[
  {
    "title": "Live Updates: Iran’s retaliatory strikes and regional tensions surge post-Khamenei",
    "slug": "iran-retaliatory-strikes-regional-tensions-surge",
    "url": "https://www.cnbc.com/2026/03/01/us-iran-live-updates-khamenei-death-trump-gulf-strikes.html",
    "source": "CNBC",
    "date": "2026-03-01T06:11:07.000Z",
    "summary": "Following the death of Iran's Supreme Leader Ayatollah Ali Khamenei in a U.S. and Israeli attack, Iran has launched retaliatory strikes amid rapidly escalating regional tensions. This represents a major geopolitical crisis with significant implications for Middle East stability.",
    "content": "Follow the latest news after the U.S. and Israel launched a massive attack on Iran that reportedly killed Iran's Supreme Leader Ayatollah Ali Khamenei.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "实时更新：伊朗的报复性打击和后卡梅尼地区局势激化",
        "summary": "在伊朗最高领导人阿亚图拉·阿里·哈梅内伊在美国和以色列的袭击中丧生后，伊朗发动了报复性打击，地区局势迅速升级。这代表了一场重大的地缘政治危机，对中东稳定造成重大影响。"
      },
      "fr": {
        "title": "Mises à jour en direct : les frappes de représailles de l'Iran et l'escalade des tensions régionales après Khamenei",
        "summary": "Suite à la mort du Guide suprême iranien l'Ayatollah Ali Khamenei dans une attaque américaine et israélienne, l'Iran a lancé des frappes de représailles au milieu d'une escalade rapide des tensions régionales. Cela représente une crise géopolitique majeure avec des implications significatives pour la stabilité du Moyen-Orient."
      },
      "de": {
        "title": "Live-Updates: Irans Vergeltungsschläge und regionale Spannungen nach Khamenei verschärfen sich",
        "summary": "Nach dem Tod des iranischen Obersten Führers Ayatollah Ali Khamenei in einem amerikanischen und israelischen Anschlag hat der Iran Vergeltungsschläge inmitten sich schnell verschärfender regionaler Spannungen gestartet. Dies stellt eine große geopolitische Krise mit erheblichen Auswirkungen auf die Stabilität im Nahen Osten dar."
      },
      "es": {
        "title": "Actualizaciones en vivo: Los ataques de represalia de Irán y el aumento de las tensiones regionales después de Jamenei",
        "summary": "Tras la muerte del Líder Supremo de Irán, el Ayatola Ali Jamenei, en un ataque estadounidense e israelí, Irán ha lanzado ataques de represalia en medio de una rápida escalada de tensiones regionales. Esto representa una crisis geopolítica importante con implicaciones significativas para la estabilidad de Oriente Medio."
      }
    }
  },
  {
    "title": "Iran after Khamenei: What's next and what it means for the country?",
    "slug": "iran-after-khamenei-whats-next",
    "url": "https://www.cnbc.com/2026/03/01/iran-khamenei-dead-us-israel-strike-trump-netanyahu.html",
    "source": "CNBC",
    "date": "2026-03-01T05:39:16.000Z",
    "summary": "Ayatollah Ali Khamenei held Iran's supreme leadership for 37 years after assuming power in 1989, overseeing the consolidation of the Islamic Revolutionary state. His death creates an unprecedented leadership vacuum with uncertain implications for Iran's future direction.",
    "content": "Khamenei assumed power following the death of Ayatollah Ruhollah Khomeini in 1989, inheriting a revolutionary state still consolidating itself.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "卡梅尼之后的伊朗：接下来会发生什么，这对国家意味着什么？",
        "summary": "阿亚图拉·阿里·哈梅内伊在1989年掌权后担任伊朗最高领导人37年，监督了伊斯兰革命国家的巩固。他的去世造成了前所未有的领导真空，对伊朗未来的方向产生了不确定的影响。"
      },
      "fr": {
        "title": "L'Iran après Khamenei : Qu'est-ce qui vient ensuite et que cela signifie pour le pays ?",
        "summary": "L'Ayatollah Ali Khamenei a détenu le leadership suprême de l'Iran pendant 37 ans après avoir pris le pouvoir en 1989, supervisant la consolidation de l'État révolutionnaire islamique. Sa mort crée un vide de leadership sans précédent avec des implications incertaines pour l'orientation future de l'Iran."
      },
      "de": {
        "title": "Der Iran nach Khamenei: Was kommt danach und was bedeutet das für das Land?",
        "summary": "Ayatollah Ali Khamenei hielt die oberste Führungsposition des Iran 37 Jahre lang, nachdem er 1989 an die Macht kam, und überwachte die Festigung des Islamischen Revolutionsstaates. Sein Tod schafft ein beispielloses Führungsvakuum mit unsicheren Auswirkungen auf die zukünftige Ausrichtung des Iran."
      },
      "es": {
        "title": "Irán después de Jamenei: ¿Qué sigue y qué significa para el país?",
        "summary": "El Ayatola Ali Jamenei ocupó el liderazgo supremo de Irán durante 37 años después de asumir el poder en 1989, supervisando la consolidación del Estado Revolucionario Islámico. Su muerte crea un vacío de liderazgo sin precedentes con implicaciones inciertas para la dirección futura de Irán."
      }
    }
  }
]