[
  {
    "title": "Dow futures drop 500 points as oil prices spike following U.S. attack on Iran: Live updates",
    "slug": "dow-futures-drop-oil-prices-iran",
    "url": "https://www.cnbc.com/2026/03/01/stock-market-today-live-update.html",
    "source": "CNBC",
    "date": "2026-03-01T23:59:37.000Z",
    "summary": "U.S. and Israeli airstrikes on Iran triggered a 500-point drop in Dow futures and an oil price surge as global energy supplies face potential disruption. The escalating U.S.-Iran conflict threatens to destabilize energy markets and broader economic growth.",
    "content": "The war between the U.S. and Iran is threatening to widen and jolt global energy supplies.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "美伊冲突后油价飙升,道指期货下跌500点:实时更新",
        "summary": "美国和以色列对伊朗的空袭引发道指期货下跌500点和油价飙升,因为全球能源供应面临潜在中断。升级的美伊冲突威胁能源市场和更广泛的经济增长的稳定性。"
      },
      "fr": {
        "title": "Les contrats à terme du Dow baissent de 500 points alors que les prix du pétrole montent en flèche suite à l'attaque américaine contre l'Iran : Mises à jour en direct",
        "summary": "Les frappes aériennes américaines et israéliennes contre l'Iran ont déclenché une baisse de 500 points des contrats à terme du Dow et une flambée des prix du pétrole, car l'approvisionnement énergétique mondial fait face à une perturbation potentielle. L'escalade du conflit États-Unis-Iran menace de déstabiliser les marchés énergétiques et la croissance économique plus large."
      },
      "de": {
        "title": "Dow-Futures fallen um 500 Punkte, da die Ölpreise nach dem US-Anschlag auf den Iran in die Höhe schießen: Live-Updates",
        "summary": "Die US- und israelischen Luftanschläge auf den Iran führten zu einem Rückgang der Dow-Futures um 500 Punkte und einem Anstieg der Ölpreise, da die globale Energieversorgung einer möglichen Störung ausgesetzt ist. Der eskalierendes US-Iran-Konflikt droht die Energiemärkte und das breitere Wirtschaftswachstum zu destabilisieren."
      },
      "es": {
        "title": "Los futuros del Dow caen 500 puntos cuando los precios del petróleo se disparan tras el ataque estadounidense a Irán: Actualizaciones en vivo",
        "summary": "Los ataques aéreos estadounidenses e israelíes contra Irán provocaron una caída de 500 puntos en los futuros del Dow y un aumento en los precios del petróleo, ya que el suministro energético mundial enfrenta una posible interrupción. El conflicto escalado entre Estados Unidos e Irán amenaza con desestabilizar los mercados energéticos y el crecimiento económico más amplio."
      }
    }
  },
  {
    "title": "U.S. crude oil jumps more than 8%, topping $72 a barrel on fears of Iran supply disruption",
    "slug": "crude-oil-jumps-72-barrel-iran",
    "url": "https://www.cnbc.com/2026/03/01/crude-oil-futures-iran.html",
    "source": "CNBC",
    "date": "2026-03-01T23:42:50.000Z",
    "summary": "U.S. crude oil surged over 8% to $72+ per barrel following concerns about Iranian oil supply disruption after Ayatollah Khamenei's death. The uncertainty over Iran's governance poses risks to the world's fourth-largest OPEC oil producer.",
    "content": "It is unclear who will ultimately govern Iran, the fourth-largest oil producer in OPEC, after U.S.-Israel strikes killed Ayatollah Ali Khamenei.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "美国原油上涨超过8%,担心伊朗供应中断后突破72美元/桶",
        "summary": "由于对哈梅内伊去世后伊朗石油供应中断的担忧,美国原油上涨超过8%至每桶72美元以上。伊朗政权不确定性对世界第四大欧佩克石油生产国构成风险。"
      },
      "fr": {
        "title": "Le brut américain dépasse 8%, atteignant 72 dollars le baril sur les craintes de perturbation de l'approvisionnement iranien",
        "summary": "Le brut américain a bondi de plus de 8 % à plus de 72 dollars le baril suite aux préoccupations concernant la perturbation de l'approvisionnement pétrolier iranien après la mort de l'Ayatollah Khamenei. L'incertitude concernant la gouvernance de l'Iran pose des risques pour le quatrième plus grand producteur pétrolier de l'OPEP au monde."
      },
      "de": {
        "title": "US-Rohöl steigt um mehr als 8% und überschreitet 72 Dollar pro Barrel aufgrund von Sorgen über die Unterbrechung der iranischen Versorgung",
        "summary": "Das US-Rohöl ist um mehr als 8 % auf über 72 Dollar pro Barrel gestiegen, nachdem Bedenken hinsichtlich einer Unterbrechung der iranischen Ölversorgung nach dem Tod von Ayatollah Khamenei entstanden sind. Die Unsicherheit über Irans Governance stellt ein Risiko für den viertgrößten OPEC-Ölproduzenten der Welt dar."
      },
      "es": {
        "title": "El petróleo crudo estadounidense sube más del 8%, superando los 72 dólares por barril por temores de interrupción del suministro iraní",
        "summary": "El petróleo crudo estadounidense se disparó más del 8% a más de 72 dólares por barril tras las preocupaciones sobre la interrupción del suministro de petróleo iraní después de la muerte del Ayatola Jamenei. La incertidumbre sobre la gobernanza de Irán presenta riesgos para el cuarto productor petrolero más grande de la OPEP en el mundo."
      }
    }
  },
  {
    "title": "The whole world is watching this critical energy chokepoint as Iran conflict enters more dangerous phase",
    "slug": "strait-hormuz-energy-chokepoint-iran",
    "url": "https://www.marketwatch.com/story/the-whole-world-is-watching-this-critical-energy-chokepoint-as-iran-conflict-enters-more-dangerous-phase-ea308cc4?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-03-01T23:37:00.000Z",
    "summary": "The Strait of Hormuz, a critical energy chokepoint, is experiencing reduced traffic amid Iranian Revolutionary Guard warnings as the Iran conflict escalates. Any sustained disruption could have major implications for global energy markets and the economy.",
    "content": "Traffic through the Strait of Hormuz has dropped off amid warnings from the Iranian Revolutionary Guard. What happens next could have major implications for the global economy.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "随着伊朗冲突进入更危险阶段,整个世界都在关注这个关键能源枢纽",
        "summary": "霍尔木兹海峡这一关键能源枢纽在伊朗伊斯兰革命卫队的警告中交通流量减少,因为伊朗冲突升级。任何持续的中断都可能对全球能源市场和经济产生重大影响。"
      },
      "fr": {
        "title": "Le monde entier observe ce goulot d'étranglement énergétique critique alors que le conflit iranien entre dans une phase plus dangereuse",
        "summary": "Le détroit d'Ormuz, un goulot d'étranglement énergétique critique, connaît un trafic réduit au milieu des avertissements de la Garde révolutionnaire islamique alors que le conflit iranien s'intensifie. Toute perturbation prolongée pourrait avoir des implications majeures pour les marchés énergétiques mondiaux et l'économie."
      },
      "de": {
        "title": "Die ganze Welt beobachtet diesen kritischen Energieengpass, während der Iran-Konflikt in eine gefährlichere Phase eintritt",
        "summary": "Die Straße von Hormuz, ein kritischer Energieengpass, erlebt einen reduzierten Verkehr inmitten von Warnungen der Islamischen Revolutionsgarde, da sich der Iran-Konflikt verschärft. Jede anhaltende Unterbrechung könnte erhebliche Auswirkungen auf die globalen Energiemärkte und die Wirtschaft haben."
      },
      "es": {
        "title": "Todo el mundo observa este cuello de botella energético crítico mientras el conflicto iraní entra en una fase más peligrosa",
        "summary": "El Estrecho de Ormuz, un cuello de botella energético crítico, está experimentando un tráfico reducido en medio de advertencias de la Guardia Revolucionaria Islámica mientras el conflicto iraní se intensifica. Cualquier interrupción sostenida podría tener implicaciones importantes para los mercados energéticos globales y la economía."
      }
    }
  },
  {
    "title": "How to think about everything presumably wrong with stocks and what to do about it",
    "slug": "stocks-market-analysis-strategies",
    "url": "https://www.cnbc.com/2026/03/01/cramer-how-to-think-about-whats-presumably-wrong-with-stocks-and-what-to-do-about-it.html",
    "source": "CNBC",
    "date": "2026-03-01T23:20:42.000Z",
    "summary": "Market analysts discuss current concerns affecting stock valuations and explore potential investment strategies in response to economic uncertainty.",
    "content": "So, what's the plan?",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "如何思考股票中看似错误的一切以及如何应对",
        "summary": "市场分析师讨论了影响股票估值的当前顾虑，并探索了应对经济不确定性的潜在投资策略。"
      },
      "fr": {
        "title": "Comment penser à tout ce qui semble mal avec les actions et quoi faire à ce sujet",
        "summary": "Les analystes de marché discutent des préoccupations actuelles affectant les valorisations boursières et explorent les stratégies d'investissement potentielles en réponse à l'incertitude économique."
      },
      "de": {
        "title": "Wie man über alles vermeintlich Falsche bei Aktien denkt und was man dagegen tun kann",
        "summary": "Marktanalysten diskutieren aktuelle Bedenken, die Aktienbewertungen beeinflussen, und erkunden potenzielle Anlagestrategien zur Reaktion auf wirtschaftliche Unsicherheit."
      },
      "es": {
        "title": "Cómo pensar en todo lo presuntamente malo con las acciones y qué hacer al respecto",
        "summary": "Los analistas de mercado discuten las preocupaciones actuales que afectan las valoraciones de acciones y exploran posibles estrategias de inversión en respuesta a la incertidumbre económica."
      }
    }
  },
  {
    "title": "Global week ahead: Operation Epic Fury means new risks for markets",
    "slug": "operation-epic-fury-market-risks",
    "url": "https://www.cnbc.com/2026/03/02/global-week-ahead-operation-epic-fury-us-israel-iran-strikes-oil-shipping-markets-volatility.html",
    "source": "CNBC",
    "date": "2026-03-01T23:15:25.000Z",
    "summary": "The coming week brings new market volatility as investors assess the implications of Operation Epic Fury, the U.S.-Israel military action against Iran. Trading strategies will be reshaped around new geopolitical risks.",
    "content": "Investors will grapple with how to trade the fallout of the U.S. and Israel's joint action in Iran.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "全球本周前瞻：史诗怒火行动为市场带来新风险",
        "summary": "随着投资者评估史诗怒火行动（美国-以色列对伊朗的军事行动）的影响，本周将为市场带来新的波动性。交易策略将围绕新的地缘政治风险重新制定。"
      },
      "fr": {
        "title": "Semaine mondiale à venir : l'opération Epic Fury signifie de nouveaux risques pour les marchés",
        "summary": "La semaine à venir apportera une nouvelle volatilité des marchés alors que les investisseurs évaluent les implications de l'opération Epic Fury, l'action militaire américano-israélienne contre l'Iran. Les stratégies de trading seront refaçonnées autour de nouveaux risques géopolitiques."
      },
      "de": {
        "title": "Globale Woche voraus: Operation Epic Fury bedeutet neue Risiken für die Märkte",
        "summary": "Die kommende Woche bringt neue Marktvolatilität, da Investoren die Auswirkungen von Operation Epic Fury, der US-israelischen Militäraktion gegen den Iran, bewerten. Handelsstrategien werden sich um neue geopolitische Risiken herum neu gestalten."
      },
      "es": {
        "title": "Semana global por delante: Operación Epic Fury significa nuevos riesgos para los mercados",
        "summary": "La próxima semana trae nueva volatilidad del mercado mientras los inversores evalúan las implicaciones de la Operación Epic Fury, la acción militar de EE.UU.-Israel contra Irán. Las estrategias comerciales se reformularán en torno a nuevos riesgos geopolíticos."
      }
    }
  },
  {
    "title": "Allegations of insider trading emerge over prediction-market bets tied to Iran conflict",
    "slug": "insider-trading-prediction-markets-iran",
    "url": "https://www.marketwatch.com/story/prediction-market-bets-tied-to-iran-conflict-stoke-backlash-over-suspicions-of-insider-trading-66ddfe87?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-03-01T20:51:00.000Z",
    "summary": "Insider trading allegations have emerged regarding prediction market activity on Iran conflict outcomes, with platforms like Polymarket and Kalshi facing criticism for their handling of sensitive bets. The controversy raises questions about market surveillance and integrity.",
    "content": "This weekend was a big one for prediction markets like Polymarket and Kalshi, but allegations of insider trading and a controversy surrounding the handling of one particularly sensitive market appear to have set off a firestorm of criticism.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "有关伊朗冲突预测市场投注的内幕交易指控浮出水面",
        "summary": "有关伊朗冲突结果预测市场活动的内幕交易指控已浮出水面，Polymarket和Kalshi等平台因处理敏感投注而面临批评。这场争议引发了对市场监督和完整性的质疑。"
      },
      "fr": {
        "title": "Des accusations de délit d'initié émergent sur les paris du marché de prédiction liés au conflit iranien",
        "summary": "Des accusations de délit d'initié ont émergé concernant l'activité du marché de prédiction sur les résultats du conflit iranien, des plateformes comme Polymarket et Kalshi faisant face à des critiques pour leur traitement des paris sensibles. La controverse soulève des questions sur la surveillance des marchés et l'intégrité."
      },
      "de": {
        "title": "Insider-Handelsvorwürfe zu Vorhersagemarkt-Wetten zum Iran-Konflikt entstehen",
        "summary": "Insider-Handelsvorwürfe sind bezüglich der Vorhersagemarktaktivität zu Ergebnissen des Iran-Konflikts entstanden, wobei Plattformen wie Polymarket und Kalshi für ihre Behandlung sensibler Wetten kritisiert werden. Die Kontroverse wirft Fragen zur Marktüberwachung und Integrität auf."
      },
      "es": {
        "title": "Surgen acusaciones de negociación con información privilegiada sobre apuestas del mercado de predicción relacionadas con el conflicto de Irán",
        "summary": "Han surgido acusaciones de negociación con información privilegiada con respecto a la actividad del mercado de predicción sobre los resultados del conflicto de Irán, con plataformas como Polymarket y Kalshi enfrentando críticas por su manejo de apuestas sensibles. La controversia plantea preguntas sobre la vigilancia del mercado e integridad."
      }
    }
  },
  {
    "title": "‘I spend $7,500 a month’: I’m 47, earn $260K, and have $3 million. Can I retire at 50?",
    "slug": "retire-at-50-financial-advice",
    "url": "https://www.marketwatch.com/story/i-spend-7-500-a-month-im-47-earn-260k-and-have-3-million-can-i-retire-at-50-05afc0b5?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-03-01T19:29:00.000Z",
    "summary": "A 47-year-old reader earning $260,000 annually with $3 million in assets and a paid-off $520,000 home seeks financial advice on whether early retirement at age 50 is feasible with $7,500 monthly spending.",
    "content": "“I own a home worth $520,000 and do not have a mortgage on it.”",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "\"我每月花费7,500美元\"：我47岁，年收入26万美元，拥有300万美元。我能在50岁退休吗?",
        "summary": "一位47岁的读者，年收入26万美元，拥有300万美元资产和一套已付清的52万美元房屋，寻求财务建议，询问月度支出7,500美元的情况下50岁提前退休是否可行。"
      },
      "fr": {
        "title": "« Je dépense 7 500 $ par mois » : J'ai 47 ans, je gagne 260 000 $, et j'ai 3 millions $. Puis-je prendre ma retraite à 50 ans ?",
        "summary": "Un lecteur de 47 ans gagnant 260 000 $ annuels avec 3 millions $ d'actifs et une maison de 520 000 $ remboursée cherche des conseils financiers pour savoir si une retraite anticipée à 50 ans est réalisable avec des dépenses mensuelles de 7 500 $."
      },
      "de": {
        "title": "„Ich gebe 7.500 $ pro Monat aus\": Ich bin 47 Jahre alt, verdiene 260.000 $ und habe 3 Millionen $. Kann ich mit 50 in den Ruhestand gehen?",
        "summary": "Ein 47-jähriger Leser mit einem Jahreseinkommen von 260.000 $ und Vermögenswerten von 3 Millionen $ sowie einem bezahlten Haus im Wert von 520.000 $ sucht finanzielle Ratschläge, ob eine vorzeitige Pensionierung mit 50 Jahren bei monatlichen Ausgaben von 7.500 $ machbar ist."
      },
      "es": {
        "title": "\"Gasto $7,500 al mes\": Tengo 47 años, gano $260,000 y tengo $3 millones. ¿Puedo jubilarme a los 50?",
        "summary": "Un lector de 47 años que gana $260,000 anuales con $3 millones en activos y una casa de $520,000 pagada busca asesoramiento financiero sobre si la jubilación anticipada a los 50 años es viable con gastos mensuales de $7,500."
      }
    }
  },
  {
    "title": "Here’s where traders expect crude-oil prices to open after this weekend’s attack on Iran",
    "slug": "crude-oil-prices-iran-prediction-market",
    "url": "https://www.marketwatch.com/story/heres-where-traders-expect-crude-oil-prices-to-open-after-this-weekends-attack-on-iran-d5dc2ee4?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-03-01T19:17:00.000Z",
    "summary": "Traders are using prediction markets like Kalshi to forecast crude oil price movements for Monday's market open following the U.S.-Israel strikes on Iran. Price expectations suggest significant volatility ahead.",
    "content": "Crude-oil markets won’t officially open for a few more hours, but traders are already using prediction markets like Kalshi to take bets on where prices will settle on Monday.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "交易员预期本周末伊朗遭袭后原油价格的开盘价位",
        "summary": "交易员正在使用Kalshi等预测市场预测美国-以色列对伊朗的袭击后周一市场开盘时的原油价格走势。价格预期表明未来将出现重大波动。"
      },
      "fr": {
        "title": "Voici où les traders s'attendent à ce que les prix du pétrole brut ouvrent après l'attaque contre l'Iran ce week-end",
        "summary": "Les traders utilisent des marchés de prédiction comme Kalshi pour prévoir les mouvements des prix du pétrole brut à l'ouverture du marché de lundi suite aux frappes américano-israéliennes contre l'Iran. Les attentes de prix suggèrent une volatilité importante à venir."
      },
      "de": {
        "title": "Hier ist, wo Trader erwarten, dass die Rohölpreise nach dem Angriff auf den Iran dieses Wochenende öffnen",
        "summary": "Trader nutzen Prognosemärkte wie Kalshi, um Rohölpreisbewegungen bei der Marktöffnung am Montag nach den US-israelischen Angriffen auf den Iran vorherzusagen. Preiserwartungen deuten auf erhebliche Volatilität voraus."
      },
      "es": {
        "title": "Aquí es donde los traders esperan que se abran los precios del petróleo crudo después del ataque contra Irán este fin de semana",
        "summary": "Los traders utilizan mercados de predicción como Kalshi para pronosticar los movimientos de los precios del petróleo crudo en la apertura del mercado del lunes siguiente a los ataques estadounidenses-israelíes contra Irán. Las expectativas de precios sugieren una volatilidad significativa."
      }
    }
  },
  {
    "title": "What travelers need to know after the U.S., Israeli strikes on Iran",
    "slug": "what-travelers-need-to-know-after-us-israeli-strikes-on-iran",
    "url": "https://www.cnbc.com/2026/03/01/travel-iran-attack-middle-east-flights.html",
    "source": "CNBC",
    "date": "2026-03-01T17:28:35.000Z",
    "summary": "U.S. and Israeli strikes on Iran are creating travel disruptions and uncertainties for international travelers. This matters because it affects flight routes, insurance, and travel safety in a geopolitically tense region.",
    "content": "What travelers need to know after the strikes in the Middle East.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "美国以色列对伊朗发动罢工后游客需要了解的信息",
        "summary": "美国和以色列对伊朗的罢工正在为国际游客造成旅行中断和不确定性。这很重要，因为它影响飞行路线、保险和地缘政治紧张地区的旅行安全。"
      },
      "fr": {
        "title": "Ce que les voyageurs doivent savoir après les frappes américano-israéliennes contre l'Iran",
        "summary": "Les frappes américaines et israéliennes contre l'Iran créent des perturbations de voyage et des incertitudes pour les voyageurs internationaux. Cela compte car cela affecte les itinéraires de vol, l'assurance et la sécurité des voyages dans une région géopolitiquement tendue."
      },
      "de": {
        "title": "Was Reisende nach US-amerikanischen und israelischen Angriffen auf den Iran wissen müssen",
        "summary": "Amerikanische und israelische Anschläge auf den Iran verursachen Reisestörungen und Unsicherheit für internationale Reisende. Dies ist wichtig, da es Flugrouten, Versicherungen und die Reisesicherheit in einer geopolitisch angespannten Region beeinflusst."
      },
      "es": {
        "title": "Lo que los viajeros necesitan saber después de los ataques estadounidenses e israelíes a Irán",
        "summary": "Los ataques estadounidenses e israelíes contra Irán están creando disrupciones de viajes e incertidumbre para los viajeros internacionales. Esto importa porque afecta las rutas de vuelo, los seguros y la seguridad de viajes en una región geopolíticamente tensa."
      }
    }
  },
  {
    "title": "Stocks face Iran jitters and a crucial jobs report in the week ahead as AI layoffs loom large",
    "slug": "stocks-face-iran-jitters-crucial-jobs-report-week-ahead-ai-layoffs",
    "url": "https://www.marketwatch.com/story/stocks-face-iran-jitters-and-a-crucial-jobs-report-in-the-week-ahead-as-ai-layoffs-loom-large-5da09c93?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-03-01T17:00:00.000Z",
    "summary": "The stock market faces uncertainty from Middle East tensions, an upcoming jobs report, and growing concerns about AI-driven layoffs. This matters because combined, these factors could significantly impact investor sentiment and market volatility.",
    "content": "“You’ve got this somewhat dystopian narrative permeating the psychology of the market” with respect to AI and jobs, asset-management firm’s CIO says.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "股票面临伊朗担忧和关键就业报告，本周AI裁员隐约可见",
        "summary": "股市面临中东紧张局势、即将发布的就业报告以及对AI驱动裁员的日益增长的担忧。这很重要，因为这些因素加在一起可能会显著影响投资者情绪和市场波动性。"
      },
      "fr": {
        "title": "Les actions font face aux inquiétudes relatives à l'Iran et à un rapport sur l'emploi crucial la semaine prochaine, alors que les licenciements liés à l'IA menacent",
        "summary": "Le marché boursier fait face à l'incertitude due aux tensions au Moyen-Orient, à un rapport sur l'emploi à venir et aux préoccupations croissantes concernant les licenciements liés à l'IA. Cela compte car, ensemble, ces facteurs pourraient avoir un impact significatif sur le sentiment des investisseurs et la volatilité du marché."
      },
      "de": {
        "title": "Aktien sehen sich iranischen Sorgen und einem entscheidenden Arbeitsmarktbericht gegenüber, während KI-Entlassungen am Horizont lauern",
        "summary": "Der Aktienmarkt sieht sich Unsicherheit durch Spannungen im Nahen Osten, einen bevorstehenden Arbeitsmarktbericht und wachsende Bedenken hinsichtlich KI-getriebener Entlassungen gegenüber. Dies ist wichtig, da diese Faktoren zusammen die Anlegerstimmung und die Marktvolatilität erheblich beeinflussen könnten."
      },
      "es": {
        "title": "Las acciones enfrentan preocupaciones por Irán y un informe de empleos crucial en la próxima semana mientras se avecinan despidos por IA",
        "summary": "El mercado de valores enfrenta incertidumbre por tensiones en Oriente Medio, un próximo informe de empleos y preocupaciones crecientes sobre despidos impulsados por IA. Esto importa porque, en conjunto, estos factores podrían impactar significativamente el sentimiento de los inversores y la volatilidad del mercado."
      }
    }
  },
  {
    "title": "Two ships hit near Strait of Hormuz as fears grow of oil price rises",
    "slug": "two-ships-hit-strait-hormuz-fears-oil-price-rises",
    "url": "https://www.bbc.com/news/articles/c75evve6l63o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-03-01T16:37:27.000Z",
    "summary": "Two ships were hit near the Strait of Hormuz, threatening to halt shipping in one of the world's most critical oil chokepoints. This matters because disruptions here could significantly increase global oil prices and supply chain costs worldwide.",
    "content": "International shipping is said to have come to a standstill at the strait's entrance, with fears of disruption already pushing up global oil prices.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "两艘船只在霍尔木兹海峡附近被击中，石油价格上涨的担忧加剧",
        "summary": "两艘船只在霍尔木兹海峡附近被击中，威胁停止全球最重要的石油咽喉之一的航运。这很重要，因为这里的中断可能会大幅提高全球油价和供应链成本。"
      },
      "fr": {
        "title": "Deux navires frappés près du détroit d'Ormuz alors que les craintes d'augmentation des prix du pétrole s'intensifient",
        "summary": "Deux navires ont été frappés près du détroit d'Ormuz, menaçant de paralyser le transport maritime dans l'un des plus critiques points chauds pétroliers du monde. Cela compte car les perturbations ici pourraient augmenter considérablement les prix mondiaux du pétrole et les coûts de la chaîne d'approvisionnement."
      },
      "de": {
        "title": "Zwei Schiffe in der Nähe der Straße von Hormuz getroffen, da sich die Befürchtungen über Ölpreiserhöhungen verschärfen",
        "summary": "Zwei Schiffe wurden in der Nähe der Straße von Hormuz getroffen und drohen, die Schifffahrt an einem der weltweit kritischsten Ölengpässe zu unterbrechen. Dies ist wichtig, da Störungen hier die globalen Ölpreise und die Kosten der Lieferkette erheblich erhöhen könnten."
      },
      "es": {
        "title": "Dos barcos golpeados cerca del Estrecho de Ormuz cuando crecen los temores de aumento de precios del petróleo",
        "summary": "Dos barcos fueron golpeados cerca del Estrecho de Ormuz, amenazando detener el envío en uno de los puntos de estrangulación de petróleo más críticos del mundo. Esto importa porque las disrupciones aquí podrían aumentar significativamente los precios mundiales del petróleo y los costos de la cadena de suministro."
      }
    }
  },
  {
    "title": "Here are the 5 big things we're watching in the stock market this week",
    "slug": "5-big-things-watching-stock-market-this-week",
    "url": "https://www.cnbc.com/2026/03/01/here-are-the-5-big-things-were-watching-in-the-stock-market-this-week.html",
    "source": "CNBC",
    "date": "2026-03-01T15:44:24.000Z",
    "summary": "Key economic and earnings data this week, including important jobs figures and major corporate earnings reports, will influence market direction. This matters because these data points are critical indicators of economic health and corporate profitability.",
    "content": "The week ahead promises to be jammed-packed with key jobs data and Club earnings reports.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "以下是我们本周关注的股市5大重点",
        "summary": "本周关键的经济和收益数据，包括重要的就业数据和主要的企业收益报告，将影响市场方向。这很重要，因为这些数据点是经济健康和企业盈利能力的关键指标。"
      },
      "fr": {
        "title": "Voici les 5 grands éléments à surveiller sur le marché boursier cette semaine",
        "summary": "Les données économiques et de résultats clés de cette semaine, y compris les chiffres importants de l'emploi et les rapports de résultats des grandes entreprises, influenceront la direction du marché. Cela importe car ces points de données sont des indicateurs critiques de la santé économique et de la rentabilité des entreprises."
      },
      "de": {
        "title": "Dies sind die 5 großen Dinge, die wir diese Woche am Aktienmarkt beobachten",
        "summary": "Wichtige Wirtschafts- und Ertragsdaten in dieser Woche, einschließlich wichtiger Arbeitsmarktdaten und großer Unternehmensgewinneberichte, werden die Marktrichtung beeinflussen. Dies ist wichtig, weil diese Datenpunkte kritische Indikatoren für die wirtschaftliche Gesundheit und die Unternehmensrentabilität sind."
      },
      "es": {
        "title": "Aquí están las 5 grandes cosas que estamos observando en el mercado de valores esta semana",
        "summary": "Los datos económicos y de ganancias clave esta semana, incluidas las cifras de empleo importantes y los principales informes de ganancias corporativas, influirán en la dirección del mercado. Esto es importante porque estos puntos de datos son indicadores críticos de la salud económica y la rentabilidad corporativa."
      }
    }
  },
  {
    "title": "Has the retail industry rebounded? We’ll find out this week from Target, Costco, Best Buy and others’ earnings",
    "slug": "retail-industry-rebound-target-costco-best-buy-earnings",
    "url": "https://www.marketwatch.com/story/has-the-retail-industry-rebounded-well-find-out-this-week-from-target-costco-best-buy-and-others-earnings-4ea65430?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-03-01T15:00:00.000Z",
    "summary": "Major retailers like Target, Costco, and Best Buy will report earnings this week, revealing whether the retail industry is recovering as analysts expected. This matters because retail health is a key indicator of consumer spending and broader economic trends.",
    "content": "Some analysts felt the retail industry was due for a modest recovery in 2026. Results from some of the biggest chains this week will offer a sense of how that rebound is going.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "零售业反弹了吗？我们将从Target、Costco、Best Buy等公司本周的收益中了解",
        "summary": "Target、Costco和Best Buy等主要零售商本周将报告收益，揭示零售业是否按照分析师预期复苏。这很重要，因为零售业的健康状况是消费支出和更广泛经济趋势的关键指标。"
      },
      "fr": {
        "title": "L'industrie du commerce de détail a-t-elle rebondi? Nous le saurons cette semaine avec les résultats de Target, Costco, Best Buy et d'autres",
        "summary": "Les grands détaillants comme Target, Costco et Best Buy publieront leurs résultats cette semaine, révélant si l'industrie du commerce de détail se redresse comme l'ont prévu les analystes. Cela importe car la santé du commerce de détail est un indicateur clé des dépenses de consommation et des tendances économiques plus larges."
      },
      "de": {
        "title": "Hat sich die Einzelhandelsindustrie erholt? Wir erfahren es diese Woche durch die Ergebnisse von Target, Costco, Best Buy und anderen",
        "summary": "Große Einzelhandelsketten wie Target, Costco und Best Buy werden diese Woche ihre Ergebnisse melden und zeigen, ob sich die Einzelhandelsindustrie wie von Analysten erwartet erholt. Dies ist wichtig, weil die Einzelhandelswirtschaft ein Schlüsselindikator für Verbraucherausgaben und breitere Wirtschaftstrends ist."
      },
      "es": {
        "title": "¿Ha rebotado la industria minorista? Lo descubriremos esta semana con las ganancias de Target, Costco, Best Buy y otros",
        "summary": "Las principales minoristas como Target, Costco y Best Buy informarán ganancias esta semana, revelando si la industria minorista se está recuperando como esperaban los analistas. Esto es importante porque la salud minorista es un indicador clave del gasto del consumidor y las tendencias económicas más amplias."
      }
    }
  },
  {
    "title": "Iran conflict risks Strait of Hormuz standstill and sparks talk of $100-a-barrel oil",
    "slug": "iran-conflict-strait-hormuz-standstill-100-barrel-oil",
    "url": "https://www.marketwatch.com/story/iran-conflict-raises-talk-of-a-return-to-100-a-barrel-oil-63bbc1b3?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-03-01T14:23:00.000Z",
    "summary": "Iranian military actions are threatening to close the Strait of Hormuz, one of the world's most critical oil shipping routes, with oil prices potentially reaching $100 per barrel. This matters because a closure would have severe global economic consequences, disrupting oil supplies and raising energy costs worldwide.",
    "content": "Reports indicate Iran’s military is not allowing passage through the crucial waterway connecting the Persian Gulf and the Gulf of Oman. But there appears not to have been a formal closure announcement.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "伊朗冲突冒着霍尔木兹海峡停运的风险，并引发了每桶100美元石油的讨论",
        "summary": "伊朗军事行动威胁关闭霍尔木兹海峡，这是世界最关键的石油运输路线之一，油价可能达到每桶100美元。这很重要，因为关闭将对全球经济造成严重后果，中断石油供应并提高全球能源成本。"
      },
      "fr": {
        "title": "Le conflit iranien risque une interruption du détroit d'Ormuz et suscite des discussions sur le pétrole à 100 dollars le baril",
        "summary": "Les actions militaires iraniennes menacent de fermer le détroit d'Ormuz, l'une des routes commerciales pétrolières les plus essentielles au monde, les prix du pétrole atteignant potentiellement 100 dollars le baril. Cela importe car une fermeture aurait de graves conséquences économiques mondiales, perturbant l'approvisionnement en pétrole et augmentant les coûts énergétiques dans le monde."
      },
      "de": {
        "title": "Der Iran-Konflikt riskiert einen Stillstand der Straße von Hormuz und löst Gespräche über Öl zu 100 Dollar pro Barrel aus",
        "summary": "Iranische Militäraktionen bedrohen die Schließung der Straße von Hormuz, einer der weltweit kritischsten Ölschifffahrtsrouten, mit Ölpreisen, die möglicherweise 100 Dollar pro Barrel erreichen. Dies ist wichtig, weil eine Schließung schwerwiegende globale wirtschaftliche Folgen hätte, die Ölversorgung stören und die Energiekosten weltweit erhöhen würde."
      },
      "es": {
        "title": "El conflicto de Irán riesga un punto muerto en el Estrecho de Ormuz y genera conversaciones sobre petróleo a $100 por barril",
        "summary": "Las acciones militares iraníes amenazan con cerrar el Estrecho de Ormuz, una de las rutas comerciales de petróleo más críticas del mundo, con precios del petróleo que podrían alcanzar $100 por barril. Esto es importante porque un cierre tendría graves consecuencias económicas globales, interrumpiendo el suministro de petróleo y aumentando los costos de energía en todo el mundo."
      }
    }
  },
  {
    "title": "China's Honor shows off smartphone with robotic camera arm and teases a humanoid robot",
    "slug": "china-honor-smartphone-robotic-camera-arm-humanoid-robot",
    "url": "https://www.cnbc.com/2026/03/01/honor-robot-phone-magic-v6-foldable-launch-mwc.html",
    "source": "CNBC",
    "date": "2026-03-01T14:15:41.000Z",
    "summary": "Chinese smartphone maker Honor unveiled a phone with a robotic camera arm and hinted at a forthcoming humanoid robot. This matters because it signals how smartphone makers are using advanced robotics and AI to compete in an increasingly saturated market.",
    "content": "Honor debuted a Robot Phone on Sunday at the Mobile World Congress as it looks to stand out from rivals like Samsung and Apple in the smartphone market.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "中国荣耀展示配备机械相机臂的智能手机并暗示人形机器人",
        "summary": "中国智能手机制造商荣耀推出了一款配有机械相机臂的手机,并暗示即将推出人形机器人。这很重要,因为它表明智能手机制造商正在使用先进的机器人和人工智能来在日益饱和的市场中竞争。"
      },
      "fr": {
        "title": "Honor de Chine montre un smartphone avec un bras caméra robotisé et taquine un robot humanoïde",
        "summary": "Le fabricant chinois de smartphones Honor a dévoilé un téléphone avec un bras caméra robotisé et a laissé entendre l'arrivée prochaine d'un robot humanoïde. Cela importe car cela montre comment les fabricants de smartphones utilisent la robotique avancée et l'IA pour concurrencer sur un marché de plus en plus saturé."
      },
      "de": {
        "title": "Chinas Honor zeigt Smartphone mit robotischem Kameraarm und deutet humanoiden Roboter an",
        "summary": "Der chinesische Smartphone-Hersteller Honor präsentierte ein Telefon mit einem robotischen Kameraarm und deutete einen bevorstehenden humanoiden Roboter an. Dies ist wichtig, da es zeigt, wie Smartphone-Hersteller fortgeschrittene Robotik und KI nutzen, um auf einem zunehmend gesättigten Markt zu konkurrieren."
      },
      "es": {
        "title": "El Honor de China muestra un smartphone con brazo robótico de cámara e insinúa un robot humanoide",
        "summary": "El fabricante chino de smartphones Honor presentó un teléfono con un brazo robótico de cámara e insinuó la llegada próxima de un robot humanoide. Esto es importante porque señala cómo los fabricantes de smartphones utilizan robótica avanzada e IA para competir en un mercado cada vez más saturado."
      }
    }
  },
  {
    "title": "As investors wait for crude-oil trading to reopen amid Iran conflict, shares of the world’s biggest producer are climbing",
    "slug": "investors-wait-crude-oil-trading-reopen-iran-saudi-aramco",
    "url": "https://www.marketwatch.com/story/as-investors-wait-for-crude-oil-trading-to-reopen-amid-iran-conflict-shares-of-the-worlds-biggest-producer-are-climbing-dd812149?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-03-01T14:03:00.000Z",
    "summary": "As crude oil trading prepares to reopen following Iran tensions, Saudi Aramco shares are surging, signaling expectations of higher oil prices. This matters because Saudi Arabia's market movement suggests traders anticipate significant increases in global oil costs.",
    "content": "Oil futures will begin trading later on Sunday. Saudi Aramco shares were climbing as trading resumed in Saudi Arabia, possibly hinting that crude is headed for a surge.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "在伊朗冲突中投资者等待原油交易重新开放,全球最大生产商的股票在攀升",
        "summary": "随着伊朗紧张局势后原油交易准备重新开放,沙特阿美股价飙升,预示着对石油价格上涨的预期。这很重要,因为沙特阿拉伯的市场走势表明交易员预计全球石油成本会大幅上升。"
      },
      "fr": {
        "title": "Alors que les investisseurs attendent la réouverture du commerce du pétrole brut au milieu du conflit iranien, les actions du plus grand producteur mondial grimpent",
        "summary": "Alors que le commerce du pétrole brut se prépare à rouvrir suite aux tensions iraniennes, les actions de Saudi Aramco montent en flèche, signalant des attentes de prix pétroliers plus élevés. Cela importe car le mouvement du marché saoudien suggère que les traders anticipent des augmentations significatives des coûts pétroliers mondiaux."
      },
      "de": {
        "title": "Während Investoren auf die Wiederöffnung des Rohölhandels inmitten der iranischen Spannungen warten, steigen die Aktien des größten Produzenten der Welt",
        "summary": "Da der Rohölhandel nach iranischen Spannungen zur Wiederöffnung vorbereitet wird, schießen die Saudi Aramco-Aktien in die Höhe und signalisieren Erwartungen höherer Ölpreise. Dies ist wichtig, da die Marktbewegung Saudi-Arabiens darauf hindeutet, dass Händler mit erheblichen Steigerungen der globalen Ölkosten rechnen."
      },
      "es": {
        "title": "Mientras los inversores esperan que se reabra el comercio de petróleo crudo en medio del conflicto iraní, las acciones del productor más grande del mundo están subiendo",
        "summary": "Cuando el comercio de petróleo crudo se prepara para reabrirse tras las tensiones iraníes, las acciones de Saudi Aramco se disparan, señalando expectativas de precios de petróleo más altos. Esto es importante porque el movimiento del mercado de Arabia Saudita sugiere que los comerciantes anticipan aumentos significativos en los costos globales del petróleo."
      }
    }
  },
  {
    "title": "'Silent failure at scale': The AI risk that can tip the business world into disorder",
    "slug": "silent-failure-at-scale-ai-risk-disorder",
    "url": "https://www.cnbc.com/2026/03/01/ai-artificial-intelligence-economy-business-risks.html",
    "source": "CNBC",
    "date": "2026-03-01T14:00:01.000Z",
    "summary": "AI experts warn of a critical but less-discussed risk: complex AI systems may become so difficult to understand that widespread failures could occur without detection. This matters because undetectable AI failures at scale could create unpredictable chaos in business operations and financial systems.",
    "content": "As AI systems become more complex the risk of surpassing human comprehension, not intelligence, could lead to chaos, artificial intelligence experts warn.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "\"大规模无声失败\":可能导致商业世界陷入混乱的人工智能风险",
        "summary": "人工智能专家警告了一个关键但讨论较少的风险:复杂的人工智能系统可能变得难以理解,以至于大范围的故障可能在无法检测的情况下发生。这很重要,因为大规模的不可检测的人工智能故障可能在商业运营和金融系统中造成不可预测的混乱。"
      },
      "fr": {
        "title": "\"Défaillance silencieuse à grande échelle\": Le risque lié à l'IA qui peut plonger le monde des affaires dans le désordre",
        "summary": "Les experts en IA avertissent d'un risque critique mais peu discuté: les systèmes d'IA complexes pourraient devenir si difficiles à comprendre que des défaillances généralisées pourraient se produire sans détection. Cela importe car les défaillances d'IA indétectables à grande échelle pourraient créer un chaos imprévisible dans les opérations commerciales et les systèmes financiers."
      },
      "de": {
        "title": "\"Stilles Versagen im großen Maßstab\": Das KI-Risiko, das die Geschäftswelt ins Chaos führen könnte",
        "summary": "KI-Experten warnen vor einem kritischen, aber weniger diskutierten Risiko: Komplexe KI-Systeme könnten so schwer zu verstehen werden, dass weit verbreitete Ausfälle unbemerkt auftreten könnten. Dies ist wichtig, da unentdeckbare KI-Ausfälle im großen Maßstab unvorhersehbares Chaos in Geschäftsabläufen und Finanzsystemen verursachen könnten."
      },
      "es": {
        "title": "\"Fallo silencioso a escala\": El riesgo de IA que puede sumir al mundo empresarial en el caos",
        "summary": "Los expertos en IA advierten sobre un riesgo crítico pero poco discutido: los sistemas complejos de IA pueden volverse tan difíciles de entender que podrían ocurrir fallos generalizados sin ser detectados. Esto es importante porque los fallos indetectables de IA a gran escala podrían crear caos impredecible en las operaciones comerciales y los sistemas financieros."
      }
    }
  },
  {
    "title": "Top Wall Street analysts recommend these dividend stocks for enhanced returns",
    "slug": "top-wall-street-analysts-recommend-dividend-stocks",
    "url": "https://www.cnbc.com/2026/03/01/top-wall-street-analysts-recommend-these-dividend-stocks-for-enhanced-returns.html",
    "source": "CNBC",
    "date": "2026-03-01T12:38:29.000Z",
    "summary": "Wall Street analysts are recommending dividend stocks as a strategy to enhance portfolio returns in the current market environment. This matters because dividend-paying stocks can provide steady income and are often favored during uncertain economic periods.",
    "content": "TipRanks names three stocks with dividends that analysts believe can bolster investors' portfolios.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "华尔街顶级分析师推荐这些派息股票以获得更高回报",
        "summary": "华尔街分析师推荐派息股票作为在当前市场环境中增强投资组合回报的策略。这很重要，因为派息股票可以提供稳定的收入，在经济不确定时期通常被青睐。"
      },
      "fr": {
        "title": "Les meilleurs analystes de Wall Street recommandent ces actions à dividende pour des rendements améliorés",
        "summary": "Les analystes de Wall Street recommandent les actions à dividende comme stratégie pour améliorer les rendements du portefeuille dans l'environnement de marché actuel. Cela est important car les actions versant des dividendes peuvent fournir un revenu stable et sont souvent privilégiées pendant les périodes d'incertitude économique."
      },
      "de": {
        "title": "Top-Analysten der Wall Street empfehlen diese Dividendenaktien für höhere Renditen",
        "summary": "Wall-Street-Analysten empfehlen Dividendenaktien als Strategie zur Verbesserung der Portfoliorenditen in der aktuellen Marktumgebung. Dies ist wichtig, da Dividendentitel stabiles Einkommen bieten können und in Zeiten wirtschaftlicher Unsicherheit oft bevorzugt werden."
      },
      "es": {
        "title": "Los principales analistas de Wall Street recomiendan estas acciones de dividendo para mayores rendimientos",
        "summary": "Los analistas de Wall Street recomiendan acciones de dividendo como estrategia para mejorar los rendimientos de la cartera en el entorno de mercado actual. Esto es importante porque las acciones que pagan dividendos pueden proporcionar ingresos estables y a menudo se prefieren durante períodos de incertidumbre económica."
      }
    }
  },
  {
    "title": "Forget DeepSeek. China’s already released 5 new AI models and UBS prefers this one",
    "slug": "forget-deepseek-china-5-new-ai-models-ubs-prefers",
    "url": "https://www.cnbc.com/2026/03/01/forget-deepseek-of-chinas-5-new-ai-models-ubs-prefers-this-one.html",
    "source": "CNBC",
    "date": "2026-03-01T12:36:54.000Z",
    "summary": "China has released five new AI models competing in the global market, and UBS analysts identify one with particular promise for enterprise applications. This matters because China's rapid AI development indicates intensifying competition in the global AI market.",
    "content": "While many Chinese companies have chased market share at home for consumer AI applications, UBS likes one in particular for its global enterprise potential.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "忘记DeepSeek。中国已经发布了5个新的AI模型，瑞银集团偏好这一个",
        "summary": "中国发布了五个新的AI模型，与全球市场竞争，瑞银分析师指出其中一个在企业应用中特别有前景。这很重要，因为中国快速的AI发展表明全球AI市场的竞争在加剧。"
      },
      "fr": {
        "title": "Oubliez DeepSeek. La Chine a déjà lancé 5 nouveaux modèles d'IA et UBS préfère celui-ci",
        "summary": "La Chine a lancé cinq nouveaux modèles d'IA en concurrence sur le marché mondial, et les analystes d'UBS identifient un modèle avec un potentiel particulier pour les applications d'entreprise. Cela est important car le développement rapide de l'IA en Chine indique une intensification de la concurrence sur le marché mondial de l'IA."
      },
      "de": {
        "title": "Vergessen Sie DeepSeek. China hat bereits 5 neue KI-Modelle veröffentlicht und UBS bevorzugt diesen",
        "summary": "China hat fünf neue KI-Modelle veröffentlicht, die auf dem globalen Markt konkurrieren, und UBS-Analysten identifizieren ein Modell mit besonderem Potenzial für Unternehmensanwendungen. Dies ist wichtig, da die schnelle KI-Entwicklung Chinas eine Intensivierung des Wettbewerbs auf dem globalen KI-Markt anzeigt."
      },
      "es": {
        "title": "Olvídate de DeepSeek. China ya ha lanzado 5 nuevos modelos de IA y UBS prefiere este",
        "summary": "China ha lanzado cinco nuevos modelos de IA que compiten en el mercado global, y los analistas de UBS identifican uno con particular promesa para aplicaciones empresariales. Esto es importante porque el rápido desarrollo de IA en China indica una intensificación de la competencia en el mercado mundial de IA."
      }
    }
  },
  {
    "title": "Investors beware: These stocks are the most at risk from AI disruption",
    "slug": "investors-beware-stocks-most-at-risk-ai-disruption",
    "url": "https://www.cnbc.com/2026/03/01/investors-beware-these-stocks-are-the-most-at-risk-from-ai-disruption.html",
    "source": "CNBC",
    "date": "2026-03-01T12:34:40.000Z",
    "summary": "Investment firm Jefferies has identified a group of stocks, including MongoDB and Robinhood, that face significant risk from AI-driven disruption. This matters because these companies may see declining demand or profitability as AI technology reshapes their industries.",
    "content": "Jefferies found a basket of \"AI risk\" stocks, ranging from MongoDB to Robinhood, that could be under threat as the technology develops.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "投资者警惕：这些股票面临AI颠覆风险最高",
        "summary": "投资公司杰富瑞确定了一组股票，包括MongoDB和罗宾汉，面临AI驱动的颠覆带来的重大风险。这很重要，因为这些公司可能会因为AI技术重塑其行业而看到需求或盈利能力下降。"
      },
      "fr": {
        "title": "Attention aux investisseurs : Ces actions sont les plus à risque face à la perturbation de l'IA",
        "summary": "La société d'investissement Jefferies a identifié un groupe d'actions, notamment MongoDB et Robinhood, qui font face à un risque important de perturbation due à l'IA. Cela est important car ces entreprises peuvent voir une baisse de la demande ou de la rentabilité à mesure que la technologie de l'IA restructure leurs industries."
      },
      "de": {
        "title": "Warnung für Investoren: Diese Aktien sind am meisten von KI-Störungen gefährdet",
        "summary": "Die Investmentfirma Jefferies hat eine Gruppe von Aktien identifiziert, darunter MongoDB und Robinhood, die erhebliche Risiken durch KI-getriebene Störungen haben. Dies ist wichtig, da diese Unternehmen durch die Umgestaltung ihrer Branchen durch KI-Technologie möglicherweise eine sinkende Nachfrage oder Rentabilität erleben."
      },
      "es": {
        "title": "Advertencia a los inversores: Estas acciones corren mayor riesgo de disruption por IA",
        "summary": "La firma de inversión Jefferies ha identificado un grupo de acciones, incluyendo MongoDB y Robinhood, que enfrentan riesgo significativo de disruption impulsada por IA. Esto es importante porque estas empresas pueden ver una disminución en la demanda o rentabilidad a medida que la tecnología de IA remodela sus industrias."
      }
    }
  },
  {
    "title": "Buffett successor Greg Abel faces first big test as Berkshire Hathaway CEO. Did he pass it?",
    "slug": "buffett-successor-greg-abel-first-test-berkshire-ceo",
    "url": "https://www.cnbc.com/2026/03/01/buffett-successor-greg-abel-faces-first-big-test-as-berkshire-hathaway-ceo-did-he-pass-it.html",
    "source": "CNBC",
    "date": "2026-03-01T12:31:09.000Z",
    "summary": "Greg Abel, Warren Buffett's successor as Berkshire Hathaway CEO, has made a positive initial impression with his approach to leadership. This matters because investor confidence in Abel's leadership is critical for Berkshire Hathaway's performance following decades of Buffett's iconic tenure.",
    "content": "Abel appears to have delivered the reassurance many shareholders were seeking at the outset of a new era.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "巴菲特继任者格雷格·阿贝尔担任伯克希尔哈撒韦首席执行官面临首次大考。他通过了吗？",
        "summary": "沃伦·巴菲特在伯克希尔哈撒韦公司的继任者格雷格·阿贝尔在领导方法上给人留下了积极的初步印象。这很重要，因为投资者对阿贝尔领导能力的信心对巴菲特统治数十年后伯克希尔哈撒韦的表现至关重要。"
      },
      "fr": {
        "title": "Le successeur de Buffett, Greg Abel, face à son premier grand test en tant que PDG de Berkshire Hathaway. L'a-t-il réussi?",
        "summary": "Greg Abel, successeur de Warren Buffett à la tête de Berkshire Hathaway, a fait une bonne première impression avec son approche du leadership. Cela a de l'importance car la confiance des investisseurs dans le leadership d'Abel est essentielle pour la performance de Berkshire Hathaway suite aux décennies du mandat emblématique de Buffett."
      },
      "de": {
        "title": "Buffetts Nachfolger Greg Abel steht seinem ersten großen Test als Berkshire-Hathaway-CEO gegenüber. Hat er es bestanden?",
        "summary": "Greg Abel, Warren Buffetts Nachfolger als CEO von Berkshire Hathaway, hat mit seinem Führungsansatz einen positiven ersten Eindruck hinterlassen. Dies ist wichtig, da das Vertrauen der Anleger in Abels Führung für die Leistung von Berkshire Hathaway entscheidend ist, nachdem Buffett es Jahrzehnte lang geleitet hat."
      },
      "es": {
        "title": "El sucesor de Buffett, Greg Abel, enfrenta su primera gran prueba como CEO de Berkshire Hathaway. ¿La superó?",
        "summary": "Greg Abel, sucesor de Warren Buffett como CEO de Berkshire Hathaway, ha dado una impresión inicial positiva con su enfoque de liderazgo. Esto importa porque la confianza de los inversores en el liderazgo de Abel es crítica para el desempeño de Berkshire Hathaway tras décadas del icónico mandato de Buffett."
      }
    }
  },
  {
    "title": "All the highlights from Berkshire CEO Abel's first shareholder letter",
    "slug": "berkshire-ceo-abel-first-shareholder-letter",
    "url": "https://www.cnbc.com/2026/03/01/all-the-highlights-from-berkshire-ceo-abels-first-shareholder-letter.html",
    "source": "CNBC",
    "date": "2026-03-01T12:20:34.000Z",
    "summary": "In his first shareholder letter, new Berkshire Hathaway CEO Greg Abel signals continuity with the company's established strategy rather than pursuing radical changes. This matters because it reassures shareholders about stability during a leadership transition after Buffett's 60-year reign.",
    "content": "After two months on the job, new Berkshire Hathaway CEO Greg Abel emphasizes he won't be making major changes to the way the company has operated for decades under Warren Buffett's leadership.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "伯克希尔首席执行官阿贝尔首封股东信的所有亮点",
        "summary": "在他的首封股东信中，新任伯克希尔哈撒韦首席执行官格雷格·阿贝尔表示与公司既定战略保持连续性，而不是追求激进变革。这很重要，因为它向股东保证在巴菲特统治60年后的领导权交接期间保持稳定。"
      },
      "fr": {
        "title": "Tous les points forts de la première lettre aux actionnaires du PDG Abel de Berkshire",
        "summary": "Dans sa première lettre aux actionnaires, le nouveau PDG de Berkshire Hathaway, Greg Abel, signale une continuité avec la stratégie établie de l'entreprise plutôt que de poursuivre des changements radicaux. Cela a de l'importance car cela rassure les actionnaires sur la stabilité lors d'une transition de direction après le règne de 60 ans de Buffett."
      },
      "de": {
        "title": "Alle Highlights aus dem ersten Aktionärsbrief des Berkshire-CEO Abel",
        "summary": "In seinem ersten Aktionärsbrief signalisiert der neue Berkshire-Hathaway-CEO Greg Abel Kontinuität mit der etablierten Strategie des Unternehmens, anstatt radikale Veränderungen anzustreben. Dies ist wichtig, da es die Aktionäre zur Stabilität während eines Führungswechsels nach Buffetts 60-jähriger Herrschaft beruhigt."
      },
      "es": {
        "title": "Todos los puntos destacados de la primera carta de accionistas del CEO Abel de Berkshire",
        "summary": "En su primera carta a los accionistas, el nuevo CEO de Berkshire Hathaway, Greg Abel, señala continuidad con la estrategia establecida de la empresa en lugar de perseguir cambios radicales. Esto importa porque asegura a los accionistas sobre la estabilidad durante una transición de liderazgo después del reinado de 60 años de Buffett."
      }
    }
  },
  {
    "title": "OPEC+ to raise oil output slightly even as U.S.-Israel strikes on Iran disrupt shipments",
    "slug": "opec-raise-oil-output-us-israel-strikes-iran-disrupt",
    "url": "https://www.cnbc.com/2026/03/01/opec-to-raise-oil-output-slightly-even-as-iran-war-disrupts-shipments.html",
    "source": "CNBC",
    "date": "2026-03-01T12:08:13.000Z",
    "summary": "OPEC+ plans a modest increase in oil production despite Middle East tensions, though analysts note the group has limited spare capacity to address potential supply disruptions. This matters because OPEC+ output decisions will influence whether global oil prices surge in response to supply concerns.",
    "content": "OPEC+ has a history of raising oil output to cushion disruptions, but analysts said the group currently has little spare capacity to add to supply.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "尽管美国-以色列对伊朗的打击扰乱了运输，欧佩克+仍将略微增加石油产量",
        "summary": "尽管中东局势紧张，欧佩克+计划小幅增加石油产量，但分析人士指出，该组织的备用产能有限，无法应对潜在的供应中断。这很重要，因为欧佩克+的产量决定将影响全球油价是否因供应担忧而上升。"
      },
      "fr": {
        "title": "L'OPEC+ augmente légèrement la production de pétrole malgré les frappes des États-Unis et d'Israël qui perturbent les expéditions vers l'Iran",
        "summary": "L'OPEC+ prévoit une augmentation modeste de la production de pétrole malgré les tensions au Moyen-Orient, bien que les analystes notent que le groupe a une capacité de secours limitée pour faire face aux perturbations potentielles de l'approvisionnement. Cela a de l'importance car les décisions de production de l'OPEC+ influenceront si les prix mondiaux du pétrole augmentent en réponse aux préoccupations liées à l'approvisionnement."
      },
      "de": {
        "title": "OPEC+ erhöht die Ölproduktion geringfügig, trotz US-Israel-Anschlägen auf den Iran, die Lieferungen stören",
        "summary": "OPEC+ plant eine bescheidene Erhöhung der Ölproduktion trotz Spannungen im Nahen Osten, obwohl Analysten darauf hinweisen, dass die Gruppe nur über begrenzte Reservekapazitäten verfügt, um mögliche Versorgungsunterbrechungen zu bewältigen. Dies ist wichtig, da OPEC+-Produktionsentscheidungen beeinflussen werden, ob die globalen Ölpreise als Reaktion auf Versorgungsbedenken ansteigen."
      },
      "es": {
        "title": "OPEC+ aumentará ligeramente la producción de petróleo a pesar de que los ataques de EE.UU.-Israel a Irán interrumpan los envíos",
        "summary": "OPEC+ planea un aumento modesto en la producción de petróleo a pesar de las tensiones en Oriente Medio, aunque los analistas señalan que el grupo tiene una capacidad de reserva limitada para hacer frente a posibles disrupciones de suministro. Esto importa porque las decisiones de producción de OPEC+ influirán en si los precios mundiales del petróleo suben en respuesta a las preocupaciones sobre el suministro."
      }
    }
  },
  {
    "title": "Flights cancelled and new travel warnings issued after Iran strikes",
    "slug": "flights-cancelled-travel-warnings-iran-strikes",
    "url": "https://www.bbc.com/news/articles/c0rjpr575g9o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-03-01T11:52:57.000Z",
    "summary": "Major airlines including BA and Virgin Atlantic have cancelled flights to the Middle East following Iran strikes. New travel warnings have been issued in response to escalating regional tensions.",
    "content": "BA and Virgin Atlantic are among major airlines to ground services to the Middle East in light of the attacks.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "伊朗袭击后航班取消和发布新的旅行警告",
        "summary": "包括英国航空和维珍大西洋在内的主要航空公司在伊朗袭击后已取消前往中东的航班。针对地区局势升级，已发布新的旅行警告。"
      },
      "fr": {
        "title": "Vols annulés et nouveaux avertissements aux voyageurs après les frappes iraniennes",
        "summary": "Les grandes compagnies aériennes, dont British Airways et Virgin Atlantic, ont annulé leurs vols vers le Moyen-Orient suite aux frappes iraniennes. De nouveaux avertissements aux voyageurs ont été émis en réponse à l'escalade des tensions régionales."
      },
      "de": {
        "title": "Flüge storniert und neue Reisewarnungen nach iranischen Angriffen",
        "summary": "Große Fluggesellschaften wie British Airways und Virgin Atlantic haben Flüge in den Nahen Osten nach den iranischen Angriffen storniert. Neue Reisewarnungen wurden angesichts der eskalierenden regionalen Spannungen ausgegeben."
      },
      "es": {
        "title": "Vuelos cancelados y nuevas advertencias de viaje emitidas después de ataques iraníes",
        "summary": "Las grandes aerolíneas, incluyendo British Airways y Virgin Atlantic, han cancelado vuelos hacia Oriente Medio tras los ataques iraníes. Se han emitido nuevas advertencias de viaje en respuesta a la escalada de tensiones regionales."
      }
    }
  },
  {
    "title": "$100 oil? Prolonged Hormuz closure could spark a 1970s-style energy shock",
    "slug": "prolonged-hormuz-closure-energy-shock",
    "url": "https://www.cnbc.com/2026/03/01/experts-weigh-potential-scenarios-for-oil-if-strait-of-hormuz-closes.html",
    "source": "CNBC",
    "date": "2026-03-01T10:57:52.000Z",
    "summary": "U.S. strikes on Iran have raised concerns about potential disruptions in the Strait of Hormuz, a critical oil shipping chokepoint. Energy analysts warn this could trigger a 1970s-style energy shock with oil prices potentially reaching $100 per barrel.",
    "content": "Energy analysts are bracing for a possible oil supply shock after U.S. strikes on Iran reignited fears of disruptions in the Strait of Hormuz.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "100美元油价？荷尔木兹海峡长期关闭可能引发1970年代风格的能源危机",
        "summary": "美国对伊朗的打击引发了人们对霍尔木兹海峡（一个关键的石油运输枢纽）可能中断的担忧。能源分析师警告这可能引发1970年代风格的能源危机，油价可能达到每桶100美元。"
      },
      "fr": {
        "title": "Pétrole à 100 dollars ? Une fermeture prolongée du détroit d'Ormuz pourrait déclencher un choc énergétique à la manière des années 1970",
        "summary": "Les frappes américaines contre l'Iran ont soulevé des préoccupations concernant les perturbations potentielles du détroit d'Ormuz, un passage maritime critique pour le pétrole. Les analystes énergétiques avertissent que cela pourrait déclencher un choc énergétique à la manière des années 1970, avec les prix du pétrole potentiellement atteignant 100 dollars le baril."
      },
      "de": {
        "title": "100-Dollar-Öl? Länger anhaltende Schließung der Straße von Hormuz könnte einen Energieschock im Stil der 1970er Jahre auslösen",
        "summary": "Die amerikanischen Anschläge auf den Iran haben Bedenken hinsichtlich möglicher Störungen in der Straße von Hormuz, einem kritischen Ölschifffahrts-Engpass, geweckt. Energieanalysten warnen, dass dies einen Energieschock im Stil der 1970er Jahre auslösen könnte, wobei die Ölpreise möglicherweise 100 Dollar pro Barrel erreichen."
      },
      "es": {
        "title": "¿Petróleo a 100 dólares? El cierre prolongado del Estrecho de Ormuz podría desencadenar un choque energético al estilo de los años 70",
        "summary": "Los ataques estadounidenses contra Irán han planteado preocupaciones sobre posibles interrupciones en el Estrecho de Ormuz, un punto crítico de envío de petróleo. Los analistas energéticos advierten que esto podría desencadenar un choque energético al estilo de los años 70, con los precios del petróleo potencialmente alcanzando 100 dólares por barril."
      }
    }
  },
  {
    "title": "A firm hiring blind staff went bust - but its mission lives on",
    "slug": "firm-hiring-blind-staff-mission-lives-on",
    "url": "https://www.bbc.com/news/articles/cpd8jpn0np1o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-03-01T09:56:50.000Z",
    "summary": "A 150-year-old business specializing in hiring blind staff has closed, but its inclusive employment mission continues after a former employee stepped in. The company's legacy of workplace accessibility lives on through individual initiative.",
    "content": "The business had been running for over 150 years before it collapsed, so one former employee took matters into her own hands.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "一家聘用盲人员工的公司倒闭了——但其使命仍在继续",
        "summary": "一家拥有150年历史、专门聘用盲人员工的企业已关闭，但其包容性就业使命在一位前员工接手后继续进行。这家公司的职场可及性遗产通过个人的主动性得以延续。"
      },
      "fr": {
        "title": "Une entreprise embauchant du personnel malvoyant a fermé - mais sa mission perdure",
        "summary": "Une entreprise centenaire spécialisée dans l'emploi de personnes malvoyantes a fermé ses portes, mais sa mission d'emploi inclusive se poursuit après l'intervention d'un ancien employé. L'héritage de l'accessibilité sur le lieu de travail de l'entreprise perdure grâce à l'initiative individuelle."
      },
      "de": {
        "title": "Ein Unternehmen, das blinde Mitarbeiter einstellte, ging bankrott - aber sein Auftrag lebt weiter",
        "summary": "Ein 150 Jahre altes Unternehmen, das sich auf die Beschäftigung blinder Mitarbeiter spezialisierte, hat geschlossen, aber seine Aufgabe der inklusiven Beschäftigung wird von einem ehemaligen Mitarbeiter fortgesetzt. Das Vermächtnis der Barrierefreiheit am Arbeitsplatz des Unternehmens lebt durch persönliche Initiative weiter."
      },
      "es": {
        "title": "Una empresa que contrataba personal invidente cerró - pero su misión continúa",
        "summary": "Un negocio centenario especializado en la contratación de personal invidente ha cerrado, pero su misión de empleo inclusivo continúa después de que un ex empleado se hizo cargo. El legado de accesibilidad laboral de la empresa continúa a través de la iniciativa individual."
      }
    }
  },
  {
    "title": "Could a huge data centre revitalise Ayrshire - or ruin it?",
    "slug": "data-centre-ayrshire-revitalise-or-ruin",
    "url": "https://www.bbc.com/news/articles/c2d1ny161yyo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-03-01T09:25:25.000Z",
    "summary": "ILI Group is proposing a major data centre development near HMP Kilmarnock in Ayrshire that could either revitalize or harm the region. The controversial project aims to transform the area into a technology hub with significant local implications.",
    "content": "Controversial proposals to turn land near HMP Kilmarnock into a technology hub are being advanced by energy company ILI Group.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "巨大的数据中心能振兴艾郡还是毁掉它？",
        "summary": "ILI集团在艾郡HMP基尔马诺克附近提议建设一个大型数据中心，这可能会振兴或伤害该地区。这个有争议的项目旨在将该地区转变为技术中心，具有重大的本地意义。"
      },
      "fr": {
        "title": "Un énorme centre de données pourrait-il revitaliser l'Ayrshire ou le ruiner ?",
        "summary": "Le groupe ILI propose un important projet de centre de données près de HMP Kilmarnock en Ayrshire qui pourrait revitaliser ou nuire à la région. Le projet controversé vise à transformer la région en un pôle technologique avec des implications locales importantes."
      },
      "de": {
        "title": "Könnte ein riesiges Datenzentrum Ayrshire revitalisieren oder ruinieren?",
        "summary": "Die ILI Group schlägt eine große Datenzentrum-Entwicklung in der Nähe von HMP Kilmarnock in Ayrshire vor, die die Region revitalisieren oder schädigen könnte. Das umstrittene Projekt zielt darauf ab, die Region in ein Technologie-Hub umzuwandeln mit erheblichen lokalen Auswirkungen."
      },
      "es": {
        "title": "¿Podría un centro de datos enorme revitalizar Ayrshire o arruinarlo?",
        "summary": "El grupo ILI está proponiendo un importante desarrollo de centro de datos cerca de HMP Kilmarnock en Ayrshire que podría revitalizar o dañar la región. El controvertido proyecto tiene como objetivo transformar el área en un centro tecnológico con importantes implicaciones locales."
      }
    }
  },
  {
    "title": "Iran may 'lash out harder' as Khamenei's death puts Tehran on a war footing, leaving the world bracing for what's next",
    "slug": "iran-khamenei-death-war-footing",
    "url": "https://www.cnbc.com/2026/03/01/us-israel-attacks-strikes-iran-retaliate-china-russia-allies.html",
    "source": "CNBC",
    "date": "2026-03-01T09:21:20.000Z",
    "summary": "Following Khamenei's death, Iran may escalate military response, putting Tehran on heightened war footing. While Russia and China have issued diplomatic protests, analysts doubt they can provide substantive support to Iran.",
    "content": "Iran's strategic allies Russia and China have made strong diplomatic protests, but analysts say neither is in a position to offer meaningful support.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "随着哈梅内伊之死使德黑兰处于战争状态，伊朗可能会\"更加猛烈地反击\"",
        "summary": "在哈梅内伊去世后，伊朗可能会升级军事反应，使德黑兰处于高度战争状态。虽然俄罗斯和中国已发出外交抗议，但分析人士怀疑他们能否为伊朗提供实质性支持。"
      },
      "fr": {
        "title": "L'Iran pourrait \"frapper plus fort\" alors que la mort de Khamenei met Téhéran sur un pied de guerre",
        "summary": "Suite au décès de Khamenei, l'Iran pourrait intensifier sa réaction militaire, mettant Téhéran sur un pied de guerre renforcé. Bien que la Russie et la Chine aient émis des protestations diplomatiques, les analystes doutent qu'elles puissent fournir un soutien substantiel à l'Iran."
      },
      "de": {
        "title": "Der Iran könnte \"stärker zurückschlagen\", da Khameneis Tod Teheran in Kriegsbereitschaft versetzt",
        "summary": "Nach Khameneis Tod könnte der Iran seine militärische Reaktion eskalieren und Teheran in verstärkte Kriegsbereitschaft versetzen. Obwohl Russland und China diplomatische Proteste eingereicht haben, zweifeln Analysten daran, dass sie substantielle Unterstützung für den Iran leisten können."
      },
      "es": {
        "title": "Irán puede \"golpear más fuerte\" mientras la muerte de Jamenei pone a Teherán en pie de guerra",
        "summary": "Tras la muerte de Jamenei, Irán podría escalar su respuesta militar, poniendo a Teherán en una posición de guerra elevada. Aunque Rusia y China han emitido protestas diplomáticas, los analistas dudan de que puedan proporcionar apoyo sustancial a Irán."
      }
    }
  },
  {
    "title": "Here’s how much you could pay for a gallon of gas by May because of the attacks on Iran",
    "slug": "gas-prices-iran-attacks-may",
    "url": "https://www.marketwatch.com/story/heres-how-much-you-could-pay-for-a-gallon-of-gas-by-may-because-of-the-attacks-on-iran-e12e976f?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-03-01T09:04:00.000Z",
    "summary": "U.S.-Israel strikes against Iran are expected to drive up oil and gasoline prices by May. GasBuddy analysis suggests Americans should prepare for significantly higher gas pump prices in the coming months.",
    "content": "U.S.-Israel strikes against Iran will push up oil prices, as well as how much Americans pay for gasoline at the pump: GasBuddy",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "由于对伊朗的攻击，到五月你可能要为一加仑汽油支付多少钱",
        "summary": "美国-以色列对伊朗的打击预计会推高油价和汽油价格。GasBuddy分析表明美国人应该为未来几个月汽油价格大幅上涨做好准备。"
      },
      "fr": {
        "title": "Voici combien vous pourriez payer pour un gallon d'essence en mai à cause des attaques contre l'Iran",
        "summary": "Les frappes américano-israéliennes contre l'Iran devraient faire monter les prix du pétrole et de l'essence d'ici mai. L'analyse de GasBuddy suggère que les Américains devraient se préparer à des prix de l'essence significativement plus élevés dans les mois à venir."
      },
      "de": {
        "title": "Hier ist, wie viel Sie bis Mai für eine Gallone Benzin zahlen könnten wegen der Anschläge auf den Iran",
        "summary": "Die amerikanisch-israelischen Anschläge auf den Iran werden voraussichtlich die Öl- und Benzinpreise bis Mai in die Höhe treiben. Die GasBuddy-Analyse deutet darauf hin, dass Amerikaner sich auf deutlich höhere Benzinpreise in den kommenden Monaten vorbereiten sollten."
      },
      "es": {
        "title": "Esto es lo que podrías pagar por un galón de gasolina en mayo debido a los ataques contra Irán",
        "summary": "Se espera que los ataques estadounidenses-israelíes contra Irán aumenten los precios del petróleo y la gasolina en mayo. El análisis de GasBuddy sugiere que los estadounidenses deben prepararse para precios de gasolina significativamente más altos en los próximos meses."
      }
    }
  },
  {
    "title": "Rescue centre sees rise in abandoned cat families",
    "slug": "rescue-centre-abandoned-cat-families-rise",
    "url": "https://www.bbc.com/news/articles/cwygprp50yqo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-03-01T08:52:59.000Z",
    "summary": "Yorkshire Cat Rescue in Haworth experienced a surge in abandoned cat families during 2025, spending £282,000 on veterinary care. The centre rescued 925 animals despite the significant financial strain.",
    "content": "Yorkshire Cat Rescue in Haworth says it paid £282,000 in vet bills in 2025 and rescued 925 animals.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "救援中心遭弃猫咪家族数量上升",
        "summary": "哈沃斯约克郡猫咪救援中心在2025年间遭弃猫咪家族激增，兽医护理费用达282,000英镑。尽管财务压力巨大，该中心仍成功救援了925只动物。"
      },
      "fr": {
        "title": "Le centre de sauvetage constate une augmentation des familles de chats abandonnés",
        "summary": "Le Yorkshire Cat Rescue à Haworth a connu une augmentation des familles de chats abandonnés en 2025, dépensant 282 000 livres en soins vétérinaires. Le centre a secouru 925 animaux malgré la pression financière importante."
      },
      "de": {
        "title": "Rettungszentrum verzeichnet Anstieg verlassener Katzenfamilien",
        "summary": "Das Yorkshire Cat Rescue in Haworth verzeichnete 2025 einen Anstieg verlassener Katzenfamilien und gab 282.000 Pfund für tierärztliche Versorgung aus. Das Zentrum rettete trotz erheblicher finanzieller Belastung 925 Tiere."
      },
      "es": {
        "title": "Centro de rescate ve aumento en familias de gatos abandonados",
        "summary": "El Centro de Rescate de Gatos de Yorkshire en Haworth experimentó un aumento en familias de gatos abandonados durante 2025, gastando £282,000 en cuidados veterinarios. El centro rescató 925 animales a pesar de la importante presión financiera."
      }
    }
  },
  {
    "title": "Live Updates: Iran’s retaliatory strikes and regional tensions surge post-Khamenei",
    "slug": "iran-retaliatory-strikes-regional-tensions-surge",
    "url": "https://www.cnbc.com/2026/03/01/us-iran-live-updates-khamenei-death-trump-gulf-strikes.html",
    "source": "CNBC",
    "date": "2026-03-01T06:11:07.000Z",
    "summary": "Following the death of Iran's Supreme Leader Ayatollah Ali Khamenei in a U.S. and Israeli attack, Iran has launched retaliatory strikes amid rapidly escalating regional tensions. This represents a major geopolitical crisis with significant implications for Middle East stability.",
    "content": "Follow the latest news after the U.S. and Israel launched a massive attack on Iran that reportedly killed Iran's Supreme Leader Ayatollah Ali Khamenei.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "实时更新：伊朗的报复性打击和后卡梅尼地区局势激化",
        "summary": "在伊朗最高领导人阿亚图拉·阿里·哈梅内伊在美国和以色列的袭击中丧生后，伊朗发动了报复性打击，地区局势迅速升级。这代表了一场重大的地缘政治危机，对中东稳定造成重大影响。"
      },
      "fr": {
        "title": "Mises à jour en direct : les frappes de représailles de l'Iran et l'escalade des tensions régionales après Khamenei",
        "summary": "Suite à la mort du Guide suprême iranien l'Ayatollah Ali Khamenei dans une attaque américaine et israélienne, l'Iran a lancé des frappes de représailles au milieu d'une escalade rapide des tensions régionales. Cela représente une crise géopolitique majeure avec des implications significatives pour la stabilité du Moyen-Orient."
      },
      "de": {
        "title": "Live-Updates: Irans Vergeltungsschläge und regionale Spannungen nach Khamenei verschärfen sich",
        "summary": "Nach dem Tod des iranischen Obersten Führers Ayatollah Ali Khamenei in einem amerikanischen und israelischen Anschlag hat der Iran Vergeltungsschläge inmitten sich schnell verschärfender regionaler Spannungen gestartet. Dies stellt eine große geopolitische Krise mit erheblichen Auswirkungen auf die Stabilität im Nahen Osten dar."
      },
      "es": {
        "title": "Actualizaciones en vivo: Los ataques de represalia de Irán y el aumento de las tensiones regionales después de Jamenei",
        "summary": "Tras la muerte del Líder Supremo de Irán, el Ayatola Ali Jamenei, en un ataque estadounidense e israelí, Irán ha lanzado ataques de represalia en medio de una rápida escalada de tensiones regionales. Esto representa una crisis geopolítica importante con implicaciones significativas para la estabilidad de Oriente Medio."
      }
    }
  },
  {
    "title": "Iran after Khamenei: What's next and what it means for the country?",
    "slug": "iran-after-khamenei-whats-next",
    "url": "https://www.cnbc.com/2026/03/01/iran-khamenei-dead-us-israel-strike-trump-netanyahu.html",
    "source": "CNBC",
    "date": "2026-03-01T05:39:16.000Z",
    "summary": "Ayatollah Ali Khamenei held Iran's supreme leadership for 37 years after assuming power in 1989, overseeing the consolidation of the Islamic Revolutionary state. His death creates an unprecedented leadership vacuum with uncertain implications for Iran's future direction.",
    "content": "Khamenei assumed power following the death of Ayatollah Ruhollah Khomeini in 1989, inheriting a revolutionary state still consolidating itself.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "卡梅尼之后的伊朗：接下来会发生什么，这对国家意味着什么？",
        "summary": "阿亚图拉·阿里·哈梅内伊在1989年掌权后担任伊朗最高领导人37年，监督了伊斯兰革命国家的巩固。他的去世造成了前所未有的领导真空，对伊朗未来的方向产生了不确定的影响。"
      },
      "fr": {
        "title": "L'Iran après Khamenei : Qu'est-ce qui vient ensuite et que cela signifie pour le pays ?",
        "summary": "L'Ayatollah Ali Khamenei a détenu le leadership suprême de l'Iran pendant 37 ans après avoir pris le pouvoir en 1989, supervisant la consolidation de l'État révolutionnaire islamique. Sa mort crée un vide de leadership sans précédent avec des implications incertaines pour l'orientation future de l'Iran."
      },
      "de": {
        "title": "Der Iran nach Khamenei: Was kommt danach und was bedeutet das für das Land?",
        "summary": "Ayatollah Ali Khamenei hielt die oberste Führungsposition des Iran 37 Jahre lang, nachdem er 1989 an die Macht kam, und überwachte die Festigung des Islamischen Revolutionsstaates. Sein Tod schafft ein beispielloses Führungsvakuum mit unsicheren Auswirkungen auf die zukünftige Ausrichtung des Iran."
      },
      "es": {
        "title": "Irán después de Jamenei: ¿Qué sigue y qué significa para el país?",
        "summary": "El Ayatola Ali Jamenei ocupó el liderazgo supremo de Irán durante 37 años después de asumir el poder en 1989, supervisando la consolidación del Estado Revolucionario Islámico. Su muerte crea un vacío de liderazgo sin precedentes con implicaciones inciertas para la dirección futura de Irán."
      }
    }
  },
  {
    "title": "Iran's Ali Khamenei, who based iron rule on fiery hostility to the U.S. and Israel, dies at 86",
    "slug": "ali-khamenei-dies-airstrikes-iran",
    "url": "https://www.cnbc.com/2026/02/28/iran-supreme-leader-ali-khamenei-dies-at-86.html",
    "source": "CNBC",
    "date": "2026-03-01T02:26:25.000Z",
    "summary": "Iran's Supreme Leader Ali Khamenei, 86, was killed in U.S.-Israeli airstrikes on his Tehran compound, marking a dramatic escalation in geopolitical tensions. His death creates unprecedented uncertainty about Iran's political future.",
    "content": "He was killed on Saturday, aged 86, Iranian state media announced, in air strikes by Israel and the U.S. that pulverized his central Tehran compound.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "伊朗最高领导人阿里·哈梅内伊去世，享年86岁，其统治基于对美国和以色列的激烈敌意",
        "summary": "伊朗最高领导人阿里·哈梅内伊，86岁，在美国-以色列对其德黑兰大院的空袭中丧生，标志着地缘政治紧张局势的戏剧性升级。他的去世为伊朗的政治未来带来了前所未有的不确定性。"
      },
      "fr": {
        "title": "Ali Khamenei d'Iran, qui a fondé son règne de fer sur une hostilité ardente envers les États-Unis et Israël, décède à 86 ans",
        "summary": "Le guide suprême iranien Ali Khamenei, 86 ans, a été tué dans des frappes aériennes américano-israéliennes contre son compound à Téhéran, marquant une escalade dramatique des tensions géopolitiques. Sa mort crée une incertitude sans précédent quant à l'avenir politique de l'Iran."
      },
      "de": {
        "title": "Irans Ali Khamenei, dessen eiserne Herrschaft auf glühender Feindseligkeit gegenüber den USA und Israel basierte, stirbt im Alter von 86 Jahren",
        "summary": "Irans Oberster Führer Ali Khamenei, 86, wurde bei US-israelischen Luftangriffen auf sein Teheraner Anwesen getötet, was eine dramatische Eskalation der geopolitischen Spannungen markiert. Sein Tod schafft beispiellose Unsicherheit über Irans politische Zukunft."
      },
      "es": {
        "title": "Alí Jamenei de Irán, cuyo gobierno de hierro se basaba en una hostilidad apasionada hacia Estados Unidos e Israel, muere a los 86 años",
        "summary": "El Líder Supremo de Irán, Alí Jamenei, de 86 años, fue asesinado en ataques aéreos estadounidenses-israelíes contra su complejo en Teherán, marcando una escalada dramática en las tensiones geopolíticas. Su muerte crea una incertidumbre sin precedentes sobre el futuro político de Irán."
      }
    }
  }
]