[
  {
    "title": "Snowflake’s stock dips as the software company gives a mixed outlook",
    "slug": "snowflake-stock-dips-mixed-outlook",
    "url": "https://www.marketwatch.com/story/snowflakes-stock-dips-as-the-software-company-gives-a-mixed-outlook-aa072974?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-25T23:42:00.000Z",
    "summary": "Snowflake's stock declined following mixed earnings results and guidance, as investors remain cautious about software sector valuations and growth prospects.",
    "content": "In a market where investors have been quick to punish software stocks, Snowflake’s report didn’t offer enough to excite Wall Street.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Snowflake股票下跌，软件公司前景不明",
        "summary": "在混合的财务业绩和指导下，Snowflake股票下跌，投资者对软件行业估值和增长前景保持谨慎态度。"
      },
      "fr": {
        "title": "Les actions de Snowflake chutent alors que l'éditeur donne une perspective mitigée",
        "summary": "Le cours de l'action Snowflake a baissé suite à des résultats et perspectives mitigés, les investisseurs restant prudents concernant les valorisations et les perspectives de croissance du secteur des logiciels."
      },
      "de": {
        "title": "Snowflakes Aktie fällt mit gemischtem Ausblick des Softwareunternehmens",
        "summary": "Die Snowflake-Aktie ist nach gemischten Geschäftsergebnissen und Prognosen gefallen, da Investoren gegenüber Bewertungen und Wachstumsaussichten des Softwaresektors vorsichtig bleiben."
      },
      "es": {
        "title": "La acción de Snowflake cae con perspectiva mixta de la empresa de software",
        "summary": "El precio de Snowflake cayó tras resultados de ganancias mixtos y guía, con inversores mostrando cautela respecto a valoraciones del sector de software y perspectivas de crecimiento."
      }
    }
  },
  {
    "title": "Salesforce shares sink on mixed guidance as company commits $50 billion for buybacks",
    "slug": "salesforce-shares-sink-mixed-guidance-50-billion",
    "url": "https://www.cnbc.com/2026/02/25/salesforce-crm-q4-earnings-report-2026.html",
    "source": "CNBC",
    "date": "2026-02-25T23:34:02.000Z",
    "summary": "Salesforce shares fell despite accelerating growth and a $50 billion buyback announcement, as mixed guidance raised investor concerns about future momentum.",
    "content": "Salesforce posted accelerating growth and pushed up its long-range revenue target thanks to a recent acquisition.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Salesforce股票下跌，公司承诺50亿美元回购，但给出混合指导",
        "summary": "尽管增长加速和宣布50亿美元回购，Salesforce股票下跌，混合指导引发投资者对未来增长的担忧。"
      },
      "fr": {
        "title": "Les actions de Salesforce chutent sur une guidance mitigée alors que l'entreprise s'engage à 50 milliards de dollars de rachats",
        "summary": "Les actions de Salesforce ont baissé malgré une croissance accélérée et une annonce de rachat de 50 milliards de dollars, car la guidance mitigée a suscité les préoccupations des investisseurs quant à la dynamique future."
      },
      "de": {
        "title": "Salesforce-Aktie sinkt bei gemischter Guidance während das Unternehmen 50 Milliarden Dollar Rückkäufe zusagt",
        "summary": "Salesforce-Aktien sind trotz beschleunigtem Wachstum und einer Ankündigung von 50 Milliarden Dollar Rückkäufen gefallen, da die gemischte Prognose Anlegerbedenken bezüglich der zukünftigen Dynamik weckte."
      },
      "es": {
        "title": "Acciones de Salesforce caen en guidance mixta mientras la empresa se compromete con 50 mil millones en recompras",
        "summary": "Las acciones de Salesforce cayeron a pesar del crecimiento acelerado y un anuncio de recompra de 50 mil millones de dólares, ya que la guidance mixta generó preocupaciones de los inversores sobre el impulso futuro."
      }
    }
  },
  {
    "title": "Salesforce’s stock falls as mixed earnings forecast fails to dispel AI gloom",
    "slug": "salesforce-stock-falls-mixed-earnings-ai-gloom",
    "url": "https://www.marketwatch.com/story/salesforces-stock-falls-as-mixed-earnings-forecast-fails-to-dispel-ai-gloom-d230d256?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-25T23:26:00.000Z",
    "summary": "Salesforce stock declined as investors remained focused on AI disruption risks despite a $50 billion buyback plan and new AI metrics announced by the company.",
    "content": "Salesforce announced a $50 billion share buyback and a new AI metric, but investors remain focused on the threat of AI disruption.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Salesforce股票下跌，混合财报预测未能消除AI担忧",
        "summary": "Salesforce股票下跌，因为投资者仍关注AI颠覆风险，尽管有50亿美元回购计划和公司宣布的新AI指标。"
      },
      "fr": {
        "title": "L'action Salesforce chute alors que les prévisions de bénéfices mitigées ne dissipent pas le pessimisme de l'IA",
        "summary": "L'action Salesforce a baissé car les investisseurs restaient concentrés sur les risques de disruption de l'IA malgré un plan de rachat de 50 milliards de dollars et de nouvelles métriques d'IA annoncées par l'entreprise."
      },
      "de": {
        "title": "Salesforce-Aktie fällt, da gemischte Ertragsprognosen die KI-Angst nicht zerstreuen",
        "summary": "Die Salesforce-Aktie fiel, da Anleger weiterhin auf KI-Disruptionsrisiken konzentriert waren, trotz eines 50-Milliarden-Dollar-Rückkaufplans und neuer KI-Metriken, die das Unternehmen ankündigte."
      },
      "es": {
        "title": "La acción de Salesforce cae ya que las previsiones de ganancias mixtas no disipan el pesimismo de la IA",
        "summary": "El precio de Salesforce cayó cuando los inversores se mantuvieron enfocados en riesgos de disrupción de IA a pesar de un plan de recompra de 50 mil millones de dólares y nuevas métricas de IA anunciadas por la empresa."
      }
    }
  },
  {
    "title": "I haven’t paid cash for a flight in 15 years. Here’s the most common question I'm asked — and why it’s wrong",
    "slug": "havent-paid-cash-flight-15-years-credit-card",
    "url": "https://www.cnbc.com/select/15-years-of-free-flights-credit-card-and-travel-rewards-tips/",
    "source": "CNBC",
    "date": "2026-02-25T23:23:06.000Z",
    "summary": "A travel rewards expert shares insights on credit card selection for maximizing flight benefits, addressing common misconceptions about travel rewards strategy.",
    "content": "Answering these three questions puts me on the path to finding the right card.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "15年来我没有用现金买过机票。这是我最常被问到的问题——为什么这是错误的",
        "summary": "一位旅游奖励专家分享了关于信用卡选择的见解，以最大化飞行优惠，并解决了关于旅游奖励策略的常见误解。"
      },
      "fr": {
        "title": "Je n'ai pas payé en espèces pour un vol depuis 15 ans. Voici la question la plus courante qu'on me pose — et pourquoi elle est fausse",
        "summary": "Un expert en récompenses de voyage partage ses idées sur la sélection des cartes de crédit pour maximiser les avantages des vols, en répondant aux idées fausses courantes sur la stratégie des récompenses de voyage."
      },
      "de": {
        "title": "Ich habe seit 15 Jahren keinen Flug mit Bargeld bezahlt. Hier ist die häufigste Frage, die mir gestellt wird — und warum sie falsch ist",
        "summary": "Ein Reiseprämienspezialist teilt Erkenntnisse zur Kreditkartenauswahl zur Maximierung von Flugvorteilen und behebt häufige Missverständnisse über die Reiseprämienstrategie."
      },
      "es": {
        "title": "No he pagado en efectivo un vuelo en 15 años. Esta es la pregunta más común que me hacen — y por qué es incorrecta",
        "summary": "Un experto en recompensas de viaje comparte información sobre la selección de tarjetas de crédito para maximizar beneficios de vuelos, abordando ideas erróneas comunes sobre estrategia de recompensas de viaje."
      }
    }
  },
  {
    "title": "Chip giant Nvidia flouts AI scepticism with record revenue",
    "slug": "nvidia-record-revenue-ai-skepticism",
    "url": "https://www.bbc.com/news/articles/c80jgd8yljko?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-25T23:22:41.000Z",
    "summary": "Nvidia achieved record revenue driven by strong demand for its chips, even as the company expands into AI product development amid broader market skepticism.",
    "content": "Demand for Nvidia chips rose even as the company sets out to create AI products of its own.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "芯片巨头英伟达以创纪录的收入击退对人工智能的怀疑",
        "summary": "英伟达因其芯片的强劲需求取得创纪录的收入，同时公司在更广泛的市场怀疑中扩展到人工智能产品开发。"
      },
      "fr": {
        "title": "Le géant des puces Nvidia déjoue le scepticisme sur l'IA avec un chiffre d'affaires record",
        "summary": "Nvidia a réalisé un chiffre d'affaires record grâce à la forte demande de ses puces, tandis que l'entreprise s'étend au développement de produits IA au milieu d'un scepticisme plus large du marché."
      },
      "de": {
        "title": "Chip-Riese Nvidia trotzt der KI-Skepsis mit Rekordeinnahmen",
        "summary": "Nvidia erzielte Rekordeinnahmen durch starke Nachfrage nach seinen Chips, während das Unternehmen die KI-Produktentwicklung inmitten von weit verbreiteter Marktskepsis ausbaut."
      },
      "es": {
        "title": "El gigante de chips Nvidia desafía el escepticismo de la IA con ingresos récord",
        "summary": "Nvidia logró ingresos récord impulsados por la fuerte demanda de sus chips, mientras que la empresa se expande hacia el desarrollo de productos de IA en medio del escepticismo más amplio del mercado."
      }
    }
  },
  {
    "title": "Paramount says Warner Bros. acquisition would be an ‘accelerant’ for its turnaround strategy",
    "slug": "paramount-warner-bros-acquisition-turnaround",
    "url": "https://www.marketwatch.com/story/paramount-says-warner-bros-acquisition-would-be-an-accelerant-of-its-turnaround-strategy-d5520fad?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-25T23:22:00.000Z",
    "summary": "Paramount, which completed its Skydance merger, is exploring a potential Warner Bros. acquisition to accelerate its turnaround despite rising losses in the latest quarter.",
    "content": "Paramount saw losses rise in its latest quarter, while revenue and streaming subscribers grew in the first full reporting period since its merger with Skydance.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Paramount表示华纳兄弟公司的收购将成为其扭转战略的\"加速剂\"",
        "summary": "Paramount在完成Skydance合并后，正在探索潜在的华纳兄弟公司收购，以加速其扭转局面，尽管最近一个季度的亏损增加。"
      },
      "fr": {
        "title": "Paramount affirme que l'acquisition de Warner Bros. serait un 'accélérateur' pour sa stratégie de redressement",
        "summary": "Paramount, qui a finalisé sa fusion avec Skydance, explore une éventuelle acquisition de Warner Bros. pour accélérer son redressement malgré les pertes croissantes du dernier trimestre."
      },
      "de": {
        "title": "Paramount sagt, dass die Übernahme von Warner Bros. ein 'Beschleuniger' für seine Umkehrstrategie wäre",
        "summary": "Paramount, das seine Skydance-Fusion abgeschlossen hat, erkundet eine mögliche Übernahme von Warner Bros., um sein Turnaround zu beschleunigen, trotz steigender Verluste im letzten Quartal."
      },
      "es": {
        "title": "Paramount dice que la adquisición de Warner Bros. sería un 'acelerador' para su estrategia de recuperación",
        "summary": "Paramount, que completó su fusión con Skydance, está explorando una posible adquisición de Warner Bros. para acelerar su recuperación a pesar de las pérdidas crecientes en el trimestre más reciente."
      }
    }
  },
  {
    "title": "Stocks making the biggest moves after hours: Nvidia, Salesforce, Snowflake, Nutanix & more",
    "slug": "stocks-biggest-moves-after-hours-nvidia-salesforce",
    "url": "https://www.cnbc.com/2026/02/25/stocks-making-the-biggest-moves-after-hours-nvda-crm-snow-ionq.html",
    "source": "CNBC",
    "date": "2026-02-25T23:16:49.000Z",
    "summary": "Extended trading session saw significant stock moves from major tech companies including Nvidia, Salesforce, and Snowflake following their earnings announcements.",
    "content": "These are the stocks posting the largest moves in extended trading.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "股市盘后涨跌不一：英伟达、Salesforce、Snowflake、Nutanix等",
        "summary": "美股盘后交易中，英伟达、Salesforce和Snowflake等主要科技公司在发布财报后出现大幅波动。"
      },
      "fr": {
        "title": "Les plus grands mouvements des actions après les heures : Nvidia, Salesforce, Snowflake, Nutanix et plus",
        "summary": "La séance de négociation prolongée a enregistré des mouvements boursiers importants des principales entreprises technologiques, notamment Nvidia, Salesforce et Snowflake, suite à leurs annonces de résultats."
      },
      "de": {
        "title": "Die größten Aktienbewegungen nach Handelsschluss: Nvidia, Salesforce, Snowflake, Nutanix und mehr",
        "summary": "In der erweiterten Handelssitzung kam es zu signifikanten Kursbewegungen von großen Technologieunternehmen, darunter Nvidia, Salesforce und Snowflake, nach ihren Gewinnmitteilungen."
      },
      "es": {
        "title": "Los mayores movimientos de acciones después de horas: Nvidia, Salesforce, Snowflake, Nutanix y más",
        "summary": "La sesión de negociación extendida vio movimientos significativos de acciones de las principales empresas tecnológicas, incluidas Nvidia, Salesforce y Snowflake, tras sus anuncios de ganancias."
      }
    }
  },
  {
    "title": "Vance says administration is pausing some Medicaid funding to Minnesota because of fraud concerns",
    "slug": "vance-pausing-medicaid-funding-minnesota-fraud",
    "url": "https://www.cnbc.com/2026/02/25/vance-says-administration-is-pausing-some-medicaid-funding-to-minnesota-because-of-fraud-concerns.html",
    "source": "CNBC",
    "date": "2026-02-25T23:13:03.000Z",
    "summary": "Vice President Vance announced a temporary halt to some Medicaid funding for Minnesota over fraud concerns, marking the Trump administration's latest healthcare policy action.",
    "content": "Vance announced Wednesday that the Trump administration would \"temporarily halt\" some Medicaid funding to the state of Minnesota over fraud concerns.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "万斯表示政府因欺诈担忧暂停向明尼苏达州的部分医疗补助资金",
        "summary": "副总统万斯宣布因欺诈担忧暂时停止向明尼苏达州提供部分医疗补助资金，这是特朗普政府最新的医疗政策举措。"
      },
      "fr": {
        "title": "Vance dit que l'administration suspend une partie du financement Medicaid au Minnesota en raison de préoccupations liées à la fraude",
        "summary": "Le Vice-président Vance a annoncé un arrêt temporaire du financement de Medicaid pour le Minnesota en raison de préoccupations concernant la fraude, marquant la dernière action politique de santé de l'administration Trump."
      },
      "de": {
        "title": "Vance sagt, dass die Verwaltung aufgrund von Betrugsverdacht einige Medicaid-Mittel für Minnesota aussetzt",
        "summary": "Vizepräsident Vance kündigte einen vorübergehenden Stopp einiger Medicaid-Mittel für Minnesota wegen Betrugsverdacht an, was die neueste Gesundheitspolitik der Trump-Administration darstellt."
      },
      "es": {
        "title": "Vance dice que la administración pausa la financiación de Medicaid a Minnesota por preocupaciones de fraude",
        "summary": "El Vice Presidente Vance anunció un cese temporal de parte de la financiación de Medicaid para Minnesota por preocupaciones de fraude, marcando la última acción de política de salud de la administración Trump."
      }
    }
  },
  {
    "title": "'We don't know where we are going': Asian businesses brace for more Trump tariff turmoil",
    "slug": "asian-businesses-trump-tariff-uncertainty",
    "url": "https://www.bbc.com/news/articles/cdr2kmjd31ro?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-25T23:03:26.000Z",
    "summary": "Asian businesses face increased uncertainty following the US Supreme Court's decision to block key trade policy, amid concerns about escalating Trump administration tariffs.",
    "content": "The US Supreme Court's decision to block a pillar of US trade policy has caused yet more uncertainty.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "\"我们不知道未来在何方\"：亚洲企业为更多特朗普关税混乱做准备",
        "summary": "在美国最高法院决定阻止关键贸易政策后，亚洲企业面临更大的不确定性，同时对特朗普政府升级关税的担忧日益增加。"
      },
      "fr": {
        "title": "\"Nous ne savons pas où nous allons\": Les entreprises asiatiques se préparent à plus de turbulences tarifaires de Trump",
        "summary": "Les entreprises asiatiques font face à une incertitude accrue suite à la décision de la Cour suprême américaine de bloquer la politique commerciale clé, au milieu des préoccupations concernant l'escalade des tarifs de l'administration Trump."
      },
      "de": {
        "title": "\"Wir wissen nicht, wohin wir gehen\": Asiatische Unternehmen bereiten sich auf mehr Trump-Zollchaos vor",
        "summary": "Asiatische Unternehmen sind mit erhöhter Unsicherheit konfrontiert, nachdem der US-Oberste Gerichtshof beschlossen hat, eine wichtige Handelspolitik zu blockieren, inmitten von Bedenken hinsichtlich der Eskalation von Zöllen der Trump-Administration."
      },
      "es": {
        "title": "\"No sabemos a dónde vamos\": Las empresas asiáticas se preparan para más caos arancelario de Trump",
        "summary": "Las empresas asiáticas enfrentan mayor incertidumbre tras la decisión de la Corte Suprema de EE.UU. de bloquear una política comercial clave, en medio de preocupaciones sobre los aranceles escalonados de la administración Trump."
      }
    }
  },
  {
    "title": "Say hello to 'Bye America!': Three trades to navigate U.S. Big Tech disruption",
    "slug": "three-trades-navigate-us-big-tech-disruption",
    "url": "https://www.cnbc.com/2026/02/25/ai-big-tech-risk-disruption-trading-three-trades-investing.html",
    "source": "CNBC",
    "date": "2026-02-25T06:04:19.000Z",
    "summary": "A portfolio manager at Julius Baer has outlined three trades designed to reduce exposure to U.S. Big Tech as the sector faces disruption. The strategy aims to help investors diversify away from concentrated tech holdings during a period of uncertainty. These trades address growing concerns about the valuation and stability of major U.S. technology companies.",
    "content": "Tom Watts, portfolio manager at Julius Baer, outlined several trades to diversify away from U.S. tech exposure.",
    "category": "economic"
  },
  {
    "title": "These are the European tech stocks to watch after Nvidia reports earnings — and how strong or weak results would affect them",
    "slug": "european-tech-stocks-watch-nvidia-earnings",
    "url": "https://www.cnbc.com/2026/02/25/european-tech-stocks-nvidia-earnings.html",
    "source": "CNBC",
    "date": "2026-02-25T06:00:01.000Z",
    "summary": "Nvidia, the world's most valuable company, is set to report its earnings on Wednesday, with potential ripple effects across European tech stocks. Several European technology companies are positioned to react significantly to Nvidia's results, depending on whether they meet or miss market expectations. The earnings announcement represents a key moment for European tech sector investors tracking exposure to Nvidia's performance.",
    "content": "The world's most valuable company reports its earnings on Wednesday. These European stocks are likely to react.",
    "category": "economic"
  },
  {
    "title": "HSBC annual pre-tax profit drops over 7%, revenue jumps as bank's results top estimates",
    "slug": "hsbc-annual-profit-drops-revenue-jumps",
    "url": "https://www.cnbc.com/2026/02/25/hsbc-2025-full-year-earnings-results.html",
    "source": "CNBC",
    "date": "2026-02-25T04:33:12.000Z",
    "summary": "HSBC, Europe's largest lender, reported annual pre-tax profit of $29.91 billion on Wednesday, beating estimates despite a 7% profit decline. Revenue growth offset profit drops, signaling resilience in the banking sector.",
    "content": "Europe's largest lender HSBC on Wednesday reported annual pre-tax profit of $29.91 billion, beating the bank's estimates.",
    "category": "economic"
  },
  {
    "title": "These are the ‘secret words’ Trump wants to hear as U.S., Iran prepare to meet this week",
    "slug": "trump-secret-words-us-iran-meet",
    "url": "https://www.marketwatch.com/story/these-are-the-secret-words-trump-wants-to-hear-as-u-s-iran-prepare-to-meet-this-week-3457d46c?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-25T04:30:00.000Z",
    "summary": "U.S. and Iranian negotiators are set to meet later this week as President Trump outlined specific demands for Tehran in his State of the Union address. The meeting will test diplomatic channels amid ongoing tensions.",
    "content": "U.S. and Iranian negotiators are set to meet again later this week, and President Donald Trump made a clear ask of Tehran in his State of the Union speech on Tuesday night ahead of those talks.",
    "category": "economic"
  },
  {
    "title": "Trump backs stock-trade ban for Congress during State of the Union. Here’s where the effort stands.",
    "slug": "trump-backs-stock-trade-ban-congress",
    "url": "https://www.marketwatch.com/story/trump-backs-stock-trade-ban-for-congress-during-state-of-the-union-heres-where-the-effort-stands-6cd6fbd8?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-25T04:00:00.000Z",
    "summary": "President Trump called for Congress to ban insider trading among lawmakers in his State of the Union address, receiving bipartisan applause. The effort aims to restrict securities trading by members of Congress.",
    "content": "President Donald Trump got applause from Democrats and Republicans alike when he called in his State of the Union address for Congress to stop insider trading among lawmakers.",
    "category": "economic"
  },
  {
    "title": "Elusive Shein boss hails Chinese roots in rare public appearance",
    "slug": "elusive-shein-boss-hails-chinese-roots-in-rare-public-appearance",
    "url": "https://www.bbc.com/news/articles/c39wdgy3gmvo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-25T03:18:11.000Z",
    "summary": "Shein's CEO made a rare public appearance acknowledging his Chinese roots despite the company's efforts to distance itself from China by relocating to Singapore. The statement marks a notable shift in the company's public positioning.",
    "content": "His speech follows years of the firm focusing away from China as it moved its headquarters to Singapore.",
    "category": "economic"
  },
  {
    "title": "The global M&A boom is rolling into 2026 as AI sparks deal frenzy — but cash is getting tight",
    "slug": "global-ma-boom-rolling-into-2026-as-ai-sparks-deal-frenzy",
    "url": "https://www.cnbc.com/2026/02/25/global-ma-boom-surges-2026-ai-mega-deals-capital-squeeze-merger-and-acquisition.html",
    "source": "CNBC",
    "date": "2026-02-25T02:46:43.000Z",
    "summary": "The global M&A market is expected to continue its 2026 surge driven by AI-related deal activity, though funding tightness poses challenges. Wall Street has regained appetite for large-scale transactions despite constrained cash availability.",
    "content": "Markets are betting that the global M&A surge has not yet finished, as Wall Street recovered its appetite for large-scale financings.",
    "category": "economic"
  },
  {
    "title": "Trump says Iran wants a deal more than the U.S. as American forces build up in oil-rich Middle East",
    "slug": "trump-says-iran-wants-deal-more-than-us",
    "url": "https://www.cnbc.com/2026/02/25/trump-says-iran-wants-a-deal-more-than-the-us-ahead-of-next-round-of-negotiations-in-geneva.html",
    "source": "CNBC",
    "date": "2026-02-25T02:31:02.000Z",
    "summary": "President Trump claims Iran is more eager for a nuclear deal than the United States as American military forces build up in the Middle East. The two countries are set to begin a third round of bilateral negotiations in Switzerland this week.",
    "content": "Iran wants to make a \"deal\" more than the U.S., President Donald Trump said Tuesday, ahead of a third round of bilateral talks in Switzerland later this week.",
    "category": "economic"
  },
  {
    "title": "U.S. Supreme Court tariff ruling will likely allow India to keep buying Russian oil",
    "slug": "us-supreme-court-tariff-ruling-india-russian-oil",
    "url": "https://www.cnbc.com/2026/02/25/us-tariff-ruling-india-russian-oil-purchases.html",
    "source": "CNBC",
    "date": "2026-02-25T02:10:50.000Z",
    "summary": "A Supreme Court tariff ruling is likely to permit India to continue purchasing Russian oil without facing U.S. sanctions. Analysts suggest the U.S. lacks sufficient leverage to force India to eliminate its Russian energy imports.",
    "content": "India is unlikely to eliminate Russian oil imports and the U.S. may not have enough leverage to push New Delhi to do so, analysts say.",
    "category": "economic"
  },
  {
    "title": "Nvidia, Microsoft back self-driving firm Wayve as it hits $8.6 billion valuation",
    "slug": "nvidia-microsoft-back-wayve-8-6-billion-valuation",
    "url": "https://www.cnbc.com/2026/02/24/wayve-fundraise-nvidia-microsoft.html",
    "source": "CNBC",
    "date": "2026-02-25T01:36:30.000Z",
    "summary": "Autonomous vehicle startup Wayve reached an $8.6 billion valuation after securing $1.2 billion in Series D funding led by Eclipse, Balderton, and SoftBank Vision Fund 2. Nvidia and Microsoft were among the major tech companies backing the round.",
    "content": "The $1.2 billion Series D round was led by Eclipse, Balderton and SoftBank Vision Fund 2",
    "category": "economic"
  },
  {
    "title": "Wednesday's big stock stories: What’s likely to move the market in the next trading session",
    "slug": "big-stock-stories-whats-likely-move-market-next-trading-session",
    "url": "https://www.cnbc.com/2026/02/24/wednesdays-big-stock-stories-whats-likely-to-move-the-market.html",
    "source": "CNBC",
    "date": "2026-02-25T01:26:13.000Z",
    "summary": "Software stocks recovered from recent selling pressure on Tuesday, pushing major market indexes higher. The sector rebound provided significant momentum to overall market gains.",
    "content": "Software stocks bounced after the latest bout of selling, lifting the major averages to a winning session Tuesday.",
    "category": "economic"
  },
  {
    "title": "Cava says diners are doing better this year — and may be getting tired of chasing meal deals",
    "slug": "cava-diners-doing-better-may-getting-tired-chasing-meal-deals",
    "url": "https://www.marketwatch.com/story/cava-says-diners-are-doing-better-this-year-and-could-be-getting-tired-of-chasing-meal-deals-25d062fe?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-25T01:26:00.000Z",
    "summary": "Mediterranean fast-casual restaurant Cava issued an optimistic sales forecast for 2026 as customer traffic rebounded from weather disruptions and effects of last year's government shutdown. The company suggests consumers are moving away from discount-chasing behavior.",
    "content": "Cava issued an upbeat sales forecast for this year, as cautious customers shook off the effects of snowstorms and last year’s government shutdown to return to the Mediterranean fast-casual chain for bowls and salads.",
    "category": "economic"
  },
  {
    "title": "Could Stripe ‘salvage’ PayPal? What Wall Street has to say about the latest takeover talk.",
    "slug": "could-stripe-salvage-paypal-what-wall-street-has-to-say-about-the-latest-takeove",
    "url": "https://www.marketwatch.com/story/could-stripe-salvage-paypal-what-wall-street-has-to-say-about-the-latest-takeover-talk-815c4e9a?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-25T00:13:00.000Z",
    "summary": "PayPal has underinvested in its consumer business, an analyst says. But Stripe could still find value in it.",
    "content": "PayPal has underinvested in its consumer business, an analyst says. But Stripe could still find value in it.",
    "category": "economic"
  },
  {
    "title": "What is the UK's new travel system and how are dual nationals affected?",
    "slug": "what-is-the-uk-s-new-travel-system-and-how-are-dual-nationals-affected",
    "url": "https://www.bbc.com/news/articles/cy57p1v61d1o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-25T00:05:49.000Z",
    "summary": "From 25 February, a new system will come into force which will affect many people, including British dual nationals.",
    "content": "From 25 February, a new system will come into force which will affect many people, including British dual nationals.",
    "category": "economic"
  },
  {
    "title": "Energy bills to fall in April after charges shake-up",
    "slug": "energy-bills-to-fall-in-april-after-charges-shake-up",
    "url": "https://www.bbc.com/news/articles/cx2lpl9lxw2o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-25T00:04:55.000Z",
    "summary": "Changes announced in the Budget mean domestic energy prices should fall sharply in April.",
    "content": "Changes announced in the Budget mean domestic energy prices should fall sharply in April.",
    "category": "economic"
  },
  {
    "title": "Paramount boosts Warner Bros offer to rival Netflix in takeover bid",
    "slug": "paramount-boosts-warner-bros-offer-to-rival-netflix-in-takeover-bid",
    "url": "https://www.bbc.com/news/articles/c24dz0683dyo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-25T00:01:02.000Z",
    "summary": "Warner Bros says the latest proposal could convince it to abandon the deal it struck with Netflix.",
    "content": "Warner Bros says the latest proposal could convince it to abandon the deal it struck with Netflix.",
    "category": "economic"
  }
]