[
  {
    "title": "Two ‘Big Short’ traders share their favorite bets as AI disruption upends a range of sectors",
    "slug": "big-short-traders-share-favorite-bets-ai-disruption-upends-sectors",
    "url": "https://www.cnbc.com/2026/02/24/two-big-short-traders-share-their-favorite-bets-amid-ai-disruption.html",
    "source": "CNBC",
    "date": "2026-02-24T23:59:03.000Z",
    "summary": "Prominent contrarian investors from \"The Big Short,\" Danny Moses and Vincent Daniel, shared their highest conviction bets as artificial intelligence disrupts multiple business sectors. Their crisis-prediction expertise is now focused on identifying opportunities amid AI-driven market upheaval.",
    "content": "The \"Big Short\" traders Danny Moses and Vincent Daniel are known for betting against the housing market in 2008. They shared their highest conviction trades.",
    "category": "economic"
  },
  {
    "title": "State of the Union live updates: Trump to talk economy amid rising disapproval ratings",
    "slug": "state-of-the-union-live-updates-trump-to-talk-economy-amid-rising-disapproval-ra",
    "url": "https://www.cnbc.com/2026/02/24/trump-state-of-the-union-live-updates.html",
    "source": "CNBC",
    "date": "2026-02-24T23:59:01.000Z",
    "summary": "President Donald Trump will give the first State of the Union of his second term at 9 p.m. ET, focusing on the economy and affordability ahead of the midterms.",
    "content": "President Donald Trump will give the first State of the Union of his second term at 9 p.m. ET, focusing on the economy and affordability ahead of the midterms.",
    "category": "economic"
  },
  {
    "title": "Governments are rushing to hoard critical minerals as the 'resource nationalism' era arrives",
    "slug": "governments-are-rushing-to-hoard-critical-minerals-as-the-resource-nationalism-e",
    "url": "https://www.cnbc.com/2026/02/25/critical-minerals-stockpile-race-us-eu-china-resource-nationalism.html",
    "source": "CNBC",
    "date": "2026-02-24T23:55:29.000Z",
    "summary": "A new race to secure critical minerals is unfolding across the global economy.",
    "content": "A new race to secure critical minerals is unfolding across the global economy.",
    "category": "economic"
  },
  {
    "title": "Lucid widely misses earnings expectations, forecasts continued EV growth in 2026",
    "slug": "lucid-widely-misses-earnings-expectations-forecasts-continued-ev-growth-in-2026",
    "url": "https://www.cnbc.com/2026/02/24/lucid-lcid-q4-2025-results-.html",
    "source": "CNBC",
    "date": "2026-02-24T23:43:35.000Z",
    "summary": "For 2026, Lucid announced a vehicle production target of between 25,000 and 27,000 units, which would be a roughly 40% to 51% increase compared with last year.",
    "content": "For 2026, Lucid announced a vehicle production target of between 25,000 and 27,000 units, which would be a roughly 40% to 51% increase compared with last year.",
    "category": "economic"
  },
  {
    "title": "Workday’s stock dives as earnings reveal the cost of competing in AI",
    "slug": "workday-s-stock-dives-as-earnings-reveal-the-cost-of-competing-in-ai",
    "url": "https://www.marketwatch.com/story/workdays-stock-dives-as-earnings-reveal-the-cost-of-competing-in-ai-3578985b?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-24T23:29:00.000Z",
    "summary": "Workday’s margin outlook came up short of expectations as the company steps up AI investments.",
    "content": "Workday’s margin outlook came up short of expectations as the company steps up AI investments.",
    "category": "economic"
  },
  {
    "title": "Paramount pushes ahead in Warner Bros. takeover fight with increased bid of $31 per share",
    "slug": "paramount-pushes-ahead-in-warner-bros-takeover-fight-with-increased-bid-of-31-pe",
    "url": "https://www.marketwatch.com/story/paramount-pushes-ahead-in-warner-bros-takeover-with-increased-bid-of-31-per-share-87989593?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-24T23:26:00.000Z",
    "summary": "The dramatic deal to acquire Warner Bros. Discovery looks like it may have a cliff-hanger ending after all.",
    "content": "The dramatic deal to acquire Warner Bros. Discovery looks like it may have a cliff-hanger ending after all.",
    "category": "economic"
  },
  {
    "title": "Workday stock sinks on weak revenue guidance",
    "slug": "workday-stock-sinks-on-weak-revenue-guidance",
    "url": "https://www.cnbc.com/2026/02/24/workday-wday-q4-earnings-report-2026.html",
    "source": "CNBC",
    "date": "2026-02-24T23:19:36.000Z",
    "summary": "The results come weeks after Workday said that CEO Carl Eschenbach is stepping down, with co-founder Aneel Bhusri replacing him.",
    "content": "The results come weeks after Workday said that CEO Carl Eschenbach is stepping down, with co-founder Aneel Bhusri replacing him.",
    "category": "economic"
  },
  {
    "title": "Nvidia’s earnings report is just a prelude to what should really matter for investors",
    "slug": "nvidia-s-earnings-report-is-just-a-prelude-to-what-should-really-matter-for-inve",
    "url": "https://www.marketwatch.com/story/nvidias-earnings-report-is-just-a-prelude-to-what-should-really-matter-for-investors-d185e94c?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-24T23:16:00.000Z",
    "summary": "The chip maker’s results are unlikely to be much of a catalyst for the stock as investors look forward to the GTC in March, one analyst says",
    "content": "The chip maker’s results are unlikely to be much of a catalyst for the stock as investors look forward to the GTC in March, one analyst says",
    "category": "economic"
  },
  {
    "title": "Register now: Applications open for the World's Top Fintech Companies 2026",
    "slug": "worlds-top-fintech-companies-2026",
    "url": "https://www.cnbc.com/2026/02/25/cnbc-worlds-top-fintech-companies-2026-apply-now.html",
    "source": "CNBC",
    "date": "2026-02-24T23:08:25.000Z",
    "summary": "CNBC and Statista have opened applications for their World's Top Fintech Companies 2026 ranking, recognizing innovation among startups and major tech firms globally. The annual recognition highlights leaders in financial technology.",
    "content": "CNBC and Statista chart the top fintech players from around the world, ranging from startups to Big Tech names.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "立即报名：2026年全球顶级金融科技公司评选开放申请",
        "summary": "CNBC和Statista为其2026年全球顶级金融科技公司评选开放申请，表彰创业公司和全球大型科技公司的创新。年度评选突出了金融科技领域的领导者。"
      },
      "ja": {
        "title": "今すぐ登録：2026年世界トップフィンテック企業のアプリケーション受付が開始",
        "summary": "CNBCとStatisaは、2026年世界トップフィンテック企業ランキングの応募を開始し、スタートアップと世界的な大手テク企業のイノベーションを認識しています。年間表彰はフィンテック分野のリーダーを強調しています。"
      },
      "ko": {
        "title": "지금 등록하세요: 2026년 세계 최고 핀테크 기업 신청 개시",
        "summary": "CNBC와 Statista가 2026년 세계 최고 핀테크 기업 평가를 위한 신청을 개시했으며, 스타트업과 글로벌 대형 기술 기업의 혁신을 인정합니다. 연간 표창은 금융 기술 분야의 리더를 강조합니다."
      },
      "fr": {
        "title": "Inscrivez-vous maintenant : Les candidatures sont ouvertes pour les meilleures entreprises fintech du monde 2026",
        "summary": "CNBC et Statista ont ouvert les candidatures pour leur classement des meilleures entreprises fintech du monde 2026, reconnaissant l'innovation des startups et des grandes entreprises technologiques mondiales. La reconnaissance annuelle met en évidence les leaders de la technologie financière."
      },
      "de": {
        "title": "Jetzt anmelden: Bewerbungen für die besten Fintech-Unternehmen der Welt 2026 sind offen",
        "summary": "CNBC und Statista haben Bewerbungen für ihre Rangliste der besten Fintech-Unternehmen der Welt 2026 eröffnet und würdigen Innovation von Startups und großen Tech-Unternehmen weltweit. Die jährliche Auszeichnung hebt Führungspersönlichkeiten in der Finanztechnologie hervor."
      },
      "es": {
        "title": "Regístrate ahora: Se abren las solicitudes para las mejores empresas Fintech del mundo 2026",
        "summary": "CNBC y Statista han abierto las solicitudes para su clasificación de las mejores empresas Fintech del mundo 2026, reconociendo la innovación entre startups y grandes empresas tecnológicas globales. El reconocimiento anual destaca a los líderes en tecnología financiera."
      }
    }
  },
  {
    "title": "US threatens Anthropic with deadline in dispute on AI safeguards",
    "slug": "us-threatens-anthropic-with-deadline-in-dispute-on-ai-safeguards",
    "url": "https://www.bbc.com/news/articles/cjrq1vwe73po?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-24T22:58:46.000Z",
    "summary": "The AI developer laid out red lines on military use of its products, a source said.",
    "content": "The AI developer laid out red lines on military use of its products, a source said.",
    "category": "economic"
  },
  {
    "title": "Why did AI ‘science fiction’ spur market panic? We asked a behavioral-finance expert to find out.",
    "slug": "why-did-ai-science-fiction-spur-market-panic-we-asked-a-behavioral-finance-exper",
    "url": "https://www.marketwatch.com/story/why-did-ai-science-fiction-spur-market-panic-we-asked-a-behavioral-finance-expert-to-find-out-beb32363?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-24T22:58:00.000Z",
    "summary": "Amid high AI valuations and fears of software displacement, a blog post from Citrini Research ignited a selloff as investors tried to front-run the exit",
    "content": "Amid high AI valuations and fears of software displacement, a blog post from Citrini Research ignited a selloff as investors tried to front-run the exit",
    "category": "economic"
  },
  {
    "title": "Head of Amazon’s AGI lab is leaving the company",
    "slug": "head-of-amazon-s-agi-lab-is-leaving-the-company",
    "url": "https://www.cnbc.com/2026/02/24/head-of-amazons-agi-lab-is-leaving-the-company.html",
    "source": "CNBC",
    "date": "2026-02-24T22:56:50.000Z",
    "summary": "David Luan, the head of Amazon's artificial general intelligence lab, announced on Tuesday that he will be departing the company at the end of the week.",
    "content": "David Luan, the head of Amazon's artificial general intelligence lab, announced on Tuesday that he will be departing the company at the end of the week.",
    "category": "economic"
  },
  {
    "title": "House prices in Wales rise faster than UK average - see how your area compares",
    "slug": "house-prices-in-wales-rise-faster-than-uk-average-see-how-your-area-compares",
    "url": "https://www.bbc.com/news/articles/cwy80d1nl7vo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-24T22:49:39.000Z",
    "summary": "Some areas have seen average house prices increase by 7% in the past year, according to ONS data.",
    "content": "Some areas have seen average house prices increase by 7% in the past year, according to ONS data.",
    "category": "economic"
  },
  {
    "title": "Discord delays age verification plans after user outcry",
    "slug": "discord-delays-age-verification-plans-after-user-outcry",
    "url": "https://www.bbc.com/news/articles/cvgv0yg4n9lo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-24T22:43:26.000Z",
    "summary": "Discord postponed its age verification initiative following widespread user objections over privacy concerns. The platform had proposed requiring facial recognition or government ID scans for age verification.",
    "content": "Users were unhappy about plans for age verification to require facial or ID scans.",
    "category": "economic"
  },
  {
    "title": "‘I am fearful’: My ailing relative is being forced into assisted living. What can I do?",
    "slug": "ailing-relative-forced-assisted-living-what-can-do",
    "url": "https://www.marketwatch.com/story/i-am-fearful-my-ailing-relative-is-being-forced-into-assisted-living-what-can-i-do-7ce8b42a?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-24T22:36:00.000Z",
    "summary": "This column addresses concerns about aging relatives being pressured into assisted living arrangements without clear understanding of associated costs and services. It raises questions about financial autonomy and informed decision-making in elderly care situations.",
    "content": "“My relative also has no idea what they are being charged for these services.”",
    "category": "economic"
  },
  {
    "title": "Constellation Energy’s stock zooms toward highest level in weeks, even after outlook is postponed",
    "slug": "constellation-energy-stock-zooms-highest-level-weeks-outlook-postponed",
    "url": "https://www.marketwatch.com/story/constellation-energys-stock-zooms-toward-highest-level-in-weeks-even-after-outlook-is-postponed-af3495f1?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-24T22:30:00.000Z",
    "summary": "Constellation Energy's stock reached its highest level in nearly six weeks despite the independent power producer delaying its 2026 financial outlook until March. The rally reflects continued investor confidence in the energy sector.",
    "content": "Constellation Energy is keeping investors waiting for its yearly guidance, saying it will provide it in March. But that hasn’t dented the independent power producer’s stock, which zoomed to its highest level in nearly six weeks on Tuesday, regaining some of its past luster.",
    "category": "economic"
  },
  {
    "title": "As the WNBA moves to stop paying for players’ housing, here’s where the labor negotiations stand",
    "slug": "wnba-stops-paying-housing-labor-negotiations-stand",
    "url": "https://www.marketwatch.com/story/as-the-wnba-moves-to-stop-paying-for-players-housing-heres-where-the-labor-negotiations-stand-d46a9cbd?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-24T22:30:00.000Z",
    "summary": "WNBA players are seeking 27.5% of league revenue as the league eliminates its housing subsidy for players. The demand reflects ongoing negotiations over compensation equity compared to NBA and NFL players.",
    "content": "WNBA players are asking for 27.5% of league revenue. Here’s how that compares to the NBA and NFL.",
    "category": "economic"
  },
  {
    "title": "Cava reports surprise same-store sales growth, driven by menu prices",
    "slug": "cava-surprise-same-store-sales-growth-menu-prices",
    "url": "https://www.cnbc.com/2026/02/24/cava-q4-2025-earnings.html",
    "source": "CNBC",
    "date": "2026-02-24T22:17:31.000Z",
    "summary": "Cava achieved unexpected same-store sales growth by strategically raising menu prices, allowing the company to navigate economic headwinds. CFO Tricia Tolivar credited the company's ability to create a \"bridge\" across the increasingly unequal K-shaped economy.",
    "content": "Cava CFO Tricia Tolivar said the company has been able to create a \"bridge\" in the increasingly K-shaped economy.",
    "category": "economic"
  },
  {
    "title": "PayPal pops nearly 7% on report fintech startup Stripe is weighing an acquisition",
    "slug": "paypal-pops-report-stripe-weighing-acquisition",
    "url": "https://www.cnbc.com/2026/02/24/paypal-stock-stripe-acquisition-report.html",
    "source": "CNBC",
    "date": "2026-02-24T22:10:28.000Z",
    "summary": "PayPal stock surged nearly 7% following reports that fintech startup Stripe is considering acquiring the payments company. The rally marks a recovery attempt for PayPal, whose stock fell nearly one-third in value last year.",
    "content": "PayPal's stock lost nearly a third of its value last year due to slowing growth and competition concerns.",
    "category": "economic"
  },
  {
    "title": "Apple says some Mac Mini production will move to the US",
    "slug": "apple-mac-mini-production-move-us",
    "url": "https://www.bbc.com/news/articles/c4g8eq9z2v8o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-24T22:09:00.000Z",
    "summary": "Apple announced plans to relocate some Mac Mini production to the United States as part of its $600 billion domestic investment commitment. The move responds to political pressure to increase manufacturing in the U.S.",
    "content": "The technology giant had pledged to increase investment in the US by $600bn, under pressure from Trump.",
    "category": "economic"
  },
  {
    "title": "Stocks making the biggest moves after hours: Workday, Cava, Lucid Group and more",
    "slug": "stocks-biggest-moves-after-hours",
    "url": "https://www.cnbc.com/2026/02/24/stocks-making-the-biggest-moves-after-hours-wday-cava-lcid.html",
    "source": "CNBC",
    "date": "2026-02-24T21:53:09.000Z",
    "summary": "Stocks including Workday, Cava, and Lucid Group posted the largest moves during extended trading hours. The after-hours activity reflects investor responses to earnings reports and market developments.",
    "content": "These are the stocks posting the largest moves in extended trading.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "盘后涨跌幅最大的股票：Workday、Cava、Lucid Group等",
        "summary": "包括Workday、Cava和Lucid Group在内的股票在盘后交易时段出现了最大涨跌。盘后活动反映了投资者对财报和市场动态的响应。"
      },
      "ja": {
        "title": "時間外取引で最大の変動を見せる株式：Workday、Cava、Lucid Groupほか",
        "summary": "Workday、Cava、Lucid Groupを含む株式は、延長取引時間中に最大の変動を記録しました。アフターアワーズの活動は、決算報告と市場の発展に対する投資家の反応を反映しています。"
      },
      "ko": {
        "title": "시간 외 거래에서 가장 큰 변동을 보이는 주식: Workday, Cava, Lucid Group 등",
        "summary": "Workday, Cava, Lucid Group을 포함한 주식들은 연장 거래 시간 동안 가장 큰 변동을 기록했습니다. 시간 외 거래 활동은 실적 보고와 시장 동향에 대한 투자자의 반응을 반영합니다."
      },
      "fr": {
        "title": "Les actions les plus performantes en trading après les heures : Workday, Cava, Lucid Group et plus",
        "summary": "Les actions y compris Workday, Cava et Lucid Group ont enregistré les plus grands mouvements pendant les heures de négociation prolongées. L'activité après les heures reflète les réactions des investisseurs aux rapports de résultats et aux développements du marché."
      },
      "de": {
        "title": "Die Aktien mit den größten Bewegungen nach Handelsschluss: Workday, Cava, Lucid Group und mehr",
        "summary": "Aktien wie Workday, Cava und Lucid Group verzeichneten die größten Bewegungen während der erweiterten Handelszeiten. Die Aktivität nach Handelsschluss spiegelt die Reaktion der Anleger auf Ergebnisberichte und Marktentwicklungen wider."
      },
      "es": {
        "title": "Las acciones con los mayores movimientos fuera de horario: Workday, Cava, Lucid Group y más",
        "summary": "Las acciones incluyendo Workday, Cava y Lucid Group registraron los mayores movimientos durante las horas de negociación extendida. La actividad fuera de horario refleja las respuestas de los inversores a los reportes de ganancias y desarrollos del mercado."
      }
    }
  },
  {
    "title": "Jamie Dimon says AI is already reshaping JPMorgan Chase's workforce as bank plans 'huge redeployment’",
    "slug": "jamie-dimon-ai-reshaping-jpmorgan-workforce",
    "url": "https://www.cnbc.com/2026/02/24/jpm-ceo-jamie-dimon-ai-reshaping-workforce-redeployment.html",
    "source": "CNBC",
    "date": "2026-02-24T21:33:36.000Z",
    "summary": "JPMorgan Chase CEO Jamie Dimon says AI is already transforming the bank's workforce as it plans major employee redeployment. The bank's nearly $20 billion annual tech budget funds an ambitious AI strategy to reshape operations.",
    "content": "JPMorgan, the world's biggest bank by market cap, has the industry's largest annual tech budget at nearly $20 billion, and it has outlined an ambitious AI plan.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "杰米·迪蒙表示AI已在重塑摩根大通员工队伍，银行计划\"大规模调配\"",
        "summary": "摩根大通CEO杰米·迪蒙表示，AI已在改变银行的员工队伍，同时银行计划进行大规模员工调配。该银行近200亿美元的年度科技预算资助了雄心勃勃的AI战略，以重塑运营。"
      },
      "ja": {
        "title": "ジェイミー・ディモンがAIがJPモルガン・チェースの従業員を既に再形成していると述べ、銀行が\"大規模な人員配置\"を計画",
        "summary": "JPモルガン・チェースのジェイミー・ディモンCEOは、AIが既に銀行の従業員の変革を起こしており、大規模な人員配置を計画していると述べています。銀行のほぼ200億ドルの年間技術予算は、業務を再形成するための野心的なAI戦略を支援しています。"
      },
      "ko": {
        "title": "제이미 다이먼 CEO가 AI가 이미 JPMorgan Chase의 직원 구조를 재편하고 있으며 은행이 \"대규모 재배치\"를 계획 중이라고 말함",
        "summary": "JPMorgan Chase CEO 제이미 다이먼은 AI가 이미 은행의 직원 구조를 변화시키고 있으며 대규모 직원 재배치를 계획 중이라고 말했습니다. 은행의 연간 약 200억 달러 기술 예산은 운영을 재편성하기 위한 야심찬 AI 전략을 지원합니다."
      },
      "fr": {
        "title": "Jamie Dimon déclare que l'IA remodèle déjà la main-d'œuvre de JPMorgan Chase alors que la banque prévoit un « redéploiement majeur »",
        "summary": "Le PDG de JPMorgan Chase, Jamie Dimon, déclare que l'IA transforme déjà la main-d'œuvre de la banque alors qu'elle prévoit un redéploiement majeur des employés. Le budget technologique annuel de près de 20 milliards de dollars de la banque finance une stratégie d'IA ambitieuse pour remodeler les opérations."
      },
      "de": {
        "title": "Jamie Dimon sagt, dass KI bereits JPMorgan Chase' Belegschaft umgestaltet, während die Bank eine \"massive Umstrukturierung\" plant",
        "summary": "Der CEO von JPMorgan Chase, Jamie Dimon, sagt, dass KI bereits die Belegschaft der Bank transformiert, da sie eine massive Neustrukturierung plant. Das jährliche Technologiebudget der Bank von fast 20 Milliarden Dollar finanziert eine ehrgeizige KI-Strategie zur Umgestaltung der Betriebsabläufe."
      },
      "es": {
        "title": "Jamie Dimon dice que la IA ya está remodelando la fuerza laboral de JPMorgan Chase mientras el banco planea una \"redisposición masiva\"",
        "summary": "El CEO de JPMorgan Chase, Jamie Dimon, dice que la IA ya está transformando la fuerza laboral del banco mientras planea una redisposición masiva de empleados. El presupuesto tecnológico anual de casi 20 mil millones de dólares del banco financia una estrategia de IA ambiciosa para remodelar las operaciones."
      }
    }
  },
  {
    "title": "Anthropic faces Friday deadline in Defense AI clash with Hegseth",
    "slug": "anthropic-friday-deadline-defense-ai-hegseth",
    "url": "https://www.cnbc.com/2026/02/24/anthropic-ai-hegseth-spying-defense.html",
    "source": "CNBC",
    "date": "2026-02-24T21:18:14.000Z",
    "summary": "Anthropic faces a Friday deadline in a Defense AI dispute following xAI becoming the second company cleared to deploy models on classified networks. The situation signals shifting dynamics in the defense AI contracting landscape.",
    "content": "Until this week, Anthropic was the only AI company cleared to deploy its models on classified networks. Elon Musk's xAI is now the second.",
    "category": "economic"
  },
  {
    "title": "BlackRock’s Rick Rieder is locking in attractive yields in this corner of the bond market before the opportunity slips away",
    "slug": "blackrock-rick-rieder-bond-market-yields",
    "url": "https://www.cnbc.com/2026/02/24/blackrocks-rick-rieder-is-locking-in-attractive-yields-in-this-corner-of-the-bond-market.html",
    "source": "CNBC",
    "date": "2026-02-24T20:28:32.000Z",
    "summary": "BlackRock's Rick Rieder is locking in attractive yields in select bond market segments before the opportunity disappears. He warns investors that current favorable conditions may not persist as market conditions shift.",
    "content": "BlackRock's Rick Rieder tells CNBC where he is investing for income right now and why he thinks the opportunity may not last.",
    "category": "economic"
  },
  {
    "title": "Google apologises for Baftas alert to 'see more' on racial slur",
    "slug": "google-apologies-baftas-alert-racial-slur",
    "url": "https://www.bbc.com/news/articles/c3v730qwwzwo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-24T20:24:26.000Z",
    "summary": "Google apologized for sending a news alert containing a reference to a racial slur during BAFTA coverage. The company stated the alert resulted from a system error that should not have occurred.",
    "content": "Google said the news alert was an error that should not have happened.",
    "category": "economic"
  },
  {
    "title": "Why AMD's megadeal with Meta shows Nvidia is still the best game in town",
    "slug": "amd-megadeal-meta-nvidia-best-game",
    "url": "https://www.cnbc.com/2026/02/24/why-amds-megadeal-with-meta-shows-nvidia-is-still-the-best-game-in-town.html",
    "source": "CNBC",
    "date": "2026-02-24T20:22:29.000Z",
    "summary": "AMD's decision to give up equity in deals with Meta and OpenAI underscores Nvidia's continued dominance in the AI chip market. The arrangement highlights Nvidia's strong negotiating position despite AMD's competitive push.",
    "content": "AMD gave up equity in its deals with Meta and OpenAI. Nvidia shareholders should be glad it doesn't need to go there.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "为何AMD与Meta的巨额交易表明Nvidia仍是芯片领域的佼佼者",
        "summary": "AMD放弃与Meta和OpenAI的股权交易决定突显了Nvidia在AI芯片市场的持续主导地位。这一安排凸显了Nvidia强大的谈判能力,尽管AMD的竞争力不断提升。"
      },
      "ja": {
        "title": "AMDとMetaの大型取引がNvidiaが依然として最高のプレイヤーであることを示す理由",
        "summary": "AMDがMetaとOpenAIとのディール株式放棄の決定は、AIチップ市場におけるNvidiaの継続的な支配力を示しています。この取り決めはAMDの競争圧力にもかかわらず、Nvidiaの強力な交渉力を強調しています。"
      },
      "ko": {
        "title": "AMD와 Meta의 대규모 거래가 Nvidia가 여전히 최고라는 것을 보여주는 이유",
        "summary": "AMD가 Meta 및 OpenAI와의 거래에서 주식 포기를 결정한 것은 AI 칩 시장에서 Nvidia의 계속된 지배력을 강조합니다. 이 배치는 AMD의 경쟁적 진출에도 불구하고 Nvidia의 강한 협상력을 나타냅니다."
      },
      "fr": {
        "title": "Pourquoi le mégadeal d'AMD avec Meta montre que Nvidia reste le meilleur jeu en ville",
        "summary": "La décision d'AMD d'abandonner les capitaux propres dans les transactions avec Meta et OpenAI souligne la domination continue de Nvidia sur le marché des puces IA. L'arrangement met en évidence la position de négociation forte de Nvidia malgré la poussée compétitive d'AMD."
      },
      "de": {
        "title": "Warum AMDs Megadeal mit Meta zeigt, dass Nvidia immer noch das beste Spiel in der Stadt ist",
        "summary": "AMDs Entscheidung, auf Eigenkapital bei Deals mit Meta und OpenAI zu verzichten, unterstreicht Nvidias anhaltende Dominanz auf dem KI-Chip-Markt. Die Vereinbarung hebt Nvidias starke Verhandlungsposition trotz AMDs Wettbewerbsdruck hervor."
      },
      "es": {
        "title": "Por qué el megaacuerdo de AMD con Meta muestra que Nvidia sigue siendo el mejor juego de la ciudad",
        "summary": "La decisión de AMD de renunciar al capital en tratos con Meta y OpenAI subraya el dominio continuo de Nvidia en el mercado de chips de IA. El acuerdo destaca la fuerte posición negociadora de Nvidia a pesar del impulso competitivo de AMD."
      }
    }
  },
  {
    "title": "From idea to launch: How to write a business plan and form your company",
    "slug": "how-to-write-business-plan-form-company",
    "url": "https://www.cnbc.com/select/how-to-write-a-business-plan-and-form-your-company/",
    "source": "CNBC",
    "date": "2026-02-24T20:10:11.000Z",
    "summary": "This guide explains how entrepreneurs can develop a business plan and establish their company from concept to launch. It compares traditional business planning with lean startup methodologies for different business scenarios.",
    "content": "Entrepreneurs can choose between creating a traditional business plan or a lean startup plan.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "从创意到上线:如何制定商业计划及创办公司",
        "summary": "本指南解释了创业者如何从概念到推出阶段开发商业计划并建立公司。它比较了传统商业计划与精益创业方法论在不同业务场景中的应用。"
      },
      "ja": {
        "title": "アイデアから立ち上げへ:ビジネスプランを作成し、会社を設立する方法",
        "summary": "このガイドは、起業家がコンセプトから立ち上げまでビジネスプランを開発し、会社を確立する方法を説明しています。従来のビジネスプランニングとリーン・スタートアップ方法論を異なるビジネスシナリオで比較しています。"
      },
      "ko": {
        "title": "아이디어에서 출시까지: 사업 계획을 작성하고 회사를 설립하는 방법",
        "summary": "이 가이드는 창업가가 개념에서 출시까지 사업 계획을 개발하고 회사를 설립하는 방법을 설명합니다. 다양한 비즈니스 시나리오에서 전통적인 사업 계획과 린 스타트업 방법론을 비교합니다."
      },
      "fr": {
        "title": "De l'idée au lancement: Comment rédiger un business plan et créer votre entreprise",
        "summary": "Ce guide explique comment les entrepreneurs peuvent développer un business plan et établir leur entreprise du concept au lancement. Il compare la planification commerciale traditionnelle avec les méthodologies lean startup pour différents scénarios commerciaux."
      },
      "de": {
        "title": "Von der Idee zur Markteinführung: Wie Sie einen Geschäftsplan schreiben und Ihr Unternehmen gründen",
        "summary": "Diese Anleitung erklärt, wie Unternehmer einen Geschäftsplan entwickeln und ihr Unternehmen vom Konzept bis zur Markteinführung aufbauen können. Sie vergleicht traditionelle Geschäftsplanung mit Lean-Startup-Methoden für verschiedene Geschäftsszenarien."
      },
      "es": {
        "title": "De la idea al lanzamiento: Cómo escribir un plan de negocios y formar su empresa",
        "summary": "Esta guía explica cómo los emprendedores pueden desarrollar un plan de negocios y establecer su empresa desde la concepción hasta el lanzamiento. Compara la planificación empresarial tradicional con metodologías lean startup para diferentes escenarios empresariales."
      }
    }
  },
  {
    "title": "Everything you need to know about the new school uniform law",
    "slug": "everything-new-school-uniform-law",
    "url": "https://www.bbc.com/news/videos/c5ygpz9yr3no?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-24T19:09:54.000Z",
    "summary": "The UK Department of Education has issued new guidelines for school uniforms following recent law changes. The guidance sets requirements and expectations for educational institutions on uniform policies.",
    "content": "New guidelines have been issued by the Department of Education in the wake of law changes on uniforms.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "关于新学校制服法你需要了解的一切",
        "summary": "英国教育部针对最近的法律变化发布了新的校服指南。该指南规定了教育机构对制服政策的要求和期望。"
      },
      "ja": {
        "title": "新しい学校制服法について知っておくべきことすべて",
        "summary": "英国教育省は、最近の法律の変更に基づいて学生制服の新しいガイドラインを発行しました。このガイダンスは、教育機関が制服政策に関して設定すべき要件と期待を定めています。"
      },
      "ko": {
        "title": "새로운 학교 교복법에 대해 알아야 할 모든 것",
        "summary": "영국 교육부는 최근 법률 변경에 따라 학교 교복에 대한 새로운 지침을 발표했습니다. 이 지침은 교육 기관이 교복 정책에 대해 설정해야 할 요구사항과 기대사항을 정합니다."
      },
      "fr": {
        "title": "Tout ce que vous devez savoir sur la nouvelle loi uniforme scolaire",
        "summary": "Le Département de l'Éducation du Royaume-Uni a publié de nouvelles directives pour les uniformes scolaires suite aux modifications légales récentes. Le guide établit les exigences et attentes des établissements d'enseignement en matière de politiques d'uniformes."
      },
      "de": {
        "title": "Alles, was Sie über das neue Schuluniformgesetz wissen müssen",
        "summary": "Das britische Bildungsministerium hat neue Richtlinien für Schuluniformen nach jüngsten Gesetzesänderungen herausgegeben. Die Richtlinie legt Anforderungen und Erwartungen für Bildungseinrichtungen bezüglich Uniformrichtlinien fest."
      },
      "es": {
        "title": "Todo lo que necesita saber sobre la nueva ley de uniforme escolar",
        "summary": "El Departamento de Educación del Reino Unido ha emitido nuevas directrices para uniformes escolares siguiendo cambios legales recientes. La guía establece requisitos y expectativas para instituciones educativas sobre políticas de uniformes."
      }
    }
  },
  {
    "title": "Warner Bros. Discovery says Paramount made higher bid, board will weigh offer against Netflix deal",
    "slug": "warner-bros-discovery-says-paramount-made-higher-bid-board-will-weigh-offer-agai",
    "url": "https://www.cnbc.com/2026/02/24/warner-bros-discovery-paramount-higher-bid-netflix.html",
    "source": "CNBC",
    "date": "2026-02-24T18:22:03.000Z",
    "summary": "If WBD deems the new Paramount offer superior, Netflix will have four days to improve its previously agreed-upon bid.",
    "content": "If WBD deems the new Paramount offer superior, Netflix will have four days to improve its previously agreed-upon bid.",
    "category": "economic"
  },
  {
    "title": "Microsoft and SpaceX's Starlink partner on global community internet effort",
    "slug": "microsoft-and-spacex-s-starlink-partner-on-global-community-internet-effort",
    "url": "https://www.cnbc.com/2026/02/24/microsoft-spacex-starlink-global-internet.html",
    "source": "CNBC",
    "date": "2026-02-24T18:21:29.000Z",
    "summary": "The collaboration will help boost demand for Elon Musk's space company, which has contracts with the Defense Department and NASA.",
    "content": "The collaboration will help boost demand for Elon Musk's space company, which has contracts with the Defense Department and NASA.",
    "category": "economic"
  },
  {
    "title": "Savannah Guthrie offers $1 million reward for missing mother Nancy Guthrie",
    "slug": "savannah-guthrie-offers-1-million-reward-for-missing-mother-nancy-guthrie",
    "url": "https://www.cnbc.com/2026/02/24/savannah-guthrie-mother-reward-instagram.html",
    "source": "CNBC",
    "date": "2026-02-24T18:18:35.000Z",
    "summary": "Nancy Guthrie, whose daughter Savannah Guthrie is a co-anchor of the \"Today\" show on NBC, was last seen entering her Arizona home on Jan. 31.",
    "content": "Nancy Guthrie, whose daughter Savannah Guthrie is a co-anchor of the \"Today\" show on NBC, was last seen entering her Arizona home on Jan. 31.",
    "category": "economic"
  },
  {
    "title": "The violent software sell-off pauses. Wall Street says bet on these stocks to bounce",
    "slug": "the-violent-software-sell-off-pauses-wall-street-says-bet-on-these-stocks-to-bou",
    "url": "https://www.cnbc.com/2026/02/24/the-violent-software-sell-off-pauses-wall-street-says-bet-on-these-stocks-to-bounce.html",
    "source": "CNBC",
    "date": "2026-02-24T18:13:02.000Z",
    "summary": "Some analysts believe the sell-off is overdone in companies across cybersecurity and traditional software, opening up buying opportunities.",
    "content": "Some analysts believe the sell-off is overdone in companies across cybersecurity and traditional software, opening up buying opportunities.",
    "category": "economic"
  },
  {
    "title": "Stocks making the biggest moves midday: IBM, AMD, Dillard's, Novo Nordisk, Keysight Technologies & more",
    "slug": "stocks-making-the-biggest-moves-midday-ibm-amd-dillard-s-novo-nordisk-keysight-t",
    "url": "https://www.cnbc.com/2026/02/24/stocks-making-the-biggest-moves-midday-ibm-amd-dds-nvo-more.html",
    "source": "CNBC",
    "date": "2026-02-24T18:11:54.000Z",
    "summary": "These are the stocks posting the largest moves in midday trading.",
    "content": "These are the stocks posting the largest moves in midday trading.",
    "category": "economic"
  },
  {
    "title": "Spirit Airlines is betting on this air-travel trend as it prepares to emerge from bankruptcy",
    "slug": "spirit-airlines-is-betting-on-this-air-travel-trend-as-it-prepares-to-emerge-fro",
    "url": "https://www.marketwatch.com/story/spirit-airlines-is-betting-on-this-air-travel-trend-as-it-prepares-to-emerge-from-bankruptcy-dcfc8543?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-24T17:58:00.000Z",
    "summary": "Spirit Airlines has reached a deal with its creditors and expects to emerge from bankruptcy as a slimmer airline — and one not solely focusing on budget air travelers.",
    "content": "Spirit Airlines has reached a deal with its creditors and expects to emerge from bankruptcy as a slimmer airline — and one not solely focusing on budget air travelers.",
    "category": "economic"
  },
  {
    "title": "Financial stocks are off to their worst yearly start in a decade. How to spot value.",
    "slug": "financial-stocks-are-off-to-their-worst-yearly-start-in-a-decade-how-to-spot-val",
    "url": "https://www.marketwatch.com/story/financial-stocks-are-off-to-their-worst-yearly-start-in-a-decade-how-to-spot-value-9a0b5faf?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-24T17:54:00.000Z",
    "summary": "A screen of the S&P 500 financial sector highlights companies with high returns on equity that are trading at low P/E valuations.",
    "content": "A screen of the S&P 500 financial sector highlights companies with high returns on equity that are trading at low P/E valuations.",
    "category": "economic"
  },
  {
    "title": "Bitcoin mining is no longer profitable after crypto's latest downward turn, analyst says",
    "slug": "bitcoin-mining-is-no-longer-profitable-after-crypto-s-latest-downward-turn-analy",
    "url": "https://www.cnbc.com/2026/02/24/bitcoin-mining-is-no-longer-profitable-after-cryptos-latest-downward-turn.html",
    "source": "CNBC",
    "date": "2026-02-24T17:43:40.000Z",
    "summary": "Bitcoin briefly sank below $63,000 on Tuesday, dragging down its miners alongside it.",
    "content": "Bitcoin briefly sank below $63,000 on Tuesday, dragging down its miners alongside it.",
    "category": "economic"
  },
  {
    "title": "Trump's new tariff comes into effect at lower than expected rate",
    "slug": "trump-s-new-tariff-comes-into-effect-at-lower-than-expected-rate",
    "url": "https://www.bbc.com/news/articles/cd6zn3ly22yo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-24T17:35:52.000Z",
    "summary": "The global levy comes in at 10%, lower than the rate the president had threatened at the weekend.",
    "content": "The global levy comes in at 10%, lower than the rate the president had threatened at the weekend.",
    "category": "economic"
  },
  {
    "title": "Biggest risk to the economy now? Goldman says it's a stock market correction",
    "slug": "biggest-risk-to-the-economy-now-goldman-says-it-s-a-stock-market-correction",
    "url": "https://www.cnbc.com/2026/02/24/biggest-risk-to-the-economy-now-goldman-says-its-a-stock-market-correction.html",
    "source": "CNBC",
    "date": "2026-02-24T17:26:52.000Z",
    "summary": "U.S. economist Pierfrancesco Mei worries that a 10% stock market pullback in the first half could cut GDP growth by half a percentage point, in one scenario.",
    "content": "U.S. economist Pierfrancesco Mei worries that a 10% stock market pullback in the first half could cut GDP growth by half a percentage point, in one scenario.",
    "category": "economic"
  },
  {
    "title": "Software stocks rebound as Anthropic announces new partnerships",
    "slug": "software-stocks-rebound-as-anthropic-announces-new-partnerships",
    "url": "https://www.cnbc.com/2026/02/24/software-stocks-anthropic-ai.html",
    "source": "CNBC",
    "date": "2026-02-24T17:23:56.000Z",
    "summary": "Cybersecurity and software names have sold off heavily in recent weeks as investors fretted about potential disruption from artificial intelligence.",
    "content": "Cybersecurity and software names have sold off heavily in recent weeks as investors fretted about potential disruption from artificial intelligence.",
    "category": "economic"
  },
  {
    "title": "Classic 'TACO'? Investors shrug off Trump's latest tariff announcement",
    "slug": "classic-taco-investors-shrug-off-trump-s-latest-tariff-announcement",
    "url": "https://www.cnbc.com/2026/02/24/trump-tariff-rates-global-investors-taco-trade.html",
    "source": "CNBC",
    "date": "2026-02-24T17:23:01.000Z",
    "summary": "Global equity markets were muted as Trump’s latest tariffs came into effect at 10%, a lower-than-expected rate.",
    "content": "Global equity markets were muted as Trump’s latest tariffs came into effect at 10%, a lower-than-expected rate.",
    "category": "economic"
  },
  {
    "title": "Jim Cramer says you 'have to own' this retail winner that reports earnings this week",
    "slug": "jim-cramer-says-you-have-to-own-this-retail-winner-that-reports-earnings-this-we",
    "url": "https://www.cnbc.com/2026/02/24/jim-cramer-says-you-have-to-own-this-retail-winner-that-reports-earnings-this-week.html",
    "source": "CNBC",
    "date": "2026-02-24T17:15:28.000Z",
    "summary": "The Investing Club holds its \"Morning Meeting\" every weekday at 10:20 a.m. ET.",
    "content": "The Investing Club holds its \"Morning Meeting\" every weekday at 10:20 a.m. ET.",
    "category": "economic"
  },
  {
    "title": "Salesforce’s stock has been hit hard by AI fears. Can anything in its earnings report turn things around?",
    "slug": "salesforce-s-stock-has-been-hit-hard-by-ai-fears-can-anything-in-its-earnings-re",
    "url": "https://www.marketwatch.com/story/salesforces-stock-has-been-hit-hard-by-ai-fears-can-anything-in-its-earnings-report-turn-things-around-dfc5ad45?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-24T17:10:00.000Z",
    "summary": "Salesforce will try to flip the AI narrative with its  earnings report Wednesday afternoon, but some on Wall Street think that might be a challenge.",
    "content": "Salesforce will try to flip the AI narrative with its  earnings report Wednesday afternoon, but some on Wall Street think that might be a challenge.",
    "category": "economic"
  },
  {
    "title": "Why Sandisk’s split from Western Digital has been such a huge win for investors",
    "slug": "why-sandisk-s-split-from-western-digital-has-been-such-a-huge-win-for-investors",
    "url": "https://www.marketwatch.com/story/why-sandisks-split-from-western-digital-has-been-such-a-huge-win-for-investors-27f82e4f?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-24T17:04:00.000Z",
    "summary": "It’s been a year since the companies broke apart and let Wall Street better assess the AI-fueled demand for both businesses",
    "content": "It’s been a year since the companies broke apart and let Wall Street better assess the AI-fueled demand for both businesses",
    "category": "economic"
  },
  {
    "title": "Trump 401(k)? The president could announce retirement plans for people whose employers don’t offer them.",
    "slug": "trump-401-k-the-president-could-announce-retirement-plans-for-people-whose-emplo",
    "url": "https://www.marketwatch.com/story/trump-401-k-the-president-could-announce-retirement-plans-for-people-whose-employers-dont-offer-them-0ad666ed?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-24T16:40:00.000Z",
    "summary": "President Donald Trump could use his State of the Union address on Tuesday night to unveil the plan.",
    "content": "President Donald Trump could use his State of the Union address on Tuesday night to unveil the plan.",
    "category": "economic"
  },
  {
    "title": "More than 80% say affordability has not improved under Trump, exclusive YouGov-MarketWatch poll finds",
    "slug": "more-than-80-say-affordability-has-not-improved-under-trump-exclusive-yougov-mar",
    "url": "https://www.marketwatch.com/story/more-than-80-say-affordability-has-not-improved-under-trump-exclusive-yougov-marketwatch-poll-finds-ca489b15?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-24T16:36:00.000Z",
    "summary": "Trump will have the opportunity to tout his record on cost-of-living issues during Tuesday’s State of the Union address.",
    "content": "Trump will have the opportunity to tout his record on cost-of-living issues during Tuesday’s State of the Union address.",
    "category": "economic"
  },
  {
    "title": "Epstein files: DOJ may have withheld FBI interviews with Trump accuser, Rep. Garcia says",
    "slug": "epstein-files-doj-may-have-withheld-fbi-interviews-with-trump-accuser-rep-garcia",
    "url": "https://www.cnbc.com/2026/02/24/epstein-trump-doj-garcia.html",
    "source": "CNBC",
    "date": "2026-02-24T16:28:18.000Z",
    "summary": "President Donald Trump last week said the files on Jeffrey Epstein released by the Department of Justice had \"totally exonerated\" him.",
    "content": "President Donald Trump last week said the files on Jeffrey Epstein released by the Department of Justice had \"totally exonerated\" him.",
    "category": "economic"
  },
  {
    "title": "What does the new law on school uniforms mean in Northern Ireland?",
    "slug": "what-does-the-new-law-on-school-uniforms-mean-in-northern-ireland",
    "url": "https://www.bbc.com/news/articles/c3ewzdn178ko?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-24T16:21:48.000Z",
    "summary": "BBC News NI having been looking at they key aspects of the new guidelines.",
    "content": "BBC News NI having been looking at they key aspects of the new guidelines.",
    "category": "economic"
  },
  {
    "title": "Home Depot tops earnings estimates for the first time in a year as demand for projects remains muted",
    "slug": "home-depot-tops-earnings-estimates-for-the-first-time-in-a-year-as-demand-for-pr",
    "url": "https://www.cnbc.com/2026/02/24/home-depot-hd-q4-2025-earnings-.html",
    "source": "CNBC",
    "date": "2026-02-24T16:13:42.000Z",
    "summary": "Home Depot beat fiscal fourth-quarter earnings expectations after missing estimates the prior three quarters.",
    "content": "Home Depot beat fiscal fourth-quarter earnings expectations after missing estimates the prior three quarters.",
    "category": "economic"
  },
  {
    "title": "Spirit Airlines plans to slash flights, fleet in bid to emerge from bankruptcy as early as spring",
    "slug": "spirit-airlines-plans-to-slash-flights-fleet-in-bid-to-emerge-from-bankruptcy-as",
    "url": "https://www.cnbc.com/2026/02/24/spirit-airlines-bankruptcy-flights.html",
    "source": "CNBC",
    "date": "2026-02-24T16:13:07.000Z",
    "summary": "Spirit Airlines said it has reached an agreement with lenders to emerge from bankruptcy by late spring or early summer.",
    "content": "Spirit Airlines said it has reached an agreement with lenders to emerge from bankruptcy by late spring or early summer.",
    "category": "economic"
  },
  {
    "title": "Trump to deliver State of the Union address as voters sour on his economy",
    "slug": "trump-to-deliver-state-of-the-union-address-as-voters-sour-on-his-economy",
    "url": "https://www.cnbc.com/2026/02/24/sotu-trump-to-deliver-address-as-voters-sour-on-his-economy.html",
    "source": "CNBC",
    "date": "2026-02-24T16:12:51.000Z",
    "summary": "Dem Gov. Abigail Spanberger of Virginia will deliver the official rebuttal for Democrats after romping to victory in 2025 on an affordability-focused agenda.",
    "content": "Dem Gov. Abigail Spanberger of Virginia will deliver the official rebuttal for Democrats after romping to victory in 2025 on an affordability-focused agenda.",
    "category": "economic"
  },
  {
    "title": "This AI derivative play is one of the hottest stocks of the year. Goldman sees even more to go",
    "slug": "this-ai-derivative-play-is-one-of-the-hottest-stocks-of-the-year-goldman-sees-ev",
    "url": "https://www.cnbc.com/2026/02/24/this-ai-play-is-one-of-the-hottest-stocks-goldman-sees-more-to-go.html",
    "source": "CNBC",
    "date": "2026-02-24T16:03:22.000Z",
    "summary": "The bank believes gave a boost to the company following its earnings report that delivered strong guidance for 2026.",
    "content": "The bank believes gave a boost to the company following its earnings report that delivered strong guidance for 2026.",
    "category": "economic"
  },
  {
    "title": "‘I found out too late’: My stepmother cheated me out of $500K from my father’s estate. What can I do?",
    "slug": "i-found-out-too-late-my-stepmother-cheated-me-out-of-500k-from-my-father-s-estat",
    "url": "https://www.marketwatch.com/story/i-found-out-too-late-my-stepmother-cheated-me-out-of-500k-from-my-fathers-estate-what-can-i-do-97f387c6?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-24T16:00:00.000Z",
    "summary": "“Within a week or two after the deadline to contest the will expired, my stepmother sent me an email stating she would not share anything.”",
    "content": "“Within a week or two after the deadline to contest the will expired, my stepmother sent me an email stating she would not share anything.”",
    "category": "economic"
  },
  {
    "title": "AI will lead to mass unemployment, a new paper says — but other researchers are skeptical",
    "slug": "ai-will-lead-to-mass-unemployment-a-new-paper-says-but-other-researchers-are-ske",
    "url": "https://www.marketwatch.com/story/ai-will-lead-to-mass-unemployment-a-new-paper-says-but-other-researchers-are-skeptical-982694d1?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-24T15:59:00.000Z",
    "summary": "The Citrini Research paper imagines a scenario in which widespread AI adoption leads to disruption and societal chaos. Evercore called it “thought-provoking” but “implausible.”",
    "content": "The Citrini Research paper imagines a scenario in which widespread AI adoption leads to disruption and societal chaos. Evercore called it “thought-provoking” but “implausible.”",
    "category": "economic"
  },
  {
    "title": "Fed's Goolsbee calls for a hold on cuts as current rate of inflation is 'not good enough'",
    "slug": "fed-s-goolsbee-calls-for-a-hold-on-cuts-as-current-rate-of-inflation-is-not-good",
    "url": "https://www.cnbc.com/2026/02/24/feds-goolsbee-calls-for-a-hold-on-cuts-as-current-rate-of-inflation-is-not-good-enough.html",
    "source": "CNBC",
    "date": "2026-02-24T15:58:03.000Z",
    "summary": "The Chicago Fed president said Tuesday that cuts aren't appropriate until there's more evidence that inflation is on its way down.",
    "content": "The Chicago Fed president said Tuesday that cuts aren't appropriate until there's more evidence that inflation is on its way down.",
    "category": "economic"
  },
  {
    "title": "AMD’s stock rockets as Meta deal serves as major validation point for investors",
    "slug": "amd-s-stock-rockets-as-meta-deal-serves-as-major-validation-point-for-investors",
    "url": "https://www.marketwatch.com/story/amds-stock-rockets-as-meta-deal-serves-as-major-validation-point-for-investors-fa247785?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-24T15:47:00.000Z",
    "summary": "Meta, looking to diversify beyond Nvidia, bets big on AMD chips, with a chance to invest in the company.",
    "content": "Meta, looking to diversify beyond Nvidia, bets big on AMD chips, with a chance to invest in the company.",
    "category": "economic"
  },
  {
    "title": "Consumers are more upbeat about the U.S. economy than previously thought",
    "slug": "consumers-are-more-upbeat-about-the-u-s-economy-than-previously-thought",
    "url": "https://www.marketwatch.com/story/consumers-are-more-upbeat-about-the-u-s-economy-that-previously-thought-a26a43cd?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-24T15:46:00.000Z",
    "summary": "Consumer spending has been the most important driver of economic growth over the past year.",
    "content": "Consumer spending has been the most important driver of economic growth over the past year.",
    "category": "economic"
  },
  {
    "title": "My grandpa retired happily at 70 with $750K after working as a missionary. I know where most Americans go wrong.",
    "slug": "my-grandpa-retired-happily-at-70-with-750k-after-working-as-a-missionary-i-know-",
    "url": "https://www.marketwatch.com/story/my-grandpa-retired-happy-at-70-with-750k-and-hes-doing-just-fine-i-know-where-most-americans-go-wrong-c5774943?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-24T15:44:00.000Z",
    "summary": "“You could even retire at 55 with $500,000 and be perfectly fine. Am I right?”",
    "content": "“You could even retire at 55 with $500,000 and be perfectly fine. Am I right?”",
    "category": "economic"
  },
  {
    "title": "Novo Nordisk to slash GLP-1 list prices by up to 50% in U.S. to cut costs for insured patients",
    "slug": "novo-nordisk-to-slash-glp-1-list-prices-by-up-to-50-in-u-s-to-cut-costs-for-insu",
    "url": "https://www.cnbc.com/2026/02/24/novo-nordisk-to-slash-wegovy-ozempic-us-list-prices-by-up-to-50percent.html",
    "source": "CNBC",
    "date": "2026-02-24T15:36:18.000Z",
    "summary": "The cuts aim to make the drugs more accessible to insured patients, particularly people with high-deductible health plans or co-insurance benefit designs.",
    "content": "The cuts aim to make the drugs more accessible to insured patients, particularly people with high-deductible health plans or co-insurance benefit designs.",
    "category": "economic"
  },
  {
    "title": "Data center expansion reaches an ‘inflection point’",
    "slug": "data-center-expansion-inflection-point",
    "url": "https://www.cnbc.com/2026/02/24/data-center-expansion-reaches-an-inflection-point.html",
    "source": "CNBC",
    "date": "2026-02-24T15:29:16.000Z",
    "summary": "Texas is set to overtake Virginia as the world's largest data center market, according to a new JLL report. The shift reflects accelerating global expansion of data infrastructure investment.",
    "content": "Texas is about to unseat Virginia as the world's largest data market, according to a new report from JLL.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "数据中心扩展达到'拐点'",
        "summary": "根据新的仲量联行报告，德克萨斯州将超越弗吉尼亚州成为全球最大的数据中心市场。这一转变反映了全球数据基础设施投资的加速扩张。"
      },
      "ja": {
        "title": "データセンター拡張が「転換点」に到達",
        "summary": "JLLの新しいレポートによると、テキサス州はバージニア州を上回り、世界最大のデータセンター市場になる予定です。この転換はデータインフラへの投資が世界的に加速していることを反映しています。"
      },
      "ko": {
        "title": "데이터 센터 확장이 '변곡점'에 도달",
        "summary": "새로운 JLL 보고서에 따르면 텍사스주가 버지니아주를 제치고 세계 최대 데이터 센터 시장이 될 예정입니다. 이 변화는 데이터 인프라 투자의 글로벌 확장 가속화를 반영합니다."
      },
      "fr": {
        "title": "L'expansion des centres de données atteint un point d'inflexion",
        "summary": "Selon un nouveau rapport de JLL, le Texas s'apprête à dépasser la Virginie en tant que plus grand marché de centres de données au monde. Ce changement reflète l'accélération de l'expansion mondiale des investissements en infrastructure de données."
      },
      "de": {
        "title": "Datenzentrum-Expansion erreicht einen Wendepunkt",
        "summary": "Nach einem neuen JLL-Bericht wird Texas Virginia als den weltgrößten Datenzentrumsmarkt übertrumpfen. Die Verschiebung spiegelt die beschleunigte globale Expansion von Datencenter-Investitionen wider."
      },
      "es": {
        "title": "La expansión del centro de datos alcanza un punto de inflexión",
        "summary": "Según un nuevo informe de JLL, Texas está por superar a Virginia como el mercado más grande de centros de datos del mundo. El cambio refleja la expansión global acelerada de la inversión en infraestructura de datos."
      }
    }
  },
  {
    "title": "Reddit fined £14m for 'concerning' child age check failings",
    "slug": "reddit-fined-14m-child-age-check-failings",
    "url": "https://www.bbc.com/news/articles/cwyx0xggepjo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-24T13:33:47.000Z",
    "summary": "The UK data protection watchdog fined Reddit £14 million for failing to adequately verify user ages, exposing children to harmful content. The penalty underscores regulatory concerns about platform safeguards for minors.",
    "content": "The UK's data watchdog said the failings meant children could be exposed to harmful material online.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Reddit因儿童年龄验证失败被罚1400万英镑",
        "summary": "英国数据保护监管机构因Reddit未能充分验证用户年龄而罚款1400万英镑，致儿童接触有害内容。该罚款凸显了监管机构对平台未成年人保护的担忧。"
      },
      "ja": {
        "title": "Reddit、子どもの年齢確認失敗で1400万ポンドの罰金",
        "summary": "英国のデータ保護監視機構は、ユーザーの年齢を適切に確認できなかったRedditに1400万ポンドの罰金を科しました。この罰金は、未成年者への有害なコンテンツ露出に対する規制当局の懸念を浮き彫りにします。"
      },
      "ko": {
        "title": "Reddit, 아동 나이 확인 실패로 1,400만 파운드 벌금",
        "summary": "영국 데이터 보호 감시기관이 사용자 나이 확인 실패로 Reddit에 1,400만 파운드 벌금을 부과했습니다. 이 처벌은 미성년자 보호 조치에 대한 규제 당국의 우려를 강조합니다."
      },
      "fr": {
        "title": "Reddit condamné à 14 millions de livres sterling pour défaillances de vérification d'âge pour enfants",
        "summary": "L'organisme britannique de protection des données a infligé une amende de 14 millions de livres sterling à Reddit pour n'avoir pas adéquatement vérifier l'âge des utilisateurs. Cette sanction souligne les préoccupations réglementaires concernant les mesures de protection des mineurs."
      },
      "de": {
        "title": "Reddit mit 14 Millionen Pfund Geldstrafe wegen Ausfällen bei der Altersüberprüfung von Kindern",
        "summary": "Die britische Datenschutzwächter verhängten eine Geldstrafe von 14 Millionen Pfund gegen Reddit, da das Unternehmen das Alter von Nutzern nicht angemessen überprüft hat. Die Geldstrafe unterstreicht behördliche Bedenken bezüglich der Schutzmaßnahmen für Minderjährige."
      },
      "es": {
        "title": "Reddit multado con £14 millones por deficiencias en la verificación de edad infantil",
        "summary": "El organismo británico de protección de datos impuso una multa de £14 millones a Reddit por no verificar adecuadamente la edad de los usuarios. La sanción subraya las preocupaciones normativas sobre las salvaguardas de plataformas para menores."
      }
    }
  },
  {
    "title": "Jamie Dimon says 'watch out’ as lofty asset prices add to economic risks: ‘My anxiety is high’",
    "slug": "jamie-dimon-watch-out-asset-prices-anxiety",
    "url": "https://www.cnbc.com/2026/02/23/jamie-dimon-says-watch-out-as-high-asset-prices-add-to-economic-risks-my-anxiety-is-high.html",
    "source": "CNBC",
    "date": "2026-02-24T13:17:41.000Z",
    "summary": "JPMorgan Chase CEO Jamie Dimon expressed heightened anxiety about inflated asset prices adding to economic risks amid lending competition. His concerns highlight worries about financial instability in the software lending sector.",
    "content": "JPMorgan Chase CEO Jamie Dimon is anxious as high asset levels collide with increased competition among lenders and jitters over loans to the software industry.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "杰米·戴蒙警告'要小心'高企资产价格增加经济风险：'我的焦虑很高'",
        "summary": "摩根大通CEO杰米·戴蒙对高企资产价格加剧经济风险表示高度焦虑。他的关切突出了对软件贷款部门金融不稳定性的担忧。"
      },
      "ja": {
        "title": "ジェイミー・ダイモン「注意が必要」と警告、高い資産価格が経済リスクを加える",
        "summary": "JPモルガン・チェースのCEOジェイミー・ダイモンは、貸出競争の中で高い資産価格が経済リスクを増加させることについて高い不安を表明しました。彼の懸念はソフトウェア・レンディング部門での金融不安定性についての懸念を強調しています。"
      },
      "ko": {
        "title": "제이미 다이먼 '주의하세요' 경고, 높은 자산 가격이 경제 위험 추가",
        "summary": "JPMorgan Chase의 CEO 제이미 다이먼은 대출 경쟁 속에서 인상된 자산 가격이 경제 위험을 가중시킨다며 높은 불안을 표했습니다. 그의 우려는 소프트웨어 대출 부문의 금융 불안정성에 대한 우려를 강조합니다."
      },
      "fr": {
        "title": "Jamie Dimon avertit « attention » alors que les prix des actifs élevés ajoutent aux risques économiques",
        "summary": "Le PDG de JPMorgan Chase, Jamie Dimon, a exprimé une anxiété accrue face aux prix des actifs gonflés ajoutant aux risques économiques au milieu de la concurrence des prêts. Ses préoccupations mettent en évidence les inquiétudes concernant l'instabilité financière dans le secteur des prêts logiciels."
      },
      "de": {
        "title": "Jamie Dimon warnt 'Achtung', da hohe Vermögenspreise zu wirtschaftlichen Risiken führen",
        "summary": "JPMorgan-Chase-CEO Jamie Dimon äußerte erhöhte Besorgnis über aufgeblähte Vermögenspreise, die inmitten des Kreditwettbewerbs zu wirtschaftlichen Risiken beitragen. Seine Bedenken unterstreichen Bedenken bezüglich finanzieller Instabilität im Softwaredarlehenssegment."
      },
      "es": {
        "title": "Jamie Dimon advierte 'cuidado' a medida que los precios de los activos elevados se suman a los riesgos económicos",
        "summary": "El CEO de JPMorgan Chase, Jamie Dimon, expresó mayor inquietud sobre los precios de los activos inflados sumándose a los riesgos económicos en medio de la competencia de préstamos. Sus preocupaciones destacan las inquietudes sobre la inestabilidad financiera en el sector de préstamos de software."
      }
    }
  },
  {
    "title": "Nvidia earnings report collides with Wall Street skepticism over AI spending",
    "slug": "nvidia-earnings-report-wall-street-skepticism-ai-spending",
    "url": "https://www.cnbc.com/2026/02/24/nvidia-earnings-collide-with-wall-street-skepticism-over-ai-spending.html",
    "source": "CNBC",
    "date": "2026-02-24T13:00:02.000Z",
    "summary": "Nvidia remains the only megacap tech stock with gains this year as investors grow skeptical about the pace and scale of AI infrastructure spending. The company's strong market position contrasts with broader caution about the sustainability of AI investment trends.",
    "content": "Nvidia is the only megacap tech stock to notch gains this year as investors have turned cautious on the hefty amounts of spending on AI infrastructure.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "英伟达财报与华尔街对AI支出的怀疑相碰撞",
        "summary": "英伟达仍是今年唯一实现涨幅的大型科技股，但投资者对AI基础设施支出的步伐和规模持怀疑态度。该公司强劲的市场地位与市场对AI投资趋势可持续性的更广泛谨慎态度形成对比。"
      },
      "fr": {
        "title": "Le rapport de résultats d'Nvidia se heurte au scepticisme de Wall Street sur les dépenses en IA",
        "summary": "Nvidia reste le seul mégacap technologique avec des gains cette année alors que les investisseurs deviennent skeptiques quant au rythme et à l'échelle des dépenses en infrastructure IA. La position de marché forte de l'entreprise contraste avec une prudence plus large concernant la durabilité des tendances d'investissement en IA."
      },
      "de": {
        "title": "Nvidias Ergebnisbericht prallt auf Wall-Street-Skepsis gegenüber KI-Ausgaben ab",
        "summary": "Nvidia bleibt der einzige Megacap-Technologiewert mit Gewinnen in diesem Jahr, während Investoren gegenüber dem Tempo und Ausmaß der KI-Infrastrukturausgaben skeptisch werden. Die starke Marktposition des Unternehmens kontrastiert mit einer breiteren Vorsicht bezüglich der Nachhaltigkeit von KI-Investitionstrends."
      },
      "es": {
        "title": "El informe de ganancias de Nvidia colisiona con el escepticismo de Wall Street sobre el gasto en IA",
        "summary": "Nvidia sigue siendo la única acción tecnológica de gran capitalización con ganancias este año, mientras los inversores se muestran escépticos sobre el ritmo y la escala del gasto en infraestructura de IA. La sólida posición de mercado de la empresa contrasta con la cautela más amplia sobre la sostenibilidad de las tendencias de inversión en IA."
      }
    }
  },
  {
    "title": "Reform vows to overhaul pension schemes for new local government workers",
    "slug": "reform-overhaul-pension-schemes-local-government",
    "url": "https://www.bbc.com/news/articles/c875edj1qeno?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-24T12:36:13.000Z",
    "summary": "The Reform party plans to discontinue more generous defined benefit pension schemes for newly hired local government workers if elected to office. The move aims to reform public sector pension obligations going forward.",
    "content": "Reform plans to end more generous defined benefit pension schemes for new local government workers if it wins office.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "改革党誓言改革新地方政府工作人员的养老金计划",
        "summary": "如果改革党当选执政，计划停止为新招聘的地方政府工作人员提供更慷慨的确定收益养老金计划。此举旨在改革今后的公共部门养老金义务。"
      },
      "fr": {
        "title": "La Réforme promet de révolutionner les régimes de retraite des nouveaux agents des collectivités locales",
        "summary": "Le parti Réforme prévoit de cesser les régimes de retraite à prestations définies plus généreux pour les nouveaux agents des collectivités locales s'il est élu. L'objectif est de réformer les obligations de retraite du secteur public à l'avenir."
      },
      "de": {
        "title": "Reform verspricht Überholung der Rentenpläne für neue Gemeindebeschäftigte",
        "summary": "Die Reformpartei plant, die großzügigeren Leistungsrentenpläne für neu eingestellte Kommunalbeschäftigte abzuschaffen, falls sie ins Amt gewählt wird. Die Maßnahme zielt darauf ab, die Rentenverpflichtungen des öffentlichen Sektors künftig zu reformieren."
      },
      "es": {
        "title": "Reforma promete revolucionar esquemas de pensiones para nuevos trabajadores de gobiernos locales",
        "summary": "El partido Reforma planea discontinuar esquemas de pensión de beneficio definido más generosos para trabajadores locales recién contratados si es elegido para ocupar un cargo. El movimiento tiene como objetivo reformar las obligaciones de pensión del sector público en el futuro."
      }
    }
  },
  {
    "title": "The ACA health coverage subsidy lapse hit 22 million people. Here are some of their stories",
    "slug": "aca-health-coverage-subsidy-lapse-22-million-people",
    "url": "https://www.cnbc.com/2026/02/24/aca-enhanced-subsidy-expiration-effects.html",
    "source": "CNBC",
    "date": "2026-02-24T12:00:01.000Z",
    "summary": "The expiration of enhanced subsidies for Affordable Care Act marketplace insurance has affected 22 million people, forcing families to make difficult financial decisions about healthcare coverage. The subsidy lapse has created significant hardship for middle-class Americans relying on marketplace plans.",
    "content": "The lapse of enhanced subsidies for Affordable Care Act marketplace insurance has forced families to make difficult financial choices.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "ACA健康保险补贴失效影响2200万人，这是他们的故事",
        "summary": "平价医疗法案市场健康保险增强补贴的到期影响了2200万人，迫使家庭在医疗保险覆盖上做出困难的财务决定。补贴失效为依赖市场计划的中产阶级美国人造成了重大困难。"
      },
      "fr": {
        "title": "L'expiration de la subvention d'assurance maladie de l'ACA a touché 22 millions de personnes. Voici quelques-unes de leurs histoires",
        "summary": "L'expiration des subventions renforcées pour l'assurance du marché de la Loi sur les soins abordables a affecté 22 millions de personnes, forçant les familles à prendre des décisions financières difficiles concernant la couverture médicale. L'expiration de la subvention a créé des difficultés considérables pour les Américains de la classe moyenne qui dépendent des plans du marché."
      },
      "de": {
        "title": "Der Ablauf der ACA-Gesundheitsversicherungssubvention betraf 22 Millionen Menschen. Hier sind einige ihrer Geschichten",
        "summary": "Das Auslaufen der erhöhten Subventionen für die Krankenversicherung des Affordable Care Act Marketplace hat 22 Millionen Menschen betroffen und Familien gezwungen, schwierige finanzielle Entscheidungen über die Krankenversicherung zu treffen. Das Auslaufen der Subventionen hat erhebliche Schwierigkeiten für Amerikaner der Mittelschicht verursacht, die auf Marktpläne angewiesen sind."
      },
      "es": {
        "title": "La expiración del subsidio de cobertura de salud del ACA afectó a 22 millones de personas. Aquí hay algunas de sus historias",
        "summary": "La expiración de los subsidios mejorados para el seguro del mercado de la Ley de Cuidados Asequibles ha afectado a 22 millones de personas, obligando a las familias a tomar decisiones financieras difíciles sobre la cobertura de salud. La expiración del subsidio ha creado dificultades significativas para los estadounidenses de clase media que dependen de planes de mercado."
      }
    }
  },
  {
    "title": "Federal Reserve Signals Potential Rate Cut in March",
    "slug": "federal-reserve-signals-potential-rate-cut-in-march",
    "url": "https://www.bbc.com/news/example/fed-rate-cut",
    "source": "BBC Business",
    "date": "2026-02-24T11:00:00Z",
    "summary": "The Federal Reserve has indicated it may cut interest rates at its March meeting, citing cooling inflation data. Markets rallied on the news, with the S&P 500 reaching new highs.",
    "content": "",
    "category": "economic"
  },
  {
    "title": "Chocolate kept in anti-theft boxes as shops warn it's being stolen to order",
    "slug": "chocolate-anti-theft-boxes-stolen-order",
    "url": "https://www.bbc.com/news/articles/ce3gqr7p0lqo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-24T10:39:39.000Z",
    "summary": "UK retailers and police forces report a surge in organized chocolate theft, with thieves systematically stealing and reselling products through illicit channels. Shops are now using anti-theft security measures to protect chocolate inventory from coordinated theft rings.",
    "content": "Retailers and police forces tell the BBC that thieves are targeting chocolate and selling it on.",
    "category": "economic"
  },
  {
    "title": "Clothing bank faces closure as donations fall",
    "slug": "clothing-bank-faces-closure-donations-fall",
    "url": "https://www.bbc.com/news/articles/c620x1j2j2no?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-24T06:29:27.000Z",
    "summary": "Clothing Coventry, a charitable organization operating since 2020, is at risk of closure due to declining donations and a £50,000 annual funding gap. The nonprofit provides vital clothing assistance but lacks sufficient financial support to continue operations.",
    "content": "Clothing Coventry has been operating since 2020, and needs £50,000 a year to keep the doors open.",
    "category": "economic"
  },
  {
    "title": "Number of workers on zero-hours contracts hits record high ahead of crackdown",
    "slug": "workers-zero-hours-contracts-record-high-crackdown",
    "url": "https://www.bbc.com/news/articles/czj1m7d4gxpo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-24T06:01:50.000Z",
    "summary": "The number of zero-hours contracts in the UK has surged by 181,000 since Labour's election, reaching a record high despite the government's stated intention to crack down on the practice. The increase raises concerns about worker protections and job security in the gig economy.",
    "content": "There has been a 181,000 increase in the number of zero-hours contracts since Labour was elected.",
    "category": "economic"
  },
  {
    "title": "Trump Organization unveils plan for 'Australia's tallest building'",
    "slug": "trump-organization-australia-tallest-building-gold-coast",
    "url": "https://www.bbc.com/news/articles/cyv9nj336v5o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-24T03:20:45.000Z",
    "summary": "The Trump Organization has announced plans to build a 335-metre tower on Queensland's Gold Coast that would surpass the Shard in London as Australia's tallest building. The development represents a major real estate project in Australia.",
    "content": "The tower will be built on Queensland's Gold Coast and be 335 metres high, taller than the Shard in London.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "特朗普集团公布澳大利亚最高建筑计划",
        "summary": "特朗普集团宣布计划在昆士兰州黄金海岸建造一座335米高的塔楼,将超越伦敦的碎片大厦,成为澳大利亚最高建筑。这项开发项目是澳大利亚的一个重大房地产项目。"
      },
      "fr": {
        "title": "Trump Organization dévoile le plan du plus haut bâtiment d'Australie",
        "summary": "La Trump Organization a annoncé des plans pour construire une tour de 335 mètres sur la Gold Coast du Queensland qui dépasserait le Shard à Londres en tant que plus haut bâtiment d'Australie. Le projet représente un important projet immobilier en Australie."
      },
      "de": {
        "title": "Trump Organisation enthüllt Pläne für Australiens höchstes Gebäude",
        "summary": "Die Trump Organization hat Pläne zum Bau eines 335 Meter hohen Turms an der Gold Coast von Queensland angekündigt, der den Shard in London übersteigen und Australiens höchstes Gebäude werden würde. Das Projekt stellt ein großes Immobilienprojekt in Australien dar."
      },
      "es": {
        "title": "Trump Organization presenta plan para el edificio más alto de Australia",
        "summary": "La Organización Trump ha anunciado planes para construir una torre de 335 metros en la Gold Coast de Queensland que superaría The Shard en Londres como el edificio más alto de Australia. El proyecto representa un importante proyecto de bienes raíces en Australia."
      }
    }
  },
  {
    "title": "FedEx sues for Trump tariff refund",
    "slug": "fedex-sues-trump-tariff-refund",
    "url": "https://www.bbc.com/news/articles/cly83r1njjro?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-24T01:18:27.000Z",
    "summary": "Following a US Supreme Court ruling that the president overstepped authority in imposing tariffs, FedEx is seeking a refund of tariff payments. The court decision has opened the door for companies across industries to pursue similar refund claims.",
    "content": "The US Supreme Court ruling that the US president overstepped when imposing levies paved the way for firms to seek a refund.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "联邦快递起诉特朗普关税退款",
        "summary": "美国最高法院裁定总统在征收关税时超越权限后,联邦快递正在寻求关税款项退款。法院的裁决为各个行业的公司追求类似退款赔偿开辟了道路。"
      },
      "fr": {
        "title": "FedEx poursuit pour remboursement de tarif Trump",
        "summary": "Suite à une décision de la Cour suprême américaine selon laquelle le président a outrepassé son autorité en imposant des tarifs, FedEx demande le remboursement des paiements de tarifs. La décision judiciaire a ouvert la porte aux entreprises de tous les secteurs pour demander des remboursements similaires."
      },
      "de": {
        "title": "FedEx verklagt Trump wegen Zollrückerstattung",
        "summary": "Nach einem Urteil des US-Obersten Gerichtshofs, dass der Präsident seine Befugnisse bei der Erhebung von Zöllen überschritten hat, verlangt FedEx eine Rückerstattung von Zahlungen. Die gerichtliche Entscheidung hat für Unternehmen in verschiedenen Branchen die Tür geöffnet, ähnliche Rückerstattungsansprüche geltend zu machen."
      },
      "es": {
        "title": "FedEx demanda reembolso de aranceles de Trump",
        "summary": "Tras una sentencia de la Corte Suprema de EE.UU. que determina que el presidente excedió su autoridad al imponer aranceles, FedEx está buscando un reembolso de los pagos arancelarios. La decisión del tribunal ha abierto la puerta para que empresas de diversos sectores persigan reclamos de reembolso similares."
      }
    }
  },
  {
    "title": "Orbital space race heats up in Arctic north",
    "slug": "orbital-space-race-arctic-north",
    "url": "https://www.bbc.com/news/articles/c4g0201rj8go?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-24T00:10:05.000Z",
    "summary": "Europe is expanding its orbital space launch capabilities by opening new facilities in the Arctic, though it still lags significantly behind the US and China. The development marks an effort to close Europe's gap in commercial space activities.",
    "content": "Europe lags far behind the US and China in orbital space launches, but new facilities are opening up.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "轨道空间竞赛在北极升温",
        "summary": "欧洲通过在北极开设新设施来扩展其轨道空间发射能力,但仍然远落后于美国和中国。这一发展标志着欧洲努力缩小在商业太空活动中的差距。"
      },
      "fr": {
        "title": "La course spatiale orbitale s'intensifie dans l'Arctique",
        "summary": "L'Europe élargit ses capacités de lancement spatial en orbite en ouvrant de nouvelles installations dans l'Arctique, mais elle est toujours considérablement en retard sur les États-Unis et la Chine. Le développement marque un effort pour combler le fossé de l'Europe dans les activités spatiales commerciales."
      },
      "de": {
        "title": "Orbitales Raumfahrtrennen heizt sich in der Arktis auf",
        "summary": "Europa erweitert seine Fähigkeiten im Bereich des Orbitalraumstarts durch die Eröffnung neuer Einrichtungen in der Arktis, liegt jedoch immer noch erheblich hinter den USA und China zurück. Die Entwicklung markiert eine Anstrengung, um Europas Rückstand bei kommerziellen Weltraumaktivitäten zu schließen."
      },
      "es": {
        "title": "La carrera espacial orbital se calienta en el Ártico norte",
        "summary": "Europa está expandiendo sus capacidades de lanzamiento espacial orbital abriendo nuevas instalaciones en el Ártico, aunque sigue significativamente rezagada respecto a EE.UU. y China. El desarrollo marca un esfuerzo por cerrar la brecha de Europa en actividades espaciales comerciales."
      }
    }
  },
  {
    "title": "TSMC Plans $40 Billion Investment in US Chip Manufacturing",
    "slug": "tsmc-plans-40-billion-investment-in-us-chip-manufacturing",
    "url": "https://www.cnbc.com/example/tsmc-us-investment",
    "source": "CNBC",
    "date": "2026-02-23T19:00:00Z",
    "summary": "Taiwan Semiconductor Manufacturing Company announces a massive expansion of its US operations, with new facilities planned in Arizona and Ohio. The investment is expected to create 10,000 jobs.",
    "content": "",
    "category": "economic"
  },
  {
    "title": "Oil Prices Drop Below $60 as OPEC+ Increases Output",
    "slug": "oil-prices-drop-below-60-as-opec-plus-increases-output",
    "url": "https://www.marketwatch.com/example/oil-prices",
    "source": "MarketWatch",
    "date": "2026-02-23T15:00:00Z",
    "summary": "Crude oil prices fell sharply after OPEC+ agreed to gradually increase production starting in April. Analysts expect continued downward pressure on energy costs through mid-2026.",
    "content": "",
    "category": "economic"
  }
]