[
  {
    "title": "Flights cancelled and new travel warnings issued after Iran strikes",
    "slug": "flights-cancelled-travel-warnings-iran-strikes",
    "url": "https://www.bbc.com/news/articles/c0rjpr575g9o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-03-01T11:52:57.000Z",
    "summary": "Major airlines including BA and Virgin Atlantic have cancelled flights to the Middle East following Iran strikes. New travel warnings have been issued in response to escalating regional tensions.",
    "content": "BA and Virgin Atlantic are among major airlines to ground services to the Middle East in light of the attacks.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "伊朗袭击后航班取消和发布新的旅行警告",
        "summary": "包括英国航空和维珍大西洋在内的主要航空公司在伊朗袭击后已取消前往中东的航班。针对地区局势升级，已发布新的旅行警告。"
      },
      "fr": {
        "title": "Vols annulés et nouveaux avertissements aux voyageurs après les frappes iraniennes",
        "summary": "Les grandes compagnies aériennes, dont British Airways et Virgin Atlantic, ont annulé leurs vols vers le Moyen-Orient suite aux frappes iraniennes. De nouveaux avertissements aux voyageurs ont été émis en réponse à l'escalade des tensions régionales."
      },
      "de": {
        "title": "Flüge storniert und neue Reisewarnungen nach iranischen Angriffen",
        "summary": "Große Fluggesellschaften wie British Airways und Virgin Atlantic haben Flüge in den Nahen Osten nach den iranischen Angriffen storniert. Neue Reisewarnungen wurden angesichts der eskalierenden regionalen Spannungen ausgegeben."
      },
      "es": {
        "title": "Vuelos cancelados y nuevas advertencias de viaje emitidas después de ataques iraníes",
        "summary": "Las grandes aerolíneas, incluyendo British Airways y Virgin Atlantic, han cancelado vuelos hacia Oriente Medio tras los ataques iraníes. Se han emitido nuevas advertencias de viaje en respuesta a la escalada de tensiones regionales."
      }
    }
  },
  {
    "title": "$100 oil? Prolonged Hormuz closure could spark a 1970s-style energy shock",
    "slug": "prolonged-hormuz-closure-energy-shock",
    "url": "https://www.cnbc.com/2026/03/01/experts-weigh-potential-scenarios-for-oil-if-strait-of-hormuz-closes.html",
    "source": "CNBC",
    "date": "2026-03-01T10:57:52.000Z",
    "summary": "U.S. strikes on Iran have raised concerns about potential disruptions in the Strait of Hormuz, a critical oil shipping chokepoint. Energy analysts warn this could trigger a 1970s-style energy shock with oil prices potentially reaching $100 per barrel.",
    "content": "Energy analysts are bracing for a possible oil supply shock after U.S. strikes on Iran reignited fears of disruptions in the Strait of Hormuz.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "100美元油价？荷尔木兹海峡长期关闭可能引发1970年代风格的能源危机",
        "summary": "美国对伊朗的打击引发了人们对霍尔木兹海峡（一个关键的石油运输枢纽）可能中断的担忧。能源分析师警告这可能引发1970年代风格的能源危机，油价可能达到每桶100美元。"
      },
      "fr": {
        "title": "Pétrole à 100 dollars ? Une fermeture prolongée du détroit d'Ormuz pourrait déclencher un choc énergétique à la manière des années 1970",
        "summary": "Les frappes américaines contre l'Iran ont soulevé des préoccupations concernant les perturbations potentielles du détroit d'Ormuz, un passage maritime critique pour le pétrole. Les analystes énergétiques avertissent que cela pourrait déclencher un choc énergétique à la manière des années 1970, avec les prix du pétrole potentiellement atteignant 100 dollars le baril."
      },
      "de": {
        "title": "100-Dollar-Öl? Länger anhaltende Schließung der Straße von Hormuz könnte einen Energieschock im Stil der 1970er Jahre auslösen",
        "summary": "Die amerikanischen Anschläge auf den Iran haben Bedenken hinsichtlich möglicher Störungen in der Straße von Hormuz, einem kritischen Ölschifffahrts-Engpass, geweckt. Energieanalysten warnen, dass dies einen Energieschock im Stil der 1970er Jahre auslösen könnte, wobei die Ölpreise möglicherweise 100 Dollar pro Barrel erreichen."
      },
      "es": {
        "title": "¿Petróleo a 100 dólares? El cierre prolongado del Estrecho de Ormuz podría desencadenar un choque energético al estilo de los años 70",
        "summary": "Los ataques estadounidenses contra Irán han planteado preocupaciones sobre posibles interrupciones en el Estrecho de Ormuz, un punto crítico de envío de petróleo. Los analistas energéticos advierten que esto podría desencadenar un choque energético al estilo de los años 70, con los precios del petróleo potencialmente alcanzando 100 dólares por barril."
      }
    }
  },
  {
    "title": "A firm hiring blind staff went bust - but its mission lives on",
    "slug": "firm-hiring-blind-staff-mission-lives-on",
    "url": "https://www.bbc.com/news/articles/cpd8jpn0np1o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-03-01T09:56:50.000Z",
    "summary": "A 150-year-old business specializing in hiring blind staff has closed, but its inclusive employment mission continues after a former employee stepped in. The company's legacy of workplace accessibility lives on through individual initiative.",
    "content": "The business had been running for over 150 years before it collapsed, so one former employee took matters into her own hands.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "一家聘用盲人员工的公司倒闭了——但其使命仍在继续",
        "summary": "一家拥有150年历史、专门聘用盲人员工的企业已关闭，但其包容性就业使命在一位前员工接手后继续进行。这家公司的职场可及性遗产通过个人的主动性得以延续。"
      },
      "fr": {
        "title": "Une entreprise embauchant du personnel malvoyant a fermé - mais sa mission perdure",
        "summary": "Une entreprise centenaire spécialisée dans l'emploi de personnes malvoyantes a fermé ses portes, mais sa mission d'emploi inclusive se poursuit après l'intervention d'un ancien employé. L'héritage de l'accessibilité sur le lieu de travail de l'entreprise perdure grâce à l'initiative individuelle."
      },
      "de": {
        "title": "Ein Unternehmen, das blinde Mitarbeiter einstellte, ging bankrott - aber sein Auftrag lebt weiter",
        "summary": "Ein 150 Jahre altes Unternehmen, das sich auf die Beschäftigung blinder Mitarbeiter spezialisierte, hat geschlossen, aber seine Aufgabe der inklusiven Beschäftigung wird von einem ehemaligen Mitarbeiter fortgesetzt. Das Vermächtnis der Barrierefreiheit am Arbeitsplatz des Unternehmens lebt durch persönliche Initiative weiter."
      },
      "es": {
        "title": "Una empresa que contrataba personal invidente cerró - pero su misión continúa",
        "summary": "Un negocio centenario especializado en la contratación de personal invidente ha cerrado, pero su misión de empleo inclusivo continúa después de que un ex empleado se hizo cargo. El legado de accesibilidad laboral de la empresa continúa a través de la iniciativa individual."
      }
    }
  },
  {
    "title": "Could a huge data centre revitalise Ayrshire - or ruin it?",
    "slug": "data-centre-ayrshire-revitalise-or-ruin",
    "url": "https://www.bbc.com/news/articles/c2d1ny161yyo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-03-01T09:25:25.000Z",
    "summary": "ILI Group is proposing a major data centre development near HMP Kilmarnock in Ayrshire that could either revitalize or harm the region. The controversial project aims to transform the area into a technology hub with significant local implications.",
    "content": "Controversial proposals to turn land near HMP Kilmarnock into a technology hub are being advanced by energy company ILI Group.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "巨大的数据中心能振兴艾郡还是毁掉它？",
        "summary": "ILI集团在艾郡HMP基尔马诺克附近提议建设一个大型数据中心，这可能会振兴或伤害该地区。这个有争议的项目旨在将该地区转变为技术中心，具有重大的本地意义。"
      },
      "fr": {
        "title": "Un énorme centre de données pourrait-il revitaliser l'Ayrshire ou le ruiner ?",
        "summary": "Le groupe ILI propose un important projet de centre de données près de HMP Kilmarnock en Ayrshire qui pourrait revitaliser ou nuire à la région. Le projet controversé vise à transformer la région en un pôle technologique avec des implications locales importantes."
      },
      "de": {
        "title": "Könnte ein riesiges Datenzentrum Ayrshire revitalisieren oder ruinieren?",
        "summary": "Die ILI Group schlägt eine große Datenzentrum-Entwicklung in der Nähe von HMP Kilmarnock in Ayrshire vor, die die Region revitalisieren oder schädigen könnte. Das umstrittene Projekt zielt darauf ab, die Region in ein Technologie-Hub umzuwandeln mit erheblichen lokalen Auswirkungen."
      },
      "es": {
        "title": "¿Podría un centro de datos enorme revitalizar Ayrshire o arruinarlo?",
        "summary": "El grupo ILI está proponiendo un importante desarrollo de centro de datos cerca de HMP Kilmarnock en Ayrshire que podría revitalizar o dañar la región. El controvertido proyecto tiene como objetivo transformar el área en un centro tecnológico con importantes implicaciones locales."
      }
    }
  },
  {
    "title": "Iran may 'lash out harder' as Khamenei's death puts Tehran on a war footing, leaving the world bracing for what's next",
    "slug": "iran-khamenei-death-war-footing",
    "url": "https://www.cnbc.com/2026/03/01/us-israel-attacks-strikes-iran-retaliate-china-russia-allies.html",
    "source": "CNBC",
    "date": "2026-03-01T09:21:20.000Z",
    "summary": "Following Khamenei's death, Iran may escalate military response, putting Tehran on heightened war footing. While Russia and China have issued diplomatic protests, analysts doubt they can provide substantive support to Iran.",
    "content": "Iran's strategic allies Russia and China have made strong diplomatic protests, but analysts say neither is in a position to offer meaningful support.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "随着哈梅内伊之死使德黑兰处于战争状态，伊朗可能会\"更加猛烈地反击\"",
        "summary": "在哈梅内伊去世后，伊朗可能会升级军事反应，使德黑兰处于高度战争状态。虽然俄罗斯和中国已发出外交抗议，但分析人士怀疑他们能否为伊朗提供实质性支持。"
      },
      "fr": {
        "title": "L'Iran pourrait \"frapper plus fort\" alors que la mort de Khamenei met Téhéran sur un pied de guerre",
        "summary": "Suite au décès de Khamenei, l'Iran pourrait intensifier sa réaction militaire, mettant Téhéran sur un pied de guerre renforcé. Bien que la Russie et la Chine aient émis des protestations diplomatiques, les analystes doutent qu'elles puissent fournir un soutien substantiel à l'Iran."
      },
      "de": {
        "title": "Der Iran könnte \"stärker zurückschlagen\", da Khameneis Tod Teheran in Kriegsbereitschaft versetzt",
        "summary": "Nach Khameneis Tod könnte der Iran seine militärische Reaktion eskalieren und Teheran in verstärkte Kriegsbereitschaft versetzen. Obwohl Russland und China diplomatische Proteste eingereicht haben, zweifeln Analysten daran, dass sie substantielle Unterstützung für den Iran leisten können."
      },
      "es": {
        "title": "Irán puede \"golpear más fuerte\" mientras la muerte de Jamenei pone a Teherán en pie de guerra",
        "summary": "Tras la muerte de Jamenei, Irán podría escalar su respuesta militar, poniendo a Teherán en una posición de guerra elevada. Aunque Rusia y China han emitido protestas diplomáticas, los analistas dudan de que puedan proporcionar apoyo sustancial a Irán."
      }
    }
  },
  {
    "title": "Here’s how much you could pay for a gallon of gas by May because of the attacks on Iran",
    "slug": "gas-prices-iran-attacks-may",
    "url": "https://www.marketwatch.com/story/heres-how-much-you-could-pay-for-a-gallon-of-gas-by-may-because-of-the-attacks-on-iran-e12e976f?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-03-01T09:04:00.000Z",
    "summary": "U.S.-Israel strikes against Iran are expected to drive up oil and gasoline prices by May. GasBuddy analysis suggests Americans should prepare for significantly higher gas pump prices in the coming months.",
    "content": "U.S.-Israel strikes against Iran will push up oil prices, as well as how much Americans pay for gasoline at the pump: GasBuddy",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "由于对伊朗的攻击，到五月你可能要为一加仑汽油支付多少钱",
        "summary": "美国-以色列对伊朗的打击预计会推高油价和汽油价格。GasBuddy分析表明美国人应该为未来几个月汽油价格大幅上涨做好准备。"
      },
      "fr": {
        "title": "Voici combien vous pourriez payer pour un gallon d'essence en mai à cause des attaques contre l'Iran",
        "summary": "Les frappes américano-israéliennes contre l'Iran devraient faire monter les prix du pétrole et de l'essence d'ici mai. L'analyse de GasBuddy suggère que les Américains devraient se préparer à des prix de l'essence significativement plus élevés dans les mois à venir."
      },
      "de": {
        "title": "Hier ist, wie viel Sie bis Mai für eine Gallone Benzin zahlen könnten wegen der Anschläge auf den Iran",
        "summary": "Die amerikanisch-israelischen Anschläge auf den Iran werden voraussichtlich die Öl- und Benzinpreise bis Mai in die Höhe treiben. Die GasBuddy-Analyse deutet darauf hin, dass Amerikaner sich auf deutlich höhere Benzinpreise in den kommenden Monaten vorbereiten sollten."
      },
      "es": {
        "title": "Esto es lo que podrías pagar por un galón de gasolina en mayo debido a los ataques contra Irán",
        "summary": "Se espera que los ataques estadounidenses-israelíes contra Irán aumenten los precios del petróleo y la gasolina en mayo. El análisis de GasBuddy sugiere que los estadounidenses deben prepararse para precios de gasolina significativamente más altos en los próximos meses."
      }
    }
  },
  {
    "title": "Rescue centre sees rise in abandoned cat families",
    "slug": "rescue-centre-abandoned-cat-families-rise",
    "url": "https://www.bbc.com/news/articles/cwygprp50yqo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-03-01T08:52:59.000Z",
    "summary": "Yorkshire Cat Rescue in Haworth experienced a surge in abandoned cat families during 2025, spending £282,000 on veterinary care. The centre rescued 925 animals despite the significant financial strain.",
    "content": "Yorkshire Cat Rescue in Haworth says it paid £282,000 in vet bills in 2025 and rescued 925 animals.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "救援中心遭弃猫咪家族数量上升",
        "summary": "哈沃斯约克郡猫咪救援中心在2025年间遭弃猫咪家族激增，兽医护理费用达282,000英镑。尽管财务压力巨大，该中心仍成功救援了925只动物。"
      },
      "fr": {
        "title": "Le centre de sauvetage constate une augmentation des familles de chats abandonnés",
        "summary": "Le Yorkshire Cat Rescue à Haworth a connu une augmentation des familles de chats abandonnés en 2025, dépensant 282 000 livres en soins vétérinaires. Le centre a secouru 925 animaux malgré la pression financière importante."
      },
      "de": {
        "title": "Rettungszentrum verzeichnet Anstieg verlassener Katzenfamilien",
        "summary": "Das Yorkshire Cat Rescue in Haworth verzeichnete 2025 einen Anstieg verlassener Katzenfamilien und gab 282.000 Pfund für tierärztliche Versorgung aus. Das Zentrum rettete trotz erheblicher finanzieller Belastung 925 Tiere."
      },
      "es": {
        "title": "Centro de rescate ve aumento en familias de gatos abandonados",
        "summary": "El Centro de Rescate de Gatos de Yorkshire en Haworth experimentó un aumento en familias de gatos abandonados durante 2025, gastando £282,000 en cuidados veterinarios. El centro rescató 925 animales a pesar de la importante presión financiera."
      }
    }
  },
  {
    "title": "Live Updates: Iran’s retaliatory strikes and regional tensions surge post-Khamenei",
    "slug": "iran-retaliatory-strikes-regional-tensions-surge",
    "url": "https://www.cnbc.com/2026/03/01/us-iran-live-updates-khamenei-death-trump-gulf-strikes.html",
    "source": "CNBC",
    "date": "2026-03-01T06:11:07.000Z",
    "summary": "Following the death of Iran's Supreme Leader Ayatollah Ali Khamenei in a U.S. and Israeli attack, Iran has launched retaliatory strikes amid rapidly escalating regional tensions. This represents a major geopolitical crisis with significant implications for Middle East stability.",
    "content": "Follow the latest news after the U.S. and Israel launched a massive attack on Iran that reportedly killed Iran's Supreme Leader Ayatollah Ali Khamenei.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "实时更新：伊朗的报复性打击和后卡梅尼地区局势激化",
        "summary": "在伊朗最高领导人阿亚图拉·阿里·哈梅内伊在美国和以色列的袭击中丧生后，伊朗发动了报复性打击，地区局势迅速升级。这代表了一场重大的地缘政治危机，对中东稳定造成重大影响。"
      },
      "fr": {
        "title": "Mises à jour en direct : les frappes de représailles de l'Iran et l'escalade des tensions régionales après Khamenei",
        "summary": "Suite à la mort du Guide suprême iranien l'Ayatollah Ali Khamenei dans une attaque américaine et israélienne, l'Iran a lancé des frappes de représailles au milieu d'une escalade rapide des tensions régionales. Cela représente une crise géopolitique majeure avec des implications significatives pour la stabilité du Moyen-Orient."
      },
      "de": {
        "title": "Live-Updates: Irans Vergeltungsschläge und regionale Spannungen nach Khamenei verschärfen sich",
        "summary": "Nach dem Tod des iranischen Obersten Führers Ayatollah Ali Khamenei in einem amerikanischen und israelischen Anschlag hat der Iran Vergeltungsschläge inmitten sich schnell verschärfender regionaler Spannungen gestartet. Dies stellt eine große geopolitische Krise mit erheblichen Auswirkungen auf die Stabilität im Nahen Osten dar."
      },
      "es": {
        "title": "Actualizaciones en vivo: Los ataques de represalia de Irán y el aumento de las tensiones regionales después de Jamenei",
        "summary": "Tras la muerte del Líder Supremo de Irán, el Ayatola Ali Jamenei, en un ataque estadounidense e israelí, Irán ha lanzado ataques de represalia en medio de una rápida escalada de tensiones regionales. Esto representa una crisis geopolítica importante con implicaciones significativas para la estabilidad de Oriente Medio."
      }
    }
  },
  {
    "title": "Iran after Khamenei: What's next and what it means for the country?",
    "slug": "iran-after-khamenei-whats-next",
    "url": "https://www.cnbc.com/2026/03/01/iran-khamenei-dead-us-israel-strike-trump-netanyahu.html",
    "source": "CNBC",
    "date": "2026-03-01T05:39:16.000Z",
    "summary": "Ayatollah Ali Khamenei held Iran's supreme leadership for 37 years after assuming power in 1989, overseeing the consolidation of the Islamic Revolutionary state. His death creates an unprecedented leadership vacuum with uncertain implications for Iran's future direction.",
    "content": "Khamenei assumed power following the death of Ayatollah Ruhollah Khomeini in 1989, inheriting a revolutionary state still consolidating itself.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "卡梅尼之后的伊朗：接下来会发生什么，这对国家意味着什么？",
        "summary": "阿亚图拉·阿里·哈梅内伊在1989年掌权后担任伊朗最高领导人37年，监督了伊斯兰革命国家的巩固。他的去世造成了前所未有的领导真空，对伊朗未来的方向产生了不确定的影响。"
      },
      "fr": {
        "title": "L'Iran après Khamenei : Qu'est-ce qui vient ensuite et que cela signifie pour le pays ?",
        "summary": "L'Ayatollah Ali Khamenei a détenu le leadership suprême de l'Iran pendant 37 ans après avoir pris le pouvoir en 1989, supervisant la consolidation de l'État révolutionnaire islamique. Sa mort crée un vide de leadership sans précédent avec des implications incertaines pour l'orientation future de l'Iran."
      },
      "de": {
        "title": "Der Iran nach Khamenei: Was kommt danach und was bedeutet das für das Land?",
        "summary": "Ayatollah Ali Khamenei hielt die oberste Führungsposition des Iran 37 Jahre lang, nachdem er 1989 an die Macht kam, und überwachte die Festigung des Islamischen Revolutionsstaates. Sein Tod schafft ein beispielloses Führungsvakuum mit unsicheren Auswirkungen auf die zukünftige Ausrichtung des Iran."
      },
      "es": {
        "title": "Irán después de Jamenei: ¿Qué sigue y qué significa para el país?",
        "summary": "El Ayatola Ali Jamenei ocupó el liderazgo supremo de Irán durante 37 años después de asumir el poder en 1989, supervisando la consolidación del Estado Revolucionario Islámico. Su muerte crea un vacío de liderazgo sin precedentes con implicaciones inciertas para la dirección futura de Irán."
      }
    }
  }
]