[
  {
    "title": "Any chance the Fed cuts rates this year is ‘evaporating before our very eyes’ as Iran tensions raise oil prices",
    "slug": "fed-cuts-evaporating-iran-oil-prices",
    "url": "https://www.marketwatch.com/story/any-chance-the-fed-cuts-rates-this-year-is-evaporating-before-our-very-eyes-as-iran-tensions-raise-oil-prices-18978691?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-28T12:00:00.000Z",
    "summary": "Rising oil prices driven by Iran tensions are diminishing the case for Federal Reserve interest rate cuts this year. The geopolitical escalation threatens to sustain inflation pressures that previously supported expectations of additional monetary easing.",
    "content": "With oil prices rising in response to growing tensions with Iran, the rationale for additional interest-rate cuts by the Federal Reserve is disappearing.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "美联储降息的可能性正在'我们眼前消失'，随着伊朗紧张局势推高油价",
        "summary": "由伊朗紧张局势驱动的油价上升正在削弱美联储今年降息的理由。地缘政治升级威胁维持之前支持额外货币宽松预期的通胀压力。"
      },
      "fr": {
        "title": "Toute chance de baisse des taux par la Fed cette année 's'évapore sous nos yeux' alors que les tensions avec l'Iran font monter les prix du pétrole",
        "summary": "La hausse des prix du pétrole causée par les tensions avec l'Iran diminue le cas pour les réductions des taux d'intérêt de la Réserve fédérale cette année. L'escalade géopolitique menace de maintenir les pressions inflationnistes qui soutenaient auparavant les attentes d'un assouplissement monétaire supplémentaire."
      },
      "de": {
        "title": "Jede Chance auf Zinssenkungen der Fed dieses Jahr 'verflüchtigt sich vor unseren Augen', da iranische Spannungen die Ölpreise in die Höhe treiben",
        "summary": "Steigende Ölpreise, die durch iranische Spannungen verursacht werden, schwächen den Fall für Zinskürzungen der Federal Reserve in diesem Jahr ab. Die geopolitische Eskalation droht, Inflationsdruck aufrechtzuerhalten, der zuvor Erwartungen zusätzlicher geldpolitischer Lockerung unterstützte."
      },
      "es": {
        "title": "Cualquier posibilidad de que la Fed reduzca las tasas este año se está 'evaporando ante nuestros ojos' a medida que las tensiones con Irán elevan los precios del petróleo",
        "summary": "El aumento de los precios del petróleo impulsado por las tensiones con Irán está disminuyendo el caso para reducciones de las tasas de interés de la Reserva Federal este año. La escalada geopolítica amenaza con mantener las presiones inflacionarias que anteriormente respaldaban las expectativas de mayor flexibilización monetaria."
      }
    }
  },
  {
    "title": "U.S.-Israel launch massive attack on Iran; 4 U.S. military bases hit in retaliation",
    "slug": "us-israel-attack-iran-retaliation",
    "url": "https://www.cnbc.com/2026/02/28/trump-us-military-iran-strikes-middle-east-oil.html",
    "source": "CNBC",
    "date": "2026-02-28T11:47:09.000Z",
    "summary": "The U.S. and Israel launched a major military strike on Iran following Iranian retaliation against four U.S. military bases. President Trump cited Iran's continued pursuit of nuclear weapons despite ongoing diplomatic negotiations.",
    "content": "U.S. President Donald Trump said Iran has continued to pursue nuclear weapons despite ongoing negotiations to end its program.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "美以联合对伊朗进行大规模攻击；美军4个基地在报复中被击中",
        "summary": "美国和以色列在伊朗报复美国四个军事基地后对伊朗进行了一次重大军事打击。特朗普总统引用伊朗尽管持续进行外交谈判但继续追求核武器作为理由。"
      },
      "fr": {
        "title": "Les États-Unis et Israël lancent une attaque massive contre l'Iran ; 4 bases militaires américaines touchées en représailles",
        "summary": "Les États-Unis et Israël ont lancé une frappe militaire majeure contre l'Iran suite aux représailles iraniennes contre quatre bases militaires américaines. Le président Trump a cité la poursuite continue par l'Iran des armes nucléaires malgré les négociations diplomatiques en cours."
      },
      "de": {
        "title": "USA und Israel starten Massenangriff auf Iran; 4 US-Militärstützpunkte bei Vergeltung getroffen",
        "summary": "Die USA und Israel führten einen großen Militärangriff auf Iran durch, nachdem der Iran vier US-Militärstützpunkte angegriffen hatte. Präsident Trump zitierte Irans andauernde Verfolgung von Kernwaffen trotz laufender diplomatischer Verhandlungen."
      },
      "es": {
        "title": "EE.UU. e Israel lanzan ataque masivo contra Irán; 4 bases militares estadounidenses impactadas en represalia",
        "summary": "Estados Unidos e Israel lanzaron un ataque militar importante contra Irán tras las represalias iraníes contra cuatro bases militares estadounidenses. El presidente Trump citó la búsqueda continua de armas nucleares por parte de Irán a pesar de las negociaciones diplomáticas en curso."
      }
    }
  },
  {
    "title": "U.S. strikes on Iran will likely boost defense stocks. Here’s what will keep the cash flowing even after the conflict ends.",
    "slug": "iran-strikes-boost-defense-stocks",
    "url": "https://www.marketwatch.com/story/iran-strikes-will-likely-boost-defense-stocks-but-heres-what-will-keep-the-cash-flowing-long-after-the-conflict-ends-2fa929cf?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-28T10:12:00.000Z",
    "summary": "U.S. military operations against Iran are expected to benefit defense sector stocks significantly. The defense industry's long-term revenue will be sustained by recurring maintenance and software contracts beyond the immediate conflict.",
    "content": "A massive backlog of maintenance and software contracts will ensure recurring revenue.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "美国对伊朗的袭击可能会提振防御类股票。以下是冲突结束后如何保持现金流动。",
        "summary": "美国对伊朗的军事行动预期将显著惠及防御部门股票。防御行业的长期收入将通过超越立即冲突的经常性维护和软件合同得到维持。"
      },
      "fr": {
        "title": "Les frappes américaines contre l'Iran vont probablement dynamiser les actions de défense. Voici ce qui maintiendra les flux de trésorerie même après la fin du conflit.",
        "summary": "Les opérations militaires américaines contre l'Iran devraient bénéficier considérablement aux actions du secteur de la défense. Les revenus à long terme de l'industrie de la défense seront soutenus par des contrats récurrents de maintenance et de logiciels au-delà du conflit immédiat."
      },
      "de": {
        "title": "US-Angriffe auf Iran werden wahrscheinlich Rüstungsaktien ankurbeln. Hier ist, was die Geldflüsse auch nach Ende des Konflikts am Fließen hält.",
        "summary": "US-Militäroperationen gegen den Iran werden voraussichtlich Rüstungssektor-Aktien erheblich begünstigen. Die langfristigen Einnahmen der Rüstungsindustrie werden durch wiederkehrende Wartungs- und Softwareverträge über den unmittelbaren Konflikt hinaus gestützt."
      },
      "es": {
        "title": "Los ataques estadounidenses contra Irán probablemente impulsarán las acciones de defensa. Aquí está lo que mantendrá el flujo de efectivo incluso después del final del conflicto.",
        "summary": "Se espera que las operaciones militares estadounidenses contra Irán beneficien significativamente a las acciones del sector de defensa. Los ingresos a largo plazo de la industria de defensa se sustentarán con contratos recurrentes de mantenimiento y software más allá del conflicto inmediato."
      }
    }
  },
  {
    "title": "The U.S. and Israel attack Iran. Bitcoin and oil offer a glimpse at how markets could react.",
    "slug": "us-israel-iran-markets-bitcoin-oil",
    "url": "https://www.marketwatch.com/story/trump-says-massive-strike-against-iran-underway-bitcoin-plunge-offers-a-glimpse-of-how-markets-could-react-25d9ed1c?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-28T10:08:00.000Z",
    "summary": "Markets are showing mixed reactions to U.S. and Israel's military action against Iran, with Bitcoin declining sharply. Oil prices and cryptocurrency movements signal the geopolitical escalation's broader impact on financial markets.",
    "content": "Bitcoin was tumbling on Saturday after military action was carried out against Iran by the U.S. and Israel.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "美国和以色列攻击伊朗。比特币和石油揭示了市场可能如何反应。",
        "summary": "市场对美国和以色列对伊朗的军事行动反应不一，比特币大幅下跌。油价和加密货币的走势反映了地缘政治升级对金融市场的更广泛影响。"
      },
      "fr": {
        "title": "Les États-Unis et Israël attaquent l'Iran. Le Bitcoin et le pétrole offrent un aperçu de la réaction des marchés.",
        "summary": "Les marchés affichent des réactions mitigées à l'action militaire des États-Unis et d'Israël contre l'Iran, le Bitcoin chutant fortement. Les mouvements des prix du pétrole et des crypto-monnaies signalent l'impact plus large de l'escalade géopolitique sur les marchés financiers."
      },
      "de": {
        "title": "USA und Israel greifen Iran an. Bitcoin und Öl zeigen, wie Märkte reagieren könnten.",
        "summary": "Märkte zeigen gemischte Reaktionen auf die Militäraktion der USA und Israels gegen den Iran, wobei Bitcoin stark fällt. Ölpreise und Kryptowährungsbewegungen signalisieren die breitere Auswirkung der geopolitischen Eskalation auf die Finanzmärkte."
      },
      "es": {
        "title": "Estados Unidos e Israel atacan a Irán. Bitcoin y petróleo ofrecen una visión de cómo podrían reaccionar los mercados.",
        "summary": "Los mercados muestran reacciones mixtas a la acción militar de Estados Unidos e Israel contra Irán, con Bitcoin cayendo bruscamente. Los movimientos de los precios del petróleo y las criptomonedas señalan el impacto más amplio de la escalada geopolítica en los mercados financieros."
      }
    }
  },
  {
    "title": "OpenAI strikes deal with Pentagon, hours after rival Anthropic was blacklisted by Trump",
    "slug": "openai-pentagon-deal-anthropic-blacklisted",
    "url": "https://www.cnbc.com/2026/02/27/openai-strikes-deal-with-pentagon-hours-after-rival-anthropic-was-blacklisted-by-trump.html",
    "source": "CNBC",
    "date": "2026-02-28T04:25:34.000Z",
    "summary": "OpenAI has reached an agreement with the Defense Department to provide its AI models, hours after its rival Anthropic faced blacklisting by the Trump administration. The deal signals growing government interest in deploying commercial AI systems for military applications.",
    "content": "OpenAI CEO Sam Altman said on X that his company has come to terms with the Defense Department for use of its models.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "OpenAI与五角大楼达成协议，竞争对手Anthropic遭特朗普政府列入黑名单仅数小时后",
        "summary": "OpenAI与美国国防部达成协议，为其提供AI模型，此前其竞争对手Anthropic遭特朗普政府列入黑名单仅数小时。该协议表明政府对部署商业AI系统用于军事应用的兴趣日益增长。"
      },
      "fr": {
        "title": "OpenAI conclut un accord avec le Pentagone, quelques heures après que son rival Anthropic ait été mis sur la liste noire par Trump",
        "summary": "OpenAI a conclu un accord avec le Département de la Défense pour fournir ses modèles d'IA, quelques heures après que son rival Anthropic ait été blacklisté par l'administration Trump. L'accord signale un intérêt croissant du gouvernement pour le déploiement de systèmes d'IA commerciaux pour des applications militaires."
      },
      "de": {
        "title": "OpenAI schließt Deal mit Pentagon ab, Stunden nachdem Rivale Anthropic von Trump auf die schwarze Liste gesetzt wurde",
        "summary": "OpenAI hat eine Vereinbarung mit dem Verteidigungsministerium getroffen, um seine KI-Modelle bereitzustellen, nur Stunden nachdem sein Rivale Anthropic von der Trump-Administration auf die schwarze Liste gesetzt wurde. Das Abkommen signalisiert wachsendes staatliches Interesse an der Bereitstellung kommerzieller KI-Systeme für militärische Anwendungen."
      },
      "es": {
        "title": "OpenAI llega a un acuerdo con el Pentágono, horas después de que su rival Anthropic fuera incluido en la lista negra por Trump",
        "summary": "OpenAI ha llegado a un acuerdo con el Departamento de Defensa para proporcionar sus modelos de IA, solo horas después de que su rival Anthropic fuera incluido en la lista negra por la administración Trump. El acuerdo señala un creciente interés gubernamental en desplegar sistemas de IA comerciales para aplicaciones militares."
      }
    }
  },
  {
    "title": "Pentagon-Anthropic AI standoff is real-time testing balance of power in future of warfare",
    "slug": "pentagon-anthropic-ai-warfare",
    "url": "https://www.cnbc.com/2026/02/27/defense-anthropic-ai-war-risks-hegseth-amodei.html",
    "source": "CNBC",
    "date": "2026-02-28T03:51:22.000Z",
    "summary": "A dispute between the Pentagon and Anthropic over military AI deployment highlights a critical power struggle over future warfare capabilities. Trump and Defense Secretary Hegseth's strong response underscores competing interests in military AI control.",
    "content": "The Pentagon clash with Anthropic and Friday's severe response from Trump and Defense Secretary Hegseth highlights a growing war over who controls military AI.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "五角大楼与Anthropic的AI僵局是对未来战争权力平衡的实时测试",
        "summary": "五角大楼与Anthropic之间关于军事AI部署的争议突出了对未来战争能力的关键权力斗争。特朗普和国防部长赫格塞斯的强硬回应强调了对军事AI控制的竞争利益。"
      },
      "fr": {
        "title": "L'impasse IA entre le Pentagone et Anthropic teste l'équilibre des pouvoirs dans la guerre future",
        "summary": "Un différend entre le Pentagone et Anthropic sur le déploiement d'IA militaire met en évidence une lutte de pouvoir critique pour les capacités de guerre futures. La réponse ferme de Trump et du secrétaire à la Défense Hegseth souligne les intérêts concurrents dans le contrôle de l'IA militaire."
      },
      "de": {
        "title": "Pentagon-Anthropic-KI-Pattsituation testet das Machtverhältnis in der zukünftigen Kriegführung",
        "summary": "Ein Streit zwischen dem Pentagon und Anthropic über den Einsatz von Militär-KI verdeutlicht einen kritischen Machtkampf über zukünftige Kriegsfähigkeiten. Die starke Reaktion von Trump und Verteidigungsminister Hegseth unterstreicht konkurrierende Interessen bei der Kontrolle von Militär-KI."
      },
      "es": {
        "title": "El punto muerto de IA entre el Pentágono y Anthropic prueba el equilibrio de poder en la guerra futura",
        "summary": "Una disputa entre el Pentágono y Anthropic sobre el despliegue de IA militar destaca una lucha crítica de poder sobre las capacidades de guerra futura. La respuesta contundente de Trump y del Secretario de Defensa Hegseth subraya intereses en competencia en el control de la IA militar."
      }
    }
  },
  {
    "title": "Rent tops £1,000 a month in more areas - find out where",
    "slug": "rent-tops-1000-month",
    "url": "https://www.bbc.com/news/articles/cx28njn2dwpo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-28T00:14:04.000Z",
    "summary": "Private rental costs have surged significantly over the past five years, with monthly rents now exceeding £1,000 in more areas, though growth may be slowing.",
    "content": "The cost of renting privately has surged in the last five years, but tenants may now see a slowdown.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "租金在更多地区超过1000英镑/月 - 查看具体位置",
        "summary": "过去五年来，私人租赁成本大幅上升，月租金在更多地区已超过1000英镑，但增长可能正在放缓。"
      },
      "fr": {
        "title": "Le loyer dépasse 1000 £ par mois dans plus de régions - découvrez lesquelles",
        "summary": "Les coûts des locations privées ont augmenté considérablement au cours des cinq dernières années, avec des loyers mensuels dépassant maintenant 1000 £ dans plus de régions, bien que la croissance ralentisse peut-être."
      },
      "de": {
        "title": "Miete überschreitet £1.000 pro Monat in mehr Gebieten - finde heraus wo",
        "summary": "Die Kosten für private Mietwohnungen sind in den letzten fünf Jahren erheblich gestiegen, wobei die monatliche Miete nun in mehr Gebieten £1.000 übersteigt, obwohl das Wachstum möglicherweise verlangsamt."
      },
      "es": {
        "title": "El alquiler supera £1.000 por mes en más áreas - descubre dónde",
        "summary": "Los costos de alquiler privado se han disparado significativamente en los últimos cinco años, con rentas mensuales que ahora superan £1.000 en más áreas, aunque el crecimiento puede estar ralentizándose."
      }
    }
  }
]