[
  {
    "title": "How the attack on Iran could impact the global oil market and economy",
    "slug": "how-attack-iran-impact-global-oil-market-economy",
    "url": "https://www.cnbc.com/2026/02/28/iran-us-attack-oil-market-economy.html",
    "source": "CNBC",
    "date": "2026-02-28T23:47:47.000Z",
    "summary": "A U.S.-Israeli attack on Iran poses significant risks to global oil supplies, given Iran's position as the fourth-largest OPEC producer and its control of the strategic Strait of Hormuz. Such disruptions could have cascading effects on energy prices and economic stability worldwide.",
    "content": "The U.S.-Israeli attack raises the risk of major oil supply disruption. Iran is the fourth-largest OPEC producer and sits on the critical Strait of Hormuz.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "对伊朗的攻击如何影响全球石油市场和经济",
        "summary": "美国-以色列对伊朗的攻击对全球石油供应构成重大风险，考虑到伊朗作为第四大欧佩克生产国及其对战略性霍尔木兹海峡的控制。这种中断可能会对全球能源价格和经济稳定产生连锁反应。"
      },
      "fr": {
        "title": "Comment l'attaque contre l'Iran pourrait affecter le marché pétrolier mondial et l'économie",
        "summary": "Une attaque américano-israélienne contre l'Iran pose des risques importants aux approvisionnements mondiaux en pétrole, étant donné la position de l'Iran en tant que quatrième plus grand producteur de l'OPEP et son contrôle du détroit stratégique d'Ormuz. De telles perturbations pourraient avoir des effets en cascade sur les prix de l'énergie et la stabilité économique mondiale."
      },
      "de": {
        "title": "Wie der Angriff auf den Iran den globalen Ölmarkt und die Wirtschaft beeinflussen könnte",
        "summary": "Ein amerikanisch-israelischer Angriff auf den Iran stellt erhebliche Risiken für die globalen Ölversorgungen dar, da der Iran als viertgrößter OPEC-Produzent und die Kontrolle der strategischen Straße von Hormus innehat. Solche Störungen könnten kaskadierende Auswirkungen auf die Energiepreise und die wirtschaftliche Stabilität weltweit haben."
      },
      "es": {
        "title": "Cómo el ataque a Irán podría afectar el mercado petrolero global y la economía",
        "summary": "Un ataque estadounidense-israelí a Irán plantea riesgos significativos para los suministros de petróleo global, dada la posición de Irán como el cuarto productor más grande de la OPEP y su control del estratégico Estrecho de Ormuz. Tales disrupciones podrían tener efectos en cascada en los precios de la energía y la estabilidad económica mundial."
      }
    }
  },
  {
    "title": "Drone warfare could mean investors need a new guidebook for this Iran conflict",
    "slug": "drone-warfare-investors-guidebook-iran-conflict",
    "url": "https://www.marketwatch.com/story/drone-warfare-could-mean-investors-need-a-new-guidebook-for-this-iran-conflict-ccac6a82?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-28T22:31:00.000Z",
    "summary": "The adoption of \"shoot and scoot\" drone tactics in the Iran conflict could extend the duration and unpredictability of military operations. This prolonged conflict carries implications for investors seeking to navigate geopolitical risks and market volatility.",
    "content": "Use of ‘shoot and scoot’ drone warfare could prolong Iran conflict, warns Papic at BCA Research",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "无人机战争可能意味着投资者需要为伊朗冲突制定新指南",
        "summary": "在伊朗冲突中采用\"射击和撤离\"无人机战术可能会延长军事行动的持续时间和不可预测性。这种持久冲突对寻求应对地缘政治风险和市场波动的投资者有影响。"
      },
      "fr": {
        "title": "La guerre des drones pourrait signifier que les investisseurs ont besoin d'un nouveau guide pour ce conflit iranien",
        "summary": "L'adoption de tactiques de drones \"tir et départ\" dans le conflit iranien pourrait prolonger la durée et l'imprévisibilité des opérations militaires. Ce conflit prolongé a des implications pour les investisseurs cherchant à naviguer dans les risques géopolitiques et la volatilité du marché."
      },
      "de": {
        "title": "Drohnenkrieg könnte bedeuten, dass Anleger einen neuen Leitfaden für diesen Iran-Konflikt benötigen",
        "summary": "Die Annahme von \"Schießen und Abhauen\"-Drohnen-Taktiken im Iran-Konflikt könnte die Dauer und Unvorhersehbarkeit von Militäreinsätzen verlängern. Dieser anhaltende Konflikt hat Auswirkungen auf Anleger, die versuchen, geopolitische Risiken und Marktvolatilität zu bewältigen."
      },
      "es": {
        "title": "La guerra de drones podría significar que los inversores necesiten una nueva guía para este conflicto con Irán",
        "summary": "La adopción de tácticas de drones \"disparar y huir\" en el conflicto con Irán podría extender la duración e impredictibilidad de las operaciones militares. Este conflicto prolongado tiene implicaciones para los inversores que buscan navegar riesgos geopolíticos y volatilidad del mercado."
      }
    }
  },
  {
    "title": "My wife’s credit-card payment is three months overdue. As an authorized user, am I in trouble?",
    "slug": "wife-credit-card-payment-overdue-authorized-user",
    "url": "https://www.marketwatch.com/story/my-wifes-credit-card-payment-is-three-months-overdue-as-an-authorized-user-am-i-in-trouble-9094513f?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-28T22:00:00.000Z",
    "summary": "An authorized user on a credit card account may face liability implications when the primary account holder falls behind on payments. Understanding the distinction between authorized user status and primary cardholder responsibility is crucial for financial protection.",
    "content": "“All correspondence regarding the account was sent to my wife’s email.”",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "我妻子的信用卡付款已逾期三个月。作为授权用户，我会有麻烦吗？",
        "summary": "当主要账户持有人逾期付款时，信用卡账户上的授权用户可能面临责任影响。理解授权用户身份和主要持卡人责任之间的区别对财务保护至关重要。"
      },
      "fr": {
        "title": "Le paiement de la carte de crédit de ma femme est en retard de trois mois. En tant qu'utilisateur autorisé, suis-je en ennuis?",
        "summary": "Un utilisateur autorisé sur un compte de carte de crédit peut faire face à des implications de responsabilité lorsque le titulaire du compte principal est en retard dans ses paiements. Comprendre la distinction entre le statut d'utilisateur autorisé et la responsabilité du titulaire de la carte est crucial pour la protection financière."
      },
      "de": {
        "title": "Die Kreditkartenzahlung meiner Frau ist um drei Monate überfällig. Als autorisierter Benutzer bin ich in Schwierigkeiten?",
        "summary": "Ein autorisierter Benutzer auf einem Kreditkartenkonto kann mit Haftungsimplikationen konfrontiert werden, wenn der primäre Kontoinhaber mit Zahlungen in Rückstand gerät. Das Verständnis des Unterschieds zwischen dem Status des autorisierten Benutzers und der Verantwortung des Kreditkarteninhabers ist entscheidend für den finanziellen Schutz."
      },
      "es": {
        "title": "El pago de la tarjeta de crédito de mi esposa está atrasado tres meses. Como usuario autorizado, ¿estoy en problemas?",
        "summary": "Un usuario autorizado en una cuenta de tarjeta de crédito puede enfrentar implicaciones de responsabilidad cuando el titular principal de la cuenta se atrasa en los pagos. Comprender la distinción entre el estado de usuario autorizado y la responsabilidad del titular de la tarjeta es crucial para la protección financiera."
      }
    }
  },
  {
    "title": "‘She spent $1,000 a month on weight-loss drugs’: My son wrecked his finances after meeting his girlfriend. Who’s to blame?",
    "slug": "son-wrecked-finances-girlfriend-weight-loss-drugs",
    "url": "https://www.marketwatch.com/story/his-credit-rating-is-wrecked-my-son-and-his-girlfriend-mingled-their-finances-big-mistake-b5273119?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-28T20:45:00.000Z",
    "summary": "A son's financial troubles stem from high spending on weight-loss drugs by his girlfriend, raising questions about shared financial responsibility in relationships. The situation highlights potential risks of entangled finances between partners without clear boundaries.",
    "content": "“My son is smart — he really is — but he was in love.”",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "\"她每月花1000美元购买减肥药\"：我儿子自从认识女友后经济状况恶化。谁应该负责？",
        "summary": "一个儿子的财务困境源于他女友在减肥药上的高额消费，引发了关于伴侣之间共享财务责任的问题。这种情况突出了合伙人之间没有明确边界的财务缠缚的潜在风险。"
      },
      "fr": {
        "title": "\"Elle a dépensé 1 000 $ par mois en médicaments amaigrissants\" : Mon fils a gâché ses finances après avoir rencontré sa petite amie. Qui est responsable ?",
        "summary": "Les problèmes financiers d'un fils résultent des dépenses élevées de sa petite amie en médicaments amaigrissants, soulevant des questions sur la responsabilité financière partagée dans les relations. La situation met en évidence les risques potentiels des finances entrelacées entre partenaires sans limites claires."
      },
      "de": {
        "title": "\"Sie gab 1.000 Dollar pro Monat für Gewichtsabnahmemittel aus\": Mein Sohn hat seine Finanzen nach dem Treffen seiner Freundin ruiniert. Wer trägt die Schuld?",
        "summary": "Die finanziellen Probleme eines Sohnes stammen aus den hohen Ausgaben seiner Freundin für Gewichtsabnahmemittel, was Fragen zur gemeinsamen finanziellen Verantwortung in Beziehungen aufwirft. Die Situation hebt die potenziellen Risiken von verflochtenen Finanzen zwischen Partnern ohne klare Grenzen hervor."
      },
      "es": {
        "title": "\"Ella gastó $1,000 al mes en medicamentos para perder peso\": Mi hijo arruinó sus finanzas después de conocer a su novia. ¿Quién tiene la culpa?",
        "summary": "Los problemas financieros de un hijo provienen del alto gasto de su novia en medicamentos para perder peso, lo que genera preguntas sobre la responsabilidad financiera compartida en las relaciones. La situación destaca los riesgos potenciales de finanzas entrelazadas entre parejas sin límites claros."
      }
    }
  },
  {
    "title": "‘I won’t take out a loan’: I need $18K in house repairs. Do I take it from my Roth, 401(k) or IRA?",
    "slug": "need-18k-house-repairs-roth-401k-ira",
    "url": "https://www.marketwatch.com/story/i-wont-take-out-a-loan-i-need-18k-in-house-repairs-do-i-take-it-from-my-roth-401-k-or-ira-651f80f1?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-28T20:45:00.000Z",
    "summary": "A homeowner facing a major repair bill must weigh the trade-offs of funding it through retirement accounts rather than loans. Early withdrawal from retirement accounts carries tax penalties and long-term opportunity costs despite the desire to remain debt-free.",
    "content": "“I plan to be debt-free in less than two years.”",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "\"我不会申请贷款\"：我需要1.8万美元进行房屋维修。我应该从罗斯、401(k)还是个人退休账户中取钱吗？",
        "summary": "面临大笔维修费用的房主必须权衡通过退休账户而非贷款进行资金筹措的利弊。从退休账户提前取款会产生税务处罚和长期机会成本，尽管存在避免债务的愿望。"
      },
      "fr": {
        "title": "\"Je ne prendrai pas de prêt\" : J'ai besoin de 18 000 $ pour les réparations de ma maison. Est-ce que je la prends de mon Roth, 401(k) ou IRA ?",
        "summary": "Un propriétaire confronté à une facture de réparation importante doit peser les compromis du financement par le biais de comptes de retraite plutôt que de prêts. Le retrait anticipé des comptes de retraite entraîne des pénalités fiscales et des coûts d'opportunité à long terme malgré le désir de rester sans dette."
      },
      "de": {
        "title": "\"Ich werde keinen Kredit aufnehmen\": Ich brauche 18.000 Dollar für Hausreparaturen. Soll ich es von meinem Roth, 401(k) oder IRA nehmen?",
        "summary": "Ein Hausbesitzer, der einer großen Reparaturrechnung gegenübersteht, muss die Kompromisse zwischen der Finanzierung durch Ruhestandskonten und Krediten abwägen. Vorzeitige Abhebungen von Ruhestandskonten sind mit Steuerbußgeldern und langfristigen Opportunitätskosten verbunden, trotz des Wunsches, schuldenfrei zu bleiben."
      },
      "es": {
        "title": "\"No sacaré un préstamo\": Necesito $18,000 en reparaciones de la casa. ¿Lo tomo de mi Roth, 401(k) o IRA?",
        "summary": "Un propietario que enfrenta una factura de reparación importante debe sopesar los compromisos de financiar a través de cuentas de jubilación en lugar de préstamos. El retiro anticipado de cuentas de jubilación conlleva multas fiscales y costos de oportunidad a largo plazo a pesar del deseo de mantenerse sin deudas."
      }
    }
  },
  {
    "title": "‘I dread the snow’: My heating and air conditioning always breaks down. Do I spend $15,000 on a new one?",
    "slug": "heating-air-conditioning-breaks-spend-15000",
    "url": "https://www.marketwatch.com/story/i-dread-the-snow-my-heating-and-air-conditioning-always-breaks-down-do-i-spend-15k-on-a-new-one-e4cbf07e?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-28T20:27:00.000Z",
    "summary": "A homeowner grappling with recurring HVAC failures must determine whether replacing a system or continuing repairs is economically prudent. Cost-benefit analysis comparing replacement expenses against cumulative repair costs is essential for informed decision-making.",
    "content": "“Is there a formula or method for figuring out when replacement becomes more cost-effective than ongoing repairs?”",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "\"我害怕下雪\"：我的供暖和空调总是出故障。我应该花1.5万美元买一个新的吗？",
        "summary": "一个房主在反复的暖通空调故障中苦恼，必须确定更换系统还是继续维修在经济上更为明智。比较更换费用与累计维修成本的成本效益分析对于做出明智决策至关重要。"
      },
      "fr": {
        "title": "\"Je redoute la neige\" : Mon système de chauffage et de climatisation tombe toujours en panne. Est-ce que je dépense 15 000 $ pour un nouveau ?",
        "summary": "Un propriétaire aux prises avec des pannes récurrentes du système CVC doit déterminer si le remplacement d'un système ou la poursuite des réparations est économiquement prudent. L'analyse coûts-avantages comparant les frais de remplacement aux coûts cumulatifs des réparations est essentielle pour une prise de décision éclairée."
      },
      "de": {
        "title": "\"Ich fürchte den Schneefall\": Meine Heizungs- und Klimaanlage fällt ständig aus. Soll ich 15.000 Dollar für eine neue ausgeben?",
        "summary": "Ein Hausbesitzer, der mit wiederkehrenden Ausfällen des HVAC-Systems zu kämpfen hat, muss bestimmen, ob der Austausch eines Systems oder die Fortsetzung von Reparaturen wirtschaftlich sinnvoll ist. Eine Kosten-Nutzen-Analyse zum Vergleich von Austauschkosten und kumulativen Reparaturkosten ist für eine fundierte Entscheidungsfindung unerlässlich."
      },
      "es": {
        "title": "\"Temo a la nieve\": Mi calefacción y aire acondicionado siempre se descomponen. ¿Gasto $15,000 en uno nuevo?",
        "summary": "Un propietario que lucha contra fallas recurrentes del sistema HVAC debe determinar si reemplazar un sistema o continuar con reparaciones es económicamente prudente. El análisis de costo-beneficio que compara los gastos de reemplazo con los costos acumulados de reparación es esencial para tomar decisiones informadas."
      }
    }
  },
  {
    "title": "The U.S.-Israel attack on Iran will wreak havoc on international air travel",
    "slug": "us-israel-attack-iran-international-air-travel",
    "url": "https://www.marketwatch.com/story/middle-eastern-airports-are-crossroads-of-the-world-heres-how-the-u-s-israel-attack-on-iran-will-sow-chaos-on-air-travel-3f34465d?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-28T19:50:00.000Z",
    "summary": "Military action against Iran threatens to disrupt major international aviation hubs in the Middle East, particularly Dubai and Doha. Such disruptions could strand passengers and strain global air travel networks that depend on Middle Eastern connectivity.",
    "content": "Dubai and Doha airports are among the largest international hubs for air travel.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "美以攻击伊朗将对国际航空旅行造成严重破坏",
        "summary": "对伊朗的军事行动威胁要扰乱中东主要国际航空枢纽，特别是迪拜和多哈。这样的破坏可能会滞留乘客并使依赖中东连接的全球航空旅行网络紧张。"
      },
      "fr": {
        "title": "L'attaque américano-israélienne contre l'Iran causera des ravages sur les voyages aériens internationaux",
        "summary": "Les actions militaires contre l'Iran menacent de perturber les principaux centres aériens internationaux du Moyen-Orient, en particulier Dubaï et Doha. De telles perturbations pourraient immobiliser les passagers et surcharger les réseaux de transport aérien mondiaux qui dépendent de la connectivité du Moyen-Orient."
      },
      "de": {
        "title": "Der US-israelische Angriff auf den Iran wird den internationalen Flugverkehr in Chaos versetzen",
        "summary": "Militärische Maßnahmen gegen den Iran drohen, die wichtigsten internationalen Luftfahrtdrehkreuze im Nahen Osten zu unterbrechen, insbesondere Dubai und Doha. Solche Unterbrechungen könnten Passagiere stranden lassen und globale Luftverkehrsnetze überlasten, die von der Konnektivität des Nahen Ostens abhängen."
      },
      "es": {
        "title": "El ataque estadounidense-israelí a Irán causará estragos en los viajes aéreos internacionales",
        "summary": "Las acciones militares contra Irán amenazan con perturbar los principales centros de aviación internacional de Oriente Medio, particularmente Dubái y Doha. Tales perturbaciones podrían dejar varados a los pasajeros y sobrecargar las redes de transporte aéreo mundial que dependen de la conectividad de Oriente Medio."
      }
    }
  },
  {
    "title": "Iran live updates: U.S. and Israel launch strikes, Trump dubs attack 'Operation Epic Fury'",
    "slug": "iran-us-israel-strikes-operation-epic-fury",
    "url": "https://www.cnbc.com/2026/02/28/trump-iran-strikes-live-updates.html",
    "source": "CNBC",
    "date": "2026-02-28T18:05:32.000Z",
    "summary": "Iran retaliated to U.S. and Israeli strikes with attacks across the Middle East, causing significant travel disruptions in the region. This escalation marks a major geopolitical development with immediate regional and economic consequences.",
    "content": "Iran retaliated with strikes across the Middle East. Travel across the region is disrupted.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "伊朗实时更新：美国和以色列发动罢工，特朗普称攻击为\"史诗般的愤怒行动\"",
        "summary": "伊朗对美国和以色列的罢工进行了报复，在中东地区发动了攻击，造成该地区重大旅行中断。这一升级标志着重大地缘政治发展，具有直接的区域和经济后果。"
      },
      "fr": {
        "title": "Iran mises à jour en direct : États-Unis et Israël lancent des frappes, Trump qualifie l'attaque d'« Opération Fureur Épique »",
        "summary": "L'Iran a riposté aux frappes américaines et israéliennes par des attaques à travers le Moyen-Orient, causant des perturbations importantes des voyages dans la région. Cette escalade marque un développement géopolitique majeur avec des conséquences régionales et économiques immédiates."
      },
      "de": {
        "title": "Iran Live-Updates: USA und Israel starten Anschläge, Trump nennt Angriff „Operation Epic Fury\"",
        "summary": "Der Iran vergalt US- und israelische Anschläge mit Angriffen im Nahen Osten und verursachte erhebliche Reisestörungen in der Region. Diese Eskalation markiert eine große geopolitische Entwicklung mit unmittelbaren regionalen und wirtschaftlichen Folgen."
      },
      "es": {
        "title": "Actualizaciones en vivo de Irán: EE. UU. e Israel lanzan ataques, Trump denomina el ataque como « Operación Furia Épica »",
        "summary": "Irán represalió los ataques estadounidenses e israelíes con ataques en todo el Oriente Medio, causando importantes interrupciones en los viajes en la región. Esta escalada marca un importante desarrollo geopolítico con consecuencias regionales y económicas inmediatas."
      }
    }
  },
  {
    "title": "Anthropic's Claude hits No. 2 on Apple's top free apps list after Pentagon rejection",
    "slug": "anthropic-claude-no-2-apple-free-apps",
    "url": "https://www.cnbc.com/2026/02/28/anthropics-claude-apple-apps.html",
    "source": "CNBC",
    "date": "2026-02-28T17:20:22.000Z",
    "summary": "Anthropic's Claude AI assistant has climbed to the No. 2 position on Apple's top free apps list, demonstrating growing market adoption despite not winning Pentagon contracts. The ranking shows Claude is gaining significant traction against OpenAI's ChatGPT.",
    "content": "OpenAI's ChatGPT remains the top free app in the U.S. on Apple's rankings, but Claude has steadily gained traction.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Anthropic的Claude在五角大楼拒绝后跃升为苹果免费应用排行榜第2位",
        "summary": "Anthropic的Claude AI助手跃升至苹果免费应用排行榜第2位，尽管未获得五角大楼合约，但展示了市场采用率的增长。该排名显示Claude正在对OpenAI的ChatGPT获得显著的市场份额。"
      },
      "fr": {
        "title": "Claude d'Anthropic atteint la 2e place sur la liste des applications gratuites les plus populaires d'Apple après le rejet du Pentagone",
        "summary": "L'assistant Claude d'Anthropic a grimpé à la 2e position de la liste des applications gratuites les plus populaires d'Apple, démontrant une adoption croissante du marché malgré le fait de ne pas remporter les contrats du Pentagone. Le classement montre que Claude gagne une traction significative contre ChatGPT d'OpenAI."
      },
      "de": {
        "title": "Anthropic Claude steigt nach Pentagon-Ablehnung auf Platz 2 in Apples Liste der besten kostenlosen Apps auf",
        "summary": "Der Claude-KI-Assistent von Anthropic ist auf Platz 2 der Liste der besten kostenlosen Apps von Apple aufgestiegen und zeigt trotz fehlender Pentagon-Verträge eine wachsende Marktakzeptanz. Das Ranking zeigt, dass Claude gegen ChatGPT von OpenAI erhebliche Fortschritte macht."
      },
      "es": {
        "title": "Claude de Anthropic llega al número 2 en la lista de aplicaciones gratuitas más populares de Apple después del rechazo del Pentágono",
        "summary": "El asistente Claude de Anthropic ha ascendido a la posición número 2 en la lista de aplicaciones gratuitas más populares de Apple, demostrando una adopción creciente del mercado a pesar de no ganar contratos del Pentágono. La clasificación muestra que Claude está ganando una tracción significativa contra ChatGPT de OpenAI."
      }
    }
  },
  {
    "title": "3 themes that drove Wall Street's wild week and the new U.S.-Iran conflict wildcard",
    "slug": "wall-street-ai-adoption-us-iran-conflict",
    "url": "https://www.cnbc.com/2026/02/28/3-themes-that-drove-wall-streets-wild-week-and-the-new-us-iran-conflict-wildcard.html",
    "source": "CNBC",
    "date": "2026-02-28T16:36:18.000Z",
    "summary": "Wall Street faced volatility last week as investors grappled with the market impact of AI adoption across sectors. The U.S. and Israeli strikes on Iran now introduce significant geopolitical uncertainty for markets moving forward.",
    "content": "Investors last week wrestled with the impact of AI adoption on various sectors and the overall economy. This coming week is a wildcard after the U.S. and Israel attacked Iran.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "推动华尔街疯狂一周的3个主题以及新的美国-伊朗冲突通配符",
        "summary": "华尔街上周面临波动，投资者在努力应对人工智能在各个行业采用所带来的市场影响。美国和以色列对伊朗的罢工现在为市场带来了重大的地缘政治不确定性。"
      },
      "fr": {
        "title": "3 thèmes qui ont façonné la semaine tumultueuse de Wall Street et le nouveau joker du conflit États-Unis-Iran",
        "summary": "Wall Street a connu une volatilité la semaine dernière alors que les investisseurs géraient l'impact du marché de l'adoption de l'IA dans tous les secteurs. Les frappes américaines et israéliennes sur l'Iran introduisent maintenant une incertitude géopolitique importante pour les marchés à l'avenir."
      },
      "de": {
        "title": "3 Themen, die die wilde Woche an der Wall Street vorangetrieben haben, und der neue USA-Iran-Konflikt-Wildcard",
        "summary": "Die Wall Street war in der letzten Woche mit Volatilität konfrontiert, da Investoren die Marktauswirkungen der KI-Adoption in allen Sektoren bewältigen. Die US- und israelischen Anschläge auf den Iran führen nun erhebliche geopolitische Unsicherheit für die Märkte mit sich."
      },
      "es": {
        "title": "3 temas que impulsaron la semana salvaje de Wall Street y el nuevo comodín del conflicto entre EE. UU. e Irán",
        "summary": "Wall Street enfrentó volatilidad la semana pasada mientras los inversores lidiaban con el impacto en el mercado de la adopción de IA en todos los sectores. Los ataques estadounidenses e israelíes a Irán ahora introducen una incertidumbre geopolítica significativa para los mercados en el futuro."
      }
    }
  },
  {
    "title": "Is it OK to wear pajamas on your next flight? A viral post sparks debate.",
    "slug": "pajamas-flight-viral-post-debate",
    "url": "https://www.marketwatch.com/story/is-it-ok-to-wear-pajamas-on-your-next-flight-a-viral-post-sparks-debate-29bad4de?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-28T16:33:00.000Z",
    "summary": "Tampa International Airport's tongue-in-cheek social media post proposing a ban on pajamas on flights went viral, sparking debate among travelers about airport fashion norms. The humorous take reflects broader conversations about casual travel attire.",
    "content": "Tampa International Airport issued a mock ban on sleepwear. Plenty of comments soon followed.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "在你的下一次飞行中穿睡衣可以吗?一篇病毒式帖子引发了辩论。",
        "summary": "坦帕国际机场发表了一篇带有讽刺意味的社交媒体帖子,提议禁止乘客穿睡衣乘飞机,这篇帖子在网上疯传,在旅客中引发了关于机场服装规范的辩论。这个幽默的观点反映了人们对休闲旅行装的更广泛讨论。"
      },
      "fr": {
        "title": "Est-ce acceptable de porter un pyjama lors de votre prochain vol? Un message viral suscite le débat.",
        "summary": "Le post ironique des aéroports internationaux de Tampa proposant une interdiction du pyjama dans les avions est devenu viral, suscitant un débat parmi les voyageurs sur les normes vestimentaires aux aéroports. Ce ton humoristique reflète des conversations plus larges sur la tenue de voyage décontractée."
      },
      "de": {
        "title": "Ist es in Ordnung, einen Pyjama auf Ihrem nächsten Flug zu tragen? Ein viraler Beitrag löst eine Debatte aus.",
        "summary": "Ein bissig-humorvoller Social-Media-Beitrag des Tampa International Airport, der ein Verbot von Pyjamas in Flugzeugen vorschlägt, wurde viral und löste unter Reisenden eine Debatte über Flughafenmodennormen aus. Der humorvolle Ton spiegelt breitere Gespräche über ungezwungene Reisekleidung wider."
      },
      "es": {
        "title": "¿Es aceptable usar pijama en tu próximo vuelo? Un mensaje viral desata el debate.",
        "summary": "Un mensaje irónico del Aeropuerto Internacional de Tampa proponiendo una prohibición de pijamas en vuelos se hizo viral, desatando un debate entre los viajeros sobre las normas de moda en los aeropuertos. Este tono humorístico refleja conversaciones más amplias sobre la ropa de viaje casual."
      }
    }
  },
  {
    "title": "Berkshire Hathaway shrinks cash pile in Buffett’s last act as CEO. Here’s how successor Greg Abel is now looking to spend.",
    "slug": "berkshire-hathaway-cash-pile-greg-abel",
    "url": "https://www.marketwatch.com/story/berkshire-hathaway-shrinks-cash-pile-in-buffetts-last-act-as-ceo-heres-how-successor-greg-abel-is-now-looking-to-spend-477eeaf3?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-28T16:06:00.000Z",
    "summary": "Berkshire Hathaway's cash reserves fell 2.1% to $373.3 billion by year-end 2025 as Warren Buffett's tenure as CEO concluded. Successor Greg Abel is now positioning the company to deploy capital more actively.",
    "content": "Company’s cash hoard at end of 2025 — which Abel noted was not a sign of an investment retreat — was down 2.1% from September to $373.3 billion.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "伯克希尔哈撒韦公司在巴菲特最后一次CEO行动中缩减现金储备。继任者格雷格·阿贝尔现在打算如何支出。",
        "summary": "伯克希尔哈撒韦公司的现金储备在2025年末下降了2.1%,降至3333亿美元,因为沃伦·巴菲特的首席执行官任期已经结束。继任者格雷格·阿贝尔现在正在寻求更积极地部署资本。"
      },
      "fr": {
        "title": "Berkshire Hathaway réduit ses réserves de trésorerie lors du dernier acte de Buffett en tant que PDG. Voici comment le successeur Greg Abel envisage maintenant de dépenser.",
        "summary": "Les réserves de trésorerie de Berkshire Hathaway ont baissé de 2,1% à 373,3 milliards de dollars à la fin de l'année 2025, alors que le mandat de Warren Buffett en tant que PDG a pris fin. Le successeur Greg Abel positionne maintenant l'entreprise pour déployer le capital de manière plus active."
      },
      "de": {
        "title": "Berkshire Hathaway reduziert Kassenbestände in Buffetts letztem Akt als CEO. So plant Nachfolger Greg Abel jetzt auszugeben.",
        "summary": "Berkshire Hathaways Kassenreserven sanken um 2,1% auf 373,3 Milliarden Dollar zum Ende des Jahres 2025, da Warren Buffetts Amtszeit als CEO endete. Nachfolger Greg Abel positioniert das Unternehmen nun, um Kapital aktiver einzusetzen."
      },
      "es": {
        "title": "Berkshire Hathaway reduce su pila de efectivo en el último acto de Buffett como CEO. Así es cómo el sucesor Greg Abel ahora planea gastar.",
        "summary": "Las reservas de efectivo de Berkshire Hathaway cayeron un 2,1% a 373.300 millones de dólares a finales de 2025 cuando concluyó el mandato de Warren Buffett como CEO. El sucesor Greg Abel ahora está posicionando la empresa para desplegar capital de manera más activa."
      }
    }
  },
  {
    "title": "Her accountant went to prison. Now the IRS is coming after her for $328,000.",
    "slug": "accountant-prison-irs-tax-liability",
    "url": "https://www.marketwatch.com/story/her-accountant-went-to-prison-now-the-irs-is-coming-after-her-for-328-000-56e9ba11?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-28T16:03:00.000Z",
    "summary": "A woman faces $328,000 in back taxes and penalties despite not intentionally evading taxes, as the IRS holds her liable for fraudulent actions her accountant committed since 1993. The case highlights the personal liability risks of hiring unscrupulous tax professionals.",
    "content": "She didn’t intend to evade taxes when she hired the accountant in 1993, but she’s still on the hook for his actions.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "她的会计师入狱了。现在国税局要求她支付328,000美元。",
        "summary": "一名妇女面临328,000美元的欠税和罚款,尽管她没有故意逃税,但国税局认为她对会计师从1993年以来犯下的欺诈行为负责。这个案例突出了雇用不诚实税务专业人士的个人责任风险。"
      },
      "fr": {
        "title": "Son comptable a été emprisonné. Maintenant, l'IRS la poursuit pour 328 000 dollars.",
        "summary": "Une femme fait face à 328 000 dollars d'arriérés d'impôts et de pénalités malgré l'absence d'évasion fiscale intentionnelle, car l'IRS la tient responsable des actions frauduleuses commises par son comptable depuis 1993. L'affaire souligne les risques de responsabilité personnelle liés à l'embauche de professionnels fiscaux malhonnêtes."
      },
      "de": {
        "title": "Ihr Buchhalter ist ins Gefängnis gegangen. Jetzt verlangt das IRS 328.000 Dollar von ihr.",
        "summary": "Eine Frau sieht sich Rückzahlungen von Steuern und Strafen in Höhe von 328.000 Dollar gegenüber, obwohl sie Steuern nicht absichtlich hinterzogen hat, da das IRS sie für betrügerische Handlungen ihres Buchhalters seit 1993 haftbar macht. Der Fall verdeutlicht die persönlichen Haftungsrisiken bei der Einstellung unredlicher Steuerexperten."
      },
      "es": {
        "title": "Su contador fue a la cárcel. Ahora el IRS le está cobrando $328,000.",
        "summary": "Una mujer enfrenta $328,000 en impuestos atrasados y multas a pesar de no evadir impuestos intencionalmente, ya que el IRS la responsabiliza de acciones fraudulentas que su contador cometió desde 1993. El caso resalta los riesgos de responsabilidad personal de contratar a profesionales fiscales sin escrúpulos."
      }
    }
  },
  {
    "title": "Stanley Druckenmiller says this is how he’d build a portfolio from scratch right now",
    "slug": "stanley-druckenmiller-portfolio-strategy-ai",
    "url": "https://www.marketwatch.com/story/stanley-druckenmiller-says-this-is-how-hed-build-a-portfolio-from-scratch-right-now-98c23d33?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-28T15:38:00.000Z",
    "summary": "Legendary investor Stanley Druckenmiller has shifted his portfolio strategy, moving away from AI-heavy positioning despite its previous market dominance. His approach reflects evolving views among top investors on sector valuations and opportunities.",
    "content": "The legendary investor says he’s been shifting his investment focus and AI is no longer playing a starring role.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "斯坦利·德鲁肯米勒谈如何从零开始构建投资组合",
        "summary": "传奇投资者斯坦利·德鲁肯米勒已改变了投资组合策略，尽管AI策略曾主导市场，但他正在远离重仓AI。他的方法反映了顶级投资者对行业估值和机会的不断演变的看法。"
      },
      "fr": {
        "title": "Stanley Druckenmiller explique comment il construirait un portefeuille à partir de zéro dès maintenant",
        "summary": "L'investisseur légendaire Stanley Druckenmiller a changé sa stratégie de portefeuille, s'éloignant du positionnement lourd en IA malgré sa domination antérieure du marché. Son approche reflète l'évolution des points de vue des meilleurs investisseurs sur les valorisations sectorielles et les opportunités."
      },
      "de": {
        "title": "Stanley Druckenmiller erklärt, wie er jetzt ein Portfolio von Grund auf aufbauen würde",
        "summary": "Der legendäre Investor Stanley Druckenmiller hat seine Portfoliostrategie verschoben und sich vom KI-lastigen Positioning abgewandt, obwohl dieses zuvor die Marktdominanz hatte. Sein Ansatz spiegelt die sich entwickelnden Ansichten führender Investoren zu Sektorbewertungen und Möglichkeiten wider."
      },
      "es": {
        "title": "Stanley Druckenmiller explica cómo construiría una cartera desde cero en estos momentos",
        "summary": "El inversor legendario Stanley Druckenmiller ha cambiado su estrategia de cartera, alejándose del posicionamiento pesado en IA a pesar de su dominio anterior del mercado. Su enfoque refleja los puntos de vista en evolución de los principales inversores sobre valoraciones sectoriales y oportunidades."
      }
    }
  },
  {
    "title": "‘I have a legal and a moral question’: My dad left when I was 9, reconnected with me in my 50s and now needs money. What do I owe him?",
    "slug": "estranged-father-reconnects-financial-help",
    "url": "https://www.marketwatch.com/story/i-have-a-legal-and-a-moral-question-my-dad-left-when-i-was-9-reconnected-with-me-in-my-50s-and-now-needs-money-what-do-i-owe-him-ca780520?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-28T15:30:00.000Z",
    "summary": "A woman seeks advice after her estranged father, who abandoned her as a child to avoid child support, reconnected decades later asking for financial help. The dilemma raises questions about family obligation versus past parental negligence.",
    "content": "“After the divorce was finalized, he and his partner moved out of state to a place where there would be no child-support enforcement.”",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "'我有法律和道德上的疑问'：我爸爸在我9岁时离开，在我50多岁时重新联系我，现在需要钱。我欠他什么？",
        "summary": "一位女性在她疏远的父亲与她重新联系后寻求建议，这位父亲曾因逃避赡养费而在她童年时抛弃了她，现在请求经济帮助。这个两难局面引发了关于家庭义务与过去父母疏忽的问题。"
      },
      "fr": {
        "title": "'J'ai une question légale et morale' : Mon père m'a abandonnée à 9 ans, a repris contact avec moi à 50 ans et a maintenant besoin d'argent. Que lui dois-je ?",
        "summary": "Une femme demande conseil après que son père adoptif, qui l'a abandonnée enfant pour éviter de payer une pension alimentaire, ait repris contact des décennies plus tard en demandant une aide financière. Le dilemme soulève des questions sur l'obligation familiale par rapport à la négligence parentale passée."
      },
      "de": {
        "title": "'Ich habe eine rechtliche und moralische Frage': Mein Vater verließ mich mit 9 Jahren, nahm Kontakt mit mir in meinen 50ern auf und braucht jetzt Geld. Was schulde ich ihm?",
        "summary": "Eine Frau sucht Rat, nachdem ihr entfremdeter Vater, der sie als Kind verließ, um Unterhalt zu vermeiden, Jahrzehnte später wieder Kontakt aufnahm und um finanzielle Hilfe bat. Das Dilemma wirft Fragen zur Familienverpflichtung gegenüber früherer elterlicher Vernachlässigung auf."
      },
      "es": {
        "title": "'Tengo una pregunta legal y moral': Mi padre se fue cuando tenía 9 años, volvió a conectar conmigo en mis 50s y ahora necesita dinero. ¿Qué le debo?",
        "summary": "Una mujer busca consejo después de que su padre distanciado, quien la abandonó de niña para evitar la manutención de los hijos, se reconectara décadas después pidiendo ayuda financiera. El dilema plantea preguntas sobre la obligación familiar versus la negligencia parental pasada."
      }
    }
  },
  {
    "title": "Berkshire Hathaway operating earnings fell nearly 30% in Warren Buffett's final quarter as CEO",
    "slug": "berkshire-hathaway-earnings-fall-buffett-final",
    "url": "https://www.cnbc.com/2026/02/28/berkshire-hathaway-brka-q4-2025-earnings.html",
    "source": "CNBC",
    "date": "2026-02-28T15:04:18.000Z",
    "summary": "Berkshire Hathaway's operating earnings declined nearly 30% in the final quarter of 2025 under Warren Buffett's leadership. The significant drop marks the end of an era for the investment giant as Greg Abel takes over.",
    "content": "Berkshire Hathaway reported fourth-quarter and full-year 2025 earnings on Saturday.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "伯克希尔·哈撒韦公司在沃伦·巴菲特最后一个季度作为首席执行官期间运营收益下降近30%",
        "summary": "伯克希尔·哈撒韦公司在2025年最后一个季度在沃伦·巴菲特的领导下运营收益下降近30%。这个显著的下降标志着这家投资巨头的一个时代的终结，因为格雷格·阿贝尔接任。"
      },
      "fr": {
        "title": "Les bénéfices d'exploitation de Berkshire Hathaway ont chuté de près de 30% au dernier trimestre de Warren Buffett en tant que PDG",
        "summary": "Les bénéfices d'exploitation de Berkshire Hathaway ont diminué de près de 30% au dernier trimestre de 2025 sous la direction de Warren Buffett. Cette baisse importante marque la fin d'une ère pour le géant de l'investissement alors que Greg Abel prend les rênes."
      },
      "de": {
        "title": "Berkshire Hathaways Betriebsergebnis fiel im letzten Quartal von Warren Buffett als CEO um fast 30%",
        "summary": "Die Betriebserträge der Berkshire Hathaway sanken im letzten Quartal 2025 unter Warren Buffetts Führung um fast 30%. Der signifikante Rückgang markiert das Ende einer Ära für den Investmentriesen, während Greg Abel die Führung übernimmt."
      },
      "es": {
        "title": "Las ganancias operacionales de Berkshire Hathaway cayeron casi un 30% en el último trimestre de Warren Buffett como CEO",
        "summary": "Las ganancias operacionales de Berkshire Hathaway disminuyeron casi un 30% en el último trimestre de 2025 bajo el liderazgo de Warren Buffett. La caída significativa marca el final de una era para el gigante de inversiones mientras Greg Abel asume el cargo."
      }
    }
  },
  {
    "title": "'Bigger ramifications than Venezuela': Markets brace for impact after U.S. strikes Iran",
    "slug": "markets-brace-us-strikes-iran-ramifications",
    "url": "https://www.cnbc.com/2026/02/28/markets-brace-for-impact-following-us-military-strikes-against-iran.html",
    "source": "CNBC",
    "date": "2026-02-28T14:47:07.000Z",
    "summary": "Markets are preparing for significant fallout from U.S. strikes on Iran, with investors expecting broader economic impact than previous geopolitical events like the Venezuela campaign. The military escalation poses substantial risks to global oil prices and stability.",
    "content": "Investors are bracing for impact after the U.S.'s attacks on Iran, a move they see as carrying far larger market consequences than the Venezuela campaign.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "\"比委内瑞拉影响更大\":美国袭击伊朗后市场准备迎接冲击",
        "summary": "市场正在为美国对伊朗的袭击造成的重大影响做准备,投资者预期经济影响比以前的地缘政治事件(如委内瑞拉运动)更广泛。军事升级对全球油价和稳定性构成重大风险。"
      },
      "fr": {
        "title": "\"Des ramifications plus importantes que le Venezuela\": Les marchés se préparent à l'impact après les frappes américaines contre l'Iran",
        "summary": "Les marchés se préparent aux retombées importantes des frappes américaines contre l'Iran, les investisseurs s'attendant à un impact économique plus large que les événements géopolitiques précédents comme la campagne du Venezuela. L'escalade militaire pose des risques importants pour les prix du pétrole mondial et la stabilité."
      },
      "de": {
        "title": "\"Größere Auswirkungen als Venezuela\": Märkte bereiten sich auf die Auswirkungen nach US-Angriffen auf den Iran vor",
        "summary": "Die Märkte bereiten sich auf erhebliche Auswirkungen der US-Anschläge auf den Iran vor, wobei Investoren mit breiteren wirtschaftlichen Auswirkungen als bei früheren geopolitischen Ereignissen wie der Venezuela-Kampagne rechnen. Die militärische Eskalation stellt erhebliche Risiken für die globalen Ölpreise und die Stabilität dar."
      },
      "es": {
        "title": "\"Mayores ramificaciones que Venezuela\": Los mercados se preparan para el impacto después de los ataques estadounidenses a Irán",
        "summary": "Los mercados se están preparando para repercusiones significativas de los ataques estadounidenses a Irán, esperando que los inversores tengan un impacto económico más amplio que los eventos geopolíticos anteriores como la campaña de Venezuela. La escalada militar presenta riesgos sustanciales para los precios globales del petróleo y la estabilidad."
      }
    }
  },
  {
    "title": "Berkshire CEO Greg Abel vows to keep Buffett's culture of disciplined investing in first annual letter",
    "slug": "greg-abel-buffett-culture-disciplined-investing",
    "url": "https://www.cnbc.com/2026/02/28/berkshire-ceo-abel-vows-to-keep-buffetts-culture-of-disciplined-investing-in-first-annual-letter.html",
    "source": "CNBC",
    "date": "2026-02-28T14:44:01.000Z",
    "summary": "New Berkshire Hathaway CEO Greg Abel pledged to maintain Warren Buffett's disciplined investing philosophy in his inaugural shareholder letter. The commitment reassures investors about continuity as leadership transitions.",
    "content": "Berkshire Hathaway's Greg Abel released his first annual shareholder letter as chief executive.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "伯克希尔首席执行官格雷格·阿贝尔誓言在首份年度信函中保持巴菲特的纪律投资文化",
        "summary": "新任伯克希尔哈撒韦首席执行官格雷格·阿贝尔在首份股东信函中承诺维持沃伦·巴菲特的纪律性投资哲学。这一承诺在领导层交接之际让投资者对连续性放心。"
      },
      "fr": {
        "title": "Le PDG de Berkshire, Greg Abel, s'engage à maintenir la culture de l'investissement discipliné de Buffett dans sa première lettre annuelle",
        "summary": "Le nouveau PDG de Berkshire Hathaway, Greg Abel, s'est engagé à maintenir la philosophie d'investissement discipliné de Warren Buffett dans sa première lettre aux actionnaires. Cet engagement rassure les investisseurs sur la continuité lors de la transition du leadership."
      },
      "de": {
        "title": "Berkshire-CEO Greg Abel verspricht, Buffetts Kultur des disziplinierten Investierens im ersten Jahresschreiben zu bewahren",
        "summary": "Der neue CEO von Berkshire Hathaway, Greg Abel, versprach, die disziplinierte Anlagephilosophie von Warren Buffett in seinem ersten Brief an die Aktionäre zu bewahren. Das Bekenntnis beruhigt die Anleger bezüglich der Kontinuität beim Führungswechsel."
      },
      "es": {
        "title": "El CEO de Berkshire, Greg Abel, promete mantener la cultura de inversión disciplinada de Buffett en su primera carta anual",
        "summary": "El nuevo CEO de Berkshire Hathaway, Greg Abel, se comprometió a mantener la filosofía de inversión disciplinada de Warren Buffett en su primera carta a los accionistas. El compromiso tranquiliza a los inversores sobre la continuidad mientras se produce la transición de liderazgo."
      }
    }
  },
  {
    "title": "Xiaomi launches flagship smartphone as memory price surge threatens sales",
    "slug": "xiaomi-17-flagship-smartphone-memory-price",
    "url": "https://www.cnbc.com/2026/02/28/xiaomi-17-and-17-ultra-launch-price-specs.html",
    "source": "CNBC",
    "date": "2026-02-28T14:32:04.000Z",
    "summary": "Xiaomi launched its new flagship Xiaomi 17 series with pricing starting at €999, facing headwinds from surging memory chip costs that are pressuring margins across the industry. The pricing strategy aims to balance competitiveness with rising component expenses.",
    "content": "The Xiaomi 17 starts at 999 euros ($1,179) while the Xiaomi 17 Ultra starts at 1,499 euros, with the device priced the same as its predecessor.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "小米推出旗舰智能手机,内存价格飙升威胁销售",
        "summary": "小米推出了新款旗舰小米17系列,起价€999,面临内存芯片成本飙升带来的逆风,这些成本正在压低整个行业的利润。定价策略旨在平衡竞争力与不断上升的元件成本。"
      },
      "fr": {
        "title": "Xiaomi lance un smartphone phare alors que la hausse des prix de la mémoire menace les ventes",
        "summary": "Xiaomi a lancé sa nouvelle série phare Xiaomi 17 avec un prix de départ de 999 €, face aux vents contraires causés par l'augmentation des coûts des puces mémoire qui pèsent sur les marges de l'industrie. La stratégie tarifaire vise à équilibrer la compétitivité avec l'augmentation des dépenses en composants."
      },
      "de": {
        "title": "Xiaomi startet Flagship-Smartphone, da Speicherpreisanstieg den Umsatz gefährdet",
        "summary": "Xiaomi startete seine neue Flagship-Serie Xiaomi 17 mit Startpreisen von 999 €, kämpft mit Gegenwind durch steigende Speicherchip-Kosten, die die Margen in der gesamten Branche belasten. Die Preisgestaltungsstrategie zielt darauf ab, Wettbewerbsfähigkeit mit steigenden Komponentenkosten auszugleichen."
      },
      "es": {
        "title": "Xiaomi lanza smartphone insignia mientras el aumento de precios de memoria amenaza las ventas",
        "summary": "Xiaomi lanzó su nueva serie insignia Xiaomi 17 con precios que comienzan en € 999, enfrentando vientos en contra por el aumento de costos de chips de memoria que están presionando los márgenes en toda la industria. La estrategia de precios tiene como objetivo equilibrar la competitividad con los crecientes gastos de componentes."
      }
    }
  },
  {
    "title": "Worried about the job market or stuck in a toxic workplace? These 2 movies can feel like 'catharsis,' workplace psychologist says",
    "slug": "movies-workplace-anxiety-catharsis",
    "url": "https://www.cnbc.com/2026/02/28/worried-about-the-job-market-or-stuck-in-a-toxic-workplace-these-2-movies-can-feel-like-catharsis.html",
    "source": "CNBC",
    "date": "2026-02-28T14:15:01.000Z",
    "summary": "Two films, \"No Other Choice\" and \"Send Help,\" resonate with workers experiencing desperation and disillusionment in the current job market and toxic workplaces. A workplace psychologist explains how these movies provide cathartic entertainment for an anxious workforce.",
    "content": "\"No Other Choice\" and \"Send Help\" capture the sheer desperation and disillusionment workers and job seekers are feeling right now.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "担心工作市场或困在有毒的工作环境中？这2部电影能让工作心理学家说的那样产生\"宣泄\"效果",
        "summary": "两部电影《别无选择》和《寻求帮助》引起了在当前工作市场和有毒工作环境中经历绝望和幻灭的员工的共鸣。一位工作心理学家解释了这些电影如何为焦虑的劳动力提供宣泄性娱乐。"
      },
      "fr": {
        "title": "Inquiet du marché du travail ou coincé dans un environnement de travail toxique ? Ces 2 films peuvent sembler « cathartiques », selon un psychologue du travail",
        "summary": "Deux films, « No Other Choice » et « Send Help », résonnent auprès des travailleurs qui vivent le désespoir et la désillusion sur le marché du travail actuel et dans des environnements de travail toxiques. Un psychologue du travail explique comment ces films offrent un divertissement cathartique à une main-d'œuvre anxieuse."
      },
      "de": {
        "title": "Besorgt um den Arbeitsmarkt oder in einem toxischen Arbeitsumfeld festgefahren? Diese 2 Filme können „kathartisch\" wirken, sagt ein Arbeitspsychologe",
        "summary": "Zwei Filme, „No Other Choice\" und „Send Help\", sprechen Arbeitnehmer an, die Verzweiflung und Desillusionierung auf dem aktuellen Arbeitsmarkt und in toxischen Arbeitsumgebungen erleben. Ein Arbeitspsychologe erklärt, wie diese Filme einer besorgten Belegschaft kathartische Unterhaltung bieten."
      },
      "es": {
        "title": "¿Preocupado por el mercado laboral o atrapado en un ambiente de trabajo tóxico? Estas 2 películas pueden sentirse como \"catarsis\", dice una psicóloga del trabajo",
        "summary": "Dos películas, \"Sin otras opciones\" y \"Pide ayuda\", resuenan con trabajadores que experimentan desesperación y desilusión en el mercado laboral actual y en ambientes de trabajo tóxicos. Una psicóloga del trabajo explica cómo estas películas proporcionan entretenimiento catártico para una fuerza laboral ansiosa."
      }
    }
  },
  {
    "title": "With free storage at max from Google to Shutterfly to Snap, the price for your memories is rising",
    "slug": "free-cloud-storage-ending-paid-photos",
    "url": "https://www.cnbc.com/2026/02/28/cloud-storage-prices-apple-icloud-google-snap-shutterfly.html",
    "source": "CNBC",
    "date": "2026-02-28T13:30:01.000Z",
    "summary": "Major cloud storage providers including Google and Snapchat are reducing free storage allowances, signaling the end of the free cloud storage era for consumers. With nearly half of Americans storing over 1,000 photos, the shift will force users to pay for storage or manage digital memories more carefully.",
    "content": "With close to half of Americans having over 1,000 photos on phones, the era of free cloud storage is ending. Keeping your memories now comes at a rising cost.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "从谷歌到Shutterfly再到Snap，免费存储已满，您的回忆价格在上升",
        "summary": "包括谷歌和Snapchat在内的主要云存储提供商正在减少免费存储配额，标志着消费者免费云存储时代的结束。由于近一半的美国人存储超过1000张照片，这一转变将迫使用户为存储付费或更仔细地管理数字回忆。"
      },
      "fr": {
        "title": "Avec le stockage gratuit maximal de Google à Shutterfly en passant par Snap, le prix de vos souvenirs augmente",
        "summary": "Les principaux fournisseurs de stockage en nuage, dont Google et Snapchat, réduisent leurs allocations de stockage gratuit, marquant la fin de l'ère du stockage en nuage gratuit pour les consommateurs. Avec près de la moitié des Américains stockant plus de 1 000 photos, ce changement forcera les utilisateurs à payer le stockage ou à gérer plus attentivement leurs souvenirs numériques."
      },
      "de": {
        "title": "Mit maximalem kostenlosem Speicher von Google bis Shutterfly bis Snap steigen die Preise für Ihre Erinnerungen",
        "summary": "Große Cloud-Speicheranbieter wie Google und Snapchat reduzieren ihre kostenlosen Speicheroptionen und signalisieren das Ende des kostenlosen Cloud-Speicher-Zeitalters für Verbraucher. Da fast die Hälfte der Amerikaner über 1.000 Fotos speichert, wird dieser Wandel Benutzer zwingen, für Speicher zu bezahlen oder ihre digitalen Erinnerungen sorgfältiger zu verwalten."
      },
      "es": {
        "title": "Con almacenamiento gratuito máximo de Google a Shutterfly a Snap, el precio de tus recuerdos está subiendo",
        "summary": "Los principales proveedores de almacenamiento en la nube, incluyendo Google y Snapchat, están reduciendo sus asignaciones de almacenamiento gratuito, señalando el fin de la era del almacenamiento en la nube gratuito para los consumidores. Con casi la mitad de los estadounidenses almacenando más de 1.000 fotos, este cambio obligará a los usuarios a pagar por el almacenamiento o administrar más cuidadosamente sus recuerdos digitales."
      }
    }
  },
  {
    "title": "NASA is sending its first Black and first female astronauts to the moon",
    "slug": "nasa-first-black-female-astronauts-moon",
    "url": "https://www.cnbc.com/2026/02/28/nasa-astronauts-moon-artemis.html",
    "source": "CNBC",
    "date": "2026-02-28T13:00:01.000Z",
    "summary": "NASA announced it will send its first Black and first female astronauts to the moon in an upcoming mission, marking humanity's return to the lunar surface after over 50 years. This milestone represents significant progress in diversity within the astronaut corps.",
    "content": "NASA is sending the first Black and first female astronauts to the moon in an upcoming launch, marking the first journey to the moon in over 50 years.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "美国宇航局将派遣其首位黑人和首位女性宇航员前往月球",
        "summary": "美国宇航局宣布将在即将进行的任务中派遣其首位黑人和首位女性宇航员前往月球，标志着人类在50多年后重返月球表面。这一里程碑代表了宇航员队伍中多样性的显著进步。"
      },
      "fr": {
        "title": "La NASA envoie son premier astronaute noir et sa première astronaute femme sur la lune",
        "summary": "La NASA a annoncé qu'elle enverrait son premier astronaute noir et sa première astronaute femme sur la lune lors d'une mission à venir, marquant le retour de l'humanité à la surface lunaire après plus de 50 ans. Cette étape importante représente des progrès significatifs dans la diversité au sein du corps des astronautes."
      },
      "de": {
        "title": "Die NASA sendet ihren ersten schwarzen und ersten weiblichen Astronauten zum Mond",
        "summary": "Die NASA kündigte an, dass sie in einer bevorstehenden Mission ihren ersten schwarzen und ersten weiblichen Astronauten zum Mond schicken wird, was die Rückkehr der Menschheit zur Mondoberfläche nach über 50 Jahren markiert. Dieser Meilenstein stellt bedeutende Fortschritte bei der Vielfalt im Astronautencorps dar."
      },
      "es": {
        "title": "La NASA envía a su primer astronauta negro y su primera astronauta mujer a la luna",
        "summary": "La NASA anunció que enviará a su primer astronauta negro y su primera astronauta mujer a la luna en una próxima misión, marcando el regreso de la humanidad a la superficie lunar después de más de 50 años. Este hito representa un progreso significativo en la diversidad dentro del cuerpo de astronautas."
      }
    }
  },
  {
    "title": "How the 'K-shaped' economy is showing up at two big U.S. gyms",
    "slug": "k-shaped-economy-gyms-life-time-planet-fitness",
    "url": "https://www.cnbc.com/2026/02/28/life-time-planet-fitness-earnings-show-k-shaped-economy.html",
    "source": "CNBC",
    "date": "2026-02-28T13:00:01.000Z",
    "summary": "The diverging performance of premium gym chains like Life Time and budget-focused competitors like Planet Fitness reflects broader economic inequality. These trends illustrate how the K-shaped economy—where wealthy and lower-income consumers move in opposite directions—is reshaping consumer industries.",
    "content": "The outlooks of Life Time and Planet Fitness show the divergence in spending between higher- and lower-income consumers.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "\"K形\"经济如何在两家美国大型健身房中显现",
        "summary": "高端健身房连锁店（如Life Time）和低成本竞争对手（如Planet Fitness）的分化性能反映了更广泛的经济不平等。这些趋势说明了\"K形\"经济——富裕和低收入消费者向相反方向发展——正在重塑消费者行业。"
      },
      "fr": {
        "title": "Comment l'économie en « K » se manifeste dans deux grandes salles de sport américaines",
        "summary": "La divergence de performance des chaînes de gymnases haut de gamme comme Life Time et des concurrents axés sur le budget comme Planet Fitness reflète une inégalité économique plus large. Ces tendances illustrent comment l'économie en forme de K—où les consommateurs riches et à faibles revenus se déplacent dans des directions opposées—façonne les industries de consommation."
      },
      "de": {
        "title": "Wie die „K-förmige\" Wirtschaft in zwei großen US-Fitnessstudios in Erscheinung tritt",
        "summary": "Die unterschiedliche Leistung von Premium-Fitnessstudioketten wie Life Time und budgetorientierten Konkurrenten wie Planet Fitness spiegelt breitere wirtschaftliche Ungleichheit wider. Diese Trends zeigen, wie die K-förmige Wirtschaft – in der wohlhabende und einkommensschwache Verbraucher sich in entgegengesetzte Richtungen bewegen – Verbraucherindustrien umgestaltet."
      },
      "es": {
        "title": "Cómo la economía en \"forma de K\" se muestra en dos grandes gimnasios estadounidenses",
        "summary": "El desempeño divergente de cadenas de gimnasios premium como Life Time y competidores enfocados en presupuesto como Planet Fitness refleja una desigualdad económica más amplia. Estas tendencias ilustran cómo la economía en forma de K—donde los consumidores ricos y de bajos ingresos se mueven en direcciones opuestas—está remodelando las industrias de consumo."
      }
    }
  },
  {
    "title": "AI just leveled up and there are no guardrails anymore",
    "slug": "ai-leveled-up-no-guardrails",
    "url": "https://www.cnbc.com/2026/02/28/ai-selloff-politics-agents.html",
    "source": "CNBC",
    "date": "2026-02-28T13:00:01.000Z",
    "summary": "Recent advances in AI capabilities have outpaced regulatory frameworks and safety measures, contributing to market volatility and political conflict. The rapid pace of AI development is creating challenges for policymakers and investors to keep pace with systemic risks.",
    "content": "CNBC's Deirdre Bosa goes inside the AI-driven market meltdown, the political fight, and the race that's moving faster than anyone can govern.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "AI刚刚升级，现在没有护栏了",
        "summary": "最近的人工智能能力进步超过了监管框架和安全措施，导致市场波动和政治冲突。人工智能发展的快速步伐给政策制定者和投资者跟上系统性风险带来了挑战。"
      },
      "fr": {
        "title": "L'IA vient de monter en puissance et il n'y a plus de garde-fous",
        "summary": "Les progrès récents des capacités de l'IA ont dépassé les cadres réglementaires et les mesures de sécurité, contribuant à la volatilité du marché et aux conflits politiques. Le rythme rapide du développement de l'IA crée des défis pour les décideurs politiques et les investisseurs à suivre les risques systémiques."
      },
      "de": {
        "title": "Die KI ist gerade aufgerüstet und es gibt keine Schutzvorrichtungen mehr",
        "summary": "Aktuelle Fortschritte in den KI-Fähigkeiten haben regulatorische Rahmenwerke und Sicherheitsmaßnahmen übertroffen und tragen zu Marktvolatilität und politischen Konflikten bei. Das schnelle Tempo der KI-Entwicklung schafft Herausforderungen für politische Entscheidungsträger und Investoren, um mit systemischen Risiken Schritt zu halten."
      },
      "es": {
        "title": "La IA acaba de subir de nivel y no hay más barandillas",
        "summary": "Los avances recientes en las capacidades de la IA han superado los marcos regulatorios y las medidas de seguridad, contribuyendo a la volatilidad del mercado y los conflitos políticos. El rápido ritmo del desarrollo de la IA está creando desafíos para los formuladores de políticas e inversores a mantenerse al día con los riesgos sistémicos."
      }
    }
  },
  {
    "title": "Google wants Intrinsic to be 'Android of robotics' as it pushes into physical AI",
    "slug": "google-intrinsic-android-robotics-physical-ai",
    "url": "https://www.cnbc.com/2026/02/28/google-wants-intrinsic-to-be-android-for-robots-moves-into-physical-ai.html",
    "source": "CNBC",
    "date": "2026-02-28T13:00:01.000Z",
    "summary": "Google is consolidating its robotics unit Intrinsic into its main company structure as it pursues a larger role in physical AI and robotics. By modeling its approach after Android's success, Google aims to establish industry standards and capture market share in the emerging robotics sector.",
    "content": "In folding its Intrinsic project into the main company and out of \"Other Bets,\" Google is aiming to mimic its Android strategy for robots.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "谷歌希望Intrinsic成为\"机器人的Android\"，推进实体AI",
        "summary": "谷歌正在将其机器人部门Intrinsic合并到主公司结构中，以追求在物理AI和机器人领域发挥更大作用。通过效仿Android的成功经验，谷歌旨在建立行业标准并在新兴机器人领域夺取市场份额。"
      },
      "fr": {
        "title": "Google veut que l'Intrinsic soit 'l'Android de la robotique' alors qu'il se lance dans l'IA physique",
        "summary": "Google consolide son unité de robotique Intrinsic dans sa structure principale tout en poursuivant un rôle plus important en IA physique et robotique. En modelant son approche après le succès d'Android, Google vise à établir les normes industrielles et à capturer la part de marché dans le secteur émergent de la robotique."
      },
      "de": {
        "title": "Google möchte, dass Intrinsic das \"Android der Robotik\" wird, während es in physische KI vordringt",
        "summary": "Google konsolidiert seine Robotik-Einheit Intrinsic in seine Hauptunternehmensstruktur, während es eine größere Rolle in physischer KI und Robotik anstrebt. Durch Modellierung seines Ansatzes nach dem Erfolg von Android möchte Google Industriestandards etablieren und Marktanteile im aufstrebenden Robotik-Sektor gewinnen."
      },
      "es": {
        "title": "Google quiere que Intrinsic sea el \"Android de la robótica\" mientras avanza en IA física",
        "summary": "Google está consolidando su unidad de robótica Intrinsic en su estructura corporativa principal mientras persigue un papel más importante en IA física y robótica. Al modelar su enfoque según el éxito de Android, Google busca establecer estándares industriales y capturar participación de mercado en el sector emergente de la robótica."
      }
    }
  },
  {
    "title": "Private equity stocks like Apollo are among the most oversold names in the S&P 500",
    "slug": "private-equity-apollo-oversold-sp500",
    "url": "https://www.cnbc.com/2026/02/28/private-equity-stocks-like-apollo-are-among-the-most-oversold-names-in-the-sp-500.html",
    "source": "CNBC",
    "date": "2026-02-28T12:55:25.000Z",
    "summary": "Private equity stocks including Apollo have experienced significant overselling during recent trading, suggesting potential valuation disconnect. Market data indicates divergent momentum between oversold private equity names and overbought technology stocks like Dell.",
    "content": "Private equity firms like Apollo were oversold in the last full week of February, while Dell Technologies was one of the most overbought stocks, per LSEG data.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "私募股权股票（如Apollo）属于标普500中被最严重超卖的股票",
        "summary": "私募股权股票（包括Apollo）在最近的交易中经历了严重的超卖，表明可能存在估值偏差。市场数据显示，被超卖的私募股权股票与被高估的科技股（如戴尔）之间存在不同的动量。"
      },
      "fr": {
        "title": "Les actions de capital-investissement comme Apollo sont parmi les noms les plus survendus du S&P 500",
        "summary": "Les actions de capital-investissement, y compris Apollo, ont connu une surventilation significative lors des récentes transactions, suggérant une déconnexion potentielle des valorisations. Les données de marché indiquent une dynamique divergente entre les noms de capital-investissement survendus et les actions technologiques surévaluées comme Dell."
      },
      "de": {
        "title": "Aktien des Private Equity wie Apollo gehören zu den meistverkauften Namen im S&P 500",
        "summary": "Private-Equity-Aktien, einschließlich Apollo, haben während der jüngsten Handelsaktivitäten eine erhebliche Überverkauftheit erlebt, was auf eine mögliche Bewertungsdiskrepanz hindeutet. Marktdaten deuten auf eine abweichende Dynamik zwischen überverkauften Private-Equity-Namen und überbewerteten Technologieaktien wie Dell hin."
      },
      "es": {
        "title": "Las acciones de capital privado como Apollo se encuentran entre los nombres más vendidos en el S&P 500",
        "summary": "Las acciones de capital privado, incluido Apollo, han experimentado una venta excesiva significativa durante las operaciones recientes, lo que sugiere una posible desconexión de valoración. Los datos de mercado indican un momento divergente entre los nombres de capital privado sobvendidos y las acciones tecnológicas sobrevaluadas como Dell."
      }
    }
  },
  {
    "title": "Morgan Stanley says stocks like Nvidia have more room to run in March",
    "slug": "morgan-stanley-nvidia-room-run-march",
    "url": "https://www.cnbc.com/2026/02/28/buy-stocks-like-nvidia-in-march.html",
    "source": "CNBC",
    "date": "2026-02-28T12:35:20.000Z",
    "summary": "Morgan Stanley analysts believe technology stocks like Nvidia remain undervalued with upside potential heading into March. The firm's positive outlook suggests continued strength in semiconductor and AI-related equities despite recent market volatility.",
    "content": "Morgan Stanley named a host of top ideas that are compelling heading into March.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "摩根士丹利表示，英伟达等股票在3月份有更多上升空间",
        "summary": "摩根士丹利分析师认为，英伟达等科技股仍被低估，在进入3月份时具有上升潜力。该公司的积极前景表明，尽管近期市场波动，半导体和人工智能相关股票将继续保持强劲。"
      },
      "fr": {
        "title": "Morgan Stanley dit que les actions comme Nvidia ont plus de potentiel de hausse en mars",
        "summary": "Les analystes de Morgan Stanley pensent que les actions technologiques comme Nvidia restent sous-évaluées avec un potentiel de hausse en mars. Les perspectives positives de la firme suggèrent une force continue des actions liées aux semi-conducteurs et à l'IA malgré la volatilité récente du marché."
      },
      "de": {
        "title": "Morgan Stanley sagt, dass Aktien wie Nvidia im März noch mehr Spielraum haben",
        "summary": "Morgan Stanley-Analysten glauben, dass Technologieaktien wie Nvidia unterbewertet bleiben und im März Aufwärtspotenzial haben. Der positive Ausblick des Unternehmens deutet auf anhaltende Stärke bei Halbleiter- und KI-bezogenen Aktien hin, trotz der kürzlichen Marktvolatilität."
      },
      "es": {
        "title": "Morgan Stanley dice que acciones como Nvidia tienen más espacio para subir en marzo",
        "summary": "Los analistas de Morgan Stanley creen que las acciones tecnológicas como Nvidia siguen infravaloradas con potencial alcista hacia marzo. La perspectiva positiva de la firma sugiere una fortaleza continua en acciones relacionadas con semiconductores e IA a pesar de la volatilidad reciente del mercado."
      }
    }
  },
  {
    "title": "FourLeaf Credit Union mortgage review 2026",
    "slug": "fourleaf-credit-union-mortgage-review-2026",
    "url": "https://www.cnbc.com/select/fourleaf-credit-union-mortgage-review/",
    "source": "CNBC",
    "date": "2026-02-28T12:04:01.000Z",
    "summary": "FourLeaf Credit Union offers competitive mortgage products with low rates and specialized loan options for borrowers. The credit union's offerings may appeal to members seeking alternative mortgage solutions beyond traditional banks.",
    "content": "FourLeaf Credit Union boasts low rates and several specialty loan products.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "四叶信用联合会抵押贷款评测2026年",
        "summary": "四叶信用联合会提供具有竞争力的抵押产品，利率低且为借款人提供专业贷款选项。该信用联合会的产品可能吸引寻求传统银行之外的替代抵押解决方案的成员。"
      },
      "fr": {
        "title": "Examen des prêts hypothécaires de FourLeaf Credit Union 2026",
        "summary": "FourLeaf Credit Union offre des produits hypothécaires compétitifs avec des taux bas et des options de prêt spécialisées pour les emprunteurs. Les offres de l'union de crédit peuvent attirer les membres qui cherchent des solutions hypothécaires alternatives au-delà des banques traditionnelles."
      },
      "de": {
        "title": "FourLeaf Credit Union Hypotheken-Bewertung 2026",
        "summary": "FourLeaf Credit Union bietet wettbewerbsfähige Hypothekenprodukte mit niedrigen Zinsen und spezialisierte Kreditoptionen für Kreditnehmer. Die Angebote der Kreditgenossenschaft könnten Mitglieder ansprechen, die alternative Hypothekenlösungen über traditionelle Banken hinaus anstreben."
      },
      "es": {
        "title": "Revisión hipotecaria de FourLeaf Credit Union 2026",
        "summary": "FourLeaf Credit Union ofrece productos hipotecarios competitivos con tasas bajas y opciones de préstamos especializadas para prestatarios. Las ofertas de la unión de crédito pueden atraer a miembros que buscan soluciones hipotecarias alternativas más allá de los bancos tradicionales."
      }
    }
  },
  {
    "title": "Any chance the Fed cuts rates this year is ‘evaporating before our very eyes’ as Iran tensions raise oil prices",
    "slug": "fed-cuts-evaporating-iran-oil-prices",
    "url": "https://www.marketwatch.com/story/any-chance-the-fed-cuts-rates-this-year-is-evaporating-before-our-very-eyes-as-iran-tensions-raise-oil-prices-18978691?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-28T12:00:00.000Z",
    "summary": "Rising oil prices driven by Iran tensions are diminishing the case for Federal Reserve interest rate cuts this year. The geopolitical escalation threatens to sustain inflation pressures that previously supported expectations of additional monetary easing.",
    "content": "With oil prices rising in response to growing tensions with Iran, the rationale for additional interest-rate cuts by the Federal Reserve is disappearing.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "美联储降息的可能性正在'我们眼前消失'，随着伊朗紧张局势推高油价",
        "summary": "由伊朗紧张局势驱动的油价上升正在削弱美联储今年降息的理由。地缘政治升级威胁维持之前支持额外货币宽松预期的通胀压力。"
      },
      "fr": {
        "title": "Toute chance de baisse des taux par la Fed cette année 's'évapore sous nos yeux' alors que les tensions avec l'Iran font monter les prix du pétrole",
        "summary": "La hausse des prix du pétrole causée par les tensions avec l'Iran diminue le cas pour les réductions des taux d'intérêt de la Réserve fédérale cette année. L'escalade géopolitique menace de maintenir les pressions inflationnistes qui soutenaient auparavant les attentes d'un assouplissement monétaire supplémentaire."
      },
      "de": {
        "title": "Jede Chance auf Zinssenkungen der Fed dieses Jahr 'verflüchtigt sich vor unseren Augen', da iranische Spannungen die Ölpreise in die Höhe treiben",
        "summary": "Steigende Ölpreise, die durch iranische Spannungen verursacht werden, schwächen den Fall für Zinskürzungen der Federal Reserve in diesem Jahr ab. Die geopolitische Eskalation droht, Inflationsdruck aufrechtzuerhalten, der zuvor Erwartungen zusätzlicher geldpolitischer Lockerung unterstützte."
      },
      "es": {
        "title": "Cualquier posibilidad de que la Fed reduzca las tasas este año se está 'evaporando ante nuestros ojos' a medida que las tensiones con Irán elevan los precios del petróleo",
        "summary": "El aumento de los precios del petróleo impulsado por las tensiones con Irán está disminuyendo el caso para reducciones de las tasas de interés de la Reserva Federal este año. La escalada geopolítica amenaza con mantener las presiones inflacionarias que anteriormente respaldaban las expectativas de mayor flexibilización monetaria."
      }
    }
  },
  {
    "title": "U.S.-Israel launch massive attack on Iran; 4 U.S. military bases hit in retaliation",
    "slug": "us-israel-attack-iran-retaliation",
    "url": "https://www.cnbc.com/2026/02/28/trump-us-military-iran-strikes-middle-east-oil.html",
    "source": "CNBC",
    "date": "2026-02-28T11:47:09.000Z",
    "summary": "The U.S. and Israel launched a major military strike on Iran following Iranian retaliation against four U.S. military bases. President Trump cited Iran's continued pursuit of nuclear weapons despite ongoing diplomatic negotiations.",
    "content": "U.S. President Donald Trump said Iran has continued to pursue nuclear weapons despite ongoing negotiations to end its program.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "美以联合对伊朗进行大规模攻击；美军4个基地在报复中被击中",
        "summary": "美国和以色列在伊朗报复美国四个军事基地后对伊朗进行了一次重大军事打击。特朗普总统引用伊朗尽管持续进行外交谈判但继续追求核武器作为理由。"
      },
      "fr": {
        "title": "Les États-Unis et Israël lancent une attaque massive contre l'Iran ; 4 bases militaires américaines touchées en représailles",
        "summary": "Les États-Unis et Israël ont lancé une frappe militaire majeure contre l'Iran suite aux représailles iraniennes contre quatre bases militaires américaines. Le président Trump a cité la poursuite continue par l'Iran des armes nucléaires malgré les négociations diplomatiques en cours."
      },
      "de": {
        "title": "USA und Israel starten Massenangriff auf Iran; 4 US-Militärstützpunkte bei Vergeltung getroffen",
        "summary": "Die USA und Israel führten einen großen Militärangriff auf Iran durch, nachdem der Iran vier US-Militärstützpunkte angegriffen hatte. Präsident Trump zitierte Irans andauernde Verfolgung von Kernwaffen trotz laufender diplomatischer Verhandlungen."
      },
      "es": {
        "title": "EE.UU. e Israel lanzan ataque masivo contra Irán; 4 bases militares estadounidenses impactadas en represalia",
        "summary": "Estados Unidos e Israel lanzaron un ataque militar importante contra Irán tras las represalias iraníes contra cuatro bases militares estadounidenses. El presidente Trump citó la búsqueda continua de armas nucleares por parte de Irán a pesar de las negociaciones diplomáticas en curso."
      }
    }
  },
  {
    "title": "U.S. strikes on Iran will likely boost defense stocks. Here’s what will keep the cash flowing even after the conflict ends.",
    "slug": "iran-strikes-boost-defense-stocks",
    "url": "https://www.marketwatch.com/story/iran-strikes-will-likely-boost-defense-stocks-but-heres-what-will-keep-the-cash-flowing-long-after-the-conflict-ends-2fa929cf?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-28T10:12:00.000Z",
    "summary": "U.S. military operations against Iran are expected to benefit defense sector stocks significantly. The defense industry's long-term revenue will be sustained by recurring maintenance and software contracts beyond the immediate conflict.",
    "content": "A massive backlog of maintenance and software contracts will ensure recurring revenue.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "美国对伊朗的袭击可能会提振防御类股票。以下是冲突结束后如何保持现金流动。",
        "summary": "美国对伊朗的军事行动预期将显著惠及防御部门股票。防御行业的长期收入将通过超越立即冲突的经常性维护和软件合同得到维持。"
      },
      "fr": {
        "title": "Les frappes américaines contre l'Iran vont probablement dynamiser les actions de défense. Voici ce qui maintiendra les flux de trésorerie même après la fin du conflit.",
        "summary": "Les opérations militaires américaines contre l'Iran devraient bénéficier considérablement aux actions du secteur de la défense. Les revenus à long terme de l'industrie de la défense seront soutenus par des contrats récurrents de maintenance et de logiciels au-delà du conflit immédiat."
      },
      "de": {
        "title": "US-Angriffe auf Iran werden wahrscheinlich Rüstungsaktien ankurbeln. Hier ist, was die Geldflüsse auch nach Ende des Konflikts am Fließen hält.",
        "summary": "US-Militäroperationen gegen den Iran werden voraussichtlich Rüstungssektor-Aktien erheblich begünstigen. Die langfristigen Einnahmen der Rüstungsindustrie werden durch wiederkehrende Wartungs- und Softwareverträge über den unmittelbaren Konflikt hinaus gestützt."
      },
      "es": {
        "title": "Los ataques estadounidenses contra Irán probablemente impulsarán las acciones de defensa. Aquí está lo que mantendrá el flujo de efectivo incluso después del final del conflicto.",
        "summary": "Se espera que las operaciones militares estadounidenses contra Irán beneficien significativamente a las acciones del sector de defensa. Los ingresos a largo plazo de la industria de defensa se sustentarán con contratos recurrentes de mantenimiento y software más allá del conflicto inmediato."
      }
    }
  },
  {
    "title": "The U.S. and Israel attack Iran. Bitcoin and oil offer a glimpse at how markets could react.",
    "slug": "us-israel-iran-markets-bitcoin-oil",
    "url": "https://www.marketwatch.com/story/trump-says-massive-strike-against-iran-underway-bitcoin-plunge-offers-a-glimpse-of-how-markets-could-react-25d9ed1c?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-28T10:08:00.000Z",
    "summary": "Markets are showing mixed reactions to U.S. and Israel's military action against Iran, with Bitcoin declining sharply. Oil prices and cryptocurrency movements signal the geopolitical escalation's broader impact on financial markets.",
    "content": "Bitcoin was tumbling on Saturday after military action was carried out against Iran by the U.S. and Israel.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "美国和以色列攻击伊朗。比特币和石油揭示了市场可能如何反应。",
        "summary": "市场对美国和以色列对伊朗的军事行动反应不一，比特币大幅下跌。油价和加密货币的走势反映了地缘政治升级对金融市场的更广泛影响。"
      },
      "fr": {
        "title": "Les États-Unis et Israël attaquent l'Iran. Le Bitcoin et le pétrole offrent un aperçu de la réaction des marchés.",
        "summary": "Les marchés affichent des réactions mitigées à l'action militaire des États-Unis et d'Israël contre l'Iran, le Bitcoin chutant fortement. Les mouvements des prix du pétrole et des crypto-monnaies signalent l'impact plus large de l'escalade géopolitique sur les marchés financiers."
      },
      "de": {
        "title": "USA und Israel greifen Iran an. Bitcoin und Öl zeigen, wie Märkte reagieren könnten.",
        "summary": "Märkte zeigen gemischte Reaktionen auf die Militäraktion der USA und Israels gegen den Iran, wobei Bitcoin stark fällt. Ölpreise und Kryptowährungsbewegungen signalisieren die breitere Auswirkung der geopolitischen Eskalation auf die Finanzmärkte."
      },
      "es": {
        "title": "Estados Unidos e Israel atacan a Irán. Bitcoin y petróleo ofrecen una visión de cómo podrían reaccionar los mercados.",
        "summary": "Los mercados muestran reacciones mixtas a la acción militar de Estados Unidos e Israel contra Irán, con Bitcoin cayendo bruscamente. Los movimientos de los precios del petróleo y las criptomonedas señalan el impacto más amplio de la escalada geopolítica en los mercados financieros."
      }
    }
  },
  {
    "title": "The third man who links Andrew with Jeffrey Epstein",
    "slug": "third-man-andrew-epstein-david-stern",
    "url": "https://www.bbc.com/news/articles/c98gne0z0rxo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-28T06:00:27.000Z",
    "summary": "David Stern served as a crucial intermediary between Jeffrey Epstein and Prince Andrew for nearly a decade. His role as a key conduit directly links the royal to the controversial financier's network.",
    "content": "For nearly a decade, David Stern acted as a key conduit between Jeffrey Epstein and Andrew Mountbatten-Windsor.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "连接安德鲁与杰弗瑞·爱泼斯坦的第三人",
        "summary": "大卫·斯特恩在近十年间充当杰弗瑞·爱泼斯坦与安德鲁王子之间的关键中介。他作为重要纽带的角色直接将王室成员与这位有争议的金融家的人脉网络相连。"
      },
      "fr": {
        "title": "Le troisième homme qui relie Andrew à Jeffrey Epstein",
        "summary": "David Stern a servi de médiateur crucial entre Jeffrey Epstein et le prince Andrew pendant près d'une décennie. Son rôle en tant que lien clé relie directement le membre de la famille royale au réseau du financier controversé."
      },
      "de": {
        "title": "Der dritte Mann, der Andrew mit Jeffrey Epstein verbindet",
        "summary": "David Stern war fast ein Jahrzehnt lang ein entscheidender Vermittler zwischen Jeffrey Epstein und Prinz Andrew. Seine Rolle als wichtiges Bindeglied verbindet das königliche Familienmitglied direkt mit dem Netzwerk des umstrittenen Finanziers."
      },
      "es": {
        "title": "El tercer hombre que vincula a Andrew con Jeffrey Epstein",
        "summary": "David Stern sirvió como intermediario crucial entre Jeffrey Epstein y el Príncipe Andrew durante casi una década. Su papel como conducto clave vincula directamente al miembro de la realeza con la red del polémico financiero."
      }
    }
  },
  {
    "title": "OpenAI strikes deal with Pentagon, hours after rival Anthropic was blacklisted by Trump",
    "slug": "openai-pentagon-deal-anthropic-blacklisted",
    "url": "https://www.cnbc.com/2026/02/27/openai-strikes-deal-with-pentagon-hours-after-rival-anthropic-was-blacklisted-by-trump.html",
    "source": "CNBC",
    "date": "2026-02-28T04:25:34.000Z",
    "summary": "OpenAI has reached an agreement with the Defense Department to provide its AI models, hours after its rival Anthropic faced blacklisting by the Trump administration. The deal signals growing government interest in deploying commercial AI systems for military applications.",
    "content": "OpenAI CEO Sam Altman said on X that his company has come to terms with the Defense Department for use of its models.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "OpenAI与五角大楼达成协议，竞争对手Anthropic遭特朗普政府列入黑名单仅数小时后",
        "summary": "OpenAI与美国国防部达成协议，为其提供AI模型，此前其竞争对手Anthropic遭特朗普政府列入黑名单仅数小时。该协议表明政府对部署商业AI系统用于军事应用的兴趣日益增长。"
      },
      "fr": {
        "title": "OpenAI conclut un accord avec le Pentagone, quelques heures après que son rival Anthropic ait été mis sur la liste noire par Trump",
        "summary": "OpenAI a conclu un accord avec le Département de la Défense pour fournir ses modèles d'IA, quelques heures après que son rival Anthropic ait été blacklisté par l'administration Trump. L'accord signale un intérêt croissant du gouvernement pour le déploiement de systèmes d'IA commerciaux pour des applications militaires."
      },
      "de": {
        "title": "OpenAI schließt Deal mit Pentagon ab, Stunden nachdem Rivale Anthropic von Trump auf die schwarze Liste gesetzt wurde",
        "summary": "OpenAI hat eine Vereinbarung mit dem Verteidigungsministerium getroffen, um seine KI-Modelle bereitzustellen, nur Stunden nachdem sein Rivale Anthropic von der Trump-Administration auf die schwarze Liste gesetzt wurde. Das Abkommen signalisiert wachsendes staatliches Interesse an der Bereitstellung kommerzieller KI-Systeme für militärische Anwendungen."
      },
      "es": {
        "title": "OpenAI llega a un acuerdo con el Pentágono, horas después de que su rival Anthropic fuera incluido en la lista negra por Trump",
        "summary": "OpenAI ha llegado a un acuerdo con el Departamento de Defensa para proporcionar sus modelos de IA, solo horas después de que su rival Anthropic fuera incluido en la lista negra por la administración Trump. El acuerdo señala un creciente interés gubernamental en desplegar sistemas de IA comerciales para aplicaciones militares."
      }
    }
  },
  {
    "title": "Pentagon-Anthropic AI standoff is real-time testing balance of power in future of warfare",
    "slug": "pentagon-anthropic-ai-warfare",
    "url": "https://www.cnbc.com/2026/02/27/defense-anthropic-ai-war-risks-hegseth-amodei.html",
    "source": "CNBC",
    "date": "2026-02-28T03:51:22.000Z",
    "summary": "A dispute between the Pentagon and Anthropic over military AI deployment highlights a critical power struggle over future warfare capabilities. Trump and Defense Secretary Hegseth's strong response underscores competing interests in military AI control.",
    "content": "The Pentagon clash with Anthropic and Friday's severe response from Trump and Defense Secretary Hegseth highlights a growing war over who controls military AI.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "五角大楼与Anthropic的AI僵局是对未来战争权力平衡的实时测试",
        "summary": "五角大楼与Anthropic之间关于军事AI部署的争议突出了对未来战争能力的关键权力斗争。特朗普和国防部长赫格塞斯的强硬回应强调了对军事AI控制的竞争利益。"
      },
      "fr": {
        "title": "L'impasse IA entre le Pentagone et Anthropic teste l'équilibre des pouvoirs dans la guerre future",
        "summary": "Un différend entre le Pentagone et Anthropic sur le déploiement d'IA militaire met en évidence une lutte de pouvoir critique pour les capacités de guerre futures. La réponse ferme de Trump et du secrétaire à la Défense Hegseth souligne les intérêts concurrents dans le contrôle de l'IA militaire."
      },
      "de": {
        "title": "Pentagon-Anthropic-KI-Pattsituation testet das Machtverhältnis in der zukünftigen Kriegführung",
        "summary": "Ein Streit zwischen dem Pentagon und Anthropic über den Einsatz von Militär-KI verdeutlicht einen kritischen Machtkampf über zukünftige Kriegsfähigkeiten. Die starke Reaktion von Trump und Verteidigungsminister Hegseth unterstreicht konkurrierende Interessen bei der Kontrolle von Militär-KI."
      },
      "es": {
        "title": "El punto muerto de IA entre el Pentágono y Anthropic prueba el equilibrio de poder en la guerra futura",
        "summary": "Una disputa entre el Pentágono y Anthropic sobre el despliegue de IA militar destaca una lucha crítica de poder sobre las capacidades de guerra futura. La respuesta contundente de Trump y del Secretario de Defensa Hegseth subraya intereses en competencia en el control de la IA militar."
      }
    }
  },
  {
    "title": "Rent tops £1,000 a month in more areas - find out where",
    "slug": "rent-tops-1000-month",
    "url": "https://www.bbc.com/news/articles/cx28njn2dwpo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-28T00:14:04.000Z",
    "summary": "Private rental costs have surged significantly over the past five years, with monthly rents now exceeding £1,000 in more areas, though growth may be slowing.",
    "content": "The cost of renting privately has surged in the last five years, but tenants may now see a slowdown.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "租金在更多地区超过1000英镑/月 - 查看具体位置",
        "summary": "过去五年来，私人租赁成本大幅上升，月租金在更多地区已超过1000英镑，但增长可能正在放缓。"
      },
      "fr": {
        "title": "Le loyer dépasse 1000 £ par mois dans plus de régions - découvrez lesquelles",
        "summary": "Les coûts des locations privées ont augmenté considérablement au cours des cinq dernières années, avec des loyers mensuels dépassant maintenant 1000 £ dans plus de régions, bien que la croissance ralentisse peut-être."
      },
      "de": {
        "title": "Miete überschreitet £1.000 pro Monat in mehr Gebieten - finde heraus wo",
        "summary": "Die Kosten für private Mietwohnungen sind in den letzten fünf Jahren erheblich gestiegen, wobei die monatliche Miete nun in mehr Gebieten £1.000 übersteigt, obwohl das Wachstum möglicherweise verlangsamt."
      },
      "es": {
        "title": "El alquiler supera £1.000 por mes en más áreas - descubre dónde",
        "summary": "Los costos de alquiler privado se han disparado significativamente en los últimos cinco años, con rentas mensuales que ahora superan £1.000 en más áreas, aunque el crecimiento puede estar ralentizándose."
      }
    }
  }
]