[
  {
    "title": "Trade Desk’s stock slides as growth slowdown unnerves Wall Street even further",
    "slug": "trades-desk-stock-slides-growth-slowdown",
    "url": "https://www.marketwatch.com/story/trade-desks-stock-slides-as-growth-slowdown-unnerves-wall-street-even-further-9d99e55e?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T00:19:00.000Z",
    "summary": "Trade Desk, an ad-tech provider, saw stock decline as automotive and packaged goods clients face pressure, signaling broader economic slowdown concerns.",
    "content": "The ad-tech provider said automotive and packaged-good clients are under pressure.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Trade Desk股票因增长放缓而下跌，进一步令华尔街感到不安",
        "summary": "广告技术提供商Trade Desk的股票下跌，因汽车和包装商品客户面临压力，预示更广泛的经济放缓担忧。"
      },
      "fr": {
        "title": "Le stock de Trade Desk dégringole alors que le ralentissement de la croissance inquiète davantage Wall Street",
        "summary": "Trade Desk, un fournisseur de technologie publicitaire, a vu son action baisser car ses clients automobiles et de biens d'emballage font face à des pressions, signalant des préoccupations plus larges concernant le ralentissement économique."
      },
      "de": {
        "title": "Trade Desk-Aktie fällt, da Wachstumsverlangsamung Wall Street weiter nervös macht",
        "summary": "Trade Desk, ein Anbieter von Werbetech, verzeichnete einen Aktienkursrückgang, da Automobil- und Verpackungsgüterkunden unter Druck stehen und auf breitere wirtschaftliche Verlangsamungsbedenken hindeuten."
      },
      "es": {
        "title": "Las acciones de Trade Desk se deslizan mientras la desaceleración del crecimiento pone más nerviosa a Wall Street",
        "summary": "Trade Desk, un proveedor de tecnología publicitaria, experimentó una caída de acciones cuando sus clientes de automoción y bienes de consumo envasados enfrentan presión, señalando preocupaciones más amplias sobre una desaceleración económica."
      }
    }
  },
  {
    "title": "Stock futures slip as traders mull over earnings from Nvidia and Salesforce: Live updates",
    "slug": "stock-futures-slip-nvidia-salesforce-earnings",
    "url": "https://www.cnbc.com/2026/02/25/stock-market-today-live-updates.html",
    "source": "CNBC",
    "date": "2026-02-26T00:08:34.000Z",
    "summary": "Stock futures declined as investors awaited earnings reports from Nvidia and Salesforce, following strong gains in the S&P 500 driven by tech sector recovery.",
    "content": "The moves follow an upbeat day for U.S. equities. The S&P 500 notched a second straight day of gains, lifted by a comeback in major tech companies.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "股指期货下跌，交易员权衡Nvidia和Salesforce的收益：实时更新",
        "summary": "随着投资者等待Nvidia和Salesforce的盈利报告，股指期货下跌，这是在由科技板块复苏推动的标普500指数强劲上升之后。"
      },
      "fr": {
        "title": "Les contrats à terme sur indice boursier fléchissent alors que les traders réfléchissent aux résultats de Nvidia et Salesforce : mises à jour en direct",
        "summary": "Les contrats à terme sur indice boursier ont baissé alors que les investisseurs attendaient les rapports de résultats de Nvidia et Salesforce, suite aux gains importants de l'indice S&P 500 tirés par la reprise du secteur technologique."
      },
      "de": {
        "title": "Aktienindex-Futures fallen, während Trader über Ergebnisse von Nvidia und Salesforce nachdenken: Live-Updates",
        "summary": "Aktienindex-Futures sind gefallen, da Investoren auf Gewinnberichte von Nvidia und Salesforce warteten, nach starken Gewinnen des S&P 500, angetrieben durch die Erholung des Technologiesektors."
      },
      "es": {
        "title": "Los futuros bursátiles se deslizan mientras los comerciantes reflexionan sobre las ganancias de Nvidia y Salesforce: Actualizaciones en vivo",
        "summary": "Los futuros bursátiles cayeron mientras los inversores esperaban informes de ganancias de Nvidia y Salesforce, tras fuertes ganancias en el S&P 500 impulsadas por la recuperación del sector tecnológico."
      }
    }
  },
  {
    "title": "Nvidia reports earnings and guidance beat as AI boom pushes data center revenue up 75%",
    "slug": "nvidia-earnings-beat-data-center-revenue-75-percent",
    "url": "https://www.cnbc.com/2026/02/25/nvidia-nvda-earnings-report-q4-2026.html",
    "source": "CNBC",
    "date": "2026-02-26T00:06:54.000Z",
    "summary": "Nvidia exceeded earnings expectations with a 75% increase in data center revenue, continuing its strong 2026 performance as the top tech megacap on Wall Street.",
    "content": "Nvidia has been the best performer on Wall Street this year among tech's megacap companies.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Nvidia报告收益和指导超预期，因AI热潮推动数据中心收入增加75%",
        "summary": "Nvidia以数据中心收入增加75%超越盈利预期，继续其作为华尔街顶级科技巨头的强劲2026年表现。"
      },
      "fr": {
        "title": "Nvidia dépasse les résultats et les prévisions alors que le boom de l'IA pousse les revenus des centres de données à la hausse de 75%",
        "summary": "Nvidia a dépassé les attentes en matière de résultats avec une augmentation de 75% des revenus des centres de données, poursuivant ses excellentes performances en 2026 en tant que plus grande mégacap technologique de Wall Street."
      },
      "de": {
        "title": "Nvidia meldet Gewinne und Prognosen, die Erwartungen übertreffen, da KI-Boom die Datencenter-Einnahmen um 75% erhöht",
        "summary": "Nvidia übertraf die Gewinnerwartungen mit einem Anstieg der Datencenter-Einnahmen um 75% und setzt seine starke Leistung im Jahr 2026 als führende Tech-Megacap an der Wall Street fort."
      },
      "es": {
        "title": "Nvidia reporta ganancias y orientación que superan las expectativas mientras el auge de la IA impulsa los ingresos del centro de datos en un 75%",
        "summary": "Nvidia superó las expectativas de ganancias con un aumento del 75% en los ingresos del centro de datos, continuando su fuerte desempeño en 2026 como la megacap tecnológica líder en Wall Street."
      }
    }
  },
  {
    "title": "The family-owned soda firm that still uses returnable glass bottles",
    "slug": "family-owned-soda-firm-returnable-glass-bottles",
    "url": "https://www.bbc.com/news/articles/cdjm289ye4mo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-26T00:06:33.000Z",
    "summary": "Twig's Beverage, a family-owned soft drinks company, maintains a loyal customer base through its distinctive old-fashioned approach to packaging and sustainability.",
    "content": "Soft drinks company Twig's Beverage has a loyal following for its old-fashioned approach.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "仍然使用可回收玻璃瓶的家族经营汽水公司",
        "summary": "Twig's Beverage是一家家族经营的软饮料公司，通过其独特的复古包装方式和可持续发展方法保持了忠实的客户基础。"
      },
      "fr": {
        "title": "La société de boissons gazeuses familiale qui utilise toujours des bouteilles en verre consignées",
        "summary": "Twig's Beverage, une entreprise de boissons non alcoolisées familiale, maintient une base de clients fidèles grâce à son approche distinctive et rétro de l'emballage et de la durabilité."
      },
      "de": {
        "title": "Das familiengeführte Limonadenunternehmen, das immer noch Mehrwegglasflaschen verwendet",
        "summary": "Twig's Beverage, ein familiengeführtes Erfrischungsgetränkeunternehmen, behält eine treue Kundschaft durch seinen charakteristischen altmodischen Verpackungsansatz und Nachhaltigkeit."
      },
      "es": {
        "title": "La empresa familiar de refrescos que aún utiliza botellas de vidrio retornables",
        "summary": "Twig's Beverage, una empresa familiar de bebidas no alcohólicas, mantiene una base leal de clientes a través de su enfoque distintivo y antiguo para el embalaje y la sostenibilidad."
      }
    }
  },
  {
    "title": "Food banks 'essential' for new generation of students",
    "slug": "food-banks-essential-new-generation-students",
    "url": "https://www.bbc.com/news/articles/cp85jd321p5o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-26T00:05:23.000Z",
    "summary": "Queen's University Belfast reports over 10,500 student visits to its food bank, highlighting rising financial pressures among the new generation of college students.",
    "content": "Queen's University Belfast says there were more than 10,500 visits by students to its food bank in the students' union.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "食物银行对新一代学生至关重要",
        "summary": "贝尔法斯特女王大学报告其食物银行接待超过10,500名学生，突出了新一代大学生面临的财务压力上升。"
      },
      "fr": {
        "title": "Les banques alimentaires sont 'essentielles' pour la nouvelle génération d'étudiants",
        "summary": "L'université Queen's de Belfast signale plus de 10 500 visites d'étudiants à sa banque alimentaire, soulignant les pressions financières croissantes chez la nouvelle génération d'étudiants."
      },
      "de": {
        "title": "Lebensmittelbanken sind \"essentiell\" für eine neue Generation von Studenten",
        "summary": "Die Queen's University Belfast berichtet über 10.500 Besuche von Studierenden in ihrer Lebensmittelbank und hebt den wachsenden finanziellen Druck auf die neue Studentengeneration hervor."
      },
      "es": {
        "title": "Los bancos de alimentos son 'esenciales' para la nueva generación de estudiantes",
        "summary": "La Universidad Queen's de Belfast reporta más de 10,500 visitas de estudiantes a su banco de alimentos, destacando las crecientes presiones financieras entre la nueva generación de estudiantes universitarios."
      }
    }
  },
  {
    "title": "Aldi shop staff to receive two pay rises this year",
    "slug": "aldi-shop-staff-two-pay-rises-year",
    "url": "https://www.bbc.com/news/articles/cwygr3p3e8go?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-26T00:02:16.000Z",
    "summary": "German budget supermarket Aldi is increasing staff wages with two annual pay rises, strengthening its competitive position in the British retail market.",
    "content": "The German budget supermarket is a growing competitor among British supermarkets",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Aldi商店员工今年将获得两次加薪",
        "summary": "德国平价超市Aldi将通过两次年度加薪来提高员工工资，以加强其在英国零售市场中的竞争地位。"
      },
      "fr": {
        "title": "Le personnel des magasins Aldi recevra deux augmentations de salaire cette année",
        "summary": "Le supermarché allemand à bas prix Aldi augmente les salaires du personnel avec deux augmentations annuelles, renforçant sa position concurrentielle sur le marché britannique du commerce de détail."
      },
      "de": {
        "title": "Aldi-Mitarbeiter erhalten dieses Jahr zwei Gehaltserhöhungen",
        "summary": "Der deutsche Discounter-Supermarkt Aldi erhöht die Löhne der Mitarbeiter mit zwei jährlichen Gehaltserhöhungen und stärkt seine Wettbewerbsposition auf dem britischen Einzelhandelsmarkt."
      },
      "es": {
        "title": "El personal de Aldi recibirá dos aumentos de salario este año",
        "summary": "El supermercado de presupuesto alemán Aldi está aumentando los salarios de los empleados con dos aumentos salariales anuales, fortaleciendo su posición competitiva en el mercado minorista británico."
      }
    }
  }
]