[
  {
    "title": "OpenAI strikes deal with Pentagon, hours after rival Anthropic was blacklisted by Trump",
    "slug": "openai-pentagon-deal-anthropic-blacklisted",
    "url": "https://www.cnbc.com/2026/02/27/openai-strikes-deal-with-pentagon-hours-after-rival-anthropic-was-blacklisted-by-trump.html",
    "source": "CNBC",
    "date": "2026-02-28T04:25:34.000Z",
    "summary": "OpenAI has reached an agreement with the Defense Department to provide its AI models, hours after its rival Anthropic faced blacklisting by the Trump administration. The deal signals growing government interest in deploying commercial AI systems for military applications.",
    "content": "OpenAI CEO Sam Altman said on X that his company has come to terms with the Defense Department for use of its models.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "OpenAI与五角大楼达成协议，竞争对手Anthropic遭特朗普政府列入黑名单仅数小时后",
        "summary": "OpenAI与美国国防部达成协议，为其提供AI模型，此前其竞争对手Anthropic遭特朗普政府列入黑名单仅数小时。该协议表明政府对部署商业AI系统用于军事应用的兴趣日益增长。"
      },
      "fr": {
        "title": "OpenAI conclut un accord avec le Pentagone, quelques heures après que son rival Anthropic ait été mis sur la liste noire par Trump",
        "summary": "OpenAI a conclu un accord avec le Département de la Défense pour fournir ses modèles d'IA, quelques heures après que son rival Anthropic ait été blacklisté par l'administration Trump. L'accord signale un intérêt croissant du gouvernement pour le déploiement de systèmes d'IA commerciaux pour des applications militaires."
      },
      "de": {
        "title": "OpenAI schließt Deal mit Pentagon ab, Stunden nachdem Rivale Anthropic von Trump auf die schwarze Liste gesetzt wurde",
        "summary": "OpenAI hat eine Vereinbarung mit dem Verteidigungsministerium getroffen, um seine KI-Modelle bereitzustellen, nur Stunden nachdem sein Rivale Anthropic von der Trump-Administration auf die schwarze Liste gesetzt wurde. Das Abkommen signalisiert wachsendes staatliches Interesse an der Bereitstellung kommerzieller KI-Systeme für militärische Anwendungen."
      },
      "es": {
        "title": "OpenAI llega a un acuerdo con el Pentágono, horas después de que su rival Anthropic fuera incluido en la lista negra por Trump",
        "summary": "OpenAI ha llegado a un acuerdo con el Departamento de Defensa para proporcionar sus modelos de IA, solo horas después de que su rival Anthropic fuera incluido en la lista negra por la administración Trump. El acuerdo señala un creciente interés gubernamental en desplegar sistemas de IA comerciales para aplicaciones militares."
      }
    }
  },
  {
    "title": "Rent tops £1,000 a month in more areas - find out where",
    "slug": "rent-tops-1000-month",
    "url": "https://www.bbc.com/news/articles/cx28njn2dwpo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-28T00:14:04.000Z",
    "summary": "Private rental costs have surged significantly over the past five years, with monthly rents now exceeding £1,000 in more areas, though growth may be slowing.",
    "content": "The cost of renting privately has surged in the last five years, but tenants may now see a slowdown.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "租金在更多地区超过1000英镑/月 - 查看具体位置",
        "summary": "过去五年来，私人租赁成本大幅上升，月租金在更多地区已超过1000英镑，但增长可能正在放缓。"
      },
      "fr": {
        "title": "Le loyer dépasse 1000 £ par mois dans plus de régions - découvrez lesquelles",
        "summary": "Les coûts des locations privées ont augmenté considérablement au cours des cinq dernières années, avec des loyers mensuels dépassant maintenant 1000 £ dans plus de régions, bien que la croissance ralentisse peut-être."
      },
      "de": {
        "title": "Miete überschreitet £1.000 pro Monat in mehr Gebieten - finde heraus wo",
        "summary": "Die Kosten für private Mietwohnungen sind in den letzten fünf Jahren erheblich gestiegen, wobei die monatliche Miete nun in mehr Gebieten £1.000 übersteigt, obwohl das Wachstum möglicherweise verlangsamt."
      },
      "es": {
        "title": "El alquiler supera £1.000 por mes en más áreas - descubre dónde",
        "summary": "Los costos de alquiler privado se han disparado significativamente en los últimos cinco años, con rentas mensuales que ahora superan £1.000 en más áreas, aunque el crecimiento puede estar ralentizándose."
      }
    }
  }
]