[
  {
    "title": "CoreWeave shares slip 8% as quarterly revenue guidance disappoints",
    "slug": "coreweave-shares-slip-quarterly-revenue",
    "url": "https://www.cnbc.com/2026/02/26/coreweave-crwv-q4-earnings-report-2025.html",
    "source": "CNBC",
    "date": "2026-02-27T00:32:39.000Z",
    "summary": "CoreWeave's shares fell 8% after the company's quarterly revenue forecast missed consensus estimates. The disappointing guidance signals investor concerns about the company's growth trajectory despite strong AI infrastructure demand.",
    "content": "The company's quarterly revenue forecast fell short of consensus.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "CoreWeave股价下跌8%，季度收入指引令人失望",
        "summary": "CoreWeave股价在公司的季度收入预测未达市场一致预期后下跌了8%。令人失望的指引表明投资者对公司增长轨迹感到担忧，尽管人工智能基础设施需求强劲。"
      },
      "fr": {
        "title": "Les actions de CoreWeave chutent de 8% alors que les prévisions de revenus trimestriels déçoivent",
        "summary": "Les actions de CoreWeave ont chuté de 8% après que les prévisions de revenus trimestriels de l'entreprise aient déçu les estimations de consensus. Les prévisions décevantes signalent les préoccupations des investisseurs concernant la trajectoire de croissance de l'entreprise malgré la forte demande en infrastructures d'IA."
      },
      "de": {
        "title": "CoreWeave-Aktien fallen um 8%, da die Quartalserlösprognose enttäuscht",
        "summary": "Die CoreWeave-Aktien fielen um 8%, nachdem die Prognose der Quartalseinnahmen des Unternehmens die Konsensprognosen verfehlt hat. Die enttäuschende Prognose signalisiert Anlegerbedenken bezüglich der Wachstumsbahn des Unternehmens trotz starker Nachfrage nach KI-Infrastruktur."
      },
      "es": {
        "title": "Las acciones de CoreWeave se deslizan un 8% cuando la orientación de ingresos trimestral decepciona",
        "summary": "Las acciones de CoreWeave cayeron un 8% después de que la previsión de ingresos trimestral de la empresa no cumpliera las estimaciones de consenso. Las prognosis decepcionantes indican la preocupación de los inversores sobre la trayectoria de crecimiento de la empresa a pesar de la fuerte demanda de infraestructura de IA."
      }
    }
  },
  {
    "title": "Stock futures slide after S&P 500 closes lower; wholesale inflation reading looms: Live updates",
    "slug": "stock-futures-slide-s-p-500-closes-lower",
    "url": "https://www.cnbc.com/2026/02/26/stock-market-today-live-updates.html",
    "source": "CNBC",
    "date": "2026-02-27T00:28:46.000Z",
    "summary": "The S&P 500 and Nasdaq Composite declined on Thursday, with Nvidia shares leading the selloff in major indices. A wholesale inflation reading is expected, which could influence market direction going forward.",
    "content": "The S&P 500 and the Nasdaq Composite slid on Thursday, dragged lower by Nvidia shares.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "标普500指数下跌后股指期货下滑；批发通胀数据即将公布：实时更新",
        "summary": "周四标普500指数和纳斯达克综合指数下跌，英伟达股票领跌主要指数。预期将公布批发通胀数据，这可能会影响今后的市场走向。"
      },
      "fr": {
        "title": "Les contrats à terme sur actions glissent après la clôture inférieure du S&P 500 ; une lecture de l'inflation de gros se profile",
        "summary": "L'indice S&P 500 et le Nasdaq Composite ont baissé jeudi, les actions Nvidia menant la vente massive dans les principaux indices. Un indicateur d'inflation de gros est attendu, ce qui pourrait influencer l'orientation du marché à l'avenir."
      },
      "de": {
        "title": "Aktienindex-Futures rutschen nach dem Rückgang des S&P 500; Großhandelsinflationslesung rückt näher",
        "summary": "Der S&P 500 und der Nasdaq Composite sanken am Donnerstag, wobei Nvidia-Aktien den Ausverkauf bei den wichtigsten Indizes anführten. Eine Großhandelsinflationslesung wird erwartet, die die zukünftige Marktrichtung beeinflussen könnte."
      },
      "es": {
        "title": "Los futuros bursátiles se deslizan después de que el S&P 500 cierre más bajo; se acerca la lectura de inflación mayorista",
        "summary": "El S&P 500 y el Nasdaq Composite cayeron el jueves, con las acciones de Nvidia liderando la venta masiva en los principales índices. Se espera una lectura de inflación mayorista, que podría influir en la dirección del mercado en el futuro."
      }
    }
  },
  {
    "title": "Columbia U. student Elmina Aghayeva released from ICE custody after Trump, NY mayor meeting",
    "slug": "columbia-student-elmina-aghayeva-released-ice",
    "url": "https://www.cnbc.com/2026/02/26/columbia-ice-dhs-immigration-detainment.html",
    "source": "CNBC",
    "date": "2026-02-27T00:23:49.000Z",
    "summary": "Columbia University student Elmina Aghayev was released from ICE custody following a meeting between Trump administration officials and New York's mayor. The case drew attention due to her status as an international student detained from university housing.",
    "content": "Elmina Aghayev was taken into custody by ICE agents from a student residential building owned by Columbia University.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "哥伦比亚大学学生埃尔米娜·阿加耶娃在特朗普与纽约市长会面后获得ICE释放",
        "summary": "在特朗普政府官员与纽约市长会面后，哥伦比亚大学学生埃尔米娜·阿加耶夫从ICE羁押中被释放。该案件因她作为国际学生从大学宿舍被拘留而引起关注。"
      },
      "fr": {
        "title": "L'étudiante de l'Université Columbia, Elmina Aghayeva, est libérée de la garde de l'ICE après la réunion entre Trump et le maire de New York",
        "summary": "L'étudiante de l'Université Columbia, Elmina Aghayev, a été libérée de la garde de l'ICE suite à une réunion entre les responsables de l'administration Trump et le maire de New York. L'affaire a attiré l'attention en raison de son statut d'étudiante internationale détenue du logement universitaire."
      },
      "de": {
        "title": "Studentin der Columbia University, Elmina Aghayeva, aus ICE-Verwahrung nach Treffen zwischen Trump und New Yorks Bürgermeister freigelassen",
        "summary": "Die Studentin der Columbia University, Elmina Aghayev, wurde aus der ICE-Verwahrung nach einem Treffen zwischen Beamten der Trump-Administration und dem Bürgermeister von New York entlassen. Der Fall zog Aufmerksamkeit auf sich aufgrund ihres Status als internationale Studentin, die aus Universitätswohnungen festgenommen wurde."
      },
      "es": {
        "title": "La estudiante de la Universidad de Columbia, Elmina Aghayeva, es liberada de la custodia del ICE después de la reunión entre Trump y el alcalde de Nueva York",
        "summary": "La estudiante de la Universidad de Columbia, Elmina Aghayev, fue liberada de la custodia del ICE tras una reunión entre funcionarios de la administración Trump y el alcalde de Nueva York. El caso atrajo atención debido a su estado como estudiante internacional detenida de la vivienda universitaria."
      }
    }
  },
  {
    "title": "Trump allies David and Larry Ellison win battle for Warner Bros. Discovery after Netflix bows out",
    "slug": "trump-allies-ellison-win-warner-bros-discovery",
    "url": "https://www.marketwatch.com/story/warner-bros-discovery-deems-paramounts-bid-superior-putting-netflix-in-the-hot-seat-a1fcea7c?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T00:14:00.000Z",
    "summary": "David and Larry Ellison have won the bid for Warner Bros. Discovery after Netflix withdrew from the bidding war. Netflix determined that counteracting Paramount's offer was no longer economically justified.",
    "content": "The streaming giant said countering Paramount’s bid was “no longer financially attractive.”",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "特朗普盟友埃利森兄弟赢得华纳兄弟探索公司争夺战，Netflix退出",
        "summary": "大卫·埃利森和拉里·埃利森在Netflix退出竞购后赢得了华纳兄弟探索公司的竞购。Netflix认为抵抗派拉蒙的报价不再在经济上合理。"
      },
      "fr": {
        "title": "Les alliés de Trump David et Larry Ellison remportent la bataille pour Warner Bros. Discovery après le retrait de Netflix",
        "summary": "David et Larry Ellison ont remporté l'enchère pour Warner Bros. Discovery après que Netflix s'est retiré de la guerre des enchères. Netflix a déterminé que contrecarrer l'offre de Paramount n'était plus économiquement justifié."
      },
      "de": {
        "title": "Trumps Verbündete David und Larry Ellison gewinnen Kampf um Warner Bros. Discovery, nachdem Netflix aussteigt",
        "summary": "David und Larry Ellison haben das Gebot für Warner Bros. Discovery gewonnen, nachdem Netflix sich aus dem Bieterkampf zurückgezogen hat. Netflix stellte fest, dass es wirtschaftlich nicht mehr gerechtfertigt war, Paramounts Angebot zu bekämpfen."
      },
      "es": {
        "title": "Los aliados de Trump David y Larry Ellison ganan la batalla por Warner Bros. Discovery después de que Netflix se retire",
        "summary": "David y Larry Ellison ganaron la puja por Warner Bros. Discovery después de que Netflix se retirara de la guerra de ofertas. Netflix determinó que contrarrestar la oferta de Paramount ya no estaba económicamente justificado."
      }
    }
  },
  {
    "title": "Asia markets opens mixed after Wall Street pullback on Nvidia slump",
    "slug": "asia-markets-mixed-wall-street-nvidia-slump",
    "url": "https://www.cnbc.com/2026/02/27/asia-markets-nikkei-225-kospi-nifty-50.html",
    "source": "CNBC",
    "date": "2026-02-27T00:13:20.000Z",
    "summary": "Asia-Pacific markets opened mixed on Friday following overnight U.S. stock declines as Nvidia shares tumbled despite beating quarterly earnings expectations. The tech-heavy selloff reflected broader market caution despite positive earnings results.",
    "content": "Asia-Pacific markets opened mixed on Friday, after U.S. stocks declined overnight as Nvidia shares tumbled despite a quarterly earnings beat.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "美国股市回调、英伟达股价下跌后，亚洲市场周五开盘涨跌混合",
        "summary": "周五亚太市场在美国股市隔夜下跌后开盘涨跌混合，尽管英伟达的季度收益超过预期，但其股价大幅下跌。尽管收益结果为正，科技股的大幅抛售反映了市场更广泛的谨慎态度。"
      },
      "fr": {
        "title": "Les marchés asiatiques ouvrent mitigés après le recul de Wall Street en raison de la baisse d'Nvidia",
        "summary": "Les marchés d'Asie-Pacifique ont ouvert mitigés vendredi suite aux baisses des actions américaines du jour au lendemain, car les actions Nvidia ont chuté malgré le dépassement des attentes concernant les bénéfices trimestriels. La forte liquidation du secteur technologique reflétait une prudence plus large du marché malgré des résultats de bénéfices positifs."
      },
      "de": {
        "title": "Asiatische Märkte öffnen gemischt nach Wall-Street-Rückgang bei Nvidia-Einbruch",
        "summary": "Die Märkte in Asien-Pazifik öffneten am Freitag gemischt nach den Rückgängen an der Wall Street über Nacht, da die Nvidia-Aktien trotz besserer als erwarteter Quartalsgewinne einbrachen. Der starke Tech-Ausverkauf spiegelte eine breitere Marktvorsicht trotz positiver Gewinnenergebnisse wider."
      },
      "es": {
        "title": "Los mercados asiáticos abren mixtos después de la caída de Wall Street por la caída de Nvidia",
        "summary": "Los mercados de Asia-Pacífico abrieron mixtos el viernes tras las caídas de las acciones estadounidenses durante la noche, ya que las acciones de Nvidia se desplomaron a pesar de superar las expectativas de ganancias trimestrales. La fuerte liquidación de tecnología reflejó una precaución más amplia del mercado a pesar de resultados de ganancias positivos."
      }
    }
  },
  {
    "title": "Jack Dorsey's Block cuts thousands of jobs as it embraces AI",
    "slug": "jack-dorsey-block-cuts-jobs-ai",
    "url": "https://www.bbc.com/news/articles/cq570d12y9do?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-27T00:06:40.000Z",
    "summary": "Block, led by former Twitter co-founder Jack Dorsey, is laying off over 4,000 employees and restructuring to prioritize artificial intelligence. Dorsey says AI fundamentally changes how companies are built and operated.",
    "content": "The Twitter co-founder says artificial intelligence \"fundamentally changes what it means to build and run a company.\"",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "杰克·多西的Block公司在拥抱AI之际裁减数千名员工",
        "summary": "由前Twitter联合创始人杰克·多西领导的Block公司正在裁员超过4000名员工并进行重组，以优先考虑人工智能。多西表示人工智能根本上改变了公司的构建和运营方式。"
      },
      "fr": {
        "title": "Block de Jack Dorsey réduit les effectifs de milliers d'employés alors qu'il adopte l'IA",
        "summary": "Block, dirigée par le co-fondateur de Twitter Jack Dorsey, licencie plus de 4 000 employés et restructure pour prioriser l'intelligence artificielle. Dorsey affirme que l'IA change fondamentalement la façon dont les entreprises sont construites et exploitées."
      },
      "de": {
        "title": "Jack Dorseys Block entlässt Tausende von Mitarbeitern während es künstliche Intelligenz umarmt",
        "summary": "Block unter der Leitung des ehemaligen Twitter-Mitgründers Jack Dorsey entlässt über 4.000 Mitarbeiter und wird umstrukturiert, um künstliche Intelligenz zu priorisieren. Dorsey sagt, dass KI grundlegend verändert, wie Unternehmen gebaut und betrieben werden."
      },
      "es": {
        "title": "Block de Jack Dorsey despide a miles de empleados mientras adopta la IA",
        "summary": "Block, liderada por el cofundador de Twitter Jack Dorsey, está despidiendo a más de 4.000 empleados y reestructurándose para priorizar la inteligencia artificial. Dorsey dice que la IA cambia fundamentalmente cómo se construyen y operan las empresas."
      }
    }
  },
  {
    "title": "Why you can't get a signal at festivals and sports matches",
    "slug": "no-signal-festivals-sports-matches",
    "url": "https://www.bbc.com/news/articles/c3rzq8d24y9o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-27T00:03:10.000Z",
    "summary": "Providing internet connectivity at large music and sports events is a complex logistical challenge involving significant infrastructure investment. Event organizers struggle to accommodate the concentrated demand from thousands of attendees in confined spaces.",
    "content": "Connecting up music and sports events to the internet is a massive undertaking.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "为什么在音乐节和体育赛事上无法获得信号",
        "summary": "为大型音乐和体育赛事提供互联网连接是一个复杂的后勤挑战，需要大量的基础设施投资。活动组织者难以应对数千名参与者在有限空间内的集中需求。"
      },
      "fr": {
        "title": "Pourquoi vous ne pouvez pas avoir de signal aux festivals et aux matchs sportifs",
        "summary": "Fournir une connectivité Internet aux grands événements musicaux et sportifs est un défi logistique complexe impliquant un investissement infrastructurel important. Les organisateurs d'événements ont du mal à satisfaire la demande concentrée de milliers de participants dans des espaces confinés."
      },
      "de": {
        "title": "Warum Sie bei Festivals und Sportveranstaltungen keinen Empfang bekommen",
        "summary": "Die Bereitstellung von Internetkonnektivität bei großen Musik- und Sportveranstaltungen ist eine komplexe logistische Herausforderung mit erheblichen Infrastrukturinvestitionen. Veranstalter haben Schwierigkeiten, die konzentrierte Nachfrage von Tausenden von Besuchern in begrenzten Räumen zu bewältigen."
      },
      "es": {
        "title": "Por qué no puedes obtener señal en festivales y eventos deportivos",
        "summary": "Proporcionar conectividad a Internet en grandes eventos musicales y deportivos es un desafío logístico complejo que requiere una inversión significativa en infraestructura. Los organizadores de eventos luchan por satisfacer la demanda concentrada de miles de asistentes en espacios confinados."
      }
    }
  }
]