[
  {
    "title": "Netflix ditches deal for Warner Bros. Discovery after Paramount’s offer is deemed superior",
    "slug": "netflix-ditches-warner-bros-paramount-bid",
    "url": "https://www.cnbc.com/2026/02/26/warner-bros-discovery-paramount-skydance-deal-superior-netflix.html",
    "source": "CNBC",
    "date": "2026-02-26T23:59:44.000Z",
    "summary": "Netflix is withdrawing from the bid to acquire Warner Bros. Discovery's studio and streaming assets after the WBD board accepted a revised, superior offer from Paramount. The decision ends Netflix's involvement in the competitive acquisition battle.",
    "content": "Netflix is ditching a deal to buy Warner Bros. Discovery's studio and streaming assets after the WBD board deemed a revised bid by Paramount to be superior.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Netflix在派拉蒙的报价被认为更优越后，放弃了收购华纳兄弟探索公司的交易",
        "summary": "在华纳兄弟探索公司董事会接受派拉蒙修订后的更优越报价后，Netflix从收购华纳兄弟探索公司的工作室和流媒体资产的竞价中撤出。这一决定结束了Netflix在竞争性收购战中的参与。"
      },
      "fr": {
        "title": "Netflix abandonne l'accord pour Warner Bros. Discovery après que l'offre de Paramount soit jugée supérieure",
        "summary": "Netflix se retire de l'offre d'acquisition des actifs d'studios et de streaming de Warner Bros. Discovery après que le conseil d'administration de WBD ait accepté une offre revisitée et supérieure de Paramount. La décision met fin à la participation de Netflix à la bataille d'acquisition concurrentielle."
      },
      "de": {
        "title": "Netflix gibt das Angebot für Warner Bros. Discovery auf, nachdem Paramounts Angebot als überlegen befunden wurde",
        "summary": "Netflix zieht sein Gebot zum Erwerb der Studio- und Streaming-Vermögenswerte von Warner Bros. Discovery zurück, nachdem der WBD-Vorstand ein überarbeitetes, überlegenes Angebot von Paramount angenommen hat. Die Entscheidung beendet Netflixs Beteiligung an der konkurrierenden Übernahmeschlacht."
      },
      "es": {
        "title": "Netflix abandona la oferta por Warner Bros. Discovery después de que la oferta de Paramount se considere superior",
        "summary": "Netflix se retira de la puja para adquirir los activos de estudio y streaming de Warner Bros. Discovery después de que la junta directiva de WBD aceptara una oferta revisada y superior de Paramount. La decisión pone fin a la participación de Netflix en la batalla de adquisición competitiva."
      }
    }
  },
  {
    "title": "Netflix drops bid for Warner Bros, clearing way for Paramount takeover",
    "slug": "netflix-drops-warner-bros-paramount",
    "url": "https://www.bbc.com/news/articles/c5y6p5ypgmzo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-26T23:56:26.000Z",
    "summary": "Netflix has exited the bidding war for Warner Bros. Discovery, clearing the path for Paramount to complete the acquisition. The move resolves the competitive acquisition battle that had been reshaping the streaming and entertainment landscape.",
    "content": "Netflix's decision to back down from the bidding war clears the path for Paramount to win the takeover battle.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Netflix放弃对华纳兄弟的竞价，为派拉蒙的收购铺平道路",
        "summary": "Netflix已退出对华纳兄弟探索公司的竞价战，为派拉蒙完成收购铺平了道路。这一举动解决了一直在重塑流媒体和娱乐格局的竞争性收购战。"
      },
      "fr": {
        "title": "Netflix abandonne son offre pour Warner Bros, ouvrant la voie à la reprise de Paramount",
        "summary": "Netflix a quitté la bataille d'enchères pour Warner Bros. Discovery, ouvrant la voie à Paramount pour finaliser l'acquisition. Le mouvement résout la bataille d'acquisition concurrentielle qui avait remodélisé le paysage du streaming et du divertissement."
      },
      "de": {
        "title": "Netflix gibt sein Angebot für Warner Bros ab und ebnet den Weg für die Übernahme durch Paramount",
        "summary": "Netflix hat sich aus dem Bieterkampf um Warner Bros. Discovery zurückgezogen und ebnete den Weg für Paramount, die Akquisition abzuschließen. Der Schritt löst die konkurrierende Übernahmeschlacht, die die Streaming- und Unterhaltungslandschaft umgestaltet hatte."
      },
      "es": {
        "title": "Netflix retira su oferta por Warner Bros, allanando el camino para la adquisición de Paramount",
        "summary": "Netflix ha abandonado la batalla de pujas por Warner Bros. Discovery, allanando el camino para que Paramount complete la adquisición. El movimiento resuelve la batalla de adquisición competitiva que había estado remodelando el panorama de transmisión y entretenimiento."
      }
    }
  },
  {
    "title": "Block shares soar 24% as company slashes workforce by nearly half",
    "slug": "block-shares-soar-workforce-cuts",
    "url": "https://www.cnbc.com/2026/02/26/block-laying-off-about-4000-employees-nearly-half-of-its-workforce.html",
    "source": "CNBC",
    "date": "2026-02-26T23:54:10.000Z",
    "summary": "Block's stock surged 24% after the company announced layoffs affecting roughly half its workforce. Market enthusiasm suggests investors view the aggressive restructuring and AI focus as a path to improved profitability.",
    "content": "Block said Thursday it's laying off more than 4,000 employees, or about half of its head count.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Block股价飙升24%，公司裁员接近一半",
        "summary": "Block宣布裁员约占员工总数一半后，股价上涨24%。市场的热情反应表明投资者将这种激进的重组和人工智能焦点视为实现盈利能力提升的途径。"
      },
      "fr": {
        "title": "Les actions de Block s'envolent de 24%, la société réduit ses effectifs de près de moitié",
        "summary": "Le cours de Block a bondi de 24% après l'annonce de licenciements affectant environ la moitié de son effectif. L'enthousiasme du marché suggère que les investisseurs considèrent la restructuration agressive et l'accent mis sur l'IA comme un chemin vers une meilleure rentabilité."
      },
      "de": {
        "title": "Block-Aktien schießen um 24% in die Höhe, während das Unternehmen etwa die Hälfte seiner Belegschaft abbaut",
        "summary": "Die Block-Aktie ist um 24% gestiegen, nachdem das Unternehmen Entlassungen ankündigte, die etwa die Hälfte seiner Belegschaft betreffen. Die Marktbegeisterung deutet darauf hin, dass Investoren die aggressive Umstrukturierung und den KI-Fokus als Weg zu verbesserter Rentabilität sehen."
      },
      "es": {
        "title": "Las acciones de Block se disparan 24% mientras la empresa reduce su fuerza laboral casi a la mitad",
        "summary": "El precio de las acciones de Block se disparó un 24% después del anuncio de despidos que afectan aproximadamente a la mitad de su fuerza laboral. El entusiasmo del mercado sugiere que los inversores ven la reestructuración agresiva y el enfoque en IA como un camino hacia una rentabilidad mejorada."
      }
    }
  },
  {
    "title": "This travel hack could save you hundreds on your summer vacation — just in time for the World Cup",
    "slug": "travel-hack-save-money-world-cup",
    "url": "https://www.marketwatch.com/story/swapping-homes-could-save-you-hundreds-of-dollars-on-your-summer-vacation-especially-if-you-live-in-a-world-cup-host-city-be455ea4?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T23:51:00.000Z",
    "summary": "With millions of international visitors expected for the 2026 FIFA World Cup in the U.S., hotel prices are rising due to increased demand, driving travelers to seek alternative accommodation options. Savvy travelers can use various strategies to reduce lodging costs during the event.",
    "content": "Millions of international visitors are expected to flock to the U.S. this summer to experience the 2026 FIFA World Cup. And with hotel prices on the rise due to increased demand, tourists are seeking alternative lodging options.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "这个旅行技巧可以为您的世界杯夏日假期节省数百美元",
        "summary": "随着数百万国际游客预计参加2026年美国FIFA世界杯，酒店价格因需求增加而上升，促使旅客寻求替代住宿选择。精明的旅客可以使用各种策略在赛事期间降低住宿成本。"
      },
      "fr": {
        "title": "Cette astuce de voyage pourrait vous économiser des centaines de dollars pour vos vacances d'été à la Coupe du monde",
        "summary": "Avec des millions de visiteurs internationaux attendus pour la Coupe du monde de la FIFA 2026 aux États-Unis, les prix des hôtels augmentent en raison de la demande accrue, incitant les voyageurs à rechercher des options d'hébergement alternatives. Les voyageurs avisés peuvent utiliser diverses stratégies pour réduire les coûts de logement lors de l'événement."
      },
      "de": {
        "title": "Dieser Reisetipp könnte Ihnen bei Ihrem Sommerurlaub zur Fußball-Weltmeisterschaft Hunderte von Dollar sparen",
        "summary": "Mit Millionen von internationalen Besuchern, die zur FIFA-Weltmeisterschaft 2026 in den USA erwartet werden, steigen die Hotelpreise aufgrund der gestiegenen Nachfrage, was Reisende dazu veranlasst, alternative Unterkunftsmöglichkeiten zu suchen. Reisende mit Gespür können verschiedene Strategien nutzen, um die Unterkunftskosten bei der Veranstaltung zu senken."
      },
      "es": {
        "title": "Este consejo de viaje podría ahorrarle cientos de dólares en sus vacaciones de verano en la Copa del Mundo",
        "summary": "Con millones de visitantes internacionales esperados para la Copa Mundial de la FIFA 2026 en Estados Unidos, los precios de los hoteles están subiendo debido a la mayor demanda, lo que lleva a los viajeros a buscar opciones de alojamiento alternativas. Los viajeros inteligentes pueden utilizar varias estrategias para reducir los costos de alojamiento durante el evento."
      }
    }
  },
  {
    "title": "Duolingo is making some changes to contend with the threat of AI. Its stock is sinking.",
    "slug": "duolingo-ai-threat-stock-sinking",
    "url": "https://www.marketwatch.com/story/duolingo-is-making-some-changes-to-contend-with-the-threat-of-ai-its-stock-is-sinking-32e75bc6?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T23:49:00.000Z",
    "summary": "Language-learning app Duolingo is increasing investment and restructuring its service tiers to address competitive threats from AI, but its stock is declining. The changes follow a slowdown in user growth that has spooked investors.",
    "content": "Following a slowdown in user growth, the language-learning company is stepping up investment and changing how it thinks about its tiers of service",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Duolingo为应对人工智能威胁做出改变，其股价下跌",
        "summary": "语言学习应用Duolingo增加投资并重组服务层级以应对人工智能的竞争威胁，但其股价下跌。这些变化发生在用户增长放缓对投资者造成担忧之后。"
      },
      "fr": {
        "title": "Duolingo fait des changements pour faire face à la menace de l'IA, son action s'effondre",
        "summary": "L'application d'apprentissage des langues Duolingo augmente ses investissements et restructure ses niveaux de service pour faire face aux menaces concurrentielles de l'IA, mais son cours baisse. Ces changements interviennent après un ralentissement de la croissance des utilisateurs qui a inquiété les investisseurs."
      },
      "de": {
        "title": "Duolingo nimmt Änderungen vor, um der KI-Bedrohung entgegenzuwirken, seine Aktie sinkt",
        "summary": "Die Sprachlern-App Duolingo erhöht ihre Investitionen und strukturiert ihre Service-Stufen um, um mit den Wettbewerbsbedrohungen durch KI umzugehen, aber ihre Aktie sinkt. Diese Änderungen folgen auf eine Verlangsamung des Benutzerwachstums, die Investoren beunruhigt hat."
      },
      "es": {
        "title": "Duolingo realiza cambios para contender con la amenaza de la IA, sus acciones se hunden",
        "summary": "La aplicación de aprendizaje de idiomas Duolingo aumenta su inversión y reestructura sus niveles de servicio para hacer frente a las amenazas competitivas de la IA, pero sus acciones están bajando. Los cambios ocurren después de una desaceleración en el crecimiento de usuarios que ha preocupado a los inversores."
      }
    }
  },
  {
    "title": "Anthropic CEO Amodei says Pentagon's threats 'do not change our position' on AI",
    "slug": "anthropic-ceo-pentagon-ai-position",
    "url": "https://www.cnbc.com/2026/02/26/anthropic-pentagon-ai-amodei.html",
    "source": "CNBC",
    "date": "2026-02-26T23:41:44.000Z",
    "summary": "Anthropic CEO Darius Amodei says the Pentagon's threats do not influence the company's stance on AI development, while negotiations with the Department of Defense remain ongoing. The statement reflects Anthropic's commitment to its existing policy direction on AI regulation.",
    "content": "Anthropic said its negotiations with the DoD are still ongoing.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "人工智能公司Anthropic首席执行官阿莫代说五角大楼的威胁\"不会改变我们对AI的立场\"",
        "summary": "Anthropic首席执行官达里乌斯·阿莫代表示，五角大楼的威胁不会影响公司在AI开发方面的立场，与国防部的谈判仍在进行中。该声明反映了Anthropic对其现有AI监管政策方向的承诺。"
      },
      "fr": {
        "title": "Le PDG d'Anthropic Amodei déclare que les menaces du Pentagone \"ne changent pas notre position\" sur l'IA",
        "summary": "Le PDG d'Anthropic, Darius Amodei, déclare que les menaces du Pentagone n'influencent pas la position de l'entreprise sur le développement de l'IA, tandis que les négociations avec le département de la Défense restent en cours. La déclaration reflète l'engagement d'Anthropic envers sa direction politique existante en matière de régulation de l'IA."
      },
      "de": {
        "title": "CEO von Anthropic Amodei sagt, die Drohungen des Pentagon \"ändern unsere Position zu KI nicht\"",
        "summary": "Der CEO von Anthropic, Darius Amodei, sagt, dass die Drohungen des Pentagon die Haltung des Unternehmens zur KI-Entwicklung nicht beeinflussen, während die Verhandlungen mit dem Verteidigungsministerium laufen. Die Aussage spiegelt Anthropics Engagement für seine bestehende Politikrichtung zur KI-Regulierung wider."
      },
      "es": {
        "title": "El CEO de Anthropic Amodei dice que las amenazas del Pentágono \"no cambian nuestra posición\" sobre la IA",
        "summary": "El CEO de Anthropic, Darius Amodei, dice que las amenazas del Pentágono no influyen en la posición de la empresa sobre el desarrollo de IA, mientras que las negociaciones con el Departamento de Defensa continúan en curso. La declaración refleja el compromiso de Anthropic con su dirección política existente sobre la regulación de la IA."
      }
    }
  },
  {
    "title": "Sweetgreen’s disappointing sales offer a reality check for restaurants, after Cava’s rally",
    "slug": "sweetgreen-disappointing-sales-restaurant",
    "url": "https://www.marketwatch.com/story/sweetgreens-disappointing-sales-offer-a-reality-check-for-restaurants-after-cavas-rally-1c2fe3d9?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T23:34:00.000Z",
    "summary": "Fast-casual chain Sweetgreen's weak sales forecast has tempered optimism in the restaurant sector just after competitor Cava posted upbeat guidance. The divergence between the two chains highlights uneven recovery in the fast-casual dining market.",
    "content": "A day after Cava’s upbeat sales forecast raised hopes for the restaurant industry, rival fast-casual chain Sweetgreen is bringing them back to earth.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Sweetgreen令人失望的销售为餐厅敲响警钟，在Cava上涨之后",
        "summary": "快餐连锁店Sweetgreen疲弱的销售预测在竞争对手Cava发布乐观指引后抑制了餐饮行业的乐观情绪。两家连锁店之间的差异突出了快餐市场的不均匀复苏。"
      },
      "fr": {
        "title": "Les ventes décevantes de Sweetgreen offrent une leçon de réalité aux restaurants, après le rebond de Cava",
        "summary": "La faible prévision de ventes de la chaîne de restauration rapide Sweetgreen a modéré l'optimisme du secteur de la restauration, juste après que son concurrent Cava ait affiché des perspectives optimistes. La divergence entre les deux chaînes met en évidence une reprise inégale du marché de la restauration rapide."
      },
      "de": {
        "title": "Sweetgreens enttäuschende Verkäufe bieten Restaurants einen Wirklichkeitscheck nach Cavas Anstieg",
        "summary": "Die schwache Verkaufsprognose der Schnellrestaurant-Kette Sweetgreen hat die Optimismus in der Gastronomiebranche gedämpft, kurz nachdem Konkurrent Cava positive Aussichten meldete. Die Divergenz zwischen den beiden Ketten zeigt eine ungleiche Erholung des Schnellrestaurant-Marktes."
      },
      "es": {
        "title": "Las ventas decepcionantes de Sweetgreen ofrecen un reality check para los restaurantes, después del repunte de Cava",
        "summary": "El débil pronóstico de ventas de la cadena de comida rápida Sweetgreen ha moderado el optimismo en el sector de la restauración justo después de que Cava publicara perspectivas positivas. La divergencia entre las dos cadenas destaca una recuperación desigual en el mercado de comida rápida casual."
      }
    }
  },
  {
    "title": "CNBC's Inside India newsletter: As AI shockwaves hit software firms, what’s in store for India’s IT titans?",
    "slug": "cnbc-s-inside-india-newsletter-as-ai-shockwaves-hit-software-firms-what-s-in-sto",
    "url": "https://www.cnbc.com/2026/02/26/cnbc-inside-india-newsletter-ai-hit-software-firms-india-it.html",
    "source": "CNBC",
    "date": "2026-02-26T23:30:40.000Z",
    "summary": "AI-led disruption is threatening India’s software giants.",
    "content": "AI-led disruption is threatening India’s software giants.",
    "category": "economic"
  },
  {
    "title": "CoreWeave’s stock drops as losses swell and interest expenses climb",
    "slug": "coreweave-stock-drops-losses-interest",
    "url": "https://www.marketwatch.com/story/coreweaves-stock-drops-as-losses-swell-and-interest-expenses-climb-9a09e137?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T23:26:00.000Z",
    "summary": "CoreWeave's stock is declining as the company reported widening net losses and rising interest expenses in the fourth quarter despite strong AI infrastructure demand. The deteriorating financial metrics are causing investor concern about the company's path to profitability.",
    "content": "While AI demand remains high, CoreWeave’s widening net loss in the fourth quarter is giving investors pause.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "随着亏损扩大和利息支出上升，CoreWeave的股票下跌",
        "summary": "CoreWeave公司的股票下跌，因为该公司报告了第四季度净亏损扩大和利息支出增加，尽管AI基础设施需求强劲。日益恶化的财务指标引发了投资者对公司实现盈利道路的担忧。"
      },
      "fr": {
        "title": "L'action de CoreWeave chute alors que les pertes s'agrandissent et les charges d'intérêts augmentent",
        "summary": "L'action de CoreWeave est en baisse alors que l'entreprise a signalé l'élargissement des pertes nettes et l'augmentation des charges d'intérêts au quatrième trimestre malgré la forte demande en infrastructure d'IA. La détérioration des mesures financières inquiète les investisseurs quant au chemin de l'entreprise vers la rentabilité."
      },
      "de": {
        "title": "CoreWeaves Aktie fällt, da Verluste wachsen und Zinskosten steigen",
        "summary": "CoreWeaves Aktienkurs fällt, da das Unternehmen im vierten Quartal wachsende Nettoverluste und steigende Zinsaufwendungen meldete, trotz starker Nachfrage nach KI-Infrastruktur. Die verschlechternden Finanzkennzahlen verursachen Besorgnis bei Investoren über CoreWeaves Weg zur Rentabilität."
      },
      "es": {
        "title": "Las acciones de CoreWeave caen a medida que las pérdidas aumentan y los gastos de intereses suben",
        "summary": "La acción de CoreWeave está en declive mientras la empresa reportó pérdidas netas crecientes y gastos de intereses en aumento en el cuarto trimestre a pesar de la fuerte demanda de infraestructura de IA. Las métricas financieras deterioradas están causando preocupación entre los inversores sobre el camino de la empresa hacia la rentabilidad."
      }
    }
  },
  {
    "title": "'I stopped engaging' due to Instagram, YouTube, woman tells landmark trial",
    "slug": "i-stopped-engaging-due-to-instagram-youtube-woman-tells-landmark-trial",
    "url": "https://www.bbc.com/news/articles/c89kdpjn7eqo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-26T23:02:18.000Z",
    "summary": "The young woman, who accuses Meta and Google of making addictive social media platforms, has been speaking in court.",
    "content": "The young woman, who accuses Meta and Google of making addictive social media platforms, has been speaking in court.",
    "category": "economic"
  },
  {
    "title": "State Farm announces $5 billion dividend; $100 average refund coming to car insurance customers",
    "slug": "state-farm-dividend-refund",
    "url": "https://www.cnbc.com/2026/02/26/state-farm-dividend-car-insurance-customers.html",
    "source": "CNBC",
    "date": "2026-02-26T22:13:51.000Z",
    "summary": "State Farm is distributing $5 billion in dividends to shareholders with average $100 refunds going to auto insurance customers. The refund amount varies by state and individual premium contributions.",
    "content": "Customers can expect to receive $100 refund on average, though State Farm says it will vary by state and by the amount of premium paid.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "国家农场宣布50亿美元红利；汽车保险客户将获得平均100美元退款",
        "summary": "国家农场向股东分配50亿美元的红利，向汽车保险客户提供平均100美元的退款。退款金额因州和个人保费贡献而异。"
      },
      "fr": {
        "title": "State Farm annonce un dividende de 5 milliards de dollars ; remboursement moyen de 100 $ pour les clients d'assurance automobile",
        "summary": "State Farm distribue 5 milliards de dollars en dividendes aux actionnaires, avec des remboursements moyens de 100 $ aux clients d'assurance automobile. Le montant du remboursement varie selon l'État et les cotisations de prime individuelles."
      },
      "de": {
        "title": "State Farm kündigt Dividende von 5 Milliarden Dollar an; durchschnittliche Rückerstattung von 100 $ für Kfz-Versicherungskunden",
        "summary": "State Farm verteilt 5 Milliarden Dollar an Dividenden an Aktionäre, mit durchschnittlichen Rückerstattungen von 100 $ an Autoversicherungskunden. Der Rückerstattungsbetrag variiert je nach Bundesstaat und individuellen Prämieneinzahlungen."
      },
      "es": {
        "title": "State Farm anuncia dividendo de $5 mil millones; reembolso promedio de $100 para clientes de seguros de automóviles",
        "summary": "State Farm está distribuyendo $5 mil millones en dividendos a los accionistas, con reembolsos promedio de $100 a los clientes de seguros de automóviles. El monto del reembolso varía según el estado y las contribuciones de prima individual."
      }
    }
  },
  {
    "title": "Burger King rolls out AI headsets that track employee 'friendliness'",
    "slug": "burger-king-ai-employee-headsets",
    "url": "https://www.bbc.com/news/articles/cgk2zygg0k3o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-26T22:09:46.000Z",
    "summary": "Burger King is testing OpenAI-powered headsets that monitor employee \"friendliness\" during customer interactions in select locations. The AI technology assesses staff behavior as part of customer service evaluations.",
    "content": "The fast-food chain is testing OpenAI-powered headsets that monitor staff interactions with customers.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "汉堡王推出追踪员工\"友好程度\"的AI耳机",
        "summary": "汉堡王正在测试由OpenAI驱动的耳机，在选定地点监控员工在客户互动期间的\"友好程度\"。该AI技术作为客户服务评估的一部分来评估员工行为。"
      },
      "fr": {
        "title": "Burger King déploie des casques IA qui suivent la « convivialité » des employés",
        "summary": "Burger King teste des casques alimentés par OpenAI qui surveillent la « convivialité » des employés lors des interactions avec les clients dans des emplacements sélectionnés. La technologie IA évalue le comportement du personnel dans le cadre des évaluations du service client."
      },
      "de": {
        "title": "Burger King führt KI-Kopfhörer ein, die die „Freundlichkeit\" von Mitarbeitern verfolgen",
        "summary": "Burger King testet von OpenAI betriebene Kopfhörer, die die „Freundlichkeit\" von Mitarbeitern während Kundeninteraktionen an ausgewählten Standorten überwachen. Die KI-Technologie bewertet das Verhalten des Personals als Teil der Kundendienstbewertungen."
      },
      "es": {
        "title": "Burger King presenta auriculares de IA que rastrean la « amabilidad » de los empleados",
        "summary": "Burger King está probando auriculares impulsados por OpenAI que monitorean la « amabilidad » de los empleados durante las interacciones con los clientes en ubicaciones seleccionadas. La tecnología de IA evalúa el comportamiento del personal como parte de las evaluaciones del servicio al cliente."
      }
    }
  },
  {
    "title": "Mandelson referred to EU anti-fraud agency over Epstein emails",
    "slug": "mandelson-eu-fraud-epstein-review",
    "url": "https://www.bbc.com/news/articles/cj98zm22327o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-26T19:18:47.000Z",
    "summary": "The European Commission has referred Mandelson to its anti-fraud agency regarding potential code of conduct violations from his communications with Jeffrey Epstein during his role as EU trade envoy. The review assesses whether the peer breached official conduct standards.",
    "content": "The European Commission says it is assessing whether the peer breached its code of conduct while its trade envoy.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "曼德尔森因爱泼斯坦电子邮件被转至欧盟反欺诈机构",
        "summary": "欧盟委员会因曼德尔森在担任欧盟贸易特使期间与杰弗里·爱泼斯坦的通讯中可能违反行为准则而将其转至反欺诈机构。该审查评估了这位同行是否违反了官方行为标准。"
      },
      "fr": {
        "title": "Mandelson renvoyé à l'agence anti-fraude de l'UE en raison des emails d'Epstein",
        "summary": "La Commission européenne a renvoyé Mandelson à son agence anti-fraude concernant des violations potentielles du code de conduite découlant de ses communications avec Jeffrey Epstein lors de son rôle de négociateur commercial de l'UE. L'examen évalue si le pair a violé les normes de conduite officielles."
      },
      "de": {
        "title": "Mandelson wegen Epstein-E-Mails an EU-Betrugsbekämpfungsbehörde verwiesen",
        "summary": "Die Europäische Kommission hat Mandelson wegen möglicher Verstöße gegen den Verhaltenskodex in seinen Kommunikationen mit Jeffrey Epstein während seiner Rolle als EU-Handelsbeauftragter an ihre Betrugsbekämpfungsbehörde verwiesen. Die Überprüfung beurteilt, ob das Mitglied offizielle Verhaltensstandards verletzt hat."
      },
      "es": {
        "title": "Mandelson remitido a la agencia antifraud de la UE por correos de Epstein",
        "summary": "La Comisión Europea ha remitido a Mandelson a su agencia antifraud en relación con posibles violaciones del código de conducta derivadas de sus comunicaciones con Jeffrey Epstein durante su función como enviado comercial de la UE. La revisión evalúa si el par incumplió los estándares de conducta oficial."
      }
    }
  },
  {
    "title": "'Is this all bad debt or good debt?'",
    "slug": "family-debt-crisis",
    "url": "https://www.bbc.com/news/videos/c05v93l1vmmo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-26T18:49:43.000Z",
    "summary": "A family faces severe financial and emotional crisis after Karen leaves behind substantial debt obligations. The situation illustrates the challenges of distinguishing between necessary and excessive debt in household financial management.",
    "content": "Karen has not only left the family in emotional turmoil but also in serious debt.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "这都是坏债还是好债？",
        "summary": "一个家庭在Karen留下的大量债务义务后面临严重的财务和情感危机。这种情况说明了在家庭财务管理中区分必要债务和过度债务的挑战。"
      },
      "fr": {
        "title": "Est-ce que c'est toute de la mauvaise dette ou de la bonne dette ?",
        "summary": "Une famille fait face à une crise financière et émotionnelle grave après que Karen a laissé des obligations de dette substantielles. La situation illustre les défis de distinguer entre la dette nécessaire et excessive dans la gestion financière des ménages."
      },
      "de": {
        "title": "Ist das alles schlechte Schulden oder gute Schulden?",
        "summary": "Eine Familie sieht sich einer schwerwiegenden finanziellen und emotionalen Krise gegenüber, nachdem Karen erhebliche Schuldenverpflichtungen hinterlassen hat. Die Situation veranschaulicht die Herausforderungen, notwendige und übermäßige Schulden in der Haushaltsfinanzverwaltung zu unterscheiden."
      },
      "es": {
        "title": "¿Es esta toda deuda mala o deuda buena?",
        "summary": "Una familia enfrenta una crisis financiera y emocional severa después de que Karen deja atrás obligaciones de deuda sustanciales. La situación ilustra los desafíos de distinguir entre deuda necesaria y excesiva en la gestión financiera del hogar."
      }
    }
  },
  {
    "title": "Women’s wealth is expected to boom: Where they are investing and how they can maximize returns",
    "slug": "womens-wealth-boom-investment-returns",
    "url": "https://www.cnbc.com/2026/02/26/womens-wealth-is-expected-to-boom-where-they-are-investing-and-how-they-can-maximize-returns.html",
    "source": "CNBC",
    "date": "2026-02-26T18:19:48.000Z",
    "summary": "Cerulli Associates projects $105 trillion in wealth transfers to heirs by 2048, with about half going to spouses. This wealth transfer represents a significant opportunity for investment and wealth management planning. The trend highlights growing importance of strategic wealth management for inheritors.",
    "content": "Cerulli Associates anticipates $105 trillion in wealth will be passed down to heirs through 2048, with about $54 trillion of that inheritance going to spouses.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "女性财富繁荣在即：她们的投资方向及如何实现收益最大化",
        "summary": "Cerulli Associates预测到2048年将有105万亿美元的财富转移给继承人，其中约一半将流向配偶。这一财富转移为投资和财富管理规划带来了重大机遇。这一趋势凸显了战略财富管理对继承人的日益重要性。"
      },
      "fr": {
        "title": "La richesse des femmes devrait augmenter : où elles investissent et comment maximiser les rendements",
        "summary": "Cerulli Associates projette 105 billions de dollars de transferts de richesse aux héritiers d'ici 2048, dont environ la moitié aux conjoints. Ce transfert de richesse représente une opportunité importante pour la planification des investissements et de la gestion patrimoniale. La tendance souligne l'importance croissante de la gestion stratégique de la richesse pour les héritiers."
      },
      "de": {
        "title": "Frauenvermögen soll boomen: Wo sie investieren und wie sie Renditen maximieren können",
        "summary": "Cerulli Associates prognostiziert bis 2048 Vermögensübergaben in Höhe von 105 Billionen Dollar an Erben, wobei etwa die Hälfte an Ehepartner geht. Diese Vermögensübertragung stellt eine bedeutende Gelegenheit für Investitionen und Vermögensplanungplanung dar. Der Trend unterstreicht die wachsende Bedeutung der strategischen Vermögensplanung für Erben."
      },
      "es": {
        "title": "La riqueza de las mujeres está destinada a explotar: dónde están invirtiendo y cómo pueden maximizar rendimientos",
        "summary": "Cerulli Associates proyecta $105 billones en transferencias de riqueza a herederos para 2048, siendo aproximadamente la mitad a cónyuges. Esta transferencia de riqueza representa una oportunidad significativa para la inversión y la planificación de gestión patrimonial. La tendencia destaca la creciente importancia de la gestión estratégica de la riqueza para los herederos."
      }
    }
  },
  {
    "title": "EBay to cut 800 jobs, joining other tech names in announcing layoffs as AI reshapes workforces",
    "slug": "ebay-cuts-800-jobs-ai-reshapes-workforce",
    "url": "https://www.marketwatch.com/story/ebay-to-cut-800-jobs-joining-other-tech-names-in-announcing-layoffs-as-ai-reshapes-workforces-9131cacf?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T18:09:00.000Z",
    "summary": "eBay announced 800 job cuts, continuing a trend of tech layoffs as companies adjust to AI-driven workforce restructuring. The cuts follow earlier layoffs at Amazon and Pinterest, and come shortly after eBay's acquisition of secondhand-clothing marketplace Depop. This reflects broader industry concerns about AI's impact on employment.",
    "content": "The layoff announcement comes a week after eBay agreed to buy secondhand-clothing site Depop and follows job cuts earlier this year by Amazon and Pinterest.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "eBay将裁员800人，加入其他科技公司行列在AI重塑劳动力之际宣布裁员",
        "summary": "eBay宣布裁员800人，继续了科技公司因AI驱动的劳动力重组而进行裁员的趋势。此次裁员跟在亚马逊和Pinterest的早期裁员之后，也发生在eBay收购二手服装市场Depop不久之后。这反映了更广泛的行业对AI对就业影响的担忧。"
      },
      "fr": {
        "title": "eBay va supprimer 800 emplois, rejoignant d'autres grandes technologies annonçant des réductions d'effectifs à mesure que l'IA redessine les effectifs",
        "summary": "eBay a annoncé la suppression de 800 emplois, poursuivant la tendance des licenciements technologiques alors que les entreprises s'ajustent à la restructuration de la main-d'œuvre pilotée par l'IA. Les réductions suivent les licenciements antérieurs chez Amazon et Pinterest, et interviennent peu après l'acquisition par eBay de la place de marché de vêtements d'occasion Depop. Cela reflète les préoccupations plus larges du secteur quant à l'impact de l'IA sur l'emploi."
      },
      "de": {
        "title": "eBay baut 800 Stellen ab und gesellt sich zu anderen Tech-Giganten, die Entlassungen ankündigen, während KI die Belegschaft umgestaltet",
        "summary": "eBay kündigte 800 Stellenabbau an und setzt damit den Trend von Entlassungen im Tech-Bereich fort, da Unternehmen sich der KI-gesteuerten Umstrukturierung der Arbeitskräfte anpassen. Die Kürzungen folgen früheren Entlassungen bei Amazon und Pinterest und kommen kurz nach eBays Übernahme des Marktplatzes für gebrauchte Kleidung Depop. Dies spiegelt die breiteren Bedenken der Branche über die Auswirkungen der KI auf die Beschäftigung wider."
      },
      "es": {
        "title": "eBay va a recortar 800 empleos, uniéndose a otros gigantes tecnológicos al anunciar despidos mientras la IA remodela la fuerza laboral",
        "summary": "eBay anunció 800 recortes de empleos, continuando la tendencia de despidos tecnológicos mientras las empresas se ajustan a la reestructuración de la fuerza laboral impulsada por IA. Los recortes siguen los despidos anteriores en Amazon y Pinterest, y ocurren poco después de la adquisición de eBay del mercado de ropa de segunda mano Depop. Esto refleja las preocupaciones más amplias de la industria sobre el impacto de la IA en el empleo."
      }
    }
  },
  {
    "title": "Mortgage rates fall below 6%, giving buyers a glimpse of affordability",
    "slug": "mortgage-rates-fall-below-6-percent-affordability",
    "url": "https://www.marketwatch.com/story/mortgage-rates-fall-below-6-giving-buyers-a-glimpse-of-affordability-67829c50?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T18:09:00.000Z",
    "summary": "Mortgage rates have dropped below 6%, potentially stimulating home-buying activity during the spring season. According to Freddie Mac's chief economist, lower rates could attract more buyers to the market. This development offers relief to prospective homebuyers facing previous affordability challenges.",
    "content": "Falling rates could “drive more potential buyers into the market for spring home-buying season,” says Freddie Mac’s chief economist.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "抵押贷款利率跌破6%，给买家一种可负担性的希望",
        "summary": "抵押贷款利率已跌破6%，可能会在春季刺激住房购买活动。根据房地美首席经济学家的说法，较低的利率可能会吸引更多买家进入市场。这一进展为面临之前可负担性挑战的潜在购房者提供了救济。"
      },
      "fr": {
        "title": "Les taux hypothécaires chutent sous les 6 %, donnant aux acheteurs un aperçu de l'accessibilité",
        "summary": "Les taux hypothécaires sont tombés en dessous de 6 %, ce qui pourrait potentiellement stimuler l'activité d'achat de maisons au printemps. Selon le chef économiste de Freddie Mac, les taux plus bas pourraient attirer plus d'acheteurs sur le marché. Cette évolution offre un soulagement aux futurs acheteurs de maisons confrontés aux défis d'accessibilité précédents."
      },
      "de": {
        "title": "Hypothekenzinsen fallen unter 6 % und geben Käufern einen Hauch von Erschwinglichkeit",
        "summary": "Die Hypothekenzinssätze sind unter 6 % gefallen und könnten möglicherweise die Hauseinkaufstätigkeit in der Frühlingssaison ankurbeln. Laut dem Chefökonomen von Freddie Mac könnten niedrigere Zinssätze mehr Käufer auf den Markt bringen. Diese Entwicklung bietet Erleichterung für zukünftige Eigenheimkäufer, die sich mit früheren Erschwinglichkeitsproblemen konfrontiert sehen."
      },
      "es": {
        "title": "Las tasas hipotecarias caen por debajo del 6%, dando a los compradores un atisbo de asequibilidad",
        "summary": "Las tasas hipotecarias han caído por debajo del 6%, lo que potencialmente podría estimular la actividad de compra de viviendas durante la temporada de primavera. Según el economista jefe de Freddie Mac, las tasas más bajas podrían atraer a más compradores al mercado. Este desarrollo ofrece alivio a los posibles compradores de viviendas que enfrentan desafíos de asequibilidad anteriores."
      }
    }
  },
  {
    "title": "Walmart to pay $100m over claims it misled drivers over pay",
    "slug": "walmart-pays-100m-misleading-drivers-pay",
    "url": "https://www.bbc.com/news/articles/cly1leyyvvdo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-26T18:04:03.000Z",
    "summary": "Walmart agreed to pay $100 million to settle claims that it misled delivery drivers about earnings potential. The company had promised drivers higher pay and tips than they actually received. This settlement highlights ongoing disputes over gig economy worker compensation.",
    "content": "The company told drivers they could expect to receive more in pay and tips than they actually did.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "沃尔玛因误导司机工资问题同意支付1亿美元",
        "summary": "沃尔玛同意支付1亿美元，以解决误导送货司机关于收入潜力的索赔。该公司曾承诺司机获得比他们实际收到的更高工资和小费。这项和解凸显了零工经济劳动者薪酬方面持续存在的纠纷。"
      },
      "fr": {
        "title": "Walmart accepte de payer 100 millions de dollars pour avoir induit les chauffeurs en erreur sur leurs salaires",
        "summary": "Walmart a accepté de payer 100 millions de dollars pour régler les réclamations selon lesquelles elle a induit en erreur les chauffeurs de livraison concernant le potentiel de revenus. L'entreprise avait promis aux conducteurs des salaires et des pourboires plus élevés qu'ils n'en avaient réellement reçus. Ce règlement souligne les différends persistants concernant la rémunération des travailleurs de l'économie des petits boulots."
      },
      "de": {
        "title": "Walmart zahlt 100 Millionen Dollar für Vorwürfe der Täuschung von Fahrern bei Löhnen",
        "summary": "Walmart einigt sich darauf, 100 Millionen Dollar zu zahlen, um Ansprüche beizulegen, wonach das Unternehmen Lieferfahrer über das Ertragspotenzial in die Irre geführt hat. Das Unternehmen hatte den Fahrern höhere Löhne und Trinkgelder versprochen, als sie tatsächlich erhalten hatten. Diese Beilegung unterstreicht anhaltende Disputes über die Vergütung von Gig-Economy-Arbeitern."
      },
      "es": {
        "title": "Walmart pagará $100 millones por acusaciones de engañar a conductores sobre sus salarios",
        "summary": "Walmart acordó pagar $100 millones para resolver acusaciones de que engañó a conductores de entrega sobre el potencial de ganancias. La empresa había prometido a los conductores salarios y propinas más altos de los que realmente recibieron. Este acuerdo destaca disputas continuas sobre la compensación de trabajadores de la economía de conciertos."
      }
    }
  },
  {
    "title": "Krispy Kreme’s sales fell again. Here’s why it was good for the stock this time.",
    "slug": "krispy-kreme-sales-decline-stock-surge",
    "url": "https://www.marketwatch.com/story/krispy-kremes-sales-fell-again-heres-why-it-was-good-for-the-stock-this-time-e53ee33d?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T18:03:00.000Z",
    "summary": "Krispy Kreme's stock surged despite declining sales in its fourth-quarter results, as investors saw signs of a potential turnaround. The company's performance indicators suggest improving business fundamentals ahead. This positive market reaction reflects investor optimism about the company's recovery trajectory.",
    "content": "Krispy Kreme’s stock was soaring Thursday as fourth-quarter results provide signs that a turnaround may be starting to take hold.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Krispy Kreme销售再次下降。这次为什么对股票有利",
        "summary": "尽管第四季度销售下降，Krispy Kreme的股票仍大幅上涨，因为投资者看到了潜在扭转的迹象。该公司的性能指标表明未来业务基本面正在改善。这种积极的市场反应反映了投资者对该公司复苏轨迹的乐观态度。"
      },
      "fr": {
        "title": "Les ventes de Krispy Kreme ont encore diminué. Voici pourquoi c'était bon pour l'action cette fois-ci",
        "summary": "Les actions de Krispy Kreme ont augmenté malgré la baisse des ventes au quatrième trimestre, car les investisseurs ont vu des signes d'un redressement potentiel. Les indicateurs de performance de l'entreprise suggèrent une amélioration des fondamentaux commerciaux à venir. Cette réaction positive du marché reflète l'optimisme des investisseurs quant à la trajectoire de redressement de l'entreprise."
      },
      "de": {
        "title": "Krispy Kremes Verkäufe sind erneut gesunken. Hier ist, warum es diesmal gut für die Aktie war",
        "summary": "Die Aktienkurse von Krispy Kreme stiegen trotz rückläufiger Umsätze in den Ergebnissen des vierten Quartals, da Investoren Zeichen einer möglichen Erholung sahen. Die Leistungsindikatoren des Unternehmens deuten auf verbesserte Geschäftsfundamente voraus. Diese positive Marktreaktion spiegelt den Optimismus der Investoren hinsichtlich der Erholungstrajektorie des Unternehmens wider."
      },
      "es": {
        "title": "Las ventas de Krispy Kreme volvieron a caer. Aquí está por qué fue bueno para las acciones esta vez",
        "summary": "Las acciones de Krispy Kreme se dispararon a pesar de las ventas decrecientes en los resultados del cuarto trimestre, ya que los inversores vieron signos de una posible recuperación. Los indicadores de desempeño de la empresa sugieren fundamentales comerciales mejorados en el futuro. Esta reacción positiva del mercado refleja el optimismo de los inversores sobre la trayectoria de recuperación de la empresa."
      }
    }
  },
  {
    "title": "Here’s how Trump’s 401(k)-style retirement accounts could work",
    "slug": "trump-401k-retirement-accounts-proposal",
    "url": "https://www.marketwatch.com/story/heres-how-trumps-401-k-style-retirement-accounts-could-work-d23983a2?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T17:58:00.000Z",
    "summary": "President Trump proposed creating new 401(k)-style retirement accounts for workers without employer-sponsored plans during his State of the Union address. The proposal addresses a significant gap in retirement savings access but raises questions about implementation and effectiveness. The initiative highlights the ongoing policy debate around retirement security.",
    "content": "During his State of the Union address, President Trump unveiled a proposal to create retirement accounts for people who don’t have one at their jobs — an idea that puts the issue of long-term financial health on center stage, but also raises more questions than it answers.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "特朗普的401(k)风格退休账户如何运作",
        "summary": "特朗普总统在国情咨文中提议为没有雇主赞助计划的工人创建新的401(k)风格退休账户。该提案解决了退休储蓄获取的重大差距，但引发了关于实施和有效性的问题。该举措凸显了围绕退休保障的持续政策辩论。"
      },
      "fr": {
        "title": "Voici comment fonctionneraient les comptes de retraite de style 401(k) de Trump",
        "summary": "Le président Trump a proposé de créer de nouveaux comptes de retraite de style 401(k) pour les travailleurs sans plans parrainés par l'employeur lors de son discours sur l'état de l'union. La proposition comble une lacune importante dans l'accès à l'épargne-retraite, mais soulève des questions sur la mise en œuvre et l'efficacité. L'initiative met en évidence le débat politique en cours sur la sécurité de la retraite."
      },
      "de": {
        "title": "So könnte Trumps 401(k)-ähnliche Rentenkonten funktionieren",
        "summary": "Präsident Trump schlug vor, neue 401(k)-ähnliche Rentenkonten für Arbeitnehmer ohne arbeitgeberfinanzierte Pläne während seiner Rede zur Lage der Nation zu schaffen. Der Vorschlag schließt eine erhebliche Lücke beim Zugang zu Altersversorgungssparen, wirft aber Fragen zur Umsetzung und Wirksamkeit auf. Die Initiative unterstreicht die laufende politische Debatte zur Alterssicherheit."
      },
      "es": {
        "title": "Así es como podrían funcionar las cuentas de jubilación de estilo 401(k) de Trump",
        "summary": "El presidente Trump propuso crear nuevas cuentas de jubilación de estilo 401(k) para trabajadores sin planes patrocinados por el empleador durante su discurso sobre el estado de la unión. La propuesta aborda una brecha significativa en el acceso al ahorro para la jubilación pero genera preguntas sobre la implementación y eficacia. La iniciativa destaca el debate político continuo en torno a la seguridad de la jubilación."
      }
    }
  },
  {
    "title": "Warren calls Trump’s bluff on affordability after State of the Union",
    "slug": "warren-challenges-trump-affordability-claims",
    "url": "https://www.cnbc.com/2026/02/26/warren-calls-trumps-bluff-on-affordability-after-state-of-the-union.html",
    "source": "CNBC",
    "date": "2026-02-26T17:56:40.000Z",
    "summary": "Senator Elizabeth Warren challenged President Trump's claims about solving affordability issues following his State of the Union address. Trump blamed Democrats for affordability problems while claiming his administration resolved them, contradicting polling that shows voters remain concerned. The exchange reflects broader political debate over economic policy and cost-of-living challenges.",
    "content": "Trump laid blame on Democrats for affordability and argued his administration has solved the problem, as polls consistently show increased concern from voters.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "沃伦在国情咨文后质疑特朗普关于可负担性的声称",
        "summary": "美国参议员伊丽莎白·沃伦在国情咨文后质疑特朗普解决可负担性问题的声称。特朗普指责民主党人造成了可负担性问题，同时声称他的政府已经解决了这些问题，但这与显示选民仍然担忧的民调相矛盾。这一交流反映了关于经济政策和生活成本挑战的更广泛的政治辩论。"
      },
      "fr": {
        "title": "Warren met Trump au défi sur l'accessibilité après le discours sur l'État de l'Union",
        "summary": "La sénatrice Elizabeth Warren a mis en doute les affirmations du président Trump concernant la résolution des problèmes d'accessibilité suite à son discours sur l'État de l'Union. Trump a imputé aux démocrates les problèmes d'accessibilité tout en affirmant que son administration les a résolus, ce qui contredit les sondages montrant que les électeurs restent préoccupés. L'échange reflète un débat politique plus large sur la politique économique et les défis du coût de la vie."
      },
      "de": {
        "title": "Warren stellt Trumps Behauptungen zur Erschwinglichkeit nach der State of the Union in Frage",
        "summary": "Die Senatorin Elizabeth Warren stellte Präsident Trumps Behauptungen zur Lösung von Erschwinglichkeitsproblemen nach seiner State-of-the-Union-Rede in Frage. Trump beschuldigte die Demokraten für Erschwinglichkeitsprobleme, während er behauptete, dass seine Regierung sie gelöst habe, was der Umfrage widerspricht, die zeigt, dass Wähler besorgt bleiben. Der Austausch spiegelt eine breitere politische Debatte über Wirtschaftspolitik und die Herausforderungen der Lebenshaltungskosten wider."
      },
      "es": {
        "title": "Warren desafía a Trump sobre la accesibilidad después del Estado de la Unión",
        "summary": "La senadora Elizabeth Warren cuestionó las afirmaciones del presidente Trump sobre resolver problemas de accesibilidad tras su discurso sobre el Estado de la Unión. Trump culpó a los demócratas por los problemas de accesibilidad mientras afirmaba que su administración los había resuelto, contradiciendo las encuestas que muestran que los votantes siguen preocupados. El intercambio refleja un debate político más amplio sobre la política económica y los desafíos del costo de vida."
      }
    }
  },
  {
    "title": "Stocks making the biggest moves midday: Paramount Skydance, Nvidia, Cars.com, Salesforce & more",
    "slug": "stocks-biggest-moves-midday-trading",
    "url": "https://www.cnbc.com/2026/02/26/stocks-making-the-biggest-moves-midday-psky-nvda-cars-crm.html",
    "source": "CNBC",
    "date": "2026-02-26T17:56:36.000Z",
    "summary": "Several major stocks experienced significant price movements in midday trading, including Paramount, Skydance, Nvidia, Cars.com, and Salesforce. The market volatility reflects ongoing investor sentiment across technology, entertainment, and automotive sectors. These movements suggest continued market uncertainty and sector-specific dynamics.",
    "content": "Here are the biggest movers in midday trading.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "中午交易中波动最大的股票：派拉蒙、斯凯德斯、英伟达、Cars.com、销售力等",
        "summary": "包括派拉蒙、斯凯德斯、英伟达、Cars.com和销售力在内的几只大型股票在中午交易中经历了显著的价格波动。市场波动反映了科技、娱乐和汽车行业投资者情绪的变化。这些波动表明市场持续存在不确定性和部门特定的动态。"
      },
      "fr": {
        "title": "Les actions qui se déplacent le plus à midi : Paramount Skydance, Nvidia, Cars.com, Salesforce et plus",
        "summary": "Plusieurs actions majeures ont connu des mouvements de prix importants lors des échanges de midi, notamment Paramount, Skydance, Nvidia, Cars.com et Salesforce. La volatilité du marché reflète le sentiment continu des investisseurs dans les secteurs de la technologie, du divertissement et de l'automobile. Ces mouvements suggèrent une incertitude continue du marché et des dynamiques spécifiques au secteur."
      },
      "de": {
        "title": "Die Aktien mit den größten Bewegungen am Mittag: Paramount Skydance, Nvidia, Cars.com, Salesforce und mehr",
        "summary": "Mehrere große Aktien erlebten während des Mittagshandels erhebliche Preisbewegungen, darunter Paramount, Skydance, Nvidia, Cars.com und Salesforce. Die Marktvolatilität spiegelt die anhaltende Anlegerstimmung in den Bereichen Technologie, Unterhaltung und Automobil wider. Diese Bewegungen deuten auf anhaltende Marktungewissheit und branchenspezifische Dynamiken hin."
      },
      "es": {
        "title": "Acciones que se mueven más al mediodía: Paramount Skydance, Nvidia, Cars.com, Salesforce y más",
        "summary": "Varias acciones principales experimentaron movimientos de precios significativos durante las operaciones del mediodía, incluidas Paramount, Skydance, Nvidia, Cars.com y Salesforce. La volatilidad del mercado refleja el sentimiento continuo de los inversores en los sectores de tecnología, entretenimiento y automoción. Estos movimientos sugieren una incertidumbre continua del mercado y dinámicas específicas del sector."
      }
    }
  },
  {
    "title": "This type of 401(k) plan could boost retirement savings up to 22% — but it comes at a price",
    "slug": "401k-plan-boost-retirement-savings-cost",
    "url": "https://www.marketwatch.com/story/more-young-workers-are-being-nudged-into-these-tailored-401-k-accounts-should-you-make-the-switch-ba518ea3?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T17:54:00.000Z",
    "summary": "A specialized type of 401(k) plan can potentially increase retirement savings by up to 22%, but requires careful cost-benefit analysis. More young workers are being encouraged to switch to these tailored accounts. The tradeoff between higher returns and associated costs warrants consideration before making the switch.",
    "content": "More young workers are being nudged into these tailored 401(k) accounts. Should you make the switch?",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "这种401(k)计划可能会增加退休储蓄高达22% — 但需要付出代价",
        "summary": "一种专门的401(k)计划可能会将退休储蓄增加高达22%，但需要进行仔细的成本效益分析。越来越多的年轻员工被鼓励切换到这些定制账户。在做出切换之前，值得考虑更高收益和相关成本之间的权衡。"
      },
      "fr": {
        "title": "Ce type de plan 401(k) pourrait augmenter l'épargne-retraite jusqu'à 22% — mais cela a un coût",
        "summary": "Un type spécialisé de plan 401(k) peut potentiellement augmenter l'épargne-retraite jusqu'à 22%, mais nécessite une analyse minutieuse des coûts-avantages. De plus en plus de jeunes travailleurs sont encouragés à passer à ces comptes personnalisés. Le compromis entre des rendements plus élevés et les coûts associés justifie une considération avant de faire le changement."
      },
      "de": {
        "title": "Diese Art von 401(k)-Plan könnte die Altersvorsorge um bis zu 22% erhöhen — aber es hat seinen Preis",
        "summary": "Eine spezialisierte Art von 401(k)-Plan kann potenziell die Altersvorsorge um bis zu 22% erhöhen, erfordert aber eine sorgfältige Kosten-Nutzen-Analyse. Immer mehr junge Arbeitnehmer werden ermutigt, zu diesen maßgeschneiderten Konten zu wechseln. Der Kompromiss zwischen höheren Renditen und damit verbundenen Kosten rechtfertigt eine Überlegung vor dem Wechsel."
      },
      "es": {
        "title": "Este tipo de plan 401(k) podría aumentar los ahorros para la jubilación hasta un 22% — pero tiene un costo",
        "summary": "Un tipo especializado de plan 401(k) puede potencialmente aumentar los ahorros para la jubilación hasta un 22%, pero requiere un análisis cuidadoso de costo-beneficio. Más trabajadores jóvenes están siendo animados a cambiar a estas cuentas personalizadas. El compromiso entre mayores rendimientos y costos asociados merece consideración antes de hacer el cambio."
      }
    }
  },
  {
    "title": "Need a side hustle to support your retirement dreams? Here’s how to find work right now.",
    "slug": "side-hustle-retirement-savings-job-market",
    "url": "https://www.marketwatch.com/story/need-a-side-hustle-to-support-your-retirement-dreams-heres-how-to-find-work-right-now-6438bea8?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T17:53:00.000Z",
    "summary": "Finding supplemental income through side work remains a viable strategy for boosting retirement savings in a challenging job market. The article offers practical guidance for securing side employment. This addresses the growing need for workers to diversify income sources for long-term financial security.",
    "content": "7 tips for navigating this tricky job market.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "需要兼职来支持你的退休梦想吗?以下是如何立即找到工作的方法。",
        "summary": "在具有挑战性的就业市场中,通过兼职工作获得补充收入仍然是增加退休储蓄的可行策略。这篇文章为获得兼职工作提供了实用指导。这解决了工作者需要多元化收入来源以确保长期财务安全的日益增长的需求。"
      },
      "fr": {
        "title": "Avez-vous besoin d'un travail complémentaire pour soutenir vos rêves de retraite? Voici comment trouver du travail dès maintenant.",
        "summary": "Trouver un revenu supplémentaire grâce à un travail complémentaire reste une stratégie viable pour augmenter l'épargne retraite dans un marché du travail difficile. L'article offre des conseils pratiques pour obtenir un emploi complémentaire. Cela répond au besoin croissant des travailleurs de diversifier leurs sources de revenus pour une sécurité financière à long terme."
      },
      "de": {
        "title": "Benötigen Sie einen Nebenjob, um Ihren Ruhestandstraum zu unterstützen? So finden Sie jetzt einen Job.",
        "summary": "Die Suche nach Zusatzeinkommen durch Nebenbeschäftigung bleibt eine praktikable Strategie zur Steigerung der Altersvorsorge in einem schwierigen Arbeitsmarkt. Der Artikel bietet praktische Anleitung zur Sicherung von Nebenbeschäftigung. Dies entspricht dem wachsenden Bedarf von Arbeitnehmern, ihre Einkommensquellen für langfristige finanzielle Sicherheit zu diversifizieren."
      },
      "es": {
        "title": "¿Necesitas un trabajo secundario para apoyar tus sueños de jubilación? Aquí te mostramos cómo encontrar trabajo ahora mismo.",
        "summary": "Encontrar ingresos complementarios a través de trabajo adicional sigue siendo una estrategia viable para aumentar los ahorros para la jubilación en un mercado laboral desafiante. El artículo ofrece orientación práctica para asegurar empleo adicional. Esto aborda la necesidad creciente de los trabajadores de diversificar las fuentes de ingresos para la seguridad financiera a largo plazo."
      }
    }
  },
  {
    "title": "You can finally invest like the 1% —  use this stress test before getting locked into private markets",
    "slug": "invest-like-1-percent-private-markets-stress-test",
    "url": "https://www.marketwatch.com/story/wall-street-is-courting-main-street-with-shiny-private-market-products-the-risks-are-hiding-in-plain-sight-d2242f8e?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T17:47:00.000Z",
    "summary": "Private credit and institutional-grade investments are becoming accessible to individual investors, expanding portfolio options beyond traditional markets. However, investors should conduct thorough stress testing before committing to these investments, as promised returns may not align with personal financial goals. This democratization of investment opportunities requires careful due diligence.",
    "content": "Private credit and other institutional investments are now within reach for individuals. But their promises don’t always align with your portfolio.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "你终于可以像1%的人一样投资了——在陷入私募市场之前使用这个压力测试",
        "summary": "私募信贷和机构级投资正变得对个人投资者可及,超越传统市场的投资组合选择正在扩大。然而,投资者在承诺这些投资之前应该进行彻底的压力测试,因为承诺的回报可能与个人的财务目标不一致。这种投资机会的民主化需要仔细的尽职调查。"
      },
      "fr": {
        "title": "Vous pouvez enfin investir comme les 1% — utilisez ce test de stress avant de vous enfermer dans les marchés privés",
        "summary": "Les crédits privés et les investissements institutionnels deviennent accessibles aux investisseurs individuels, élargissant les options de portefeuille au-delà des marchés traditionnels. Cependant, les investisseurs doivent effectuer un test de stress approfondi avant de s'engager dans ces investissements, car les rendements promis peuvent ne pas correspondre aux objectifs financiers personnels. Cette démocratisation des opportunités d'investissement nécessite une diligence raisonnable minutieuse."
      },
      "de": {
        "title": "Sie können endlich wie die 1% investieren — verwenden Sie diesen Stresstest, bevor Sie sich in Privatmärkte einschließen",
        "summary": "Private Kreditvergabe und institutionelle Investitionen werden für Einzelanleger zugänglich und erweitern die Portfoliooptionen über traditionelle Märkte hinaus. Allerdings sollten Anleger gründliche Stresstests durchführen, bevor sie sich auf diese Investitionen einlassen, da versprochene Renditen möglicherweise nicht mit persönlichen Finanzzielen übereinstimmen. Diese Demokratisierung der Investitionsmöglichkeiten erfordert sorgfältige Due Diligence."
      },
      "es": {
        "title": "Finalmente puedes invertir como el 1% — usa esta prueba de estrés antes de quedar atrapado en mercados privados",
        "summary": "El crédito privado y las inversiones de grado institucional se están volviendo accesibles para inversionistas individuales, ampliando las opciones de cartera más allá de los mercados tradicionales. Sin embargo, los inversionistas deben realizar pruebas de estrés exhaustivas antes de comprometerse con estas inversiones, ya que los rendimientos prometidos pueden no alinearse con los objetivos financieros personales. Esta democratización de oportunidades de inversión requiere una debida diligencia cuidadosa."
      }
    }
  },
  {
    "title": "Congress takes on Nvidia, White House as it pushes for chip export limits",
    "slug": "congress-chip-export-limits-china",
    "url": "https://www.cnbc.com/2026/02/26/congress-pushes-back-on-nvidia-white-house-with-chip-export-limits.html",
    "source": "CNBC",
    "date": "2026-02-26T17:41:11.000Z",
    "summary": "A bipartisan coalition of lawmakers is advancing legislation to restrict exports of advanced semiconductor chips to China. The effort reflects concerns about national security and technological competition with China. The push for export controls highlights ongoing geopolitical tensions around critical technology sectors.",
    "content": "A bipartisan group of lawmakers in both chambers is working to limit advanced chip exports to China.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "国会对英伟达和白宫进行施压,推动芯片出口限制",
        "summary": "一个两党联盟的议员正在推进立法以限制先进半导体芯片向中国的出口。这一努力反映了对国家安全和与中国技术竞争的担忧。推动出口管制凸显了围绕关键技术领域的持续地缘政治紧张局势。"
      },
      "fr": {
        "title": "Le Congrès s'en prend à Nvidia et la Maison-Blanche alors qu'il pousse pour les limites d'exportation de puces",
        "summary": "Une coalition bipartisane de législateurs fait avancer une législation pour restreindre les exportations de puces de semi-conducteurs avancées vers la Chine. L'effort reflète les préoccupations concernant la sécurité nationale et la concurrence technologique avec la Chine. La poussée pour les contrôles d'exportation met en évidence les tensions géopolitiques continues autour des secteurs technologiques critiques."
      },
      "de": {
        "title": "Der Kongress stellt sich Nvidia und dem Weißen Haus entgegen, während er auf Chipexportbeschränkungen drängt",
        "summary": "Eine überparteiliche Koalition von Gesetzgebern treibt eine Gesetzgebung voran, um die Ausfuhr fortschrittlicher Halbleiterchips nach China zu beschränken. Die Bemühung spiegelt Bedenken hinsichtlich der nationalen Sicherheit und des technologischen Wettbewerbs mit China wider. Das Drängen auf Ausfuhrkontrollen unterstreicht anhaltende geopolitische Spannungen um kritische Technologiesektoren."
      },
      "es": {
        "title": "El Congreso se enfrenta a Nvidia y la Casa Blanca mientras presiona por límites de exportación de chips",
        "summary": "Una coalición bipartidista de legisladores está impulsando una legislación para restringir las exportaciones de chips de semiconductores avanzados a China. El esfuerzo refleja preocupaciones sobre la seguridad nacional y la competencia tecnológica con China. El impulso para los controles de exportación destaca las tensiones geopolíticas continuas en torno a los sectores tecnológicos críticos."
      }
    }
  },
  {
    "title": "Jim Cramer says this unfairly punished stock is worth buying for new investors",
    "slug": "jim-cramer-undervalued-stock-recommendation",
    "url": "https://www.cnbc.com/2026/02/26/jim-cramer-says-this-unfairly-punished-stock-is-worth-buying-for-new-investors.html",
    "source": "CNBC",
    "date": "2026-02-26T17:33:55.000Z",
    "summary": "CNBC's Jim Cramer identified a stock he believes has been unfairly undervalued and recommended it to new investors during the Investing Club's regular morning meeting. The recommendation suggests the stock may offer value relative to market sentiment. Cramer's analysis highlights investment opportunities that may be overlooked by the broader market.",
    "content": "The Investing Club holds its \"Morning Meeting\" every weekday at 10:20 a.m. ET.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Jim Cramer说这只遭受不公正打压的股票值得新投资者购买",
        "summary": "CNBC的吉姆·克拉默指出了一只他认为被不公平低估的股票，并在投资俱乐部的常规晨会上向新投资者推荐了它。该推荐表明该股票相对于市场情绪可能提供价值。克拉默的分析突出了可能被更广泛市场忽视的投资机会。"
      },
      "fr": {
        "title": "Jim Cramer dit que cette action injustement punie vaut la peine d'être achetée pour les nouveaux investisseurs",
        "summary": "Jim Cramer de CNBC a identifié une action qu'il croit avoir été injustement sous-évaluée et l'a recommandée aux nouveaux investisseurs lors de la réunion matinale régulière du Club d'investissement. La recommandation suggère que l'action pourrait offrir de la valeur par rapport au sentiment du marché. L'analyse de Cramer met en évidence les opportunités d'investissement qui pourraient être négligées par le marché plus large."
      },
      "de": {
        "title": "Jim Cramer sagt, dass diese ungerechtfertigt bestrafte Aktie für neue Anleger einen Kauf wert ist",
        "summary": "Jim Cramers von CNBC identifizierte eine Aktie, die seiner Meinung nach unfair unterbewertet wurde, und empfahl sie neuen Anlegern in der regelmäßigen Morgenveranstaltung des Investment Clubs. Die Empfehlung deutet darauf hin, dass die Aktie im Vergleich zur Marktbewertung einen Wert bieten könnte. Cramers Analyse hebt Anlagemöglichkeiten hervor, die vom breiteren Markt möglicherweise übersehen werden."
      },
      "es": {
        "title": "Jim Cramer dice que esta acción injustamente castigada vale la pena comprar para nuevos inversores",
        "summary": "Jim Cramer de CNBC identificó una acción que cree ha sido injustamente infravalorada y la recomendó a nuevos inversores durante la reunión matutina regular del Club de Inversión. La recomendación sugiere que la acción puede ofrecer valor en relación con el sentimiento del mercado. El análisis de Cramer destaca las oportunidades de inversión que el mercado más amplio podría pasar por alto."
      }
    }
  },
  {
    "title": "Wall Street loves this 'AI-proof retail compounder'",
    "slug": "ai-proof-retail-compounder-wall-street",
    "url": "https://www.cnbc.com/2026/02/26/wall-street-loves-this-ai-proof-retail-compounder.html",
    "source": "CNBC",
    "date": "2026-02-26T17:27:39.000Z",
    "summary": "Prominent financial institutions Bernstein and Bank of America identified a retailer expected to outperform competitors despite industry concerns about AI disruption and tariff impacts. The retailer's business model demonstrates resilience against technological change and trade uncertainties. This analysis reflects divergent investment outlooks across the retail sector.",
    "content": "Bernstein and Bank of America both say this retailer is set to outperform as others are struck by AI disruption fears and renewed tariff uncertainty.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "华尔街喜欢这个\"防AI零售复合体\"",
        "summary": "伯恩斯坦和美国银行等知名金融机构确定了一家零售商，尽管存在关于人工智能颠覆和关税影响的行业关注，但该零售商预计将超越竞争对手。该零售商的商业模式展现了对技术变革和贸易不确定性的抵抗力。这一分析反映了零售部门中存在分歧的投资前景。"
      },
      "fr": {
        "title": "Wall Street adore ce \"composé de détail à l'épreuve de l'IA\"",
        "summary": "Des institutions financières éminentes Bernstein et Bank of America ont identifié un détaillant censé surpasser ses concurrents malgré les préoccupations du secteur concernant les perturbations liées à l'IA et les impacts tarifaires. Le modèle commercial du détaillant démontre une résilience face aux changements technologiques et aux incertitudes commerciales. Cette analyse reflète des perspectives d'investissement divergentes dans le secteur de la vente au détail."
      },
      "de": {
        "title": "Wall Street liebt diesen \"KI-sicheren Einzelhandelszusammensetzung\"",
        "summary": "Prominent Financial Institutions Bernstein und Bank of America identifizierten einen Einzelhändler, von dem erwartet wird, dass er Konkurrenten trotz Bedenken der Branche bezüglich KI-Störungen und Zollauswirkungen übertrifft. Das Geschäftsmodell des Einzelhändlers zeigt Widerstandsfähigkeit gegen technologischen Wandel und Handelsunsicherheiten. Diese Analyse spiegelt unterschiedliche Anlageperspektiven im Einzelhandelssektor wider."
      },
      "es": {
        "title": "Wall Street ama este \"compounder minorista a prueba de IA\"",
        "summary": "Instituciones financieras prominentes Bernstein y Bank of America identificaron un minorista que se espera que supere a los competidores a pesar de las preocupaciones de la industria sobre la disrupción de la IA y los impactos arancelarios. El modelo de negocio del minorista demuestra resiliencia frente al cambio tecnológico e incertidumbres comerciales. Este análisis refleja perspectivas de inversión divergentes en el sector minorista."
      }
    }
  },
  {
    "title": "Google launches Nano Banana 2, updating its viral AI image generator",
    "slug": "google-nano-banana-2-ai-image-generator",
    "url": "https://www.cnbc.com/2026/02/26/google-launches-nano-banana-2-updating-its-viral-ai-image-generator.html",
    "source": "CNBC",
    "date": "2026-02-26T17:27:25.000Z",
    "summary": "Google released Nano Banana 2, an updated version of its viral Gemini AI image generator with enhanced speed and real-time content sourcing capabilities. The upgrade reflects Google's continued investment in generative AI technology for visual content creation. This development demonstrates competitive activity in the rapidly evolving AI tools market.",
    "content": "Nano Banana 2 is Google's newest version of its Gemini AI image generator, with increased speed and real-time sourcing.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Google推出Nano Banana 2，更新其病毒式AI图像生成器",
        "summary": "Google发布了Nano Banana 2，这是其病毒式Gemini AI图像生成器的更新版本，具有增强的速度和实时内容获取功能。此次升级反映了Google对用于视觉内容创建的生成性AI技术的持续投资。这一发展展示了快速发展的AI工具市场中的竞争活动。"
      },
      "fr": {
        "title": "Google lance Nano Banana 2, mettant à jour son générateur d'images IA viral",
        "summary": "Google a lancé Nano Banana 2, une version mise à jour de son générateur d'images IA Gemini viral avec des capacités d'approvisionnement en contenu en temps réel améliorées et une vitesse accrue. La mise à niveau reflète l'investissement continu de Google dans la technologie d'IA générative pour la création de contenu visuel. Ce développement démontre une activité concurrentielle sur le marché des outils d'IA en rapide évolution."
      },
      "de": {
        "title": "Google startet Nano Banana 2 und aktualisiert seinen viralen KI-Bildgenerator",
        "summary": "Google veröffentlichte Nano Banana 2, eine aktualisierte Version des viralen Gemini-KI-Bildgenerators mit verbesserter Geschwindigkeit und Echtzeit-Content-Sourcing-Funktionen. Das Upgrade spiegelt Googles andauernde Investitionen in generative KI-Technologie für die Erstellung visueller Inhalte wider. Diese Entwicklung demonstriert Wettbewerbsaktivität auf dem sich schnell entwickelnden KI-Toolmarkt."
      },
      "es": {
        "title": "Google lanza Nano Banana 2, actualizando su generador de imágenes IA viral",
        "summary": "Google lanzó Nano Banana 2, una versión actualizada de su generador de imágenes IA Gemini viral con capacidades mejoradas de velocidad y obtención de contenido en tiempo real. La actualización refleja la inversión continua de Google en tecnología de IA generativa para la creación de contenido visual. Este desarrollo demuestra actividad competitiva en el mercado de herramientas de IA en rápida evolución."
      }
    }
  },
  {
    "title": "Instagram to alert parents if teens search for self-harm and suicide content",
    "slug": "instagram-teen-harm-alerts",
    "url": "https://www.bbc.com/news/articles/c3v7z5eyewko?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-26T16:39:57.000Z",
    "summary": "Instagram is launching a feature to alert parents when teenagers search for self-harm and suicide-related content on the platform. Safety advocates contend the tool shifts responsibility to parents rather than addressing platform-level accountability.",
    "content": "Safety campaigners say Meta is \"passing the buck\" with its new feature for parents using Instagram's teen supervision tools.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Instagram将在青少年搜索自伤和自杀内容时提醒家长",
        "summary": "Instagram推出一项功能，当青少年在该平台上搜索自伤和自杀相关内容时，向家长发送警报。安全倡导者声称该工具将责任转移给父母，而不是解决平台层面的问责问题。"
      },
      "fr": {
        "title": "Instagram alertera les parents si les adolescents recherchent des contenus sur l'automutilation et le suicide",
        "summary": "Instagram lance une fonctionnalité pour alerter les parents lorsque les adolescents recherchent des contenus liés à l'automutilation et au suicide sur la plateforme. Les défenseurs de la sécurité soutiennent que l'outil transfère la responsabilité aux parents plutôt que de résoudre la responsabilité au niveau de la plateforme."
      },
      "de": {
        "title": "Instagram wird Eltern benachrichtigen, wenn Jugendliche nach Selbstverletzungs- und Suizidmaterial suchen",
        "summary": "Instagram führt eine Funktion ein, um Eltern zu benachrichtigen, wenn Jugendliche nach Selbstverletzungs- und suizidbezogenen Inhalten auf der Plattform suchen. Sicherheitsverteidiger argumentieren, dass das Tool die Verantwortung auf Eltern überträgt, anstatt die Rechenschaftspflicht auf Plattformebene zu adressieren."
      },
      "es": {
        "title": "Instagram alertará a los padres si los adolescentes buscan contenido de autolesiones y suicidio",
        "summary": "Instagram está lanzando una función para alertar a los padres cuando los adolescentes buscan contenido relacionado con autolesiones y suicidio en la plataforma. Los defensores de seguridad argumentan que la herramienta traslada la responsabilidad a los padres en lugar de abordar la responsabilidad a nivel de plataforma."
      }
    }
  },
  {
    "title": "World Economic Forum boss quits after review of Epstein links",
    "slug": "wef-chief-resigns-epstein-links",
    "url": "https://www.bbc.com/news/articles/cr5lq9ll15jo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-26T14:25:28.000Z",
    "summary": "World Economic Forum Chief Brende has resigned following a review of his communications with convicted financier Jeffrey Epstein. Brende stated he was \"completely unaware\" of Epstein's criminal history during their interactions.",
    "content": "Brende acknowledged communications with Epstein but said he was \"completely unaware\" of his past criminal activity.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "世界经济论坛主席因爱泼斯坦关联而辞职",
        "summary": "世界经济论坛首席执行官布伦德在审查他与被判有罪的金融家杰弗里·爱泼斯坦的沟通后辞职。布伦德表示他在与爱泼斯坦互动期间\"完全不知道\"其犯罪历史。"
      },
      "fr": {
        "title": "Le patron du Forum économique mondial démissionne après examen des liens d'Epstein",
        "summary": "Le directeur général du Forum économique mondial Brende a démissionné suite à un examen de ses communications avec le financier condamné Jeffrey Epstein. Brende a déclaré qu'il n'était \"complètement inconscient\" de l'histoire criminelle d'Epstein lors de leurs interactions."
      },
      "de": {
        "title": "Chef des Weltwirtschaftsforums tritt nach Überprüfung der Epstein-Verbindungen zurück",
        "summary": "Der Geschäftsführer des Weltwirtschaftsforums Brende ist nach einer Überprüfung seiner Kommunikation mit dem verurteilten Finanzier Jeffrey Epstein zurückgetreten. Brende gab an, dass er sich der kriminellen Geschichte Epsteins während ihrer Interaktionen \"völlig nicht bewusst\" war."
      },
      "es": {
        "title": "El jefe del Foro Económico Mundial renuncia tras la revisión de vínculos con Epstein",
        "summary": "El director ejecutivo del Foro Económico Mundial Brende ha renunciado después de una revisión de sus comunicaciones con el financiero condenado Jeffrey Epstein. Brende declaró que estaba \"completamente inconsciente\" del historial criminal de Epstein durante sus interacciones."
      }
    }
  },
  {
    "title": "World Economic Forum CEO quits after Epstein ties scrutinized",
    "slug": "world-economic-forum-ceo-quits-epstein",
    "url": "https://www.cnbc.com/2026/02/26/world-economic-forum-ceo-epstein-files.html",
    "source": "CNBC",
    "date": "2026-02-26T12:11:32.000Z",
    "summary": "WEF President and CEO Borge Brende is stepping down following scrutiny over his connections to Epstein. This leadership change comes amid reputational concerns for the prominent global organization.",
    "content": "The president and CEO of the World Economic Forum, Borge Brende, steps down after Epstein ties scrutinized.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "世界经济论坛首席执行官因爱普斯坦关联接受审查后辞职",
        "summary": "世界经济论坛主席兼首席执行官博格·布伦德由于其与爱普斯坦的联系受到审查而辞职。这一领导层变动出现在这个著名全球组织面临声誉问题之际。"
      },
      "fr": {
        "title": "Le PDG du Forum économique mondial démissionne après examen des liens avec Epstein",
        "summary": "Le président et PDG du FEM, Borge Brende, démissionne suite au scrutin de ses liens avec Epstein. Ce changement de direction intervient au milieu des préoccupations de réputation pour cette organisation mondiale importante."
      },
      "de": {
        "title": "CEO des Weltwirtschaftsforums tritt nach Überprüfung von Epstein-Verbindungen zurück",
        "summary": "Der Präsident und CEO des WEF, Borge Brende, tritt nach Überprüfung seiner Verbindungen zu Epstein zurück. Dieser Führungswechsel erfolgt inmitten von Reputationsproblemen für die prominente globale Organisation."
      },
      "es": {
        "title": "El CEO del Foro Económico Mundial renuncia después de que se examinen sus vínculos con Epstein",
        "summary": "El presidente y CEO del FEM, Borge Brende, está renunciando tras el escrutinio de sus conexiones con Epstein. Este cambio de liderazgo ocurre en medio de preocupaciones de reputación para la destacada organización global."
      }
    }
  },
  {
    "title": "Nearly a million 16-24 year-olds not working or in education",
    "slug": "young-uk-workers-not-employed-education",
    "url": "https://www.bbc.com/news/articles/c62gzl2yl24o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-26T12:10:25.000Z",
    "summary": "The UK has approximately one million young people aged 16-24 who are neither employed nor in education. This reflects broader challenges in the UK's job market particularly affecting young workers entering their careers.",
    "content": "People at the start of their careers are particularly affected by the UK's weak job market.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "近百万16-24岁年轻人未工作也未接受教育",
        "summary": "英国约有一百万名16-24岁的年轻人既未就业也未接受教育。这反映了英国就业市场面临的更广泛挑战，特别是影响进入职业生涯的年轻工作者。"
      },
      "fr": {
        "title": "Près d'un million de jeunes de 16 à 24 ans ne travaillent pas et ne suivent pas d'études",
        "summary": "Le Royaume-Uni compte environ un million de jeunes âgés de 16 à 24 ans qui ne sont ni employés ni en éducation. Cela reflète les défis plus larges du marché du travail au Royaume-Uni, affectant particulièrement les jeunes travailleurs entrant dans leur carrière."
      },
      "de": {
        "title": "Fast eine Million 16-24-Jährige arbeiten nicht und sind nicht in Ausbildung",
        "summary": "Großbritannien hat etwa eine Million junger Menschen im Alter von 16-24 Jahren, die weder berufstätig noch in Ausbildung sind. Dies spiegelt breitere Herausforderungen auf dem britischen Arbeitsmarkt wider, die besonders junge Arbeitnehmer betreffen, die in ihre Karrieren einsteigen."
      },
      "es": {
        "title": "Casi un millón de jóvenes de 16 a 24 años no trabajan ni estudian",
        "summary": "El Reino Unido tiene aproximadamente un millón de jóvenes de 16 a 24 años que no están empleados ni en educación. Esto refleja desafíos más amplios en el mercado laboral del Reino Unido, afectando particularmente a jóvenes trabajadores que ingresan a sus carreras."
      }
    }
  },
  {
    "title": "Market watchers back Jensen Huang's view that investors are 'wrong' on SaaSpocalypse",
    "slug": "jensen-huang-investors-wrong-saas",
    "url": "https://www.cnbc.com/2026/02/26/nvidia-ceo-jensen-huang-software-saas-markets-microsoft-salesforce-oracle.html",
    "source": "CNBC",
    "date": "2026-02-26T12:09:28.000Z",
    "summary": "Nvidia CEO Jensen Huang told CNBC that artificial intelligence will not displace software, contradicting investor concerns about SaaS company viability. Market analysts are increasingly backing his view that software companies will thrive alongside AI advances.",
    "content": "Nvidia CEO Huang told CNBC that software will not be displaced by artificial intelligence.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "市场观察人士支持黄仁勋认为投资者对SaaS末日的看法\"错误\"的观点",
        "summary": "英伟达首席执行官黄仁勋告诉CNBC，人工智能不会取代软件，这与投资者对SaaS公司可行性的担忧相矛盾。市场分析师越来越多地支持他的观点，即软件公司将与人工智能进步共同繁荣发展。"
      },
      "fr": {
        "title": "Les analystes de marché soutiennent l'opinion de Jensen Huang selon laquelle les investisseurs se trompent sur l'apocalypse SaaS",
        "summary": "Le PDG de Nvidia, Jensen Huang, a déclaré à CNBC que l'intelligence artificielle ne déplacera pas les logiciels, contredisant les inquiétudes des investisseurs quant à la viabilité des entreprises SaaS. Les analystes de marché soutiennent de plus en plus son point de vue selon lequel les entreprises de logiciels prospéreront aux côtés des progrès de l'IA."
      },
      "de": {
        "title": "Marktbeobachter unterstützen Jensen Huangs Ansicht, dass Investoren beim SaaS-Untergang \"falsch liegen\"",
        "summary": "Nvidias CEO Jensen Huang sagte CNBC, dass künstliche Intelligenz Software nicht verdrängen wird, was den Bedenken der Investoren bezüglich der Rentabilität von SaaS-Unternehmen widerspricht. Marktanalytiker unterstützen zunehmend seine Ansicht, dass Softwareunternehmen neben KI-Fortschritten gedeihen werden."
      },
      "es": {
        "title": "Los observadores del mercado respaldan la opinión de Jensen Huang de que los inversores están \"equivocados\" sobre el apocalipsis de SaaS",
        "summary": "El CEO de Nvidia, Jensen Huang, le dijo a CNBC que la inteligencia artificial no desplazará el software, contradice las preocupaciones de los inversores sobre la viabilidad de las empresas SaaS. Los analistas de mercado respaldan cada vez más su punto de vista de que las empresas de software prosperarán junto con los avances de la IA."
      }
    }
  },
  {
    "title": "Why strategist Tom Lee believes the AI and crypto selloffs are almost over",
    "slug": "tom-lee-ai-crypto-selloff-over",
    "url": "https://www.marketwatch.com/story/why-strategist-tom-lee-believes-the-ai-bloodbath-and-crypto-selloff-is-almost-over-0ccdbb49?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T12:05:00.000Z",
    "summary": "Fundstrat strategist Tom Lee suggests that recent selloffs in tech and cryptocurrency assets have reached their low point. He believes the market has nearly completed its correction in these volatile sectors.",
    "content": "Fundstrat’s Tom Lee says the tech and crypto selloff has gone just about as far as it’s going to go.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "为什么策略师汤姆·李认为AI和加密货币抛售即将结束",
        "summary": "Fundstrat策略师汤姆·李表示，科技和加密货币资产近期的抛售已经触及低点。他认为市场在这些波动性较大的领域的调整已接近完成。"
      },
      "fr": {
        "title": "Pourquoi le stratège Tom Lee croit que les ventes massives d'IA et de crypto sont presque terminées",
        "summary": "Le stratège Fundstrat Tom Lee suggère que les récentes ventes massives d'actifs technologiques et de cryptomonnaies ont atteint leur point bas. Il croit que le marché a presque terminé sa correction dans ces secteurs volatiles."
      },
      "de": {
        "title": "Warum Stratege Tom Lee glaubt, dass die KI- und Krypto-Ausverkäufe fast vorbei sind",
        "summary": "Der Fundstrat-Stratege Tom Lee deutet an, dass die jüngsten Verkäufe von Tech- und Kryptowährungsanlagen ihren Tiefpunkt erreicht haben. Er glaubt, dass der Markt seine Korrektur in diesen volatilen Sektoren fast abgeschlossen hat."
      },
      "es": {
        "title": "Por qué el estratega Tom Lee cree que las ventas de IA y criptomonedas están casi terminadas",
        "summary": "El estratega de Fundstrat Tom Lee sugiere que las recientes ventas de activos tecnológicos y de criptomonedas han alcanzado su punto más bajo. Cree que el mercado ha completado casi su corrección en estos sectores volátiles."
      }
    }
  },
  {
    "title": "U.S. warns Iran's reluctance to discuss weapons is a 'big, big problem' as fresh talks begin",
    "slug": "us-iran-weapons-talks-rubio",
    "url": "https://www.cnbc.com/2026/02/26/us-iran-nuclear-weapons-talks-rubio-geneva-ballistic-missiles.html",
    "source": "CNBC",
    "date": "2026-02-26T12:01:08.000Z",
    "summary": "U.S. Secretary of State Marco Rubio expressed serious concerns that Iran is unwilling to discuss its intercontinental ballistic missile program during new negotiations. This stance threatens progress in nuclear weapons discussions between the countries.",
    "content": "U.S. Secretary of State Marco Rubio warned that Iran's reluctance to discuss its intercontinental ballistic missiles was a \"big, big problem.\"",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "美国警告伊朗不愿讨论武器是\"大问题\"，新谈判开始",
        "summary": "美国国务卿马可·鲁比奥表示严重关切，伊朗在新谈判中不愿讨论其洲际弹道导弹项目。这一立场威胁到两国在核武器讨论中的进展。"
      },
      "fr": {
        "title": "Les États-Unis avertissent que la réticence de l'Iran à discuter des armes est un \"gros, gros problème\" alors que de nouveaux pourparlers commencent",
        "summary": "Le Secrétaire d'État américain Marco Rubio a exprimé de sérieuses préoccupations concernant le fait que l'Iran refuse de discuter de son programme de missiles balistiques intercontinentaux lors de nouvelles négociations. Cette position menace les progrès des discussions sur les armes nucléaires entre les pays."
      },
      "de": {
        "title": "USA warnen, dass Irans Unwilligkeit, Waffen zu diskutieren, ein \"großes, großes Problem\" ist, während neue Verhandlungen beginnen",
        "summary": "Der US-Außenminister Marco Rubio drückte ernsthafte Bedenken aus, dass der Iran nicht bereit ist, sein Interkontinentalraketen-Programm während neuer Verhandlungen zu diskutieren. Diese Haltung bedroht Fortschritte bei den Kernwaffengesprächen zwischen den Ländern."
      },
      "es": {
        "title": "EE.UU. advierte que la renuencia de Irán a discutir armas es un \"gran, gran problema\" mientras comienzan nuevas conversaciones",
        "summary": "El Secretario de Estado estadounidense Marco Rubio expresó preocupaciones serias de que Irán no esté dispuesto a discutir su programa de misiles balísticos intercontinentales durante nuevas negociaciones. Esta posición amenaza el progreso en las discusiones sobre armas nucleares entre los países."
      }
    }
  },
  {
    "title": "Instagram to start parent alerts for teen suicide, self-harm searches as Meta trials continue",
    "slug": "instagram-parent-alerts-teen-mental-health",
    "url": "https://www.cnbc.com/2026/02/26/instagram-parent-alerts-teen-suicide-meta-trial.html",
    "source": "CNBC",
    "date": "2026-02-26T12:00:01.000Z",
    "summary": "Meta is piloting a new feature that alerts parents when their teenage children repeatedly search for phrases related to suicide or self-harm on Instagram. Parents will receive notifications via email, text, WhatsApp, or Instagram direct message.",
    "content": "Parents will receive alerts via email, text, WhatsApp or Instagram if their teens are repeatedly searching for \"phrases promoting suicide or self-harm.\"",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Instagram将启动青少年自杀和自伤搜索的父母提醒，Meta试验继续",
        "summary": "Meta正在试验一项新功能，当青少年在Instagram上重复搜索与自杀或自伤相关的短语时，该功能会向父母发出警报。父母将通过电子邮件、短信、WhatsApp或Instagram直接消息接收通知。"
      },
      "fr": {
        "title": "Instagram commencera à alerter les parents des recherches d'adolescents sur le suicide et l'automutilation alors que les essais de Meta se poursuivent",
        "summary": "Meta teste une nouvelle fonctionnalité qui alerte les parents lorsque leurs enfants adolescents recherchent à plusieurs reprises des expressions liées au suicide ou à l'automutilation sur Instagram. Les parents recevront des notifications par email, SMS, WhatsApp ou message direct Instagram."
      },
      "de": {
        "title": "Instagram wird Eltern vor Suizid- und Selbstverletzungssuchen von Jugendlichen warnen, während Meta-Tests fortgesetzt werden",
        "summary": "Meta testet eine neue Funktion, die Eltern warnt, wenn ihre jugendlichen Kinder wiederholt nach Ausdrücken suchen, die sich auf Suizid oder Selbstverletzung auf Instagram beziehen. Eltern erhalten Benachrichtigungen per E-Mail, SMS, WhatsApp oder Instagram-Direktnachricht."
      },
      "es": {
        "title": "Instagram comenzará a alertar a los padres sobre búsquedas de suicidio y autolesiones de adolescentes mientras continúan las pruebas de Meta",
        "summary": "Meta está probando una nueva función que alerta a los padres cuando sus hijos adolescentes buscan repetidamente frases relacionadas con el suicidio o la autolesión en Instagram. Los padres recibirán notificaciones por correo electrónico, SMS, WhatsApp o mensaje directo de Instagram."
      }
    }
  },
  {
    "title": "Democrat senators press Commerce Secretary Lutnick on conflict of interest concerns in USA Rare Earth deal",
    "slug": "senators-lutnick-rare-earth-conflict",
    "url": "https://www.cnbc.com/2026/02/26/warren-lutnick-usa-rare-earth-usar-critical-minerals.html",
    "source": "CNBC",
    "date": "2026-02-26T11:59:11.000Z",
    "summary": "Democratic senators including Elizabeth Warren are questioning Commerce Secretary Howard Lutnick about potential conflicts of interest in the USA Rare Earth deal. The senators are seeking additional transparency regarding his involvement in the transaction.",
    "content": "Senators Elizabeth Warren, Chris Van Hollen and Ron Wyden are pressing Commerce Secretary Howard Lutnick for more information on the USA Rare Earth deal.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "民主党参议员就美国稀土交易中的利益冲突问题向商务部长卢特尼克施压",
        "summary": "包括伊丽莎白·沃伦在内的民主党参议员质疑商务部长霍华德·卢特尼克在美国稀土交易中的潜在利益冲突。参议员们要求提高他在这笔交易中的参与透明度。"
      },
      "fr": {
        "title": "Les sénateurs démocrates demandent au Secrétaire du Commerce Lutnick de clarifier les préoccupations concernant les conflits d'intérêts dans l'accord américain sur les terres rares",
        "summary": "Des sénateurs démocrates, dont Elizabeth Warren, questionnent le Secrétaire du Commerce Howard Lutnick sur les conflits d'intérêts potentiels dans l'accord américain sur les terres rares. Les sénateurs demandent une transparence supplémentaire concernant sa participation à la transaction."
      },
      "de": {
        "title": "Demokratische Senatoren drängen Handelsminister Lutnick auf Interessenskonflikte bei USA-Seltenerden-Deal",
        "summary": "Demokratische Senatoren, einschließlich Elizabeth Warren, stellen dem Handelsminister Howard Lutnick Fragen zu potenziellen Interessenskonflikten beim USA-Seltenerden-Deal. Die Senatoren fordern zusätzliche Transparenz bezüglich seiner Beteiligung an der Transaktion."
      },
      "es": {
        "title": "Senadores demócratas presionan al Secretario de Comercio Lutnick sobre preocupaciones de conflicto de intereses en el acuerdo de tierras raras de EE.UU.",
        "summary": "Senadores demócratas, incluyendo a Elizabeth Warren, cuestionan al Secretario de Comercio Howard Lutnick sobre conflictos de intereses potenciales en el acuerdo de tierras raras de EE.UU. Los senadores buscan una transparencia adicional respecto a su participación en la transacción."
      }
    }
  },
  {
    "title": "Nvidia's stock sees only marginal gains after better-than-expected results. Here's the latest",
    "slug": "nvidia-stock-marginal-gains-results",
    "url": "https://www.cnbc.com/2026/02/26/nvidia-nvda-stock-price-q4-earnings.html",
    "source": "CNBC",
    "date": "2026-02-26T11:43:05.000Z",
    "summary": "Despite posting better-than-expected financial results, Nvidia's stock price showed only modest gains due to lingering concerns about an AI bubble. Investor caution suggests market skepticism about AI valuations remains high.",
    "content": "Better-than-expected results drew a muted investor response as AI bubble concerns remain",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "英伟达股票在超预期业绩后仅看到边际涨幅。最新情况如下",
        "summary": "尽管公布了超预期的财务业绩，由于对人工智能泡沫的持续担忧，英伟达股价涨幅有限。投资者的谨慎态度表明市场对人工智能估值的怀疑仍然很高。"
      },
      "fr": {
        "title": "Le titre d'Nvidia n'enregistre que des gains marginaux malgré des résultats meilleurs que prévu. Voici les dernières nouvelles",
        "summary": "Malgré des résultats financiers meilleurs que prévu, le prix de l'action Nvidia n'a augmenté que modestement en raison des préoccupations persistantes concernant une bulle de l'IA. La prudence des investisseurs suggère que le scepticisme du marché concernant les valorisations de l'IA reste élevé."
      },
      "de": {
        "title": "Nvidias Aktie verzeichnet nach besser als erwarteten Ergebnissen nur marginale Gewinne. Hier sind die neuesten Informationen",
        "summary": "Trotz besser als erwarteten Finanzergebnissen stieg der Aktienkurs von Nvidia nur bescheiden, was auf anhaltende Bedenken bezüglich einer KI-Blase zurückzuführen ist. Die Vorsicht der Anleger deutet darauf hin, dass die Marktskepsis gegenüber KI-Bewertungen weiterhin hoch ist."
      },
      "es": {
        "title": "La acción de Nvidia registra solo ganancias marginales después de resultados mejores de lo esperado. Aquí están las últimas noticias",
        "summary": "A pesar de reportar resultados financieros mejores de lo esperado, el precio de la acción de Nvidia mostró ganancias modestas debido a las preocupaciones persistentes sobre una burbuja de IA. La cautela de los inversionistas sugiere que el escepticismo del mercado sobre las valoraciones de IA sigue siendo alto."
      }
    }
  },
  {
    "title": "Russia says Cuba situation is escalating after deadly incident with U.S.-tagged speedboat",
    "slug": "russia-cuba-escalation-speedboat",
    "url": "https://www.cnbc.com/2026/02/26/cuba-crisis-russia-boat-incident-florida-trump-oil.html",
    "source": "CNBC",
    "date": "2026-02-26T11:29:17.000Z",
    "summary": "A deadly incident involving a U.S.-associated speedboat off Cuba has raised tensions, with Russia claiming the situation is escalating. The event occurs amid already heightened tensions between the United States and Cuba.",
    "content": "The incident comes at a time of heightened tensions between Washington and Havana.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "俄罗斯称美国标记的快艇致命事件后古巴局势升级",
        "summary": "一起涉及美国相关快艇在古巴附近的致命事件引发了紧张局势，俄罗斯声称情况正在升级。这一事件发生在美国和古巴之间已经高度紧张的背景下。"
      },
      "fr": {
        "title": "La Russie dit que la situation à Cuba s'aggrave après un incident mortel avec un hors-bord marqué par les États-Unis",
        "summary": "Un incident mortel impliquant un hors-bord associé aux États-Unis au large de Cuba a augmenté les tensions, la Russie affirmant que la situation s'aggrave. L'événement intervient au milieu de tensions déjà accrues entre les États-Unis et Cuba."
      },
      "de": {
        "title": "Russland sagt, die Situation in Kuba eskaliert nach tödlichem Zwischenfall mit US-gekennzeichnetem Schnellboot",
        "summary": "Ein tödlicher Zwischenfall mit einem mit den USA verbundenen Schnellboot vor Kuba hat die Spannungen erhöht, wobei Russland behauptet, dass die Situation eskaliert. Das Ereignis findet inmitten bereits erhöhter Spannungen zwischen den USA und Kuba statt."
      },
      "es": {
        "title": "Rusia dice que la situación en Cuba se está escalando después de un incidente mortal con una lancha rápida marcada por EE.UU.",
        "summary": "Un incidente mortal que involucra una lancha rápida asociada con EE.UU. frente a Cuba ha aumentado las tensiones, con Rusia afirmando que la situación se está escalando. El evento ocurre en medio de tensiones ya elevadas entre Estados Unidos y Cuba."
      }
    }
  },
  {
    "title": "Jeep maker Stellantis posts first annual loss in company history after EV writedowns",
    "slug": "stellantis-first-loss-ev-writedown",
    "url": "https://www.cnbc.com/2026/02/26/stellantis-earnings-full-year-2025-autos-evs.html",
    "source": "CNBC",
    "date": "2026-02-26T11:23:19.000Z",
    "summary": "Automotive manufacturer Stellantis reported its first annual loss ever, driven by significant write-downs on electric vehicle investments. The loss follows the company's recent decision to scale back its EV strategy amid market challenges.",
    "content": "The results come shortly after the auto giant scaled back its EV ambitions following a major strategic shift.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "吉普制造商Stellantis在电动汽车资产减记后报告公司历史上首次年度亏损",
        "summary": "汽车制造商Stellantis报告了有史以来首次年度亏损，主要由电动汽车投资的重大资产减记驱动。这一亏损紧跟该公司最近在市场挑战中缩减其电动汽车战略的决定。"
      },
      "fr": {
        "title": "Le fabricant de Jeep Stellantis enregistre sa première perte annuelle de l'histoire de l'entreprise après des dépréciations de véhicules électriques",
        "summary": "Le fabricant automobile Stellantis a enregistré sa première perte annuelle de tous les temps, entraînée par des dépréciations importantes des investissements dans les véhicules électriques. Cette perte fait suite à la récente décision de l'entreprise de réduire sa stratégie EV face aux défis du marché."
      },
      "de": {
        "title": "Der Jeep-Hersteller Stellantis vermeldet seinen ersten Jahresverlust in der Unternehmensgeschichte nach Abschreibungen bei Elektrofahrzeugen",
        "summary": "Der Automobilhersteller Stellantis berichtete über seinen ersten Jahresverlust aller Zeiten, angetrieben durch bedeutende Abschreibungen auf Investitionen in Elektrofahrzeuge. Der Verlust folgt der jüngsten Entscheidung des Unternehmens, seine EV-Strategie angesichts von Marktherausforderungen zu reduzieren."
      },
      "es": {
        "title": "El fabricante de Jeep Stellantis reporta su primera pérdida anual en la historia de la empresa después de depreciaciones de vehículos eléctricos",
        "summary": "El fabricante de automóviles Stellantis reportó su primera pérdida anual de todos los tiempos, impulsada por depreciaciones significativas en inversiones en vehículos eléctricos. La pérdida sigue a la reciente decisión de la empresa de reducir su estrategia de vehículos eléctricos ante los desafíos del mercado."
      }
    }
  },
  {
    "title": "Rolls-Royce stock has outperformed Nvidia’s in the last three years — and the gap is growing",
    "slug": "rolls-royce-outperforms-nvidia",
    "url": "https://www.marketwatch.com/story/rolls-royce-stock-has-outperformed-nvidias-in-the-last-three-years-and-the-gap-is-growing-61464759?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T11:08:00.000Z",
    "summary": "Rolls-Royce stock has significantly outperformed Nvidia's shares over the past three years, with the performance gap continuing to widen. CEO Tufan Erginbilgic announced increased share buybacks and raised guidance for profits and free cash flow.",
    "content": "Chief executive Tufan Erginbilgic raised guidance for the size of the share buyback program, free cash flow and underlying profits",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "劳斯莱斯股票在过去三年中的表现优于英伟达，且差距还在扩大",
        "summary": "劳斯莱斯股票在过去三年中明显优于英伟达股票，性能差距持续扩大。首席执行官图凡·埃尔金比尔吉奇宣布增加股票回购，并提高了利润和自由现金流的指导预期。"
      },
      "fr": {
        "title": "L'action Rolls-Royce a surpassé celle de Nvidia au cours des trois dernières années — et l'écart s'élargit",
        "summary": "L'action Rolls-Royce a nettement surpassé les actions de Nvidia au cours des trois dernières années, l'écart de performance continuant à s'élargir. Le PDG Tufan Erginbilgic a annoncé des rachats d'actions accrus et relevé les orientations relatives aux bénéfices et aux flux de trésorerie disponibles."
      },
      "de": {
        "title": "Die Rolls-Royce-Aktie hat die Nvidia-Aktie in den letzten drei Jahren überflügelt — und der Abstand wächst",
        "summary": "Die Rolls-Royce-Aktie hat die Nvidia-Aktie in den letzten drei Jahren deutlich überflügelt, wobei der Leistungsabstand weiter wächst. CEO Tufan Erginbilgic kündigte verstärkte Aktienrückkäufe an und erhöhte die Prognosen für Gewinne und freie Cashflow."
      },
      "es": {
        "title": "La acción de Rolls-Royce ha superado el rendimiento de Nvidia en los últimos tres años — y la brecha sigue creciendo",
        "summary": "La acción de Rolls-Royce ha superado significativamente el rendimiento de Nvidia en los últimos tres años, con la brecha de rendimiento continuando a ampliarse. El CEO Tufan Erginbilgic anunció recompras de acciones aumentadas y elevó la guía para ganancias y flujo de efectivo libre."
      }
    }
  },
  {
    "title": "Pressure to make budgets add up as Holyrood election looms",
    "slug": "scotland-holyrood-election-budgets",
    "url": "https://www.bbc.com/news/articles/c3wl526edelo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-26T10:57:44.000Z",
    "summary": "As Scotland's parliamentary election approaches, political parties seeking to form a government face pressure to clearly outline how they will fund their campaign promises. Budget credibility will be a key factor in voters' decision-making.",
    "content": "Parties hoping to form at least part of a government will want to show how they will pay for their vote-winning promises",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "随着苏格兰议会选举的临近，预算需要平衡的压力增加",
        "summary": "随着苏格兰议会选举的临近，寻求组建政府的政治党派面临压力，需要清楚地说明他们如何为竞选承诺提供资金。预算可信度将成为选民决策的关键因素。"
      },
      "fr": {
        "title": "La pression pour que les budgets s'équilibrent alors que l'élection d'Holyrood approche",
        "summary": "À l'approche des élections parlementaires écossaises, les partis politiques cherchant à former un gouvernement font face à la pression de définir clairement comment ils financeront leurs promesses électorales. La crédibilité budgétaire sera un facteur clé dans la prise de décision des électeurs."
      },
      "de": {
        "title": "Druck, Haushalte auszugleichen, wenn die Holyrood-Wahl bevorsteht",
        "summary": "Mit bevorstehenden schottischen Parlamentswahlen sehen sich Parteien, die eine Regierung bilden wollen, unter Druck, deutlich darzulegen, wie sie ihre Wahlkampfversprechen finanzieren werden. Die Haushaltsglaubwürdigkeit wird ein Schlüsselfaktor bei der Entscheidungsfindung der Wähler sein."
      },
      "es": {
        "title": "Presión para que los presupuestos cuadren cuando se acerca la elección de Holyrood",
        "summary": "A medida que se acerca la elección parlamentaria de Escocia, los partidos políticos que buscan formar un gobierno enfrentan presión para delinear claramente cómo financiarán sus promesas de campaña. La credibilidad presupuestaria será un factor clave en la toma de decisiones de los votantes."
      }
    }
  },
  {
    "title": "Rolls-Royce raises outlook, plans up to $12 billion share buyback as engine demand boosts growth",
    "slug": "rolls-royce-raises-outlook-buyback",
    "url": "https://www.cnbc.com/2026/02/26/rolls-royce-stock-sees-profits-hitting-4-billion-this-year-as-robust-growth-continues.html",
    "source": "CNBC",
    "date": "2026-02-26T10:47:31.000Z",
    "summary": "Rolls-Royce announced strong growth driven by demand for its engines and power systems, raising profit outlook to over £4 billion for the year. The company plans to return up to $12 billion to shareholders through share buybacks.",
    "content": "Rolls-Royce sees profits of over £4 billion this year as the engine and power systems maker promises another year of robust growth.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "劳斯莱斯提高展望，计划回购最多120亿美元股票以满足发动机需求促进增长",
        "summary": "劳斯莱斯因其发动机和动力系统需求强劲而宣布增长势强，将年度利润展望提高至超过40亿英镑。公司计划通过股票回购向股东返还最多120亿美元。"
      },
      "fr": {
        "title": "Rolls-Royce relève ses perspectives et prévoit un rachat d'actions pouvant atteindre 12 milliards de dollars grâce à la demande de moteurs",
        "summary": "Rolls-Royce a annoncé une croissance solide tirée par la demande de ses moteurs et systèmes d'énergie, revoyant à la hausse les perspectives de bénéfices à plus de 4 milliards de livres sterling pour l'année. L'entreprise prévoit de restituer jusqu'à 12 milliards de dollars aux actionnaires par des rachats d'actions."
      },
      "de": {
        "title": "Rolls-Royce hebt Ausblick an und plant Aktienrückkäufe im Wert von bis zu 12 Milliarden Dollar angesichts der Motorennachfrage",
        "summary": "Rolls-Royce gab starkes Wachstum bekannt, das durch die Nachfrage nach seinen Triebwerken und Energiesystemen angetrieben wird, und erhöhte die Gewinnprognose für das Jahr auf über 4 Milliarden Pfund. Das Unternehmen plant, bis zu 12 Milliarden Dollar an Aktionäre durch Aktienrückkäufe zurückzugeben."
      },
      "es": {
        "title": "Rolls-Royce aumenta perspectivas y planea recompra de acciones por hasta 12 mil millones de dólares impulsado por demanda de motores",
        "summary": "Rolls-Royce anunció un fuerte crecimiento impulsado por la demanda de sus motores y sistemas de energía, elevando las perspectivas de ganancias a más de 4 mil millones de libras esterlinas para el año. La empresa planea devolver hasta 12 mil millones de dólares a los accionistas a través de recompras de acciones."
      }
    }
  },
  {
    "title": "‘I live in a state with no inheritance tax’: Is it legal to deposit $150K cash into my bank account?",
    "slug": "inheritance-tax-cash-deposit-legal",
    "url": "https://www.marketwatch.com/story/i-live-in-a-state-with-no-inheritance-tax-is-it-legal-to-deposit-150k-cash-into-my-bank-account-d7987cfe?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T10:30:00.000Z",
    "summary": "A financial advice column addresses whether it's legal to deposit a large sum of cash into a bank account in a state without inheritance tax. The guidance discusses banking regulations and tax implications for depositing substantial amounts.",
    "content": "“The money is not currently in a bank account and it is not part of an estate.”",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "\"我住在没有遗产税的州\"：在银行账户中存入15万美元现金合法吗？",
        "summary": "一个财务建议专栏讨论在没有遗产税的州向银行账户存入大笔现金是否合法。该指南讨论了银行监管和存入大额资金的税务影响。"
      },
      "fr": {
        "title": "« Je vis dans un État sans impôt sur les successions » : Est-il légal de déposer 150 000 $ en espèces sur mon compte bancaire ?",
        "summary": "Une chronique de conseils financiers aborde la question de savoir s'il est légal de déposer une grosse somme en espèces sur un compte bancaire dans un État sans impôt sur les successions. Le guide discute de la réglementation bancaire et des implications fiscales du dépôt de montants importants."
      },
      "de": {
        "title": "\"Ich lebe in einem Staat ohne Erbschaftssteuer\": Ist es legal, 150.000 Dollar bar auf mein Bankkonto einzuzahlen?",
        "summary": "Eine Finanzratgeberkolumne erörtert, ob es legal ist, eine große Summe Bargeld auf ein Bankkonto in einem Staat ohne Erbschaftssteuer einzuzahlen. Der Leitfaden erörtert Bankvorschriften und Steuerauswirkungen bei der Hinterlegung großer Beträge."
      },
      "es": {
        "title": "\"Vivo en un estado sin impuesto sobre sucesiones\": ¿Es legal depositar $150,000 en efectivo en mi cuenta bancaria?",
        "summary": "Una columna de consejos financieros aborda si es legal depositar una gran suma de efectivo en una cuenta bancaria en un estado sin impuesto sobre sucesiones. La guía discute las regulaciones bancarias y las implicaciones fiscales de depositar montos sustanciales."
      }
    }
  },
  {
    "title": "Here’s what’s necessary to return the incredibly concentrated U.S. stock market to normal levels",
    "slug": "concentrated-us-stock-market-normal",
    "url": "https://www.marketwatch.com/story/heres-whats-necessary-to-return-the-incredibly-concentrated-u-s-stock-market-to-normal-levels-ca9ecc4c?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T10:22:00.000Z",
    "summary": "D.E. Shaw, the renowned quantitative hedge fund, calculated how long it would take for the highly concentrated U.S. stock market to return to historical normal levels. The analysis examines the concentration issues affecting current market conditions.",
    "content": "D.E. Shaw, the renowned number-crunching hedge fund manager, calculated how long it would take for concentrated U.S. stock markets to return to normal.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "以下是将高度集中的美国股市恢复到正常水平所需的条件",
        "summary": "著名的量化对冲基金D.E. Shaw计算了美国股市高度集中需要多长时间才能恢复到历史正常水平。该分析研究了影响当前市场状况的集中度问题。"
      },
      "fr": {
        "title": "Voici ce qui est nécessaire pour ramener le marché boursier américain incroyablement concentré à des niveaux normaux",
        "summary": "D.E. Shaw, le renommé fonds spéculatif quantitatif, a calculé combien de temps il faudrait pour que le marché boursier américain très concentré revienne à des niveaux normaux historiques. L'analyse examine les problèmes de concentration affectant les conditions actuelles du marché."
      },
      "de": {
        "title": "Das ist notwendig, um den unglaublich konzentrierten amerikanischen Aktienmarkt auf normale Niveaus zurückzubringen",
        "summary": "D.E. Shaw, der renommierte quantitative Hedgefonds, hat berechnet, wie lange es dauern würde, bis der stark konzentrierte US-Aktienmarkt zu historischen normalen Niveaus zurückkehrt. Die Analyse untersucht die Konzentrationsprobleme, die die aktuellen Marktbedingungen beeinflussen."
      },
      "es": {
        "title": "Esto es lo necesario para devolver el increíblemente concentrado mercado de valores estadounidense a niveles normales",
        "summary": "D.E. Shaw, el renombrado fondo de cobertura cuantitativo, calculó cuánto tiempo tomaría que el mercado de valores estadounidense altamente concentrado vuelva a los niveles normales históricos. El análisis examina los problemas de concentración que afectan las condiciones actuales del mercado."
      }
    }
  },
  {
    "title": "Rescue centre at 'breaking point' over £40k bills",
    "slug": "rescue-centre-breaking-point-40k-bills",
    "url": "https://www.bbc.com/news/articles/cd9gl51k7y0o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-26T06:11:09.000Z",
    "summary": "The Ark Wildlife Park is facing serious financial difficulties with mounting bills reaching £40,000. The wildlife rescue centre is struggling to sustain operations due to escalating costs.",
    "content": "The Ark Wildlife Park is home to exotic animals such as crocodiles, monkeys and wildcats.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "救援中心因4万英镑账单面临\"崩溃边缘\"",
        "summary": "方舟野生动物园面临严重的财务困难，账单金额达到4万英镑。这家野生动物救援中心由于成本上升而正在努力维持运营。"
      },
      "fr": {
        "title": "Centre de secours au bord de l'effondrement face à des factures de 40 000 livres",
        "summary": "Le parc animalier Ark fait face à de graves difficultés financières avec des factures atteignant 40 000 livres sterling. Le centre de sauvetage de la faune sauvage a du mal à maintenir ses opérations en raison de l'augmentation des coûts."
      },
      "de": {
        "title": "Rettungszentrum an \"Zusammenbruchpunkt\" wegen £40k-Rechnungen",
        "summary": "Der Ark Wildlife Park befindet sich in ernsthaften finanziellen Schwierigkeiten mit Rechnungen, die £40.000 erreichen. Das Wildtierschutzzentrum hat Schwierigkeiten, seine Operationen aufgrund steigender Kosten aufrechtzuerhalten."
      },
      "es": {
        "title": "Centro de rescate al \"borde del colapso\" por facturas de £40k",
        "summary": "El parque de vida silvestre Ark enfrenta serias dificultades financieras con facturas que alcanzan £40,000. El centro de rescate de vida silvestre está luchando por mantener sus operaciones debido al aumento de costos."
      }
    }
  },
  {
    "title": "Nvidia’s Huang says any Pentagon–Anthropic rift is 'not the end of the world'",
    "slug": "nvidia-huang-pentagon-anthropic-rift",
    "url": "https://www.cnbc.com/2026/02/26/huang-nvidia-anthropic-pentagon-hegseth-ai.html",
    "source": "CNBC",
    "date": "2026-02-26T04:33:28.000Z",
    "summary": "Nvidia CEO Jensen Huang commented on tensions between the Pentagon and Anthropic, downplaying their significance to the broader industry. The remark reflects Nvidia's position as a key player in strategic defense and AI partnerships.",
    "content": "Nvidia CEO Jensen Huang weighed in on a conflict between the Defense Department and its strategic partner on Thursday, saying it's “not the end of the world.”",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "英伟达黄仁勋表示五角大楼与Anthropic的分歧\"不是世界末日\"",
        "summary": "英伟达首席执行官黄仁勋就五角大楼与Anthropic之间的紧张关系发表评论，淡化了其对整体行业的重要性。这一言论反映了英伟达作为战略防御和人工智能合作伙伴关系中关键参与者的地位。"
      },
      "fr": {
        "title": "Le PDG de Nvidia Huang déclare que tout différend Pentagon-Anthropic n'est \"pas la fin du monde\"",
        "summary": "Le PDG de Nvidia Jensen Huang a commenté les tensions entre le Pentagone et Anthropic, en minimisant leur importance pour l'industrie dans son ensemble. Cette remarque reflète la position de Nvidia en tant qu'acteur clé dans les partenariats stratégiques de défense et d'IA."
      },
      "de": {
        "title": "Nvidias Huang sagt, dass jede Pentagon-Anthropic-Spaltung \"nicht das Ende der Welt\" ist",
        "summary": "Der CEO von Nvidia, Jensen Huang, äußerte sich zu Spannungen zwischen dem Pentagon und Anthropic und bagatellisierte deren Bedeutung für die breitere Branche. Die Aussage spiegelt Nvidias Position als Schlüsselakteur in strategischen Verteidigungs- und KI-Partnerschaften wider."
      },
      "es": {
        "title": "El CEO de Nvidia Huang dice que cualquier ruptura Pentagon-Anthropic \"no es el fin del mundo\"",
        "summary": "El CEO de Nvidia Jensen Huang comentó sobre las tensiones entre el Pentágono y Anthropic, minimizando su importancia para la industria en general. La observación refleja la posición de Nvidia como actor clave en asociaciones estratégicas de defensa e IA."
      }
    }
  },
  {
    "title": "China holiday spending sends a strong signal on consumer stimulus plans",
    "slug": "china-holiday-spending-consumer-stimulus",
    "url": "https://www.cnbc.com/2026/02/26/china-lunar-new-year-holiday-spending-signal-consumer-stimulus-outlook.html",
    "source": "CNBC",
    "date": "2026-02-26T04:26:21.000Z",
    "summary": "China's Lunar New Year holiday spending revealed strong consumer demand for travel and experiences despite price sensitivity. The data provides insights into the effectiveness of consumer stimulus measures in the world's second-largest economy.",
    "content": "China's nine-day Lunar New Year holiday showed consumers were eager to travel, while remaining price-conscious.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "中国假期消费为消费者刺激计划释放强烈信号",
        "summary": "中国农历新年假期支出显示，尽管价格敏感，消费者对旅游和体验的需求强劲。这些数据为了解世界第二大经济体消费刺激措施的有效性提供了见解。"
      },
      "fr": {
        "title": "Les dépenses de vacances en Chine envoient un signal fort sur les plans de relance de la consommation",
        "summary": "Les dépenses de vacances du Nouvel An lunaire chinois ont révélé une forte demande des consommateurs pour les voyages et les expériences malgré la sensibilité aux prix. Les données fournissent des informations sur l'efficacité des mesures de relance de la consommation dans la deuxième plus grande économie du monde."
      },
      "de": {
        "title": "Chinas Ferienausgaben senden ein starkes Signal über Konsumstimulierungsmaßnahmen",
        "summary": "Die Ferienausgaben des chinesischen Mondneujahrs zeigten eine starke Nachfrage der Verbraucher nach Reisen und Erlebnissen trotz Preissensitivität. Die Daten bieten Einblicke in die Wirksamkeit von Konsumstimulierungsmaßnahmen in der zweitgrößten Wirtschaft der Welt."
      },
      "es": {
        "title": "El gasto de vacaciones de China envía una fuerte señal sobre planes de estímulo del consumidor",
        "summary": "El gasto de vacaciones del Año Nuevo Lunar chino reveló una fuerte demanda de consumidores por viajes y experiencias a pesar de la sensibilidad al precio. Los datos proporcionan información sobre la efectividad de las medidas de estímulo de consumo en la segunda economía más grande del mundo."
      }
    }
  },
  {
    "title": "Samsung's S26 gives an advance look at what the Google-powered Apple Siri could do",
    "slug": "samsung-s26-google-powered-siri-ai",
    "url": "https://www.cnbc.com/2026/02/25/samsung-s26-launch-gemini-ai-apple-siri.html",
    "source": "CNBC",
    "date": "2026-02-26T04:21:36.000Z",
    "summary": "Samsung's S26 device integrates multiple AI systems including Google's Gemini and Perplexity alongside its upgraded Bixby assistant. The device demonstrates the potential direction for AI-powered personal assistants across major tech platforms.",
    "content": "The Samsung S26 has three separate AI systems with Google's Gemini, Perplexity and its own upgraded Bixby.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Samsung S26展示谷歌驱动的Apple Siri的潜在发展方向",
        "summary": "Samsung S26设备集成了多个AI系统，包括谷歌的Gemini和Perplexity，以及升级的Bixby助手。该设备展示了AI驱动个人助手在主要科技平台上的潜在发展方向。"
      },
      "fr": {
        "title": "Samsung S26 offre un aperçu de ce que pourrait faire Siri alimenté par Google d'Apple",
        "summary": "L'appareil Samsung S26 intègre plusieurs systèmes d'IA, notamment Gemini de Google et Perplexity, ainsi que l'assistant Bixby amélioré. L'appareil démontre la direction potentielle pour les assistants personnels alimentés par l'IA sur les principales plateformes technologiques."
      },
      "de": {
        "title": "Samsungs S26 zeigt einen Ausblick auf das, was Apples von Google betriebenes Siri tun könnte",
        "summary": "Das Samsung S26-Gerät integriert mehrere KI-Systeme, einschließlich Googles Gemini und Perplexity sowie den verbesserten Bixby-Assistenten. Das Gerät zeigt die mögliche Richtung für KI-gestützte persönliche Assistenten auf großen Technologieplattformen."
      },
      "es": {
        "title": "El Samsung S26 ofrece una vista previa de lo que podría hacer Siri impulsado por Google de Apple",
        "summary": "El dispositivo Samsung S26 integra múltiples sistemas de IA, incluidos Gemini de Google y Perplexity, junto con su asistente Bixby mejorado. El dispositivo demuestra la dirección potencial para los asistentes personales impulsados por IA en las principales plataformas tecnológicas."
      }
    }
  },
  {
    "title": "Trump insists trade deals safe after Supreme Court ruling upends tariff authority, but partners aren’t so sure",
    "slug": "trump-trade-deals-supreme-court-tariff-ruling",
    "url": "https://www.cnbc.com/2026/02/26/trump-state-of-the-union-supreme-court-tariffs-trade-deals-ieepa-section-301-232-122.html",
    "source": "CNBC",
    "date": "2026-02-26T03:45:38.000Z",
    "summary": "A Supreme Court ruling striking down Trump's tariffs has created uncertainty around existing trade agreements despite administration assurances. Global trade partners are expressing skepticism about the stability of ongoing negotiations.",
    "content": "The Supreme Court decision to strike down Trump's tariffs has thrown fresh confusion over the raft of trade deals negotiated with global partners, stalling trade talks.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "特朗普坚持贸易协议安全，但最高法院裁决推翻关税权限，合作伙伴持怀疑态度",
        "summary": "最高法院推翻特朗普关税的裁决为现有贸易协议带来不确定性，尽管政府提供了保证。全球贸易伙伴对正在进行的谈判的稳定性表示怀疑。"
      },
      "fr": {
        "title": "Trump insiste sur la sécurité des accords commerciaux après un arrêt de la Cour suprême, mais les partenaires doutent",
        "summary": "Une décision de la Cour suprême annulant les tarifs de Trump a créé de l'incertitude autour des accords commerciaux existants malgré les assurances de l'administration. Les partenaires commerciaux mondiaux expriment du scepticisme quant à la stabilité des négociations en cours."
      },
      "de": {
        "title": "Trump beharrt auf der Sicherheit von Handelsabkommen nach Oberster Gerichtshof-Urteil, aber Partner sind skeptisch",
        "summary": "Ein Urteil des Obersten Gerichtshofs, das Trumps Zölle aufgehoben hat, hat Unsicherheit um bestehende Handelsabkommen trotz Zusicherungen der Verwaltung geschaffen. Globale Handelspartner äußern Skepsis über die Stabilität laufender Verhandlungen."
      },
      "es": {
        "title": "Trump insiste en que los acuerdos comerciales son seguros después de la sentencia de la Corte Suprema, pero los socios dudan",
        "summary": "Una sentencia de la Corte Suprema que anula los aranceles de Trump ha creado incertidumbre en torno a los acuerdos comerciales existentes a pesar de las garantías de la administración. Los socios comerciales mundiales expresan escepticismo sobre la estabilidad de las negociaciones en curso."
      }
    }
  },
  {
    "title": "Nutanix’s stock soars as AMD investment creates a ‘halo effect’",
    "slug": "nutanix-stock-amd-investment-halo-effect",
    "url": "https://www.marketwatch.com/story/this-stock-is-soaring-on-news-of-a-forthcoming-investment-by-amd-216f3ee1?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T03:39:00.000Z",
    "summary": "Nutanix's stock surged following an AMD partnership, benefiting from increased investor confidence in the hyperconverged infrastructure company. The partnership positions the company to capture demand from AI-focused customers seeking flexible computing ecosystems.",
    "content": "The company, which makes hyperconverged infrastructure including storage offerings, is partnering with AMD and betting that AI customers want flexible ecosystems.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Nutanix股价飙升，AMD投资创造\"光环效应\"",
        "summary": "Nutanix股价在与AMD的合作后飙升，受益于投资者对超融合基础设施公司信心的提升。该合作伙伴关系使公司能够满足寻求灵活计算生态系统的AI客户的需求。"
      },
      "fr": {
        "title": "L'action de Nutanix s'envole alors que l'investissement d'AMD crée un \"effet de halo\"",
        "summary": "L'action de Nutanix a bondi suite à un partenariat avec AMD, bénéficiant de la confiance accrue des investisseurs envers la société d'infrastructure hyperconvergée. Le partenariat permet à l'entreprise de capturer la demande des clients axés sur l'IA qui recherchent des écosystèmes informatiques flexibles."
      },
      "de": {
        "title": "Nutanix-Aktie steigt, da AMD-Investition einen \"Halo-Effekt\" schafft",
        "summary": "Der Aktienkurs von Nutanix stieg nach einer Partnerschaft mit AMD und profitierte vom gestiegenen Anlegervertrauen in das Hyperkonvergenz-Infrastruktur-Unternehmen. Die Partnerschaft ermöglicht es dem Unternehmen, die Nachfrage von KI-fokussierten Kunden, die flexible Computing-Ökosysteme suchen, zu erfassen."
      },
      "es": {
        "title": "La acción de Nutanix se dispara con la inversión de AMD que crea un \"efecto halo\"",
        "summary": "El precio de las acciones de Nutanix se disparó tras una asociación con AMD, beneficiándose de la mayor confianza de los inversores en la empresa de infraestructura hiperconvergida. La asociación posiciona a la empresa para capturar la demanda de clientes enfocados en IA que buscan ecosistemas informáticos flexibles."
      }
    }
  },
  {
    "title": "Cuba says it killed 4 exiles, wounded 6 others who attacked from Florida speedboat",
    "slug": "cuba-killed-exiles-florida-speedboat-attack",
    "url": "https://www.cnbc.com/2026/02/26/cuba-says-it-killed-4-exiles-wounded-6-others-who-attacked-from-florida-speedboat.html",
    "source": "CNBC",
    "date": "2026-02-26T03:03:18.000Z",
    "summary": "Cuba reported repelling an attack by anti-government exiles arriving by speedboat from Florida, resulting in four deaths and six injuries. The incident involves individuals with histories of plotting against the Cuban government.",
    "content": "Cuba's Interior Ministry said the group was comprised of anti-government Cubans, some of whom were previously wanted for plotting attacks.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "古巴称击毙4名流亡者，伤6人，他们乘快速艇从佛罗里达州发起攻击",
        "summary": "古巴报告称击退了一次由反政府流亡者从佛罗里达州乘快速艇发起的攻击，造成4人死亡和6人受伤。该事件涉及与古巴政府密谋有关历史的个人。"
      },
      "fr": {
        "title": "Cuba dit avoir tué 4 exilés et blessé 6 autres qui ont attaqué par vedette depuis la Floride",
        "summary": "Cuba a rapporté avoir repoussé une attaque par des exilés anti-gouvernementaux arrivant par vedette depuis la Floride, entraînant quatre décès et six blessés. L'incident implique des individus ayant des antécédents de complots contre le gouvernement cubain."
      },
      "de": {
        "title": "Kuba sagt, es habe 4 Exilanten getötet und 6 andere verwundet, die mit einem Schnellboot von Florida aus angegriffen haben",
        "summary": "Kuba berichtete, dass es einen Angriff von regierungsfeindlichen Exilanten, die mit einem Schnellboot aus Florida ankamen, abgewehrt hat, was zu vier Todesfällen und sechs Verletzten führte. Der Vorfall betrifft Personen mit einer Vorgeschichte von Komplotten gegen die kubanische Regierung."
      },
      "es": {
        "title": "Cuba dice que mató a 4 exiliados e hirió a 6 otros que atacaron desde una lancha rápida de Florida",
        "summary": "Cuba informó de haber repelido un ataque de exiliados anti-gobierno que llegaron en lancha rápida desde Florida, resultando en cuatro muertes y seis heridos. El incidente involucra a individuos con historial de conspiración contra el gobierno cubano."
      }
    }
  },
  {
    "title": "Japan's Nikkei 225 crosses 59,000 first the first time as central bank board picks fuel 'Takaichi trade'",
    "slug": "japan-nikkei-225-crosses-59000-takaichi-trade",
    "url": "https://www.cnbc.com/2026/02/26/asia-pacific-markets-nvidia-kospi-nikkei-225-hang-seng-index.html",
    "source": "CNBC",
    "date": "2026-02-26T02:46:59.000Z",
    "summary": "Japan's Nikkei 225 index reached an unprecedented 59,000 milestone, driven by strong earnings from tech giants Nvidia and Oracle. Asia-Pacific markets are experiencing broader gains as investor confidence strengthens across the region.",
    "content": "Asia-Pacific markets were poised to open higher on Thursday, tracking Wall Street gains as strong earnings from Nvidia and Oracle lifted investor sentiment.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "日本日经225指数首次突破59000点，央行董事会推动\"高市贸易\"",
        "summary": "日本日经225指数达到了前所未有的59000点里程碑，由英伟达和甲骨文等科技巨头的强劲收益驱动。随着投资者信心在整个地区增强，亚太市场正在经历更广泛的涨幅。"
      },
      "fr": {
        "title": "L'indice Nikkei 225 du Japon dépasse pour la première fois 59 000 alors que le conseil de la banque centrale soutient le « commerce Takaichi »",
        "summary": "L'indice Nikkei 225 du Japon a atteint pour la première fois un niveau sans précédent de 59 000, soutenu par les solides résultats des géants technologiques Nvidia et Oracle. Les marchés de l'Asie-Pacifique connaissent des gains plus larges à mesure que la confiance des investisseurs se renforce dans la région."
      },
      "de": {
        "title": "Japans Nikkei 225 überschreitet zum ersten Mal 59.000, da der Zentralbankrat den „Takaichi-Handel\" antreibt",
        "summary": "Japans Nikkei-225-Index hat zum ersten Mal einen beispiellosen Meilenstein von 59.000 erreicht, angetrieben durch starke Gewinne von Technologiegiganten Nvidia und Oracle. Die Märkte im asiatisch-pazifischen Raum erleben breitere Gewinne, da das Vertrauen der Anleger in der Region zunimmt."
      },
      "es": {
        "title": "El índice Nikkei 225 de Japón supera los 59.000 por primera vez a medida que el consejo del banco central impulsa el \"comercio Takaichi\"",
        "summary": "El índice Nikkei 225 de Japón alcanzó un hito sin precedentes de 59.000, impulsado por sólidas ganancias de gigantes tecnológicos como Nvidia y Oracle. Los mercados de Asia-Pacífico están experimentando ganancias más amplias a medida que la confianza de los inversores se fortalece en toda la región."
      }
    }
  },
  {
    "title": "Canada's finance minister says US is unlikely to lift tariffs",
    "slug": "canada-finance-minister-us-unlikely-lift-tariffs",
    "url": "https://www.bbc.com/news/articles/cq57j8nqn67o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-26T02:09:30.000Z",
    "summary": "Canada's finance minister expressed skepticism about potential tariff relief from the United States despite Trump's broader tariff restructuring proposals. The statement reflects growing concern in Canada about the impact of sustained U.S. tariff policies.",
    "content": "The comments come after US President Donald Trump said he wants global tariffs to replace income taxes as America's main revenue source.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "加拿大财政部长称美国不太可能取消关税",
        "summary": "加拿大财政部长对美国可能提供的关税救济表示怀疑，尽管特朗普提出了更广泛的关税重组提案。该声明反映了加拿大日益增长的担忧，即美国持续的关税政策带来的影响。"
      },
      "fr": {
        "title": "Le ministre des Finances du Canada dit que les États-Unis sont peu susceptibles de lever les tarifs",
        "summary": "Le ministre des Finances du Canada a exprimé du scepticisme quant à un potentiel allègement tarifaire de la part des États-Unis malgré les propositions plus larges de restructuration tarifaire de Trump. La déclaration reflète une préoccupation croissante au Canada concernant l'impact des politiques tarifaires soutenues des États-Unis."
      },
      "de": {
        "title": "Kanadas Finanzminister sagt, die USA würden Zölle wahrscheinlich nicht aufheben",
        "summary": "Kanadas Finanzminister äußerte Skepsis gegenüber möglichen Zollentlastungen durch die Vereinigten Staaten trotz Trumps umfassenderer Zollumstrukturierungsvorschläge. Die Erklärung spiegelt wachsende Besorgnis in Kanada über die Auswirkungen der anhaltenden US-Zollpolitik wider."
      },
      "es": {
        "title": "El ministro de Finanzas de Canadá dice que Estados Unidos es poco probable que levante los aranceles",
        "summary": "El ministro de Finanzas de Canadá expresó escepticismo sobre un posible alivio arancelario de Estados Unidos a pesar de las propuestas más amplias de reestructuración arancelaria de Trump. La declaración refleja la creciente preocupación en Canadá sobre el impacto de las políticas arancelarias sostenidas de Estados Unidos."
      }
    }
  },
  {
    "title": "Asia tech stocks rally as Nvidia earnings soothe AI slowdown fears",
    "slug": "asia-tech-stocks-rally-nvidia-earnings-ai",
    "url": "https://www.cnbc.com/2026/02/26/asia-tech-stocks-nvidia-earnings-jensen-huang-chips-gpu.html",
    "source": "CNBC",
    "date": "2026-02-26T02:03:58.000Z",
    "summary": "Asian technology stocks gained significantly following Nvidia's stronger-than-expected earnings results, which addressed investor concerns about slowing AI investment momentum. The rally reflects renewed confidence in the artificial intelligence sector's growth trajectory.",
    "content": "Asian tech stocks rallied as stronger-than-expected results from Nvidia eased concerns that momentum in artificial intelligence spending was cooling.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "亚洲科技股随英伟达财报上涨，缓解人工智能放缓担忧",
        "summary": "在英伟达超预期的财报公布后，亚洲科技股大幅上涨，这缓解了投资者对人工智能投资势头放缓的担忧。此次上涨反映了市场对人工智能行业增长轨迹恢复信心。"
      },
      "fr": {
        "title": "Les actions technologiques asiatiques s'envolent alors que les résultats de Nvidia apaisent les craintes de ralentissement de l'IA",
        "summary": "Les actions technologiques asiatiques ont gagné significativement suite aux résultats supérieurs aux attentes de Nvidia, qui ont dissipé les craintes des investisseurs concernant un ralentissement du momentum d'investissement en IA. Le rally reflète une confiance renouvelée dans la trajectoire de croissance du secteur de l'intelligence artificielle."
      },
      "de": {
        "title": "Asiatische Tech-Aktien steigen, da Nvidias Gewinne die Angst vor einer KI-Verlangsamung beruhigen",
        "summary": "Asiatische Technologieaktien sind nach den besser als erwartet ausgefallenen Gewinnmitteilungen von Nvidia erheblich gestiegen, die die Bedenken der Anleger bezüglich einer Verlangsamung der KI-Investitionsdynamik behoben. Der Aufschwung spiegelt erneuertes Vertrauen in die Wachstumstrajektorie des Künstliche-Intelligenz-Sektors wider."
      },
      "es": {
        "title": "Las acciones tecnológicas asiáticas se disparan mientras los resultados de Nvidia calman los temores de una desaceleración de la IA",
        "summary": "Las acciones tecnológicas asiáticas ganaron significativamente tras los resultados mejores de lo esperado de Nvidia, que abordaron las preocupaciones de los inversores sobre la desaceleración del impulso de inversión en IA. El repunte refleja una confianza renovada en la trayectoria de crecimiento del sector de inteligencia artificial."
      }
    }
  },
  {
    "title": "Nvidia’s Jensen Huang is the latest tech CEO to cheer the potential of data centers in outer space",
    "slug": "nvidia-jensen-huang-data-centers-outer-space",
    "url": "https://www.marketwatch.com/story/nvidias-jensen-huang-is-the-latest-tech-ceo-to-cheer-the-potential-of-data-centers-in-outer-space-32d022b2?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T02:01:00.000Z",
    "summary": "Nvidia CEO Jensen Huang joined other technology leaders in discussing the potential of space-based data centers, though acknowledging current economic challenges. The CEO believes technological advancements will eventually make the economics of space infrastructure viable.",
    "content": "Nvidia’s CEO acknowledged that “the economics are poor today” but should “improve over time.”",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "英伟达CEO詹森·黄加入讨论外太空数据中心的潜力",
        "summary": "英伟达首席执行官詹森·黄与其他科技领导者一起讨论了基于空间的数据中心的潜力，尽管承认当前存在经济挑战。该首席执行官认为技术进步最终将使太空基础设施的经济性变得可行。"
      },
      "fr": {
        "title": "Jensen Huang de Nvidia est le dernier PDG technologique à célébrer le potentiel des centres de données dans l'espace",
        "summary": "Le PDG de Nvidia Jensen Huang a rejoint d'autres leaders technologiques pour discuter du potentiel des centres de données basés dans l'espace, tout en reconnaissant les défis économiques actuels. Le PDG croit que les avancées technologiques rendront finalement viables les économies de l'infrastructure spatiale."
      },
      "de": {
        "title": "Nvidias Jensen Huang ist der neueste Tech-CEO, der das Potenzial von Rechenzentren im Weltall bejubelt",
        "summary": "Nvidias CEO Jensen Huang schloss sich anderen Technologieführern an, um das Potenzial von weltraumgestützten Rechenzentren zu diskutieren, erkannte aber auch die aktuellen wirtschaftlichen Herausforderungen an. Der CEO glaubt, dass technologische Fortschritte letztendlich die Wirtschaftlichkeit der Raumfahrtinfrastruktur realisierbar machen werden."
      },
      "es": {
        "title": "Jensen Huang de Nvidia es el último CEO tecnológico en elogiar el potencial de los centros de datos en el espacio exterior",
        "summary": "El CEO de Nvidia Jensen Huang se unió a otros líderes tecnológicos para discutir el potencial de los centros de datos basados en el espacio, aunque reconociendo los desafíos económicos actuales. El CEO cree que los avances tecnológicos eventualmente harán que la economía de la infraestructura espacial sea viable."
      }
    }
  },
  {
    "title": "Nvidia's forecast points to accelerating growth, as Vera Rubin starts hitting market",
    "slug": "nvidia-forecast-accelerating-growth-vera-rubin",
    "url": "https://www.cnbc.com/2026/02/25/nvidia-forecast-points-to-accelerating-growth-vera-rubin-hits-market.html",
    "source": "CNBC",
    "date": "2026-02-26T01:55:33.000Z",
    "summary": "Nvidia's earnings guidance exceeded analyst expectations with first-quarter projections showing the company's fastest growth rate in a year. The strong forecast reflects ongoing demand for AI infrastructure and computing capabilities.",
    "content": "In its earnings report, Nvidia gave guidance for the first quarter that sailed past estimates, with growth projected to reach its fastest in a year.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "英伟达预测加速增长，维拉·鲁宾开始冲击市场",
        "summary": "英伟达的财报指引超过了分析师预期，第一季度预测显示该公司过去一年增长最快。强劲的展望反映了对人工智能基础设施和计算能力的持续需求。"
      },
      "fr": {
        "title": "Les prévisions de Nvidia pointent vers une accélération de la croissance, alors que Vera Rubin commence à conquérir le marché",
        "summary": "Les prévisions de résultats de Nvidia ont dépassé les attentes des analystes, les projections du premier trimestre montrant le taux de croissance le plus rapide de l'entreprise en un an. Les prévisions solides reflètent la demande continue pour les infrastructures IA et les capacités informatiques."
      },
      "de": {
        "title": "Nvidias Prognose deutet auf beschleunigtes Wachstum hin, während Vera Rubin den Markt zu erobern beginnt",
        "summary": "Nvidias Gewinnprognose übertraf die Analystenerwartungen, wobei die Prognosen für das erste Quartal das schnellste Wachstum des Unternehmens in einem Jahr zeigen. Die starke Prognose spiegelt die anhaltende Nachfrage nach KI-Infrastruktur und Rechenkapazität wider."
      },
      "es": {
        "title": "El pronóstico de Nvidia apunta a un crecimiento acelerado, mientras Vera Rubin comienza a ganar mercado",
        "summary": "La orientación de ganancias de Nvidia superó las expectativas de los analistas, con proyecciones del primer trimestre mostrando la tasa de crecimiento más rápida de la empresa en un año. El pronóstico sólido refleja la demanda continua de infraestructura de IA y capacidades informáticas."
      }
    }
  },
  {
    "title": "Urban Outfitters’ once-struggling namesake stores are now driving its sales gains",
    "slug": "urban-outfitters-namesake-stores-sales-gains",
    "url": "https://www.marketwatch.com/story/urban-outfitters-once-struggling-namesake-stores-are-now-driving-its-sales-gains-a841972d?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T01:39:00.000Z",
    "summary": "Urban Outfitters reported fourth-quarter results that exceeded estimates, with the company's namesake stores driving sales growth after a period of underperformance. The turnaround in its core brand stores marks a significant improvement for the retailer.",
    "content": "Shares of Urban Outfitters were flat after hours on Wednesday, after the clothing retailer reported fourth-quarter results that beat estimates, helped by a turnaround at its namesake stores.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "城市装饰品曾经陷入困境的同名门店现在正推动其销售增长",
        "summary": "Urban Outfitters报告了超出预期的第四季度业绩，该公司的同名门店在经历一段时间的表现不佳后，正推动销售增长。其核心品牌门店的扭转标志着零售商的重大改善。"
      },
      "fr": {
        "title": "Les magasins homonymes d'Urban Outfitters, autrefois en difficulté, génèrent désormais ses gains de ventes",
        "summary": "Urban Outfitters a rapporté des résultats du quatrième trimestre qui ont dépassé les estimations, les magasins homonymes de la société stimulant la croissance des ventes après une période de sous-performance. Le revirement de ses magasins de marque principale marque une amélioration significative pour le détaillant."
      },
      "de": {
        "title": "Urban Outfitters' ehemals angeschlagene Namensstores treiben jetzt seinen Umsatzgewinn an",
        "summary": "Urban Outfitters meldete Ergebnisse des vierten Quartals, die die Schätzungen übertroffen haben, wobei die Namensstores des Unternehmens das Umsatzwachstum nach einer Phase schwacher Leistung antreiben. Die Trendwende in seinen Flaggschiff-Stores bedeutet eine signifikante Verbesserung für den Einzelhändler."
      },
      "es": {
        "title": "Las tiendas homónimas de Urban Outfitters, que alguna vez estuvieron en dificultades, ahora impulsan sus ganancias de ventas",
        "summary": "Urban Outfitters reportó resultados del cuarto trimestre que superaron las estimaciones, con las tiendas homónimas de la empresa impulsando el crecimiento de ventas después de un período de bajo rendimiento. La recuperación de sus tiendas de marca principal marca una mejora significativa para el minorista."
      }
    }
  },
  {
    "title": "Watch CNBC's full interview with Nvidia CEO Jensen Huang after earnings and guidance beat",
    "slug": "nvidia-jensen-huang-cnbc-interview-earnings",
    "url": "https://www.cnbc.com/video/2026/02/26/jensen-x-squawk-asia-full.html",
    "source": "CNBC",
    "date": "2026-02-26T01:20:49.000Z",
    "summary": "Nvidia CEO Jensen Huang discussed the company's strong earnings and guidance with CNBC, emphasizing that AI systems will complement rather than replace existing software tools. He outlined his vision for agentic systems across various industries while defending Nvidia's competitive position.",
    "content": "Nvidia CEO Jensen Huang discussed the company's earnings and revenue guidance with CNBC's Becky Quick. He also shared his views about the rise of agentic systems in various industries and argued that AI will complement, not replace, existing software tools, predicting increased tool usage. Huang also defended Nvidia's market position.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "观看CNBC对英伟达首席执行官黄仁勋在收益和指导超出预期后的完整采访",
        "summary": "英伟达首席执行官黄仁勋与CNBC讨论了该公司强劲的收益和指导，强调AI系统将补充而非替代现有的软件工具。他在为英伟达的竞争地位辩护的同时，阐述了他对各个行业智能系统的愿景。"
      },
      "fr": {
        "title": "Regardez l'interview complète de CNBC avec le PDG d'Nvidia Jensen Huang après des bénéfices et des prévisions battus",
        "summary": "Le PDG d'Nvidia Jensen Huang a discuté des bénéfices et des prévisions solides de l'entreprise avec CNBC, soulignant que les systèmes d'IA complèteront plutôt que remplaceront les outils logiciels existants. Il a présenté sa vision des systèmes agentiques dans diverses industries tout en défendant la position concurrentielle d'Nvidia."
      },
      "de": {
        "title": "Schauen Sie sich das vollständige CNBC-Interview mit Nvidia-CEO Jensen Huang nach Earnings und Guidance Beat an",
        "summary": "Der CEO von Nvidia, Jensen Huang, diskutierte die starken Gewinne und Prognosen des Unternehmens mit CNBC und betonte, dass KI-Systeme bestehende Softwaretools ergänzen würden, anstatt sie zu ersetzen. Er skizzierte seine Vision für agentengesteuerte Systeme in verschiedenen Branchen und verteidigte gleichzeitig Nvidias Wettbewerbsposition."
      },
      "es": {
        "title": "Vea la entrevista completa de CNBC con el CEO de Nvidia Jensen Huang después de las ganancias y la guía que superaron las expectativas",
        "summary": "El CEO de Nvidia, Jensen Huang, discutió las sólidas ganancias y guía de la empresa con CNBC, enfatizando que los sistemas de IA complementarán en lugar de reemplazar las herramientas de software existentes. Esbozó su visión para sistemas agénticos en varias industrias mientras defendía la posición competitiva de Nvidia."
      }
    }
  },
  {
    "title": "Nvidia keeps the AI party alive with a booming quarter and even better outlook",
    "slug": "nvidia-keeps-ai-party-alive-booming-quarter",
    "url": "https://www.cnbc.com/2026/02/25/nvidia-keeps-the-ai-party-alive-with-a-booming-quarter-and-even-better-outlook.html",
    "source": "CNBC",
    "date": "2026-02-26T00:57:40.000Z",
    "summary": "Nvidia delivered strong quarterly earnings and an optimistic outlook, signaling continued momentum in the artificial intelligence sector. The chipmaker's impressive results reinforce its dominant position in the AI infrastructure market despite modest after-hours stock movement.",
    "content": "Nvidia shares weren't moving much in extended trading. But make no mistake, the chipmaker's earnings report was impressive.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "英伟达以蓬勃发展的季度和更好的展望保持人工智能派对活跃",
        "summary": "英伟达公布了强劲的季度业绩和乐观的前景，表明人工智能领域的势头持续。这家芯片制造商的令人印象深刻的成果强化了其在AI基础设施市场中的主导地位，尽管盘后股价涨幅不大。"
      },
      "fr": {
        "title": "Nvidia maintient la fête de l'IA en vie avec un trimestre en plein essor et des perspectives encore meilleures",
        "summary": "Nvidia a livré de solides résultats trimestriels et des perspectives optimistes, signalant la poursuite de l'élan dans le secteur de l'intelligence artificielle. Les résultats impressionnants du fabricant de puces renforcent sa position dominante sur le marché de l'infrastructure IA malgré un mouvement boursier modeste après les heures de négociation."
      },
      "de": {
        "title": "Nvidia hält die KI-Party mit einem boomenden Quartal und noch besseren Aussichten am Leben",
        "summary": "Nvidia lieferte starke Quartalsergebnisse und einen optimistischen Ausblick, was auf anhaltende Dynamik im Bereich künstliche Intelligenz hindeutet. Die beeindruckenden Ergebnisse des Chipmachers stärken seine dominante Position auf dem KI-Infrastrukturmarkt, trotz bescheidener Aktienbewegungen nach Handelsschluss."
      },
      "es": {
        "title": "Nvidia mantiene viva la fiesta de la IA con un trimestre en auge y perspectivas aún mejores",
        "summary": "Nvidia entregó sólidas ganancias trimestrales y perspectivas optimistas, señalando un impulso continuo en el sector de la inteligencia artificial. Los impresionantes resultados del fabricante de chips refuerzan su posición dominante en el mercado de infraestructura de IA a pesar del movimiento de acciones modesto después del horario."
      }
    }
  },
  {
    "title": "Trade Desk’s stock slides as growth slowdown unnerves Wall Street even further",
    "slug": "trades-desk-stock-slides-growth-slowdown",
    "url": "https://www.marketwatch.com/story/trade-desks-stock-slides-as-growth-slowdown-unnerves-wall-street-even-further-9d99e55e?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-26T00:19:00.000Z",
    "summary": "Trade Desk, an ad-tech provider, saw stock decline as automotive and packaged goods clients face pressure, signaling broader economic slowdown concerns.",
    "content": "The ad-tech provider said automotive and packaged-good clients are under pressure.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Trade Desk股票因增长放缓而下跌，进一步令华尔街感到不安",
        "summary": "广告技术提供商Trade Desk的股票下跌，因汽车和包装商品客户面临压力，预示更广泛的经济放缓担忧。"
      },
      "fr": {
        "title": "Le stock de Trade Desk dégringole alors que le ralentissement de la croissance inquiète davantage Wall Street",
        "summary": "Trade Desk, un fournisseur de technologie publicitaire, a vu son action baisser car ses clients automobiles et de biens d'emballage font face à des pressions, signalant des préoccupations plus larges concernant le ralentissement économique."
      },
      "de": {
        "title": "Trade Desk-Aktie fällt, da Wachstumsverlangsamung Wall Street weiter nervös macht",
        "summary": "Trade Desk, ein Anbieter von Werbetech, verzeichnete einen Aktienkursrückgang, da Automobil- und Verpackungsgüterkunden unter Druck stehen und auf breitere wirtschaftliche Verlangsamungsbedenken hindeuten."
      },
      "es": {
        "title": "Las acciones de Trade Desk se deslizan mientras la desaceleración del crecimiento pone más nerviosa a Wall Street",
        "summary": "Trade Desk, un proveedor de tecnología publicitaria, experimentó una caída de acciones cuando sus clientes de automoción y bienes de consumo envasados enfrentan presión, señalando preocupaciones más amplias sobre una desaceleración económica."
      }
    }
  },
  {
    "title": "Stock futures slip as traders mull over earnings from Nvidia and Salesforce: Live updates",
    "slug": "stock-futures-slip-nvidia-salesforce-earnings",
    "url": "https://www.cnbc.com/2026/02/25/stock-market-today-live-updates.html",
    "source": "CNBC",
    "date": "2026-02-26T00:08:34.000Z",
    "summary": "Stock futures declined as investors awaited earnings reports from Nvidia and Salesforce, following strong gains in the S&P 500 driven by tech sector recovery.",
    "content": "The moves follow an upbeat day for U.S. equities. The S&P 500 notched a second straight day of gains, lifted by a comeback in major tech companies.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "股指期货下跌，交易员权衡Nvidia和Salesforce的收益：实时更新",
        "summary": "随着投资者等待Nvidia和Salesforce的盈利报告，股指期货下跌，这是在由科技板块复苏推动的标普500指数强劲上升之后。"
      },
      "fr": {
        "title": "Les contrats à terme sur indice boursier fléchissent alors que les traders réfléchissent aux résultats de Nvidia et Salesforce : mises à jour en direct",
        "summary": "Les contrats à terme sur indice boursier ont baissé alors que les investisseurs attendaient les rapports de résultats de Nvidia et Salesforce, suite aux gains importants de l'indice S&P 500 tirés par la reprise du secteur technologique."
      },
      "de": {
        "title": "Aktienindex-Futures fallen, während Trader über Ergebnisse von Nvidia und Salesforce nachdenken: Live-Updates",
        "summary": "Aktienindex-Futures sind gefallen, da Investoren auf Gewinnberichte von Nvidia und Salesforce warteten, nach starken Gewinnen des S&P 500, angetrieben durch die Erholung des Technologiesektors."
      },
      "es": {
        "title": "Los futuros bursátiles se deslizan mientras los comerciantes reflexionan sobre las ganancias de Nvidia y Salesforce: Actualizaciones en vivo",
        "summary": "Los futuros bursátiles cayeron mientras los inversores esperaban informes de ganancias de Nvidia y Salesforce, tras fuertes ganancias en el S&P 500 impulsadas por la recuperación del sector tecnológico."
      }
    }
  },
  {
    "title": "Nvidia reports earnings and guidance beat as AI boom pushes data center revenue up 75%",
    "slug": "nvidia-earnings-beat-data-center-revenue-75-percent",
    "url": "https://www.cnbc.com/2026/02/25/nvidia-nvda-earnings-report-q4-2026.html",
    "source": "CNBC",
    "date": "2026-02-26T00:06:54.000Z",
    "summary": "Nvidia exceeded earnings expectations with a 75% increase in data center revenue, continuing its strong 2026 performance as the top tech megacap on Wall Street.",
    "content": "Nvidia has been the best performer on Wall Street this year among tech's megacap companies.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Nvidia报告收益和指导超预期，因AI热潮推动数据中心收入增加75%",
        "summary": "Nvidia以数据中心收入增加75%超越盈利预期，继续其作为华尔街顶级科技巨头的强劲2026年表现。"
      },
      "fr": {
        "title": "Nvidia dépasse les résultats et les prévisions alors que le boom de l'IA pousse les revenus des centres de données à la hausse de 75%",
        "summary": "Nvidia a dépassé les attentes en matière de résultats avec une augmentation de 75% des revenus des centres de données, poursuivant ses excellentes performances en 2026 en tant que plus grande mégacap technologique de Wall Street."
      },
      "de": {
        "title": "Nvidia meldet Gewinne und Prognosen, die Erwartungen übertreffen, da KI-Boom die Datencenter-Einnahmen um 75% erhöht",
        "summary": "Nvidia übertraf die Gewinnerwartungen mit einem Anstieg der Datencenter-Einnahmen um 75% und setzt seine starke Leistung im Jahr 2026 als führende Tech-Megacap an der Wall Street fort."
      },
      "es": {
        "title": "Nvidia reporta ganancias y orientación que superan las expectativas mientras el auge de la IA impulsa los ingresos del centro de datos en un 75%",
        "summary": "Nvidia superó las expectativas de ganancias con un aumento del 75% en los ingresos del centro de datos, continuando su fuerte desempeño en 2026 como la megacap tecnológica líder en Wall Street."
      }
    }
  },
  {
    "title": "The family-owned soda firm that still uses returnable glass bottles",
    "slug": "family-owned-soda-firm-returnable-glass-bottles",
    "url": "https://www.bbc.com/news/articles/cdjm289ye4mo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-26T00:06:33.000Z",
    "summary": "Twig's Beverage, a family-owned soft drinks company, maintains a loyal customer base through its distinctive old-fashioned approach to packaging and sustainability.",
    "content": "Soft drinks company Twig's Beverage has a loyal following for its old-fashioned approach.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "仍然使用可回收玻璃瓶的家族经营汽水公司",
        "summary": "Twig's Beverage是一家家族经营的软饮料公司，通过其独特的复古包装方式和可持续发展方法保持了忠实的客户基础。"
      },
      "fr": {
        "title": "La société de boissons gazeuses familiale qui utilise toujours des bouteilles en verre consignées",
        "summary": "Twig's Beverage, une entreprise de boissons non alcoolisées familiale, maintient une base de clients fidèles grâce à son approche distinctive et rétro de l'emballage et de la durabilité."
      },
      "de": {
        "title": "Das familiengeführte Limonadenunternehmen, das immer noch Mehrwegglasflaschen verwendet",
        "summary": "Twig's Beverage, ein familiengeführtes Erfrischungsgetränkeunternehmen, behält eine treue Kundschaft durch seinen charakteristischen altmodischen Verpackungsansatz und Nachhaltigkeit."
      },
      "es": {
        "title": "La empresa familiar de refrescos que aún utiliza botellas de vidrio retornables",
        "summary": "Twig's Beverage, una empresa familiar de bebidas no alcohólicas, mantiene una base leal de clientes a través de su enfoque distintivo y antiguo para el embalaje y la sostenibilidad."
      }
    }
  },
  {
    "title": "Food banks 'essential' for new generation of students",
    "slug": "food-banks-essential-new-generation-students",
    "url": "https://www.bbc.com/news/articles/cp85jd321p5o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-26T00:05:23.000Z",
    "summary": "Queen's University Belfast reports over 10,500 student visits to its food bank, highlighting rising financial pressures among the new generation of college students.",
    "content": "Queen's University Belfast says there were more than 10,500 visits by students to its food bank in the students' union.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "食物银行对新一代学生至关重要",
        "summary": "贝尔法斯特女王大学报告其食物银行接待超过10,500名学生，突出了新一代大学生面临的财务压力上升。"
      },
      "fr": {
        "title": "Les banques alimentaires sont 'essentielles' pour la nouvelle génération d'étudiants",
        "summary": "L'université Queen's de Belfast signale plus de 10 500 visites d'étudiants à sa banque alimentaire, soulignant les pressions financières croissantes chez la nouvelle génération d'étudiants."
      },
      "de": {
        "title": "Lebensmittelbanken sind \"essentiell\" für eine neue Generation von Studenten",
        "summary": "Die Queen's University Belfast berichtet über 10.500 Besuche von Studierenden in ihrer Lebensmittelbank und hebt den wachsenden finanziellen Druck auf die neue Studentengeneration hervor."
      },
      "es": {
        "title": "Los bancos de alimentos son 'esenciales' para la nueva generación de estudiantes",
        "summary": "La Universidad Queen's de Belfast reporta más de 10,500 visitas de estudiantes a su banco de alimentos, destacando las crecientes presiones financieras entre la nueva generación de estudiantes universitarios."
      }
    }
  },
  {
    "title": "Aldi shop staff to receive two pay rises this year",
    "slug": "aldi-shop-staff-two-pay-rises-year",
    "url": "https://www.bbc.com/news/articles/cwygr3p3e8go?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-26T00:02:16.000Z",
    "summary": "German budget supermarket Aldi is increasing staff wages with two annual pay rises, strengthening its competitive position in the British retail market.",
    "content": "The German budget supermarket is a growing competitor among British supermarkets",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Aldi商店员工今年将获得两次加薪",
        "summary": "德国平价超市Aldi将通过两次年度加薪来提高员工工资，以加强其在英国零售市场中的竞争地位。"
      },
      "fr": {
        "title": "Le personnel des magasins Aldi recevra deux augmentations de salaire cette année",
        "summary": "Le supermarché allemand à bas prix Aldi augmente les salaires du personnel avec deux augmentations annuelles, renforçant sa position concurrentielle sur le marché britannique du commerce de détail."
      },
      "de": {
        "title": "Aldi-Mitarbeiter erhalten dieses Jahr zwei Gehaltserhöhungen",
        "summary": "Der deutsche Discounter-Supermarkt Aldi erhöht die Löhne der Mitarbeiter mit zwei jährlichen Gehaltserhöhungen und stärkt seine Wettbewerbsposition auf dem britischen Einzelhandelsmarkt."
      },
      "es": {
        "title": "El personal de Aldi recibirá dos aumentos de salario este año",
        "summary": "El supermercado de presupuesto alemán Aldi está aumentando los salarios de los empleados con dos aumentos salariales anuales, fortaleciendo su posición competitiva en el mercado minorista británico."
      }
    }
  }
]