[
  {
    "title": "Trump admin blacklists Anthropic as AI firm refuses Pentagon demands",
    "slug": "trump-blacklists-anthropic-pentagon",
    "url": "https://www.cnbc.com/2026/02/27/trump-anthropic-ai-pentagon.html",
    "source": "CNBC",
    "date": "2026-02-27T23:55:22.000Z",
    "summary": "The Trump administration has blacklisted Anthropic after the AI firm refused Pentagon demands, citing refusal to develop autonomous weapons or support mass surveillance.",
    "content": "\"The Leftwing nut jobs at Anthropic have made a DISASTROUS MISTAKE trying to STRONG-ARM the Department of War,\" Trump wrote in a Truth Social post.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "特朗普政府因Anthropic拒绝五角大楼要求而将其列入黑名单",
        "summary": "特朗普政府因AI公司Anthropic拒绝五角大楼的要求而将其列入黑名单，该公司以拒绝开发自主武器或支持大规模监控为理由。"
      },
      "fr": {
        "title": "L'administration Trump met Anthropic sur liste noire après que la société d'IA refuse les demandes du Pentagone",
        "summary": "L'administration Trump a mis Anthropic sur liste noire après que la société d'IA ait refusé les demandes du Pentagone, citant son refus de développer des armes autonomes ou de soutenir la surveillance de masse."
      },
      "de": {
        "title": "Trump-Verwaltung setzt Anthropic auf schwarze Liste, da KI-Unternehmen Pentagonanforderungen ablehnt",
        "summary": "Die Trump-Verwaltung hat Anthropic auf die schwarze Liste gesetzt, nachdem das KI-Unternehmen die Anforderungen des Pentagon ablehnte und seine Weigerung zitierte, autonome Waffen zu entwickeln oder Massenüberwachung zu unterstützen."
      },
      "es": {
        "title": "La administración Trump pone en lista negra a Anthropic después de que la empresa de IA rechaza demandas del Pentágono",
        "summary": "La administración Trump ha puesto en lista negra a Anthropic después de que la empresa de IA se negó a las demandas del Pentágono, citando su negativa a desarrollar armas autónomas o respaldar la vigilancia masiva."
      }
    }
  },
  {
    "title": "Jack Dorsey made the loudest case yet that AI is already replacing jobs",
    "slug": "jack-dorsey-ai-replacing-jobs",
    "url": "https://www.cnbc.com/2026/02/27/jack-dorsey-made-the-loudest-case-yet-ai-is-already-replacing-jobs.html",
    "source": "CNBC",
    "date": "2026-02-27T23:38:28.000Z",
    "summary": "Block's cutting 40% of its workforce demonstrates AI-driven job displacement is actively occurring, with company leadership openly confirming automation-based layoffs.",
    "content": "In cutting nearly 40% of its workforce, Block loudly professed that the days of AI taking the jobs of humans has arrived.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Jack Dorsey做出了迄今为止最有力的论证：AI已经在替代工作",
        "summary": "Block公司裁员40%表明AI驱动的工作替代正在积极进行，公司领导层公开确认基于自动化的裁员。"
      },
      "fr": {
        "title": "Jack Dorsey a présenté l'argument le plus fort à ce jour selon lequel l'IA remplace déjà les emplois",
        "summary": "La suppression de 40% de l'effectif de Block démontre que le remplacement d'emplois motivé par l'IA se produit activement, avec la direction de l'entreprise confirmant ouvertement les licenciements basés sur l'automatisation."
      },
      "de": {
        "title": "Jack Dorsey brachte das stärkste Argument dafür, dass KI bereits Arbeitsplätze ersetzt",
        "summary": "Blocks Kürzung von 40% seiner Belegschaft zeigt, dass KI-gesteuerte Arbeitsplatzverlagerung aktiv stattfindet, wobei die Unternehmensleitung öffentlich automationsbasierte Entlassungen bestätigt."
      },
      "es": {
        "title": "Jack Dorsey presentó el argumento más contundente de que la IA ya está reemplazando empleos",
        "summary": "El recorte del 40% de la fuerza laboral de Block demuestra que el desplazamiento laboral impulsado por IA está ocurriendo activamente, con el liderazgo de la empresa confirmando públicamente despidos basados en automatización."
      }
    }
  },
  {
    "title": "Private-credit ‘cockroaches’ and the AI ‘scare trade’ hammered stocks in February. Here’s what else has investors shaken up.",
    "slug": "private-credit-ai-hammered-stocks",
    "url": "https://www.marketwatch.com/story/private-credit-cockroaches-and-the-ai-scare-trade-hammered-stocks-in-february-heres-what-else-has-investors-shaken-up-98641651?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T23:30:00.000Z",
    "summary": "U.S. stock markets experienced major volatility in February amid concerns about private credit risks and AI-related uncertainties, making it a turbulent month for equities.",
    "content": "Stocks were caught up Friday in a whirlwind of market-moving headlines, making for a wild final trading day in a rough month for U.S. equities.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "私人信贷\"蟑螂\"和人工智能\"恐慌交易\"在二月重创股市。还有什么让投资者不安的？",
        "summary": "美国股市在二月因私人信贷风险和人工智能相关不确定性担忧而经历重大波动，使这个月成为股市的动荡期。"
      },
      "fr": {
        "title": "Les « cafards » du crédit privé et le « commerce de la peur » de l'IA ont martelé les actions en février. Qu'est-ce d'autre qui secoue les investisseurs ?",
        "summary": "Les marchés boursiers américains ont connu une volatilité majeure en février en raison des préoccupations concernant les risques de crédit privé et les incertitudes liées à l'IA, ce qui a rendu ce mois turbulent pour les actions."
      },
      "de": {
        "title": "Private-Credit-„Kakerlaken\" und der KI-„Schreckenshandel\" bombardierten Aktien im Februar. Was hat Investoren sonst noch erschüttert?",
        "summary": "Die US-Aktienmärkte erlebten im Februar aufgrund von Bedenken hinsichtlich Private-Credit-Risiken und KI-bezogener Unsicherheiten große Volatilität, was den Monat zu einer turbulenten Zeit für Aktien machte."
      },
      "es": {
        "title": "Las « cucarachas » de crédito privado y el « comercio de miedo » de la IA golpearon las acciones en febrero. ¿Qué más ha inquietado a los inversores?",
        "summary": "Los mercados bursátiles estadounidenses experimentaron una volatilidad significativa en febrero ante preocupaciones por los riesgos de crédito privado e incertidumbres relacionadas con la IA, lo que convirtió el mes en un período turbulento para las acciones."
      }
    }
  },
  {
    "title": "Judge dismisses Trump officials’ bid to end student loan repayment plan used by millions of borrowers",
    "slug": "judge-dismisses-trump-student-loans",
    "url": "https://www.cnbc.com/2026/02/27/judge-dismisses-trump-officials-bid-to-end-save-plan.html",
    "source": "CNBC",
    "date": "2026-02-27T23:21:22.000Z",
    "summary": "A federal judge has blocked the Trump administration's attempt to eliminate the SAVE student loan repayment plan, protecting benefits for millions of borrowers.",
    "content": "A federal judge on Friday dismissed the Trump administration's request to eliminate the Saving on a Valuable Education, or SAVE, student loan repayment plan.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "法官驳回特朗普官员结束数百万借款人使用的学生贷款还款计划的提议",
        "summary": "联邦法官已阻止特朗普政府消除SAVE学生贷款还款计划的企图，保护了数百万借款人的福利。"
      },
      "fr": {
        "title": "Un juge rejette la tentative des responsables de Trump de mettre fin au plan de remboursement de prêt étudiant utilisé par des millions d'emprunteurs",
        "summary": "Un juge fédéral a bloqué la tentative de l'administration Trump d'éliminer le plan de remboursement de prêt étudiant SAVE, protégeant les avantages pour des millions d'emprunteurs."
      },
      "de": {
        "title": "Richter lehnt Antrag von Trump-Beamten ab, Studentendarlehenrückzahlungsplan zu beenden, der von Millionen Kreditnehmern genutzt wird",
        "summary": "Ein Bundesgericht hat die Versuche der Trump-Administration blockiert, den SAVE-Studentendarlehenrückzahlungsplan zu eliminieren, wodurch die Vorteile für Millionen Kreditnehmer geschützt werden."
      },
      "es": {
        "title": "Juez rechaza el intento de funcionarios de Trump de terminar el plan de reembolso de préstamos estudiantiles utilizado por millones de prestatarios",
        "summary": "Un juez federal ha bloqueado el intento de la administración Trump de eliminar el plan de reembolso de préstamos estudiantiles SAVE, protegiendo beneficios para millones de prestatarios."
      }
    }
  },
  {
    "title": "FAA plans to reduce flights at Chicago O'Hare, cites boost in schedules",
    "slug": "faa-reduce-flights-chicago-ohare",
    "url": "https://www.cnbc.com/2026/02/27/faa-plans-to-reduce-flights-at-chicago-ohare-cites-boost-in-schedules.html",
    "source": "CNBC",
    "date": "2026-02-27T23:13:36.000Z",
    "summary": "The FAA will reduce flights at Chicago O'Hare this summer after airlines overbooked capacity beyond airport infrastructure limits.",
    "content": "The Federal Aviation Administration plans to reduce flights at Chicago O'Hare airport this summer, saying major airlines have overscheduled flights.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "美国联邦航空局计划减少芝加哥奥黑尔机场航班，引用航班计划增加",
        "summary": "美国联邦航空局将在今年夏天减少芝加哥奥黑尔机场的航班，因为航空公司超额预订了超过机场基础设施限制的容量。"
      },
      "fr": {
        "title": "La FAA prévoit de réduire les vols à Chicago O'Hare, citant une augmentation des horaires",
        "summary": "La FAA réduira les vols à Chicago O'Hare cet été après que les compagnies aériennes aient surréservé la capacité au-delà des limites d'infrastructure de l'aéroport."
      },
      "de": {
        "title": "FAA plant Reduzierung der Flüge in Chicago O'Hare, führt Erhöhung der Flugpläne an",
        "summary": "Die FAA wird die Flüge am Chicago O'Hare in diesem Sommer reduzieren, da Fluggesellschaften die Kapazität über die Infrastrukturlimits des Flughafens hinaus überbucht haben."
      },
      "es": {
        "title": "FAA planea reducir vuelos en Chicago O'Hare, cita aumento en horarios",
        "summary": "La FAA reducirá los vuelos en Chicago O'Hare este verano después de que las aerolíneas overbookearan la capacidad más allá de los límites de infraestructura del aeropuerto."
      }
    }
  },
  {
    "title": "Trump blacklists Anthropic, opening the door to Elon Musk and xAI",
    "slug": "trump-blacklist-xai-anthropic-ethics",
    "url": "https://www.marketwatch.com/story/trump-blacklists-anthropic-opening-the-door-to-elon-musk-and-xai-03011fda?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T23:02:00.000Z",
    "summary": "Trump's Anthropic blacklist benefits Elon Musk's xAI, which permits classified AI use and autonomous weapons applications that Anthropic refused on ethical grounds.",
    "content": "Grok will let its model be used for classified purposes, while Anthropic has refused to let its products be deployed for autonomous weapons or mass surveillance.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "特朗普将Anthropic列入黑名单，为埃隆·马斯克和xAI打开大门",
        "summary": "特朗普对Anthropic的黑名单使埃隆·马斯克的xAI受益，该公司允许机密AI用途和自主武器应用，而Anthropic出于伦理考量拒绝了这些。"
      },
      "fr": {
        "title": "Trump met Anthropic sur la liste noire, ouvrant la porte à Elon Musk et xAI",
        "summary": "La liste noire d'Anthropic de Trump profite au xAI d'Elon Musk, qui autorise les utilisations d'IA classifiées et les applications d'armes autonomes qu'Anthropic a refusées pour des raisons éthiques."
      },
      "de": {
        "title": "Trump setzt Anthropic auf die schwarze Liste und öffnet die Tür für Elon Musk und xAI",
        "summary": "Trumps Anthropic-Blacklist kommt Elon Musks xAI zugute, die klassifizierte KI-Nutzung und autonome Waffensysteme zulässt, die Anthropic aus ethischen Gründen ablehnte."
      },
      "es": {
        "title": "Trump pone en lista negra a Anthropic, abriendo la puerta a Elon Musk y xAI",
        "summary": "La lista negra de Anthropic de Trump beneficia a xAI de Elon Musk, que permite el uso de IA clasificada y aplicaciones de armas autónomas que Anthropic rechazó por razones éticas."
      }
    }
  },
  {
    "title": "Trump orders government to stop using Anthropic in battle over AI use",
    "slug": "trump-government-stop-anthropic",
    "url": "https://www.bbc.com/news/articles/cn48jj3y8ezo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-27T22:52:03.000Z",
    "summary": "Trump has ordered government agencies to stop using Anthropic products following disputes with the company over Pentagon AI deployment and autonomy.",
    "content": "The move announced on social media comes after a standoff between Anthropic's boss and the Ministry of Defense.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "特朗普命令政府停止使用Anthropic，在AI使用之争中交锋",
        "summary": "特朗普已命令政府机构停止使用Anthropic产品，此前与该公司在五角大楼AI部署和自主权问题上存在争议。"
      },
      "fr": {
        "title": "Trump ordonne au gouvernement d'arrêter d'utiliser Anthropic dans la bataille sur l'utilisation de l'IA",
        "summary": "Trump a ordonné aux agences gouvernementales d'arrêter d'utiliser les produits d'Anthropic suite aux différends avec l'entreprise concernant le déploiement de l'IA au Pentagone et l'autonomie."
      },
      "de": {
        "title": "Trump befiehlt der Regierung, Anthropic in der Auseinandersetzung über KI-Nutzung nicht mehr zu verwenden",
        "summary": "Trump hat Regierungsbehörden angewiesen, Anthropic-Produkte nicht mehr zu verwenden, nachdem es Dispute mit dem Unternehmen über die KI-Bereitstellung im Pentagon und Autonomie gab."
      },
      "es": {
        "title": "Trump ordena al gobierno dejar de usar Anthropic en batalla sobre el uso de IA",
        "summary": "Trump ha ordenado a las agencias gubernamentales dejar de usar productos de Anthropic después de disputas con la empresa sobre el despliegue de IA en el Pentágono y la autonomía."
      }
    }
  },
  {
    "title": "Here’s what’s worth streaming in March 2026 on Netflix, Hulu, HBO Max and more",
    "slug": "streaming-march-2026-netflix-hbo",
    "url": "https://www.marketwatch.com/story/heres-whats-worth-streaming-in-march-2026-on-netflix-hulu-hbo-max-and-more-83f5b64d?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T22:51:00.000Z",
    "summary": "March 2026 brings notable releases across streaming platforms including HBO original series and a Netflix Peaky Blinders film as Emmy season approaches.",
    "content": "Shows like HBO’s ‘DTF St. Louis’ and ‘Rooster,’ Paramount’s ‘The Madison’ and Netflix’s ‘Peaky Blinders’ movie jump out of the gate as Emmy season gets underway",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "2026年3月Netflix、Hulu、HBO Max等平台值得观看的内容",
        "summary": "2026年3月在各大流媒体平台推出值得关注的内容，包括HBO原创剧集和Netflix的《浴血黑帮》电影，正值艾美奖季临近。"
      },
      "fr": {
        "title": "Voici ce qui vaut la peine d'être regardé en mars 2026 sur Netflix, Hulu, HBO Max et plus",
        "summary": "Mars 2026 apporte des sorties notables sur les plateformes de streaming, notamment des séries originales HBO et un film Netflix Peaky Blinders, à l'approche de la saison des Emmy."
      },
      "de": {
        "title": "Das ist im März 2026 auf Netflix, Hulu, HBO Max und mehr sehenswert",
        "summary": "März 2026 bringt bemerkenswerte Veröffentlichungen auf Streaming-Plattformen, darunter HBO-Originalserie und einen Netflix-Film zu Peaky Blinders, während die Emmy-Saison ansteht."
      },
      "es": {
        "title": "Aquí está lo que vale la pena ver en marzo de 2026 en Netflix, Hulu, HBO Max y más",
        "summary": "Marzo de 2026 trae lanzamientos notables en plataformas de streaming, incluidas series originales de HBO y una película de Netflix de Peaky Blinders a medida que se acerca la temporada de los Premios Emmy."
      }
    }
  },
  {
    "title": "White House gives Democrats new DHS funding offer as partial government shutdown drags on",
    "slug": "dhs-funding-shutdown-democrats",
    "url": "https://www.cnbc.com/2026/02/27/white-house-dhs-ice-government-shutdown-democrats.html",
    "source": "CNBC",
    "date": "2026-02-27T22:46:33.000Z",
    "summary": "The Department of Homeland Security shutdown has extended since February 14 as immigration enforcement disputes continue to block DHS funding negotiations.",
    "content": "The Department of Homeland Security has been shut down since Feb. 14 as immigration enforcement negotiations drag on.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "白宫向民主党人提出新的国土安全部经费提案 政府部分关闭继续拖延",
        "summary": "由于移民执法争议继续阻碍国土安全部资金谈判,自2月14日以来部门关闭已延长"
      },
      "fr": {
        "title": "La Maison-Blanche propose une nouvelle offre de financement du DHS aux démocrates alors que l'arrêt gouvernemental partiel s'éternise",
        "summary": "L'arrêt du Département de la Sécurité intérieure s'est prolongé depuis le 14 février alors que les différends sur l'application de l'immigration continuent de bloquer les négociations de financement du DHS"
      },
      "de": {
        "title": "Weißes Haus macht Demokraten neues DHS-Finanzierungsangebot, während sich teilweise Regierungsstillstand hinzieht",
        "summary": "Die Abschaltung des Ministeriums für innere Sicherheit hat sich seit dem 14. Februar verlängert, da Streitigkeiten über die Durchsetzung der Einwanderung weiterhin die Verhandlungen über die DHS-Finanzierung blockieren"
      },
      "es": {
        "title": "La Casa Blanca ofrece a los demócratas una nueva propuesta de financiamiento del DHS mientras el cierre parcial del gobierno se prolonga",
        "summary": "El cierre del Departamento de Seguridad Nacional se ha extendido desde el 14 de febrero, ya que las disputas sobre la aplicación de la inmigración continúan bloqueando las negociaciones de financiamiento del DHS"
      }
    }
  },
  {
    "title": "How Amazon's massive stake in OpenAI could boost its AI and cloud businesses",
    "slug": "amazon-openai-investment-ai-cloud",
    "url": "https://www.cnbc.com/2026/02/27/amazon-open-ai-cloud-jassy-altman.html",
    "source": "CNBC",
    "date": "2026-02-27T22:38:27.000Z",
    "summary": "Amazon's substantial investment in OpenAI may address investor concerns about its $200 billion AI spending while accelerating competitive AI tool development.",
    "content": "The deal could ease some of Wall Street's fears about Amazon's monster $200 billion capex spending, and accelerate its development of AI tools.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "亚马逊在OpenAI中的巨大股份如何能促进其人工智能和云业务",
        "summary": "亚马逊对OpenAI的巨额投资可能会解决投资者对其200亿美元人工智能支出的担忧,同时加速竞争性人工智能工具的开发"
      },
      "fr": {
        "title": "Comment la part massive d'Amazon dans OpenAI pourrait stimuler ses activités d'IA et de cloud",
        "summary": "L'investissement substantiel d'Amazon dans OpenAI pourrait répondre aux préoccupations des investisseurs concernant ses dépenses en IA de 200 milliards de dollars tout en accélérant le développement d'outils d'IA compétitifs"
      },
      "de": {
        "title": "Wie Amazons massiver Anteil an OpenAI seine KI- und Cloud-Geschäfte ankurbeln könnte",
        "summary": "Amazons erhebliche Investition in OpenAI könnte die Bedenken der Anleger in Bezug auf die 200-Milliarden-Dollar-KI-Ausgaben beruhigen und gleichzeitig die Entwicklung konkurrenzfähiger KI-Tools beschleunigen"
      },
      "es": {
        "title": "Cómo la participación masiva de Amazon en OpenAI podría impulsar sus negocios de IA y nube",
        "summary": "La inversión sustancial de Amazon en OpenAI podría abordar las preocupaciones de los inversores sobre su gasto en IA de 200 mil millones de dólares mientras acelera el desarrollo de herramientas de IA competitivas"
      }
    }
  },
  {
    "title": "Trump warned ‘sometimes you have to’ use force on Friday. Oil markets now see high odds of a U.S. strike on Iran.",
    "slug": "trump-iran-military-oil-prices",
    "url": "https://www.marketwatch.com/story/trump-said-sometimes-you-have-to-use-force-on-friday-oil-markets-now-see-high-odds-of-the-u-s-striking-iran-abbaf88c?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T22:38:00.000Z",
    "summary": "Trump's comments suggesting potential military action against Iran have triggered significant oil price increases, with markets pricing in heightened strike risk.",
    "content": "Oil prices jolted higher on Friday, booking their biggest daily gains in over a week, after President Trump signaled the window for using diplomacy to end Tehran’s nuclear program may be closing.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "特朗普周五警告\"有时你必须\"使用武力。油市现在看到美国袭击伊朗的高概率",
        "summary": "特朗普关于对伊朗采取潜在军事行动的评论引发了油价大幅上涨,市场定价显示越来越高的袭击风险"
      },
      "fr": {
        "title": "Trump a mis en garde \"parfois tu dois\" utiliser la force vendredi. Les marchés pétroliers voient maintenant une forte probabilité d'une frappe américaine contre l'Iran",
        "summary": "Les commentaires de Trump suggérant une action militaire potentielle contre l'Iran ont déclenché des augmentations importantes des prix du pétrole, les marchés fixant un risque de frappe accru"
      },
      "de": {
        "title": "Trump warnte am Freitag, \"manchmal muss man\" Gewalt einsetzen. Die Ölmärkte sehen nun hohe Chancen für einen US-Anschlag auf den Iran",
        "summary": "Trumps Kommentare, die eine mögliche Militäraktion gegen den Iran andeuten, haben zu erheblichen Ölpreiserhöhungen geführt, und die Märkte bewerten das Risiko eines Anschlags höher"
      },
      "es": {
        "title": "Trump advirtió el viernes que \"a veces tienes que\" usar la fuerza. Los mercados petroleros ahora ven altas probabilidades de un ataque estadounidense a Irán",
        "summary": "Los comentarios de Trump sugiriendo una posible acción militar contra Irán han desencadenado aumentos significativos en los precios del petróleo, con los mercados fijando un riesgo de ataque elevado"
      }
    }
  },
  {
    "title": "United’s stock had its worst day in months on rising oil prices, market jitters",
    "slug": "united-airlines-stock-oil-prices",
    "url": "https://www.marketwatch.com/story/uniteds-stock-and-other-airline-shares-get-a-reality-check-from-rising-oil-prices-market-jitters-2b6adfd0?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T22:35:00.000Z",
    "summary": "United Airlines stock suffered its worst drop in 10 months as rising oil prices and market jitters weighed on the carrier and broader airline sector.",
    "content": "United Airlines’ stock on Friday suffered its worst drop in 10 months, with other airline stocks also seeing steep declines amid rising oil futures prices and increased market jitters.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "美联航股票在油价上升和市场震荡中经历数月来最差表现",
        "summary": "随着油价上升和市场震荡对这家航空公司和整个航空业造成压力，美联航股票在10个月内遭遇最大跌幅。"
      },
      "fr": {
        "title": "L'action d'United a connu sa pire journée en mois sur fond de hausse des prix du pétrole et de nervosité du marché",
        "summary": "L'action d'United Airlines a subi sa plus forte baisse en 10 mois, les prix du pétrole en hausse et la nervosité du marché pesant sur la compagnie aérienne et l'ensemble du secteur aérien."
      },
      "de": {
        "title": "Uniteds Aktienkurs erlebte seinen schlechtesten Tag in Monaten angesichts steigender Ölpreise und Marktbesorgnis",
        "summary": "United Airlines-Aktie verzeichnete ihren größten Rückgang in 10 Monaten, da steigende Ölpreise und Marktbesorgnis auf der Fluggesellschaft und dem breiten Flugverkehrssektor lasteten."
      },
      "es": {
        "title": "El stock de United tuvo su peor día en meses debido a precios más altos del petróleo y nerviosismo del mercado",
        "summary": "La acción de United Airlines sufrió su mayor caída en 10 meses mientras que los precios más altos del petróleo y el nerviosismo del mercado pesaron sobre la aerolínea y el sector más amplio de aerolíneas."
      }
    }
  },
  {
    "title": "House Democrats grapple with Trump’s threats to U.S. elections: 'This is a five-alarm fire'",
    "slug": "democrats-trump-election-threats",
    "url": "https://www.cnbc.com/2026/02/27/trumps-election-threats-democrats-save-act.html",
    "source": "CNBC",
    "date": "2026-02-27T22:33:56.000Z",
    "summary": "Trump has proposed nationalizing federal elections, banning mail-in voting, and imposing voter-ID requirements ahead of the 2026 midterms, alarming Democrats.",
    "content": "President Donald Trump recently called to \"nationalize\" federal elections, ban mail voting and impose voter-ID requirements ahead of the 2026 midterms.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "众议院民主党与特朗普对美国选举的威胁进行较量：这是五级警报",
        "summary": "在2026年中期选举前，特朗普提议将联邦选举国有化、禁止邮寄投票并实施选民ID要求，引起民主党人的警惕。"
      },
      "fr": {
        "title": "Les démocrates de la Chambre font face aux menaces de Trump envers les élections américaines : c'est un incendie à cinq alarmes",
        "summary": "Trump a proposé la nationalisation des élections fédérales, l'interdiction du vote par courrier et l'imposition d'exigences d'identification des électeurs avant les élections de 2026, ce qui alarme les démocrates."
      },
      "de": {
        "title": "Demokraten des Hauses kämpfen gegen Trumps Drohungen gegen US-Wahlen: Dies ist ein Fünf-Alarm-Feuer",
        "summary": "Trump hat die Verstaatlichung der Bundeswahlen, das Verbot der Briefwahl und die Einführung von Wählerausweisanforderungen vor der Wahl 2026 vorgeschlagen, was die Demokraten alarmiert."
      },
      "es": {
        "title": "Los demócratas de la Cámara luchan contra las amenazas de Trump a las elecciones estadounidenses: este es un fuego de cinco alarmas",
        "summary": "Trump ha propuesto nacionalizar las elecciones federales, prohibir la votación por correo e imponer requisitos de identificación de votantes antes de las elecciones de 2026, alarmando a los demócratas."
      }
    }
  },
  {
    "title": "Nvidia's stock wraps up tough week as Wall Street focuses more on competition than growth",
    "slug": "nvidia-competition-amd-amazon-chips",
    "url": "https://www.cnbc.com/2026/02/27/nvidia-wraps-tough-week-as-investors-focus-on-competition-over-growth.html",
    "source": "CNBC",
    "date": "2026-02-27T22:27:29.000Z",
    "summary": "Nvidia faces mounting competitive pressure as major tech companies diversify AI chip suppliers, with Meta, OpenAI, and others seeking alternatives to Nvidia processors.",
    "content": "Meta will use AMD's chips and is reportedly interested in Google processors, while OpenAI is turning to Amazon silicon, as Nvidia faces increasing competition.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "英伟达股票在华尔街更关注竞争而非增长时结束了艰难的一周",
        "summary": "随着Meta、OpenAI等主要科技公司寻求英伟达处理器以外的替代品来分散AI芯片供应商，英伟达面临日益增加的竞争压力。"
      },
      "fr": {
        "title": "L'action de Nvidia conclut une semaine difficile alors que Wall Street se concentre davantage sur la concurrence que sur la croissance",
        "summary": "Nvidia fait face à une pression concurrentielle croissante alors que les grandes entreprises technologiques diversifient leurs fournisseurs de puces IA, Meta, OpenAI et d'autres cherchant des alternatives aux processeurs Nvidia."
      },
      "de": {
        "title": "Nvidias Aktie beendet eine schwierige Woche, da die Wall Street mehr auf den Wettbewerb als auf das Wachstum konzentriert",
        "summary": "Nvidia steht unter zunehmender Wettbewerbsdruck, da große Technologieunternehmen ihre KI-Chip-Lieferanten diversifizieren, wobei Meta, OpenAI und andere nach Alternativen zu Nvidia-Prozessoren suchen."
      },
      "es": {
        "title": "Las acciones de Nvidia cierran una semana difícil mientras Wall Street se enfoca más en la competencia que en el crecimiento",
        "summary": "Nvidia enfrenta una presión competitiva creciente mientras que grandes empresas tecnológicas diversifican sus proveedores de chips de IA, con Meta, OpenAI y otros buscando alternativas a los procesadores Nvidia."
      }
    }
  },
  {
    "title": "Medicare will run out of money 12 years earlier than expected",
    "slug": "medicare-runs-out-of-money-12-years-early",
    "url": "https://www.marketwatch.com/story/medicare-will-run-out-of-money-12-years-earlier-than-expected-23b24c83?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T22:22:00.000Z",
    "summary": "The Congressional Budget Office warns that Medicare will deplete its funds 12 years sooner than previously projected, highlighting accelerating deterioration in America's public retirement programs. This earlier depletion timeline underscores growing fiscal pressures on Social Security and Medicare.",
    "content": "The Congressional Budget Office warns America’s public retirement programs are deteriorating at a shocking rate.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "医疗保险将比预期提前12年耗尽资金",
        "summary": "国会预算办公室警告称，医疗保险将比之前预测提前12年耗尽资金，突显了美国公共退休计划加速恶化。这一更早的资金耗尽时间表突出了社会保障和医疗保险面临的日益增长的财政压力。"
      },
      "fr": {
        "title": "L'assurance-maladie Medicare sera à court d'argent 12 ans plus tôt que prévu",
        "summary": "Le Bureau du budget du Congrès avertit que Medicare épuisera ses fonds 12 ans plus tôt que prévu, soulignant la détérioration accélérée des programmes de retraite publics américains. Ce calendrier d'épuisement plus précoce souligne les pressions budgétaires croissantes sur la Sécurité sociale et Medicare."
      },
      "de": {
        "title": "Medicare wird 12 Jahre früher als erwartet Geld ausgehen",
        "summary": "Das Congressional Budget Office warnt, dass Medicare seine Mittel 12 Jahre früher als bisher projiziert aufbrauchen wird, was auf die beschleunigte Verschlechterung amerikanischer öffentlicher Rentenprogramme hinweist. Dieser frühere Erschöpfungszeitplan unterstreicht wachsenden Haushaltsdruck auf die Sozialversicherung und Medicare."
      },
      "es": {
        "title": "Medicare se quedará sin dinero 12 años antes de lo esperado",
        "summary": "La Oficina de Presupuesto del Congreso advierte que Medicare agotará sus fondos 12 años antes de lo proyectado anteriormente, destacando el deterioro acelerado de los programas de jubilación pública de Estados Unidos. Este calendario de agotamiento más temprano subraya las crecientes presiones fiscales sobre la Seguridad Social y Medicare."
      }
    }
  },
  {
    "title": "WBD employees fear coming wave of job losses as Paramount tops Netflix's bid to acquire company",
    "slug": "wbd-employees-fear-job-losses-paramount",
    "url": "https://www.cnbc.com/2026/02/27/warner-bros-employees-paramount.html",
    "source": "CNBC",
    "date": "2026-02-27T22:02:49.000Z",
    "summary": "Warner Bros. Discovery employees face uncertain futures after Paramount replaced Netflix as the preferred acquirer, raising concerns about job losses, cultural clashes, and existing debt burdens. The deal's close relationship to Paramount's existing media empire could trigger significant workforce restructuring.",
    "content": "WBD employees fear potential job cuts, culture clashes and high debt loads as Paramount supplants Netflix as the company's acquirer.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "随着派拉蒙超越网飞的收购出价，WBD员工担心即将到来的大规模裁员",
        "summary": "派拉蒙取代网飞成为首选收购方后，华纳兄弟探索公司的员工面临不确定的未来，引发了对员工裁员、文化冲突和现有债务负担的担忧。该交易与派拉蒙现有媒体帝国的紧密关系可能会引发重大的劳动力重组。"
      },
      "fr": {
        "title": "Les employés de WBD craignent une vague imminente de pertes d'emplois alors que Paramount surpasse l'offre de Netflix pour acquérir l'entreprise",
        "summary": "Les employés de Warner Bros. Discovery font face à des avenirs incertains après que Paramount ait remplacé Netflix en tant qu'acquéreur préféré, soulevant des préoccupations concernant les pertes d'emploi, les chocs culturels et les charges de dettes existantes. La relation étroite de l'accord avec l'empire médiatique existant de Paramount pourrait déclencher une restructuration importante de la main-d'œuvre."
      },
      "de": {
        "title": "WBD-Mitarbeiter befürchten kommende Welle von Entlassungen, da Paramount Netflixs Angebot zum Erwerb des Unternehmens überbietet",
        "summary": "Mitarbeiter von Warner Bros. Discovery sehen sich unsicheren Zukunftsaussichten gegenüber, nachdem Paramount Netflix als bevorzugter Erwerber ersetzt hat, was Bedenken hinsichtlich Stellenabbau, kultureller Konflikte und bestehender Schuldlasten aufwirft. Die enge Beziehung des Deals zu Paramounts bestehendem Medienimperium könnte eine bedeutende Umstrukturierung der Belegschaft auslösen."
      },
      "es": {
        "title": "Los empleados de WBD temen una próxima ola de pérdida de empleos mientras Paramount supera la oferta de Netflix para adquirir la empresa",
        "summary": "Los empleados de Warner Bros. Discovery enfrentan futuros inciertos después de que Paramount reemplazó a Netflix como adquiridor preferido, generando preocupaciones sobre pérdida de empleos, choques culturales y cargas de deuda existentes. La relación cercana del trato con el imperio mediático existente de Paramount podría desencadenar una reestructuración significativa de la fuerza laboral."
      }
    }
  },
  {
    "title": "What the Warner Bros deal could mean for streaming, cinemas and news",
    "slug": "warner-bros-deal-streaming-cinemas-news",
    "url": "https://www.bbc.com/news/articles/c20j5n2w4q6o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-27T21:46:14.000Z",
    "summary": "Paramount's proposed takeover of Warner Bros. Discovery could fundamentally reshape Hollywood's streaming, theatrical cinema, and news sectors by consolidating major media assets. The deal's success would significantly alter competitive dynamics across entertainment and media distribution.",
    "content": "If Paramount's takeover of Warner Bros goes ahead it could significantly reshape Hollywood.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "华纳兄弟交易对流媒体、影院和新闻意味着什么",
        "summary": "派拉蒙对华纳兄弟探索频道的提议收购可能会通过整合主要媒体资产从根本上重塑好莱坞的流媒体、影院和新闻部门。该交易的成功将显著改变娱乐和媒体分发的竞争动态。"
      },
      "fr": {
        "title": "Ce que l'accord Warner Bros pourrait signifier pour le streaming, les cinémas et les actualités",
        "summary": "La prise de contrôle proposée de Warner Bros. Discovery par Paramount pourrait fondamentalement transformer les secteurs du streaming, du cinéma et des actualités à Hollywood en consolidant les principaux actifs médiatiques. Le succès de cet accord modifierait considérablement la dynamique concurrentielle dans les secteurs du divertissement et de la distribution médiatique."
      },
      "de": {
        "title": "Was das Warner-Bros-Abkommen für Streaming, Kinos und Nachrichten bedeuten könnte",
        "summary": "Paramounts geplante Übernahme von Warner Bros. Discovery könnte Hollywoods Streaming-, Kino- und Nachrichtensektoren durch die Konsolidierung großer Medienkonzerne grundlegend umgestalten. Der Erfolg des Deals würde die Wettbewerbsdynamik in der Unterhaltungs- und Medienvertriebsbranche erheblich verändern."
      },
      "es": {
        "title": "Lo que el acuerdo de Warner Bros podría significar para el streaming, los cines y las noticias",
        "summary": "La adquisición propuesta de Warner Bros. Discovery por Paramount podría transformar fundamentalmente los sectores de streaming, cine teatral y noticias de Hollywood mediante la consolidación de activos mediáticos principales. El éxito del acuerdo alteraría significativamente la dinámica competitiva en entretenimiento y distribución de medios."
      }
    }
  },
  {
    "title": "Software stocks fall as Block’s big job cuts stoke further AI fears",
    "slug": "software-stocks-fall-block-job-cuts-ai",
    "url": "https://www.marketwatch.com/story/software-stocks-fall-as-blocks-big-job-cuts-stoke-further-ai-fears-c66aef8e?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T21:45:00.000Z",
    "summary": "Software stock prices fell following Block's major job cuts, amplifying investor concerns that artificial intelligence deployment will drastically reduce employment and dampen demand for software solutions. The layoffs reflect broader anxiety about AI's labor market disruption across the tech sector.",
    "content": "Block’s layoffs exacerbated concerns that artificial-intelligence could decimate employee counts and hurt demand for software.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "随着Block大幅裁员加剧AI担忧，软件股票下跌",
        "summary": "Block公司大幅裁员后软件股价下跌，加剧了投资者对人工智能部署将大幅减少就业和降低软件解决方案需求的担忧。这些裁员反映了整个科技部门对AI劳动力市场中断的更广泛忧虑。"
      },
      "fr": {
        "title": "Les actions du secteur logiciel chutent alors que les grandes réductions d'effectifs de Block raviver les craintes concernant l'IA",
        "summary": "Les prix des actions logicielles ont chuté suite aux réductions d'effectifs massives de Block, amplifiant les préoccupations des investisseurs selon lesquelles le déploiement de l'intelligence artificielle réduira drastiquement l'emploi et diminuera la demande de solutions logicielles. Les licenciements reflètent une anxiété plus large concernant la perturbation du marché du travail par l'IA dans l'ensemble du secteur technologique."
      },
      "de": {
        "title": "Softwareaktien fallen, da Blocks massive Entlassungen weitere KI-Ängste schüren",
        "summary": "Die Softwareaktienpreise fielen nach massiven Entlassungen von Block und verstärkten die Bedenken der Anleger, dass der Einsatz künstlicher Intelligenz die Beschäftigung drastisch reduzieren und die Nachfrage nach Softwarelösungen dämpfen wird. Die Entlassungen spiegeln eine breitere Besorgnis über die Arbeitsmarktverwerfung durch KI im gesamten Technologiesektor wider."
      },
      "es": {
        "title": "Las acciones de software caen a medida que los grandes despidos de Block avivan más temores sobre la IA",
        "summary": "Los precios de las acciones de software cayeron después de los grandes despidos de Block, amplificando las preocupaciones de los inversores de que el despliegue de inteligencia artificial reducirá drásticamente el empleo y disminuirá la demanda de soluciones de software. Los despidos reflejan una ansiedad más amplia sobre la perturbación del mercado laboral por la IA en todo el sector tecnológico."
      }
    }
  },
  {
    "title": "10-year yield falls below 4% on stagflation risk following hot producer prices reading",
    "slug": "10-year-yield-falls-below-4-percent-stagflation",
    "url": "https://www.cnbc.com/2026/02/27/us-treasury-yields-investors-await-wholesale-inflation-reading.html",
    "source": "CNBC",
    "date": "2026-02-27T21:18:25.000Z",
    "summary": "The 10-year Treasury yield dropped below 4% as investors reacted to producer prices that exceeded Wall Street expectations, signaling stagflation risks. The decline reflects markets pricing in economic weakness despite persistent inflation pressures.",
    "content": "U.S. Treasury yields were lower on Friday as investors reacted to wholesale inflation that came in above Wall Street estimates.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "生产者价格高于预期后，十年期收益率因滞胀风险跌破4%",
        "summary": "随着投资者对超出华尔街预期的生产者价格做出反应，十年期国债收益率跌破4%，暗示滞胀风险。这一下降反映了市场在持续通胀压力下对经济衰弱的定价。"
      },
      "fr": {
        "title": "Le rendement des obligations à 10 ans chute en dessous de 4 % en raison du risque de stagflation suite à une lecture élevée des prix à la production",
        "summary": "Le rendement des bons du Trésor à 10 ans est tombé en dessous de 4 % alors que les investisseurs réagissaient aux prix à la production qui ont dépassé les attentes de Wall Street, signalant des risques de stagflation. Le déclin reflète les marchés qui évaluent la faiblesse économique malgré les pressions inflationnistes persistantes."
      },
      "de": {
        "title": "Die 10-jährige Rendite fällt unter 4 % aufgrund von Stagflationsrisiken nach heißer Erzeugerpreisablesung",
        "summary": "Die 10-Jahres-Anleiherendite ist unter 4 % gefallen, da Anleger auf Erzeugerpreise reagierten, die die Erwartungen der Wall Street übertroffen haben und Stagflationsrisiken signalisieren. Der Rückgang spiegelt wider, dass die Märkte die wirtschaftliche Schwäche trotz anhaltender Inflationsdruck bewerten."
      },
      "es": {
        "title": "El rendimiento de 10 años cae por debajo del 4% por riesgo de estanflación tras lectura de precios al productor elevada",
        "summary": "El rendimiento del Tesoro a 10 años cayó por debajo del 4% cuando los inversores reaccionaron a los precios de los productores que superaron las expectativas de Wall Street, señalando riesgos de estanflación. La caída refleja los mercados que valoran la debilidad económica a pesar de las presiones inflacionarias persistentes."
      }
    }
  },
  {
    "title": "What traders are buying and selling during rout: Dumping Nvidia, buying Apple",
    "slug": "traders-dumping-nvidia-buying-apple",
    "url": "https://www.cnbc.com/2026/02/27/what-traders-are-buying-and-selling-during-rout-nvidia-apple.html",
    "source": "CNBC",
    "date": "2026-02-27T21:12:38.000Z",
    "summary": "During ongoing market turbulence, traders are selling Nvidia shares while accumulating Apple stock, signaling strategic shifts in portfolio positioning. The trades reflect changing assessments of AI-related valuations and consumer-focused tech investments.",
    "content": "In an appearance on CNBC's \"Halftime Report,\" investors Kevin Simpson and Steve Weiss revealed their recent trades.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "交易员在暴跌中买卖什么：抛售英伟达，买入苹果",
        "summary": "在持续的市场动荡期间，交易员正在抛售英伟达股份，同时积累苹果股票，这表示投资组合定位的战略转变。这些交易反映了对人工智能相关估值和以消费者为中心的科技投资的评估变化。"
      },
      "fr": {
        "title": "Qu'achètent et vendent les traders pendant l'effondrement : Dumping de Nvidia, achat d'Apple",
        "summary": "Pendant les turbulences permanentes du marché, les traders vendent des actions Nvidia tout en accumulant des actions Apple, signalant des changements stratégiques dans le positionnement du portefeuille. Les transactions reflètent l'évolution des évaluations liées à l'IA et les investissements technologiques centrés sur les consommateurs."
      },
      "de": {
        "title": "Was Händler während des Zusammenbruchs kaufen und verkaufen: Nvidia abstoßen, Apple kaufen",
        "summary": "Während der anhaltenden Marktvolatilität verkaufen Händler Nvidia-Aktien, während sie Apple-Aktien ansammeln, was strategische Verschiebungen bei der Portfoliopositionierung signalisiert. Die Geschäfte spiegeln sich ändernde Bewertungen von KI-bezogenen Wertpapieren und verbraucherzentrierten Technologieinvestitionen wider."
      },
      "es": {
        "title": "Qué están comprando y vendiendo los traders durante la caída: Abandonar Nvidia, comprar Apple",
        "summary": "Durante la turbulencia continua del mercado, los traders están vendiendo acciones de Nvidia mientras acumulan acciones de Apple, lo que indica cambios estratégicos en el posicionamiento de la cartera. Los intercambios reflejan evaluaciones cambiantes de las valoraciones relacionadas con la IA e inversiones tecnológicas enfocadas en el consumidor."
      }
    }
  },
  {
    "title": "Average IRS tax refund is up 10.2%, based on early filing data",
    "slug": "average-irs-tax-refund-up-10-percent",
    "url": "https://www.cnbc.com/2026/02/27/average-irs-tax-refund.html",
    "source": "CNBC",
    "date": "2026-02-27T20:22:03.000Z",
    "summary": "Early Internal Revenue Service filing data shows average tax refunds increased by 10.2% compared to the prior year. The larger refunds may reflect changes in withholding patterns or tax law adjustments affecting individual filers.",
    "content": "The average IRS tax refund is up 10.2%, based on early filing data. Here's what filers need to know.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "根据早期申报数据，国税局平均退税增加10.2%",
        "summary": "国税局早期申报数据显示，平均税收退款比前一年增加10.2%。较大的退款可能反映了预扣模式的变化或影响个人申报人的税法调整。"
      },
      "fr": {
        "title": "Le remboursement fiscal moyen de l'IRS est en hausse de 10,2%, selon les données de déclaration précoce",
        "summary": "Les données de déclaration précoce de l'Internal Revenue Service montrent que les remboursements fiscaux moyens ont augmenté de 10,2% par rapport à l'année précédente. Les remboursements plus importants pourraient refléter des changements dans les modèles de retenue ou des ajustements de la loi fiscale affectant les contribuables individuels."
      },
      "de": {
        "title": "Die durchschnittliche IRS-Steuerrückerstattung ist um 10,2% gestiegen, basierend auf frühen Anmeldedaten",
        "summary": "Frühe Anmeldedaten des Internal Revenue Service zeigen, dass die durchschnittlichen Steuerrückerstattungen um 10,2% gegenüber dem Vorjahr gestiegen sind. Die höheren Rückerstattungen könnten Änderungen bei den Einbehaltungsmustern oder Steuersatzanpassungen widerspiegeln, die einzelne Steuerpflichtige betreffen."
      },
      "es": {
        "title": "El reembolso fiscal promedio del IRS aumentó un 10.2%, según datos de declaración temprana",
        "summary": "Los datos de declaración temprana del Servicio de Ingresos Internos muestran que los reembolsos fiscales promedio aumentaron un 10,2% en comparación con el año anterior. Los reembolsos más grandes pueden reflejar cambios en los patrones de retención o ajustes de la ley fiscal que afecten a los contribuyentes individuales."
      }
    }
  },
  {
    "title": "This Morgan Stanley income fund is rated 5 stars by Morningstar. Where its manager is investing right now",
    "slug": "morgan-stanley-income-fund-5-stars-investing",
    "url": "https://www.cnbc.com/2026/02/27/morgan-stanley-income-fund-rated-5-stars-by-morningstar-.html",
    "source": "CNBC",
    "date": "2026-02-27T20:02:17.000Z",
    "summary": "Andrew Szczurowski, manager of a five-star Morgan Stanley income fund, continues identifying attractive income opportunities in a challenging environment but emphasizes the need for careful analysis to separate strong performers from underperformers. His strategy reflects the difficulty of generating reliable yields amid market volatility.",
    "content": "Morgan Stanley's Andrew Szczurowski is still finding attractive income streams, but says digging is necessary to separate winners from the losers.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "这只摩根士丹利收入基金被晨星评为5星。其经理现在在哪里投资",
        "summary": "五星摩根士丹利收入基金经理安德鲁·施茨罗夫斯基继续在具有挑战性的环境中寻找有吸引力的收入机会，但强调需要进行仔细分析以将表现良好者与表现不佳者区分开来。他的策略反映了在市场波动中产生可靠收益的困难。"
      },
      "fr": {
        "title": "Ce fonds de revenu Morgan Stanley est noté 5 étoiles par Morningstar. Où son gestionnaire investit maintenant",
        "summary": "Andrew Szczurowski, gestionnaire d'un fonds de revenu Morgan Stanley cinq étoiles, continue d'identifier les opportunités de revenus attrayantes dans un environnement difficile, mais souligne la nécessité d'une analyse minutieuse pour distinguer les meilleurs performeurs des moins bons. Sa stratégie reflète la difficulté de générer des rendements fiables au milieu de la volatilité du marché."
      },
      "de": {
        "title": "Dieser Morgan Stanley-Einkommensfonds ist von Morningstar mit 5 Sternen bewertet. Wo sein Manager gerade investiert",
        "summary": "Andrew Szczurowski, Manager eines fünfsterzigen Morgan Stanley-Einkommensfonds, identifiziert weiterhin attraktive Einkommensmöglichkeiten in einem schwierigen Umfeld, betont aber die Notwendigkeit einer sorgfältigen Analyse, um starke Performer von schwächeren zu unterscheiden. Seine Strategie spiegelt die Schwierigkeit wider, zuverlässige Renditen angesichts von Marktvolatilität zu generieren."
      },
      "es": {
        "title": "Este fondo de ingresos de Morgan Stanley tiene una calificación de 5 estrellas de Morningstar. Dónde está invirtiendo su gerente ahora",
        "summary": "Andrew Szczurowski, gerente de un fondo de ingresos de Morgan Stanley de cinco estrellas, continúa identificando oportunidades de ingresos atractivas en un entorno desafiante, pero enfatiza la necesidad de un análisis cuidadoso para separar a los mejores desempeños de los de menor desempeño. Su estrategia refleja la dificultad de generar rendimientos confiables en medio de la volatilidad del mercado."
      }
    }
  },
  {
    "title": "Are Jack Dorsey's aggressive job cuts the start of an AI jobs apocalypse? Economists weigh in",
    "slug": "jack-dorsey-job-cuts-ai-jobs-apocalypse",
    "url": "https://www.cnbc.com/2026/02/27/are-dorseys-giant-job-cuts-the-start-of-an-ai-jobs-apocalypse-economists-weigh-in.html",
    "source": "CNBC",
    "date": "2026-02-27T19:53:56.000Z",
    "summary": "Economists debate whether aggressive job cuts led by figures like Jack Dorsey signal a broader AI-driven labor market transformation or reflect company-specific strategic decisions. The discussion highlights uncertainty about artificial intelligence's long-term employment consequences.",
    "content": "Economists question whether such moves signal a broader shift in the labor market or simply reflect company-specific adjustments.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "杰克·多尔西的激进裁员是人工智能工作启示录的开始吗？经济学家发表评论",
        "summary": "经济学家辩论杰克·多尔西等人领导的激进裁员是否预示着更广泛的人工智能驱动的劳动力市场转型，或只是公司特定的战略决策。这一讨论突显了对人工智能长期就业影响的不确定性。"
      },
      "fr": {
        "title": "Les réductions massives d'emploi de Jack Dorsey marquent-elles le début d'une apocalypse technologique ? Les économistes pèsent leurs avis",
        "summary": "Les économistes débattent si les réductions agressives d'effectifs menées par des figures comme Jack Dorsey signalent une transformation plus large du marché du travail impulsée par l'IA, ou reflètent des décisions stratégiques spécifiques à l'entreprise. La discussion met en lumière l'incertitude concernant les conséquences à long terme de l'intelligence artificielle sur l'emploi."
      },
      "de": {
        "title": "Sind Jack Dorseys aggressive Kürzungen der Beginn einer KI-Jobpocalypse? Ökonomen äußern sich",
        "summary": "Ökonomen debattieren, ob aggressive Kürzungen, die von Figuren wie Jack Dorsey angeführt werden, auf eine breitere KI-gesteuerte Arbeitsmarkttransformation hindeuten oder unternehmens-spezifische strategische Entscheidungen widerspiegeln. Die Diskussion hebt die Unsicherheit über die langfristigen Auswirkungen der künstlichen Intelligenz auf die Beschäftigung hervor."
      },
      "es": {
        "title": "¿Son los recortes agresivos de Jack Dorsey el comienzo de un apocalipsis de empleos de IA? Los economistas opinan",
        "summary": "Los economistas debaten si los recortes agresivos de personal dirigidos por figuras como Jack Dorsey señalan una transformación más amplia del mercado laboral impulsada por la IA, o reflejan decisiones estratégicas específicas de la empresa. La discusión destaca la incertidumbre sobre las consecuencias laborales a largo plazo de la inteligencia artificial."
      }
    }
  },
  {
    "title": "Here's an update on our 4th Industrial Revolution stocks and the rest of the portfolio",
    "slug": "4th-industrial-revolution-stocks-portfolio",
    "url": "https://www.cnbc.com/2026/02/27/jim-cramers-update-on-our-ai-stocks-and-the-rest-of-the-portfolio.html",
    "source": "CNBC",
    "date": "2026-02-27T19:30:43.000Z",
    "summary": "Jim Cramer reviewed the performance of \"Fourth Industrial Revolution\" stocks within the Club portfolio during the monthly meeting, spotlighting key positions and themes. The update examines how innovation-focused investments are positioning portfolios.",
    "content": "Jim Cramer spotlighted the \"Fourth Industrial Revolution\" winners in the Club's portfolio during Friday's Monthly Meeting.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "以下是我们的第四次工业革命股票及投资组合其余部分的更新",
        "summary": "吉姆·克莱默在月度会议期间评述了\"第四次工业革命\"股票在俱乐部投资组合中的表现，突出了关键头寸和主题。该更新研究了以创新为重点的投资如何定位投资组合。"
      },
      "fr": {
        "title": "Voici une mise à jour sur nos actions de la quatrième révolution industrielle et le reste du portefeuille",
        "summary": "Jim Cramer a examiné la performance des actions de la \"quatrième révolution industrielle\" au sein du portefeuille du Club lors de la réunion mensuelle, mettant en avant les positions clés et les thèmes. La mise à jour examine comment les investissements axés sur l'innovation positionnent les portefeuilles."
      },
      "de": {
        "title": "Hier ist ein Update über unsere Aktien der vierten industriellen Revolution und den Rest des Portfolios",
        "summary": "Jim Cramer überprüfte die Leistung von \"Vierte Industrielle Revolution\"-Aktien im Club-Portfolio während des monatlichen Treffens und hob wichtige Positionen und Themen hervor. Die Aktualisierung untersucht, wie innovationsorientierte Investitionen Portfolios positionieren."
      },
      "es": {
        "title": "Aquí hay una actualización sobre nuestras acciones de la Cuarta Revolución Industrial y el resto de la cartera",
        "summary": "Jim Cramer revisó el desempeño de las acciones de la \"Cuarta Revolución Industrial\" dentro de la cartera del Club durante la reunión mensual, destacando posiciones y temas clave. La actualización examina cómo las inversiones enfocadas en innovación posicionan las carteras."
      }
    }
  },
  {
    "title": "Trump says he'd 'love not to' attack Iran, 'but sometimes you have to'",
    "slug": "trump-iran-nuclear-attack",
    "url": "https://www.cnbc.com/2026/02/27/trump-iran-war.html",
    "source": "CNBC",
    "date": "2026-02-27T18:15:06.000Z",
    "summary": "President Trump expressed frustration with Iran's refusal to comply with US demands to curb its nuclear program, suggesting military action may be necessary if compliance isn't achieved. The comment underscores continuing tensions between the US and Iran over nuclear policy.",
    "content": "President Donald Trump expressed frustration at Iran's refusal to comply with American demands to curb its nuclear program.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "特朗普表示他\"很乐意不\"攻击伊朗，\"但有时候你必须这样做\"",
        "summary": "特朗普总统对伊朗拒绝按照美国要求遏制核项目表示沮丧，暗示如果无法达成合规，军事行动可能是必要的。这一评论凸显了美国和伊朗在核政策上持续存在的紧张局势。"
      },
      "fr": {
        "title": "Trump dit qu'il \"aimerait ne pas\" attaquer l'Iran, \"mais parfois il le faut\"",
        "summary": "Le président Trump a exprimé sa frustration face au refus de l'Iran de se conformer aux exigences américaines visant à limiter son programme nucléaire, suggérant qu'une action militaire pourrait être nécessaire si la conformité n'est pas réalisée. Le commentaire souligne les tensions continues entre les États-Unis et l'Iran sur la politique nucléaire."
      },
      "de": {
        "title": "Trump sagt, er würde \"es lieber nicht tun\", den Iran anzugreifen, \"aber manchmal musst du es tun\"",
        "summary": "Präsident Trump äußerte Frustration über Irans Weigerung, sich an die amerikanischen Forderungen zur Begrenzung seines Atomprogramms zu halten, und deutete an, dass Militäreinsätze möglicherweise erforderlich sind, wenn die Compliance nicht erreicht wird. Die Bemerkung unterstreicht anhaltende Spannungen zwischen den USA und dem Iran über Atompolitik."
      },
      "es": {
        "title": "Trump dice que le \"encantaría no\" atacar a Irán, \"pero a veces tienes que hacerlo\"",
        "summary": "El presidente Trump expresó frustración por la negativa de Irán a cumplir con las demandas estadounidenses de frenar su programa nuclear, sugiriendo que la acción militar podría ser necesaria si no se logra el cumplimiento. El comentario subraya las tensiones continuas entre Estados Unidos e Irán sobre la política nuclear."
      }
    }
  },
  {
    "title": "Dell shares climb 20% on earnings beat as company navigates rising memory costs",
    "slug": "dell-shares-earnings-beat-memory-costs",
    "url": "https://www.cnbc.com/2026/02/27/dell-stock-earnings-memory-shortage-ai-servers.html",
    "source": "CNBC",
    "date": "2026-02-27T18:10:00.000Z",
    "summary": "Dell reported strong fourth-quarter earnings that beat expectations and demonstrated effective navigation of rising memory costs, driving a 20% stock surge. The results show the company's competitive positioning in a challenging supply environment.",
    "content": "Dell's strong fourth-quarter results show the company is navigating the memory shortage well so far.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "戴尔股价上涨20%，因收益超预期且公司应对内存成本上升",
        "summary": "戴尔报告了强劲的第四季度收益，超过了预期，并展示了对不断上升的内存成本的有效应对，推动了20%的股价上涨。这些结果显示了该公司在充满挑战的供应环境中的竞争地位。"
      },
      "fr": {
        "title": "Les actions de Dell grimpent de 20% sur un bénéfice supérieur aux attentes tandis que l'entreprise navigue dans la hausse des coûts de la mémoire",
        "summary": "Dell a signalé des bénéfices du quatrième trimestre solides qui ont dépassé les attentes et ont démontré une navigation efficace de la hausse des coûts de la mémoire, entraînant une montée du stock de 20%. Les résultats montrent le positionnement concurrentiel de l'entreprise dans un environnement d'approvisionnement difficile."
      },
      "de": {
        "title": "Dell-Aktien steigen um 20% nach Ertragsschlag während Unternehmen steigende Speicherkosten navigiert",
        "summary": "Dell meldete starke Gewinne im vierten Quartal, die Erwartungen übertrafen, und zeigte eine wirksame Navigation steigender Speicherkosten, was zu einem 20%igen Aktienanstieg führte. Die Ergebnisse zeigen die Wettbewerbsposition des Unternehmens in einem schwierigen Lieferumfeld."
      },
      "es": {
        "title": "Las acciones de Dell suben 20% con ganancias superiores a las expectativas mientras la empresa navega el aumento de costos de memoria",
        "summary": "Dell reportó ganancias sólidas del cuarto trimestre que superaron las expectativas y demostró una navegación efectiva del aumento de los costos de la memoria, impulsando un aumento del stock del 20%. Los resultados muestran el posicionamiento competitivo de la empresa en un entorno de suministro desafiante."
      }
    }
  },
  {
    "title": "Did Paramount overpay and Netflix get away scot-free? Taking stock of the Warner Bros. deal.",
    "slug": "paramount-overpay-netflix-warner-bros",
    "url": "https://www.marketwatch.com/story/did-paramount-overpay-and-netflix-get-away-scot-free-taking-stock-of-the-warner-bros-deal-98ee934d?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T18:00:00.000Z",
    "summary": "The Warner Bros. deal appears costly for Paramount, which must absorb troubled assets, while Netflix investors are relieved to have avoided similar liabilities. The disparate outcomes highlight different strategic challenges for major media companies.",
    "content": "Paramount must now absorb a troubled asset at a high cost, while Netflix investors seem overjoyed to not have such problems.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "派拉蒙是否过度支付而Netflix全身而退？评估华纳兄弟交易",
        "summary": "华纳兄弟交易对派拉蒙来说似乎成本高昂，派拉蒙必须吸收有问题的资产，而Netflix投资者则对避免类似负债感到宽慰。不同的结果突出了大型媒体公司面临的不同战略挑战。"
      },
      "fr": {
        "title": "Paramount a-t-il trop payé et Netflix s'en est-il tiré sans frais ? Évaluation de l'accord Warner Bros.",
        "summary": "L'accord Warner Bros. semble coûteux pour Paramount, qui doit absorber des actifs problématiques, tandis que les investisseurs de Netflix sont soulagés d'avoir évité des responsabilités similaires. Les résultats disparates mettent en évidence différents défis stratégiques pour les grandes sociétés de médias."
      },
      "de": {
        "title": "Hat Paramount zu viel bezahlt und ist Netflix ungeschoren davongekommen? Bilanz des Warner Bros.-Deals",
        "summary": "Das Warner Bros.-Deal erscheint kostspielig für Paramount, das problematische Vermögenswerte absorbieren muss, während Netflix-Investoren erleichtert sind, ähnliche Verbindlichkeiten vermieden zu haben. Die unterschiedlichen Ergebnisse unterstreichen unterschiedliche strategische Herausforderungen für große Medienunternehmen."
      },
      "es": {
        "title": "¿Paramount pagó de más y Netflix se salió con la suya? Evaluación del acuerdo de Warner Bros.",
        "summary": "El acuerdo de Warner Bros. parece costoso para Paramount, que debe absorber activos problemáticos, mientras que los inversores de Netflix están aliviados de haber evitado pasivos similares. Los resultados dispares destacan diferentes desafíos estratégicos para las principales empresas de medios."
      }
    }
  },
  {
    "title": "Nearly 1 in 5 eligible filers miss this 'valuable' tax credit, IRS says — how it can boost refunds",
    "slug": "tax-credit-eligible-filers-boost-refunds",
    "url": "https://www.cnbc.com/2026/02/27/earned-income-tax-credit-eligibility-2025.html",
    "source": "CNBC",
    "date": "2026-02-27T17:57:26.000Z",
    "summary": "Nearly 20% of eligible taxpayers miss the earned income tax credit worth thousands of dollars, according to the IRS, leaving significant refund money unclaimed. Understanding eligibility requirements could help lower-income workers substantially increase their tax returns.",
    "content": "Nearly 1 in 5 eligible taxpayers miss the earned income tax credit, which is worth thousands of dollars, according to the IRS. Here's what to know.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "国税局称近五分之一的符合条件的申报者错过了这个\"宝贵的\"税收抵免——它如何可以提高退税",
        "summary": "根据国税局的数据，近20%的符合条件的纳税人错过了价值数千美元的所得税收抵免，导致大量退税金额无人认领。了解资格要求可以帮助低收入工作者大幅增加他们的税收退款。"
      },
      "fr": {
        "title": "Près d'1 sur 5 déclarants éligibles manquent ce crédit d'impôt \"précieux\", selon l'IRS — comment il peut augmenter les remboursements",
        "summary": "Selon l'IRS, près de 20 % des contribuables éligibles manquent le crédit pour revenus du travail d'une valeur de milliers de dollars, laissant des remboursements importants non réclamés. Comprendre les critères d'admissibilité pourrait aider les travailleurs à revenus faibles à augmenter considérablement leurs remboursements d'impôts."
      },
      "de": {
        "title": "Fast jeder 5. berechtigte Antragsteller verpasst diese \"wertvolle\" Steuergutschrift, sagt der IRS — wie er Rückerstattungen erhöhen kann",
        "summary": "Nach Angaben des IRS verpassen fast 20% der berechtigten Steuerzahler die Steuergutschrift für verdiente Einkommen im Wert von Tausenden von Dollar, was zu nicht eingelösten Rückerstattungsgeldern führt. Das Verständnis der Zulassungsvoraussetzungen könnte Arbeitnehmern mit niedrigerem Einkommen helfen, ihre Steuerrückerstattungen erheblich zu erhöhen."
      },
      "es": {
        "title": "Casi 1 de cada 5 declarantes elegibles pierden este crédito fiscal \"valioso\", dice el IRS — cómo puede aumentar los reembolsos",
        "summary": "Según el IRS, casi el 20% de los contribuyentes elegibles pierden el crédito por ingresos del trabajo por valor de miles de dólares, dejando dinero de reembolso importante no reclamado. Comprender los requisitos de elegibilidad podría ayudar a los trabajadores de bajos ingresos a aumentar sustancialmente sus devoluciones de impuestos."
      }
    }
  },
  {
    "title": "Epstein files: Rep. Mace says she'll call Trump Commerce chief Lutnick to testify",
    "slug": "mace-lutnick-testify-epstein-files",
    "url": "https://www.cnbc.com/2026/02/27/epstein-trump-lutnick-mace-clinton.html",
    "source": "CNBC",
    "date": "2026-02-27T17:40:16.000Z",
    "summary": "Rep. Nancy Mace announced plans to call Commerce Secretary Lutnick to testify regarding connections to Jeffrey Epstein as the House investigates past relationships with the disgraced financier. The testimony comes as the committee also questions former President Bill Clinton.",
    "content": "Rep. Nancy Mace's comments came before the House Oversight Committe was to question ex-President Bill Clinton about his connections to Jeffrey Epstein.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "爱泼斯坦文件：众议员梅斯说她将呼吁特朗普商务部长卢特尼克作证",
        "summary": "众议员南希·梅斯宣布计划要求商务部长卢特尼克就与杰弗瑞·爱泼斯坦的联系作证，因为众议院正在调查与这位失宠金融家的过去关系。该证词同时进行时，委员会还在询问前总统比尔·克林顿。"
      },
      "fr": {
        "title": "Dossiers Epstein : La représentante Mace dit qu'elle appellera le secrétaire au Commerce de Trump, Lutnick, à témoigner",
        "summary": "La représentante Nancy Mace a annoncé son intention d'appeler le secrétaire au Commerce Lutnick à témoigner concernant les connexions à Jeffrey Epstein alors que la Chambre enquête sur les relations passées avec le financier disgrâcié. Le témoignage intervient alors que le comité interroge également l'ancien président Bill Clinton."
      },
      "de": {
        "title": "Epstein-Akten: Rep. Mace sagt, sie werde Commerce-Chef Lutnick von Trump zum Zeugnis auffordern",
        "summary": "Die Abgeordnete Nancy Mace kündigte an, Handelsminister Lutnick aufzufordern, zur Aussage über Verbindungen zu Jeffrey Epstein beizutragen, während das Repräsentantenhaus frühere Beziehungen zum in Ungnade gefallenen Finanzier untersucht. Die Aussage erfolgt, während der Ausschuss auch den früheren Präsidenten Bill Clinton befragt."
      },
      "es": {
        "title": "Archivos de Epstein: La representante Mace dice que llamará al secretario de Comercio de Trump, Lutnick, a testificar",
        "summary": "La representante Nancy Mace anunció su intención de llamar al secretario de Comercio Lutnick a testificar sobre conexiones con Jeffrey Epstein mientras la Cámara investiga relaciones pasadas con el financiero caído en desgracia. El testimonio se produce mientras el comité también cuestiona al expresidente Bill Clinton."
      }
    }
  },
  {
    "title": "Jim Cramer: Here are 4 reasons I can't be negative on this stock market",
    "slug": "cramer-bullish-stock-market-reasons",
    "url": "https://www.cnbc.com/2026/02/27/jim-cramer-here-are-4-reasons-i-cant-be-negative-on-this-stock-market.html",
    "source": "CNBC",
    "date": "2026-02-27T17:37:30.000Z",
    "summary": "CNBC's Jim Cramer outlined four reasons to remain bullish on stocks, comparing the current era to an early phase of a new Industrial Revolution with substantial growth potential ahead. His analysis suggests investors should stay optimistic about market prospects.",
    "content": "\"We're in a new Industrial Revolution, and you're not at the part where you're winning yet,\" Cramer said.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "吉姆·克拉默：以下是我不能对这个股市持悲观态度的4个原因",
        "summary": "美国全国广播公司财经频道的吉姆·克拉默列举了四个看好股票的原因，将当前时代与新工业革命的早期阶段进行比较，认为前方还有巨大的增长潜力。他的分析表明投资者应该对市场前景保持乐观。"
      },
      "fr": {
        "title": "Jim Cramer : Voici 4 raisons pour lesquelles je ne peux pas être négatif sur ce marché boursier",
        "summary": "Jim Cramer de CNBC a énuméré quatre raisons de rester optimiste sur les actions, comparant l'ère actuelle à une phase précoce d'une nouvelle révolution industrielle avec un potentiel de croissance substantiel en avant. Son analyse suggère que les investisseurs devraient rester optimistes sur les perspectives du marché."
      },
      "de": {
        "title": "Jim Cramer: Hier sind 4 Gründe, warum ich in diesem Aktienmarkt nicht pessimistisch sein kann",
        "summary": "Jim Cramer von CNBC nannte vier Gründe, um bullisch zu den Aktien zu bleiben, indem er die aktuelle Ära mit einer frühen Phase einer neuen Industriellen Revolution mit erheblichem Wachstumspotenzial verglich. Seine Analyse deutet darauf hin, dass Anleger optimistisch zur Marktaussicht bleiben sollten."
      },
      "es": {
        "title": "Jim Cramer: Aquí hay 4 razones por las que no puedo ser negativo en este mercado de valores",
        "summary": "Jim Cramer de CNBC describió cuatro razones para mantener una perspectiva alcista sobre las acciones, comparando la era actual con una fase temprana de una nueva Revolución Industrial con potencial de crecimiento sustancial por delante. Su análisis sugiere que los inversores deben mantener el optimismo sobre las perspectivas del mercado."
      }
    }
  },
  {
    "title": "The new anti-AI trade sweeping Wall Street: 'HALO'",
    "slug": "anti-ai-trade-halo-physical-assets",
    "url": "https://www.cnbc.com/2026/02/27/the-new-anti-ai-trade-sweeping-wall-street-halo.html",
    "source": "CNBC",
    "date": "2026-02-27T17:32:56.000Z",
    "summary": "Wall Street investors are increasingly favoring \"HALO\" companies with substantial physical assets like power grids and pipelines that are less vulnerable to artificial intelligence disruption. This trend reflects growing concerns about AI's potential impact on traditional business models.",
    "content": "Investors are bidding up companies with hefty real assets such as grids, pipelines and heavy machinery that are least likely to be replaced by artificial intelligence.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "席卷华尔街的新反AI贸易：\"HALO\"",
        "summary": "华尔街投资者越来越倾向于支持拥有电网和管道等大量物理资产的\"HALO\"公司，这些资产不易受到人工智能中断的影响。这一趋势反映了人们对AI对传统商业模式潜在影响的日益增长的担忧。"
      },
      "fr": {
        "title": "Le nouveau commerce anti-IA balayant Wall Street : « HALO »",
        "summary": "Les investisseurs de Wall Street favorisent de plus en plus les entreprises « HALO » possédant des actifs physiques substantiels comme les réseaux électriques et les pipelines qui sont moins vulnérables à la perturbation de l'intelligence artificielle. Cette tendance reflète les préoccupations croissantes concernant l'impact potentiel de l'IA sur les modèles commerciaux traditionnels."
      },
      "de": {
        "title": "Der neue Anti-KI-Handel, der die Wall Street erfasst: „HALO\"",
        "summary": "Wall-Street-Investoren bevorzugen zunehmend „HALO\"-Unternehmen mit erheblichen physischen Vermögenswerten wie Stromnetzen und Pipelines, die weniger anfällig für KI-Störungen sind. Dieser Trend spiegelt wachsende Bedenken hinsichtlich der potenziellen Auswirkungen von KI auf traditionelle Geschäftsmodelle wider."
      },
      "es": {
        "title": "El nuevo comercio anti-IA que barre Wall Street: 'HALO'",
        "summary": "Los inversores de Wall Street están favoreciendo cada vez más a las empresas \"HALO\" con activos físicos sustanciales como redes eléctricas y tuberías que son menos vulnerables a la disrupción de la inteligencia artificial. Esta tendencia refleja las crecientes preocupaciones sobre el impacto potencial de la IA en los modelos comerciales tradicionales."
      }
    }
  },
  {
    "title": "CoreWeave CEO defends spending plans, tries to combat debt narrative as stock plummets nearly 20%",
    "slug": "coreweave-ceo-spending-debt-stock",
    "url": "https://www.cnbc.com/2026/02/27/coreweave-ceo-intrator-stock-ai-spending.html",
    "source": "CNBC",
    "date": "2026-02-27T17:32:39.000Z",
    "summary": "CoreWeave's CEO defended the company's accelerated infrastructure spending amid a nearly 20% stock decline, countering concerns about mounting debt from expansion. The comments highlight investor tensions between long-term growth investments and near-term financial risks.",
    "content": "Coreweave CEO Mike Intrator said the company has intentionally accelerated its infrastructure buildout.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "CoreWeave首席执行官为支出计划辩护，试图对抗债务叙述，股票下跌近20%",
        "summary": "CoreWeave首席执行官在股票下跌近20%的情况下为公司加速基础设施支出进行了辩护，反驳了对扩张带来的债务增加的担忧。这些评论突显了投资者在长期增长投资和短期财务风险之间的紧张关系。"
      },
      "fr": {
        "title": "Le PDG de CoreWeave défend les plans de dépenses, essaie de combattre le récit de la dette alors que l'action chute de près de 20%",
        "summary": "Le PDG de CoreWeave a défendu les dépenses accélérées en infrastructure de l'entreprise au milieu d'une baisse des actions de près de 20%, réfutant les préoccupations concernant l'endettement croissant lié à l'expansion. Les commentaires mettent en évidence les tensions des investisseurs entre les investissements de croissance à long terme et les risques financiers à court terme."
      },
      "de": {
        "title": "CoreWeave-CEO verteidigt Ausgabenpläne, versucht, die Schuldendarstellung zu bekämpfen, da die Aktie um fast 20% fällt",
        "summary": "Der CEO von CoreWeave verteidigte die beschleunigten Infrastrukturausgaben des Unternehmens inmitten eines Aktienkurses um fast 20%, um Bedenken hinsichtlich der steigenden Verschuldung durch die Expansion zu widerlegen. Die Kommentare verdeutlichen die Spannungen der Anleger zwischen langfristigen Wachstumsinvestitionen und kurzfristigen Finanzrisiken."
      },
      "es": {
        "title": "El CEO de CoreWeave defiende los planes de gastos, intenta combatir la narrativa de deuda mientras las acciones se desploman casi 20%",
        "summary": "El CEO de CoreWeave defendió el gasto acelerado en infraestructura de la empresa en medio de una caída de casi el 20% en las acciones, refutando las preocupaciones sobre el aumento de la deuda por la expansión. Los comentarios destacan las tensiones de los inversores entre las inversiones de crecimiento a largo plazo y los riesgos financieros a corto plazo."
      }
    }
  },
  {
    "title": "Stocks making the biggest moves midday: Bank stocks, Netflix, Duolingo, AES, Sunrun and more",
    "slug": "stocks-biggest-moves-midday",
    "url": "https://www.cnbc.com/2026/02/27/stocks-making-the-biggest-moves-midday-banks-nflx-duol-aes-run-.html",
    "source": "CNBC",
    "date": "2026-02-27T17:24:03.000Z",
    "summary": "Bank stocks, Netflix, Duolingo, AES, and Sunrun were among stocks posting the largest midday price movements, reflecting varied sectoral and individual company performance. The activity suggests continued market volatility and shifting investor sentiment.",
    "content": "These are some of the stocks posting the largest moves at midday.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "中午股票涨跌幅最大的：银行股、Netflix、Duolingo、AES、Sunrun等",
        "summary": "银行股、Netflix、Duolingo、AES和Sunrun等股票在中午出现了最大的价格波动，反映了不同行业和个别公司的业绩表现不同。这一活动表明市场波动持续，投资者情绪转变。"
      },
      "fr": {
        "title": "Les actions enregistrant les plus grands mouvements en milieu de journée : actions bancaires, Netflix, Duolingo, AES, Sunrun et plus",
        "summary": "Les actions bancaires, Netflix, Duolingo, AES et Sunrun figuraient parmi les actions enregistrant les plus grands mouvements de prix en milieu de journée, reflétant les performances variées du secteur et des entreprises individuelles. L'activité suggère une volatilité continue du marché et une évolution du sentiment des investisseurs."
      },
      "de": {
        "title": "Aktien mit den größten Bewegungen mittags: Bankaktien, Netflix, Duolingo, AES, Sunrun und mehr",
        "summary": "Bankaktien, Netflix, Duolingo, AES und Sunrun gehörten zu den Aktien mit den größten Preisbewegungen mittags und spiegelten unterschiedliche Leistungen des Sektors und einzelner Unternehmen wider. Die Aktivität deutet auf anhaltende Marktvolatilität und sich ändernde Anlegerstimmung hin."
      },
      "es": {
        "title": "Las acciones con los mayores movimientos a mediodía: acciones bancarias, Netflix, Duolingo, AES, Sunrun y más",
        "summary": "Las acciones bancarias, Netflix, Duolingo, AES y Sunrun se encontraban entre las acciones que registraban los mayores movimientos de precios a mediodía, reflejando el desempeño variado del sector y de las empresas individuales. La actividad sugiere volatilidad continua del mercado y cambios en el sentimiento de los inversores."
      }
    }
  },
  {
    "title": "Bill Clinton on Jeffrey Epstein: 'I saw nothing, and I did nothing wrong'",
    "slug": "clinton-epstein-testimony-oversight",
    "url": "https://www.cnbc.com/2026/02/27/bill-clinton-jeffrey-epstein-oversight-committee.html",
    "source": "CNBC",
    "date": "2026-02-27T17:23:58.000Z",
    "summary": "Former President Bill Clinton testified before the House Oversight Committee, denying knowledge of or involvement in Jeffrey Epstein's crimes and stating he \"saw nothing, and did nothing wrong.\" The hearing is part of congressional scrutiny of Epstein connections, though President Trump has not been called to testify.",
    "content": "The House Oversight forced Bill and Hillary Clinton to testify about Jeffrey Epstein. It has not called for testimony from President Donald Trump.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "比尔·克林顿谈杰弗里·爱泼斯坦：\"我什么都没看到，我没有做错任何事\"",
        "summary": "前总统比尔·克林顿在众议院监督委员会作证，否认了解或参与杰弗里·爱泼斯坦的犯罪，并声称他\"什么都没看到，也没有做错任何事\"。该听证会是国会对爱泼斯坦关联的审视的一部分，尽管特朗普总统尚未被要求作证。"
      },
      "fr": {
        "title": "Bill Clinton sur Jeffrey Epstein : « Je n'ai rien vu, et je n'ai rien fait de mal »",
        "summary": "L'ancien président Bill Clinton a témoigné devant la Commission de surveillance de la Chambre, niant toute connaissance ou implication dans les crimes de Jeffrey Epstein et affirmant qu'il « n'avait rien vu et n'avait rien fait de mal ». L'audience fait partie de l'examen par le Congrès des liens avec Epstein, bien que le président Trump n'ait pas été appelé à témoigner."
      },
      "de": {
        "title": "Bill Clinton über Jeffrey Epstein: „Ich habe nichts gesehen, und ich habe nichts falsch gemacht\"",
        "summary": "Der ehemalige Präsident Bill Clinton sagte vor dem Aufsichtsausschuss des Repräsentantenhauses aus und bestritt, von Jeffreys Epsteins Verbrechen gewusst zu haben oder darin verwickelt zu sein, und erklärte, er „habe nichts gesehen und nichts falsch gemacht\". Die Anhörung ist Teil der Überprüfung durch den Kongress von Epstein-Verbindungen, obwohl Präsident Trump nicht zur Aussage aufgefordert wurde."
      },
      "es": {
        "title": "Bill Clinton sobre Jeffrey Epstein: \"No vi nada, y no hice nada mal\"",
        "summary": "El expresidente Bill Clinton testificó ante el Comité de Supervisión de la Cámara, negando conocimiento o participación en los crímenes de Jeffrey Epstein y afirmando que \"no vio nada y no hizo nada mal\". La audiencia es parte del escrutinio del Congreso sobre las conexiones de Epstein, aunque el presidente Trump no ha sido llamado a testificar."
      }
    }
  },
  {
    "title": "Boomers waste money, too. These are the spending traps tripping up the richest generation.",
    "slug": "boomers-spending-traps-wasteful-habits",
    "url": "https://www.marketwatch.com/story/boomers-waste-money-too-these-are-the-spending-traps-tripping-up-the-richest-generation-ddc3f112?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T17:21:00.000Z",
    "summary": "Baby boomers, despite their wealth advantage, struggle with wasteful spending and financially damaging habits that undermine long-term security. Understanding these behavioral spending traps could help older adults optimize their financial management.",
    "content": "Baby boomers may not be the “avocado toast” generation, but they have plenty of their own wasteful and financially damaging habits.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "婴儿潮一代也浪费金钱。这些消费陷阱正在绊倒最富有的一代。",
        "summary": "尽管婴儿潮一代拥有财富优势，但他们仍在与浪费性支出和财务破坏性习惯作斗争，这些习惯削弱了长期安全。理解这些行为消费陷阱可以帮助老年人优化他们的财务管理。"
      },
      "fr": {
        "title": "Les baby-boomers gaspillent aussi de l'argent. Ce sont les pièges de dépenses qui piègent la génération la plus riche.",
        "summary": "Les baby-boomers, malgré leur avantage de richesse, luttent contre les dépenses inutiles et les habitudes financièrement nuisibles qui sapent la sécurité à long terme. Comprendre ces pièges de dépenses comportementales pourrait aider les personnes âgées à optimiser leur gestion financière."
      },
      "de": {
        "title": "Auch Babyboomer verschwenden Geld. Dies sind die Ausgabenfallen, die die reichste Generation in die Irre führen.",
        "summary": "Babyboomer kämpfen trotz ihres Vermögensvorteils mit verschwendungsüchtigem Ausgeben und finanziell schädlichen Gewohnheiten, die die langfristige Sicherheit untergraben. Das Verständnis dieser Verhaltensausgabenfallen könnte älteren Erwachsenen helfen, ihre Finanzverwaltung zu optimieren."
      },
      "es": {
        "title": "Los boomers también desperdician dinero. Estas son las trampas de gasto que engañan a la generación más rica.",
        "summary": "Los baby boomers, a pesar de su ventaja de riqueza, luchan contra gastos derrochadores y hábitos financieramente dañinos que socavan la seguridad a largo plazo. Comprender estas trampas de gasto de comportamiento podría ayudar a los adultos mayores a optimizar su gestión financiera."
      }
    }
  },
  {
    "title": "Brewdog expected to announce sale early next week",
    "slug": "brewdog-expected-announce-sale",
    "url": "https://www.bbc.com/news/articles/c07jmmgyx19o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-27T17:16:32.000Z",
    "summary": "Brewdog is expected to announce a sale early next week, with its German operations set for liquidation while bar locations continue normal operations. The sale marks a significant transition for the Scottish brewery following years of expansion.",
    "content": "Staff are told Brewdog's German arm is not included in the sale and will now be liquidated but bars will trade as normal this weekend.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "布鲁杜格预计下周初宣布出售",
        "summary": "布鲁杜格预计在下周初宣布出售，其德国业务将进行清算，而酒吧地点继续正常运营。此次出售对这家苏格兰啤酒厂经过多年扩张后标志着重大转变。"
      },
      "fr": {
        "title": "BrewDog devrait annoncer sa vente en début de semaine prochaine",
        "summary": "BrewDog devrait annoncer une vente en début de semaine prochaine, ses opérations allemandes étant destinées à la liquidation tandis que les bars continueront à fonctionner normalement. La vente marque une transition importante pour la brasserie écossaise suite à des années d'expansion."
      },
      "de": {
        "title": "BrewDog soll frühe nächste Woche einen Verkauf ankündigen",
        "summary": "BrewDog wird voraussichtlich in der nächsten Woche einen Verkauf ankündigen, wobei seine deutschen Aktivitäten zur Liquidation bestimmt sind, während die Barstandorte normal weiterlaufen. Der Verkauf markiert einen bedeutenden Übergang für die schottische Brauerei nach Jahren der Expansion."
      },
      "es": {
        "title": "Se espera que BrewDog anuncie la venta a principios de la próxima semana",
        "summary": "Se espera que BrewDog anuncie una venta a principios de la próxima semana, con sus operaciones alemanas destinadas a la liquidación mientras que las ubicaciones de bares continúan funcionando normalmente. La venta marca una transición importante para la cervecería escocesa tras años de expansión."
      }
    }
  },
  {
    "title": "Beware of banks breaking bad, warns top B. of A. strategist. He casts a wary eye on bank-loan ETFs.",
    "slug": "banks-problem-loans-etf-risks",
    "url": "https://www.marketwatch.com/story/beware-of-banks-breaking-bad-warns-top-b-of-a-strategist-he-casts-a-wary-eye-on-bank-loan-etfs-d90a9920?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T17:15:00.000Z",
    "summary": "A Bank of America strategist warns that rising problem loans in the financial sector signal mounting risks for broader markets and bank-loan ETFs. The warning suggests investors should exercise caution with bank-related investments amid deteriorating credit conditions.",
    "content": "Problem loans in the financial-services sector imply mounting risks for markets.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "警惕银行走向恶化，美银首席策略师警告。他对银行贷款ETF投以警惕目光。",
        "summary": "美国银行策略师警告称，金融部门问题贷款的增加预示着对更广泛市场和银行贷款ETF的风险上升。该警告表明投资者在信贷条件恶化的情况下应对银行相关投资保持谨慎。"
      },
      "fr": {
        "title": "Attention aux banques qui déraillent, avertit le meilleur stratège de BofA. Il jette un regard méfiant sur les ETF de prêts bancaires.",
        "summary": "Un stratège de la Banque d'Amérique avertit que la hausse des crédits problématiques dans le secteur financier signale une accumulation croissante des risques pour les marchés plus larges et les ETF de prêts bancaires. L'avertissement suggère que les investisseurs doivent exercer la prudence concernant les investissements liés aux banques au milieu de la détérioration des conditions de crédit."
      },
      "de": {
        "title": "Vorsicht vor Banken, die schiefgehen, warnt der Top-Strategist der B. of A. Er wirft einen wachsamen Blick auf Bank-Loan-ETFs.",
        "summary": "Ein Stratege der Bank of America warnt, dass steigende notleidende Kredite im Finanzsektor ein wachsendes Risiko für breitere Märkte und Bank-Loan-ETFs signalisieren. Die Warnung deutet darauf hin, dass Anleger bei bankenbezogenen Investitionen angesichts sich verschlechternder Kreditbedingungen Vorsicht walten lassen sollten."
      },
      "es": {
        "title": "Cuidado con los bancos que se descarrilan, advierte el principal estratega de BofA. Lanza una mirada cautelosa a los ETF de préstamos bancarios.",
        "summary": "Un estratega del Banco de América advierte que el aumento de préstamos problemáticos en el sector financiero señala riesgos crecientes para los mercados más amplios y los ETF de préstamos bancarios. La advertencia sugiere que los inversores deben ejercer cautela con las inversiones relacionadas con bancos en medio del deterioro de las condiciones crediticias."
      }
    }
  },
  {
    "title": "Most banks fail miserably at helping grieving families make this vital financial move",
    "slug": "banks-grieving-families-financial-help",
    "url": "https://www.marketwatch.com/story/most-banks-fail-miserably-at-helping-grieving-families-make-this-vital-financial-move-66831e97?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T17:13:00.000Z",
    "summary": "Many banks inadequately assist grieving families with critical financial matters after a loved one's death, leaving them struggling with hold music and complex processes. Improving support for bereaved customers represents a significant service gap in the banking industry.",
    "content": "When a loved one dies, the last thing you want to hear is hold music.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "大多数银行在帮助悲伤的家庭进行这一重要财务决定时表现得极其糟糕",
        "summary": "许多银行对丧失亲人后的悲伤家庭在重要财务事宜上协助不足，使他们陷入长时间等待和复杂流程的困境。改善对丧失亲人客户的支持代表了银行业的一个重大服务差距。"
      },
      "fr": {
        "title": "La plupart des banques échouent lamentablement à aider les familles endeuillées à effectuer ce mouvement financier vital",
        "summary": "De nombreuses banques aident de manière insuffisante les familles endeuillées avec des questions financières essentielles après le décès d'un proche, les laissant confrontées à de la musique d'attente et à des processus complexes. L'amélioration du soutien aux clients endeuillés représente une lacune importante des services du secteur bancaire."
      },
      "de": {
        "title": "Die meisten Banken versagen kläglich darin, trauernden Familien bei diesem wichtigen finanziellen Schritt zu helfen",
        "summary": "Viele Banken unterstützen trauernde Familien bei kritischen Finanzangelegenheiten nach dem Tod eines geliebten Menschen nicht angemessen und lassen sie mit Warteschleifen und komplizierten Prozessen kämpfen. Eine Verbesserung der Unterstützung für trauernde Kunden stellt eine erhebliche Servicelücke in der Bankenbranche dar."
      },
      "es": {
        "title": "La mayoría de los bancos fracasan miserablemente en ayudar a las familias afligidas a hacer este movimiento financiero vital",
        "summary": "Muchos bancos no ayudan adecuadamente a las familias afligidas con asuntos financieros críticos después de la muerte de un ser querido, dejándolas lidiando con música de espera y procesos complejos. Mejorar el apoyo a los clientes afligidos representa una brecha de servicios significativa en la industria bancaria."
      }
    }
  },
  {
    "title": "Rubio to travel to Israel to discuss Iran, other issues, State Dept. says",
    "slug": "rubio-israel-iran-negotiations",
    "url": "https://www.cnbc.com/2026/02/27/iran-israel-rubio-state-department.html",
    "source": "CNBC",
    "date": "2026-02-27T17:01:02.000Z",
    "summary": "Secretary of State Rubio is traveling to Israel to discuss Iran and other Middle East issues as the US continues pressuring Iran to curb its nuclear program. The visit reflects ongoing diplomatic efforts despite stalled direct talks with Tehran.",
    "content": "The United States has been pressuring Iran to curb its nuclear program, but talks between the two countries have not led to a breakthrough so far.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "鲁比奥前往以色列讨论伊朗等问题，美国国务院表示",
        "summary": "国务卿鲁比奥正前往以色列讨论伊朗和其他中东问题，美国继续对伊朗施压以遏制其核计划。这次访问反映了尽管与德黑兰的直接谈判陷入僵局，美国仍在进行持续的外交努力。"
      },
      "fr": {
        "title": "Rubio se rendra en Israël pour discuter de l'Iran et d'autres questions, déclare le département d'État",
        "summary": "Le secrétaire d'État Rubio se rend en Israël pour discuter de l'Iran et d'autres questions du Moyen-Orient alors que les États-Unis continuent de faire pression sur l'Iran pour freiner son programme nucléaire. La visite reflète les efforts diplomatiques continus malgré les pourparlers directs interrompus avec Téhéran."
      },
      "de": {
        "title": "Rubio reist nach Israel, um über den Iran und andere Fragen zu sprechen, sagt das Außenministerium",
        "summary": "Außenminister Rubio reist nach Israel, um über den Iran und andere Fragen im Nahen Osten zu sprechen, während die USA weiterhin Druck auf den Iran ausüben, um sein Atomkraftwerk einzudämmen. Der Besuch spiegelt laufende diplomatische Bemühungen wider, obwohl die direkten Gespräche mit Teheran stagnieren."
      },
      "es": {
        "title": "Rubio viajará a Israel para discutir sobre Irán y otros temas, dice el Departamento de Estado",
        "summary": "El Secretario de Estado Rubio viaja a Israel para discutir sobre Irán y otros problemas de Oriente Medio mientras Estados Unidos continúa presionando a Irán para frenar su programa nuclear. La visita refleja esfuerzos diplomáticos continuos a pesar de los diálogos directos estancados con Teherán."
      }
    }
  },
  {
    "title": "UBS downgrades the U.S. stock market. Here's what has the investment bank worried",
    "slug": "ubs-downgrades-us-stock-market",
    "url": "https://www.cnbc.com/2026/02/27/ubs-downgrades-the-us-stock-market-heres-what-has-the-investment-bank-worried.html",
    "source": "CNBC",
    "date": "2026-02-27T16:59:22.000Z",
    "summary": "Investment bank UBS downgraded US equities to \"benchmark\" status, citing concerns that factors driving years of stock outperformance are beginning to fade. The move signals skepticism about continued US market strength relative to global alternatives.",
    "content": "UBS downgraded U.S. equities to \"benchmark\" in a fully invested global equity portfolio, saying factors that powered years of outperformance are starting to fade.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "UBS下调美国股票市场评级。以下是投资银行担忧的原因",
        "summary": "投资银行瑞银集团将美国股票下调至\"基准\"评级，理由是推动多年来股票表现优异的因素开始消退。此举表明对美国市场相对于全球其他市场的持续强劲表现持怀疑态度。"
      },
      "fr": {
        "title": "UBS abaisse le marché boursier américain. Voici ce qui préoccupe la banque d'investissement",
        "summary": "La banque d'investissement UBS a abaissé les actions américaines au statut « de référence », citant des préoccupations selon lesquelles les facteurs qui ont stimulé la surperformance des actions pendant des années commencent à s'estomper. Cette décision signale du scepticisme quant à la poursuite de la force du marché américain par rapport aux alternatives mondiales."
      },
      "de": {
        "title": "UBS stuft den US-Aktienmarkt herab. Hier erfahren Sie, was die Investmentbank beunruhigt",
        "summary": "Die Investmentbank UBS stufte US-Aktien auf \"Benchmark\"-Status herab, da sie besorgt ist, dass die Faktoren, die Jahre lang zu einer Überperformance von Aktien führten, zu verblassen beginnen. Die Maßnahme signalisiert Skepsis gegenüber anhaltender US-Marktstärke im Vergleich zu globalen Alternativen."
      },
      "es": {
        "title": "UBS rebaja el mercado de valores estadounidense. Esto es lo que preocupa al banco de inversión",
        "summary": "El banco de inversión UBS rebajó las acciones estadounidenses al estado \"de referencia\", citando preocupaciones de que los factores que impulsaron el rendimiento superior de las acciones durante años están comenzando a desvanecerse. El movimiento señala escepticismo sobre la fortaleza continua del mercado estadounidense en relación con las alternativas globales."
      }
    }
  },
  {
    "title": "Government to give go-ahead for £1bn defence helicopter deal",
    "slug": "government-approves-1bn-defense-helicopter-deal",
    "url": "https://www.bbc.com/news/articles/c75e14k64dvo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-27T16:20:07.000Z",
    "summary": "The UK government is approving a £1 billion defense helicopter deal to protect manufacturing jobs at a Somerset-based facility. The chancellor's intervention highlights the government's commitment to maintaining domestic defense production capabilities.",
    "content": "The chancellor has stepped in to protect jobs at the helicopter manufacturer in Somerset, the BBC understands.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "政府批准10亿英镑国防直升机交易",
        "summary": "英国政府批准了一笔10亿英镑的国防直升机交易，以保护位于萨默塞特的制造业工作。财政大臣的干预凸显了政府致力于维持国内防御生产能力的承诺。"
      },
      "fr": {
        "title": "Le gouvernement approuve un accord de 1 milliard de livres sur les hélicoptères de défense",
        "summary": "Le gouvernement britannique approuve un accord de 1 milliard de livres sur les hélicoptères de défense pour protéger les emplois de fabrication dans une installation basée à Somerset. L'intervention du chancelier souligne l'engagement du gouvernement à maintenir les capacités nationales de production de défense."
      },
      "de": {
        "title": "Regierung genehmigt £1-Milliarden-Verteidigungshelikopter-Geschäft",
        "summary": "Die britische Regierung genehmigt ein £1-Milliarden-Abkommen über Verteidigungshubschrauber, um Fertigungsarbeitsplätze in einer Somerset-Einrichtung zu schützen. Die Intervention des Schatzkanzlers unterstreicht das Engagement der Regierung, die inländischen Verteidigungsproduktionsfähigkeiten zu erhalten."
      },
      "es": {
        "title": "Gobierno aprueba acuerdo de helicóptero de defensa de mil millones de libras",
        "summary": "El gobierno británico aprueba un acuerdo de mil millones de libras sobre helicópteros de defensa para proteger empleos de fabricación en una instalación con sede en Somerset. La intervención del canciller destaca el compromiso del gobierno de mantener las capacidades nacionales de producción de defensa."
      }
    }
  },
  {
    "title": "Trump angering MAHA with glyphosate order gives Democrats an opening",
    "slug": "trump-glyphosate-order-maha-democrats",
    "url": "https://www.cnbc.com/2026/02/27/trump-maha-glyphosate-order-democrats-rfk-jr.html",
    "source": "CNBC",
    "date": "2026-02-27T16:16:51.000Z",
    "summary": "Trump's glyphosate order is creating friction with health-conscious supporters of Robert F. Kennedy Jr., potentially giving Democrats an opening to reclaim voters from MAHA and Trump's base. The policy disagreement exposes fault lines within Trump's coalition.",
    "content": "Democrats once counted many of the health-conscious followers of Robert F. Kennedy Jr. among their own ranks.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "特朗普的草甘膦命令激怒MAHA，为民主党带来机会",
        "summary": "特朗普的草甘膦命令正在与罗伯特·肯尼迪二世的健康意识支持者产生摩擦，可能为民主党提供从MAHA和特朗普基地收回选民的机会。政策分歧暴露了特朗普联盟内部的分界线。"
      },
      "fr": {
        "title": "L'ordre de glyphosate de Trump fâche MAHA et donne aux démocrates une ouverture",
        "summary": "L'ordre de glyphosate de Trump crée des frictions avec les partisans conscients de la santé de Robert F. Kennedy Jr., donnant potentiellement aux démocrates une ouverture pour reprendre des électeurs de MAHA et de la base de Trump. Le désaccord politique expose les lignes de faille au sein de la coalition de Trump."
      },
      "de": {
        "title": "Trumps Glyphosat-Befehl verärgert MAHA und gibt Demokraten eine Möglichkeit",
        "summary": "Trumps Glyphosat-Befehl schafft Reibereien mit gesundheitsbewussten Unterstützern von Robert F. Kennedy Jr. und gibt Demokraten möglicherweise eine Möglichkeit, Wähler von MAHA und Trumps Basis zurückzugewinnen. Die politische Uneinigkeit legt Bruchlinien innerhalb von Trumps Koalition offen."
      },
      "es": {
        "title": "La orden de glifosato de Trump enoja a MAHA y abre una oportunidad a los demócratas",
        "summary": "La orden de glifosato de Trump está creando fricción con los partidarios conscientes de la salud de Robert F. Kennedy Jr., potencialmente dando a los demócratas una apertura para recuperar votantes de MAHA y la base de Trump. El desacuerdo político expone las líneas de falla dentro de la coalición de Trump."
      }
    }
  },
  {
    "title": "Core wholesale prices rose 0.8% in January, much more than expected",
    "slug": "core-wholesale-prices-rose-0-8-percent-january",
    "url": "https://www.cnbc.com/2026/02/27/ppi-january-2026-.html",
    "source": "CNBC",
    "date": "2026-02-27T14:29:19.000Z",
    "summary": "The core producer price index rose 0.8% in January, significantly exceeding the 0.6% monthly increase in December and Wall Street expectations. The jump signals persistent wholesale inflation pressures that could challenge Federal Reserve policy assumptions.",
    "content": "The core producer price index increased a seasonally adjusted 0.8%, more than the 0.6% gain in December.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "1月核心批发价格上涨0.8%，远超预期",
        "summary": "核心生产者价格指数在1月份上升了0.8%，远超12月份的0.6%月增长和华尔街的预期。这个上升表明持续的批发通胀压力可能会挑战美联储的政策假设。"
      },
      "fr": {
        "title": "Les prix de gros de base ont augmenté de 0,8% en janvier, bien plus que prévu",
        "summary": "L'indice des prix à la production de base a augmenté de 0,8% en janvier, dépassant largement l'augmentation mensuelle de 0,6% en décembre et les attentes de Wall Street. La hausse signale des pressions d'inflation de gros persistantes qui pourraient remettre en question les hypothèses de politique de la Réserve fédérale."
      },
      "de": {
        "title": "Kerngroßhandelspreise im Januar um 0,8% gestiegen, deutlich mehr als erwartet",
        "summary": "Der Kern-Erzeugerpreisindex ist im Januar um 0,8% gestiegen und übertrifft damit deutlich die monatliche Steigerung von 0,6% im Dezember und die Erwartungen der Wall Street. Der Anstieg signalisiert anhaltende Großhandelsinflationsdruck, der die Annahmen der Geldpolitik der Federal Reserve in Frage stellen könnte."
      },
      "es": {
        "title": "Los precios mayoristas básicos subieron 0,8% en enero, mucho más de lo esperado",
        "summary": "El índice de precios de productor núcleo subió 0,8% en enero, superando significativamente el aumento mensual del 0,6% en diciembre y las expectativas de Wall Street. El aumento señala presiones de inflación mayorista persistentes que podrían desafiar los supuestos de política de la Reserva Federal."
      }
    }
  },
  {
    "title": "Trump said tariffs could someday 'substantially replace' income taxes. What policy experts say",
    "slug": "trump-tariffs-replace-income-tax",
    "url": "https://www.cnbc.com/2026/02/27/trump-tariffs-income-taxes.html",
    "source": "CNBC",
    "date": "2026-02-27T13:14:41.000Z",
    "summary": "President Trump proposed during his State of the Union address that tariffs could eventually substantially replace the federal income tax system. Policy experts are analyzing the feasibility and economic implications of this alternative revenue approach.",
    "content": "During his State of the Union address, President Donald Trump said tariffs could someday \"substantially replace\" the federal income tax system.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "特朗普说关税有朝一日可能\"大幅替代\"所得税。政策专家怎么说",
        "summary": "特朗普在国情咨文中提议关税最终可能大幅替代联邦所得税制度。政策专家正在分析这一替代收入方法的可行性和经济影响。"
      },
      "fr": {
        "title": "Trump a déclaré que les tarifs pourraient un jour « remplacer considérablement » l'impôt sur le revenu. Que disent les experts en politique",
        "summary": "Le président Trump a proposé lors de son discours sur l'État de l'Union que les tarifs pourraient éventuellement remplacer considérablement le système fédéral d'impôt sur le revenu. Les experts en politique analysent la faisabilité et les implications économiques de cette approche alternative des revenus."
      },
      "de": {
        "title": "Trump sagte, dass Zölle eines Tages die Einkommensteuer „erheblich ersetzen\" könnten. Was sagen Politikexperten",
        "summary": "Präsident Trump schlug in seiner Rede zur Lage der Nation vor, dass Zölle möglicherweise erheblich das föderale Einkommensteuersystem ersetzen könnten. Politikexperten analysieren die Machbarkeit und wirtschaftlichen Auswirkungen dieses alternativen Einnahmeprinzips."
      },
      "es": {
        "title": "Trump dijo que los aranceles podrían algún día 'reemplazar sustancialmente' los impuestos sobre la renta. Qué dicen los expertos en políticas",
        "summary": "El presidente Trump propuso en su Discurso sobre el Estado de la Unión que los aranceles podrían eventualmente reemplazar sustancialmente el sistema federal de impuestos sobre la renta. Los expertos en políticas están analizando la viabilidad e implicaciones económicas de este enfoque alternativo de ingresos."
      }
    }
  },
  {
    "title": "SSE Airtricity to reduce gas prices by 8% from April",
    "slug": "sse-airtricity-gas-price-cut",
    "url": "https://www.bbc.com/news/articles/clyg21wgejvo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-27T13:05:27.000Z",
    "summary": "SSE Airtricity is reducing residential gas prices by 8% effective April, lowering typical household annual bills by approximately £80. The reduction provides relief to consumers amid broader economic pressures.",
    "content": "It means the annual gas bill of a typical household with a credit meter will reduce by £80 a year.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "SSE Airtricity 从4月起将燃气价格降低8%",
        "summary": "SSE Airtricity 从4月起将住宅燃气价格降低8%，降低典型家庭年度账单约80英镑。该降幅为消费者在更广泛的经济压力中提供了缓解。"
      },
      "fr": {
        "title": "SSE Airtricity réduira les prix du gaz de 8% à partir d'avril",
        "summary": "SSE Airtricity réduit les prix du gaz résidentiel de 8% à partir d'avril, réduisant les factures annuelles des ménages typiques d'environ 80 £. La réduction soulage les consommateurs dans un contexte de pressions économiques plus larges."
      },
      "de": {
        "title": "SSE Airtricity senkt Gaspreise ab April um 8%",
        "summary": "SSE Airtricity senkt die Gaspreise für Privathaushalte ab April um 8%, wodurch sich die typischen jährlichen Haushaltsrechnungen um etwa 80 £ reduzieren. Die Senkung bietet Verbrauchern angesichts breiterer wirtschaftlicher Belastungen Erleichterung."
      },
      "es": {
        "title": "SSE Airtricity reducirá los precios del gas un 8% a partir de abril",
        "summary": "SSE Airtricity está reduciendo los precios del gas residencial un 8% a partir de abril, reduciendo las facturas anuales típicas de los hogares en aproximadamente £80. La reducción proporciona alivio a los consumidores en medio de presiones económicas más amplias."
      }
    }
  },
  {
    "title": "Tyrrells plans to give vegetable crisps the chop",
    "slug": "tyrrells-vegetable-crisps-cut",
    "url": "https://www.bbc.com/news/articles/c620egvdqgyo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-27T12:57:23.000Z",
    "summary": "KP Snacks is planning to discontinue Tyrrells vegetable crisps as part of a restructuring initiative. The proposal could result in closure of the company's Uttoxeter factory in England.",
    "content": "Parent company KP confirms the proposals may lead to the loss of a factory in Uttoxeter.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Tyrrells 计划停产蔬菜薯片",
        "summary": "KP Snacks 计划在重组方案中停止销售 Tyrrells 蔬菜薯片。该提议可能导致该公司位于英格兰 Uttoxeter 工厂的关闭。"
      },
      "fr": {
        "title": "Tyrrells envisage d'abandonner les chips aux légumes",
        "summary": "KP Snacks envisage d'arrêter la production des chips aux légumes Tyrrells dans le cadre d'une initiative de restructuration. La proposition pourrait entraîner la fermeture de l'usine de Uttoxeter de la société en Angleterre."
      },
      "de": {
        "title": "Tyrrells plant, Gemüsechips abzuschaffen",
        "summary": "KP Snacks plant die Einstellung von Tyrrells-Gemüsechips als Teil einer Restrukturierungsinitiative. Der Vorschlag könnte zur Schließung der Fabrik Uttoxeter des Unternehmens in England führen."
      },
      "es": {
        "title": "Tyrrells planea dejar de producir chips de verdura",
        "summary": "KP Snacks planea descontinuar los chips de verdura Tyrrells como parte de una iniciativa de reestructuración. La propuesta podría resultar en el cierre de la fábrica Uttoxeter de la empresa en Inglaterra."
      }
    }
  },
  {
    "title": "Not all strategies belong in an ETF wrapper. Here's why",
    "slug": "not-all-strategies-belong-in-etf-wrapper",
    "url": "https://www.cnbc.com/2026/02/27/crowded-market-themes-may-have-no-place-in-etfs-.html",
    "source": "CNBC",
    "date": "2026-02-27T12:00:01.000Z",
    "summary": "The market is experiencing a potential shakeout of overcrowded non-traditional ETF strategies. This shift suggests mounting pressure on investors currently holding these types of investments.",
    "content": "The market may be entering a new phase: The shaking out of the most crowded \"non-traditional\" strategies.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "并非所有策略都适合在ETF包装中。原因如下",
        "summary": "市场正在经历非传统ETF策略过度拥挤可能引发的调整。这一转变表明，目前持有这些类型投资的投资者面临的压力不断增加。"
      },
      "fr": {
        "title": "Toutes les stratégies ne conviennent pas à un wrapper ETF. Voici pourquoi",
        "summary": "Le marché connaît une possible correction des stratégies ETF non traditionnelles surpeuplées. Ce changement suggère une pression croissante sur les investisseurs détenant actuellement ces types de placements."
      },
      "de": {
        "title": "Nicht alle Strategien gehören in eine ETF-Wrapper. Hier ist warum",
        "summary": "Der Markt erlebt eine mögliche Bereinigung überbelegter, nicht traditioneller ETF-Strategien. Diese Verschiebung deutet auf wachsenden Druck auf Anleger hin, die derzeit diese Art von Anlagen halten."
      },
      "es": {
        "title": "No todas las estrategias pertenecen a un envoltorio ETF. Aquí está el por qué",
        "summary": "El mercado está experimentando una posible corrección de estrategias ETF no tradicionales saturadas. Este cambio sugiere una presión creciente sobre los inversores que actualmente mantienen estos tipos de inversiones."
      }
    }
  },
  {
    "title": "Why you should consider fixing your energy tariff now",
    "slug": "why-you-should-consider-fixing-energy-tariff-now",
    "url": "https://www.bbc.com/news/videos/c309v7802v4o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-27T11:58:25.000Z",
    "summary": "The upcoming energy price cap change will affect UK household bills. Martin Lewis explains what these changes mean for consumers considering fixed-rate tariffs.",
    "content": "Martin Lewis explains what the upcoming change to the energy price cap means for your bills.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "为什么你现在应该考虑锁定能源费率",
        "summary": "即将到来的能源价格上限变化将影响英国家庭账单。马丁·刘易斯解释了这些变化对考虑固定费率关税的消费者意味着什么。"
      },
      "fr": {
        "title": "Pourquoi vous devriez envisager de fixer votre tarif énergétique maintenant",
        "summary": "Le prochain changement du plafond des prix de l'énergie affectera les factures des ménages au Royaume-Uni. Martin Lewis explique ce que ces changements signifient pour les consommateurs envisageant des tarifs fixes."
      },
      "de": {
        "title": "Warum Sie jetzt Ihren Energietarif fixieren sollten",
        "summary": "Die bevorstehende Änderung der Energiepreisdecke wird sich auf die Rechnungen britischer Haushalte auswirken. Martin Lewis erklärt, was diese Veränderungen für Verbraucher bedeuten, die Festtarife in Betracht ziehen."
      },
      "es": {
        "title": "Por qué deberías considerar fijar tu tarifa de energía ahora",
        "summary": "El próximo cambio en el techo de precios de la energía afectará las facturas de los hogares del Reino Unido. Martin Lewis explica lo que estos cambios significan para los consumidores que consideran tarifas fijas."
      }
    }
  },
  {
    "title": "Howard Marks of Oaktree makes 180-degree turn on AI after Claude tutorial. Here’s how he suggests investors approach it.",
    "slug": "howard-marks-oaktree-180-turn-ai-claude-tutorial",
    "url": "https://www.marketwatch.com/story/howard-marks-makes-180-degree-turn-on-ai-after-claude-tutorial-heres-how-he-suggests-investors-approach-it-c8658e7d?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T11:52:00.000Z",
    "summary": "Howard Marks, the legendary Oaktree investor, significantly reversed his skepticism about AI after using Claude, viewing it as revolutionary technology. Though cautious about potential AI bubbles, he believes AI has the capacity to outperform most human investors.",
    "content": "Legendary investor is still undecided about the AI bubble but the technology is revolutionary, he thinks. He believes AI has the capacity to be a better investor than most.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "橡树资本的霍华德·马克斯在Claude教程后对人工智能进行了180度大转变。以下是他建议投资者应对的方式。",
        "summary": "传奇橡树资本投资者霍华德·马克斯在使用Claude后，大幅改变了对人工智能的怀疑态度，认为这是革命性的技术。尽管对潜在的人工智能泡沫持谨慎态度，但他相信人工智能有能力超越大多数人类投资者。"
      },
      "fr": {
        "title": "Howard Marks d'Oaktree fait un revirement à 180 degrés sur l'IA après un tutoriel Claude. Voici comment il suggère aux investisseurs de l'aborder.",
        "summary": "Howard Marks, l'investisseur légendaire d'Oaktree, a considérablement inversé son scepticisme vis-à-vis de l'IA après l'utilisation de Claude, la considérant comme une technologie révolutionnaire. Bien que prudent quant aux bulles potentielles de l'IA, il croit que l'IA a la capacité de surpasser la plupart des investisseurs humains."
      },
      "de": {
        "title": "Howard Marks von Oaktree macht nach Claude-Anleitung eine 180-Grad-Wendung zur KI. Hier ist, wie er Investoren empfiehlt, damit umzugehen.",
        "summary": "Howard Marks, der legendäre Investor von Oaktree, hat seine Skepsis gegenüber KI nach der Nutzung von Claude erheblich umgekehrt und betrachtet sie als revolutionäre Technologie. Obwohl er vorsichtig bezüglich möglicher KI-Blasen ist, glaubt er, dass KI die Fähigkeit hat, die meisten menschlichen Investoren zu übertreffen."
      },
      "es": {
        "title": "Howard Marks de Oaktree da un giro de 180 grados sobre la IA después del tutorial de Claude. Así es cómo sugiere que los inversores lo aborden.",
        "summary": "Howard Marks, el legendario inversor de Oaktree, ha revertido significativamente su escepticismo sobre la IA después de usar Claude, viéndola como una tecnología revolucionaria. Aunque es cauteloso sobre posibles burbujas de IA, cree que la IA tiene la capacidad de superar a la mayoría de los inversores humanos."
      }
    }
  },
  {
    "title": "Nine out of 10 bets this fund manager made outperformed over the past year. Here’s his next two plays.",
    "slug": "nine-out-ten-bets-fund-manager-outperformed-past-year",
    "url": "https://www.marketwatch.com/story/nine-out-of-10-bets-this-fund-manager-made-outperformed-over-the-past-year-heres-his-next-two-plays-79f4b71e?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T11:46:00.000Z",
    "summary": "A fund manager at Man Group achieved exceptional performance with nine of ten bets outperforming over the past year. The strategy focused on gold miners, Japan stocks, and nuclear plays.",
    "content": "Gold miners, Japan stocks and nuclear plays boosted Man Group’s portfolio",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "该基金经理过去一年中的十笔投资中有九笔跑赢市场。以下是他接下来的两个投资计划。",
        "summary": "美国集团(Man Group)的一位基金经理去年表现异常出色，十笔投资中有九笔跑赢市场。该策略专注于黄金矿商、日本股票和核能相关投资。"
      },
      "fr": {
        "title": "Neuf des dix paris que ce gestionnaire de fonds a faits ont surperformé l'année dernière. Voici ses deux prochains coups.",
        "summary": "Un gestionnaire de fonds chez Man Group a réalisé une performance exceptionnelle avec neuf de ses dix paris surperformant l'année dernière. La stratégie s'est concentrée sur les mineurs d'or, les actions japonaises et les enjeux nucléaires."
      },
      "de": {
        "title": "Neun von zehn Wetten dieses Fondsmanagers schlugen den Markt im vergangenen Jahr. Hier sind seine nächsten zwei Spielzüge.",
        "summary": "Ein Fondsmanager bei Man Group erzielte im vergangenen Jahr eine außergewöhnliche Leistung, wobei neun von zehn Wetten den Markt schlugen. Die Strategie konzentrierte sich auf Goldminen, japanische Aktien und Kernkraftanlagen."
      },
      "es": {
        "title": "Nueve de cada diez apuestas que hizo este gestor de fondos superaron al mercado el año pasado. Aquí están sus dos próximas jugadas.",
        "summary": "Un gestor de fondos de Man Group logró un rendimiento excepcional con nueve de sus diez apuestas superando el mercado el año pasado. La estrategia se enfocó en mineros de oro, acciones japonesas y jugadas nucleares."
      }
    }
  },
  {
    "title": "UK PM Keir Starmer suffers major blow after his party comes third in key vote",
    "slug": "uk-pm-keir-starmer-major-blow-party-third-key-vote",
    "url": "https://www.cnbc.com/2026/02/27/uk-election-gorton-denton-greens-labour-reform-starmer.html",
    "source": "CNBC",
    "date": "2026-02-27T11:45:21.000Z",
    "summary": "Prime Minister Keir Starmer faced a major setback as Labour came third in a key vote in a constituency the party has dominated for nearly a century. The result is an embarrassing loss for the government.",
    "content": "The result in a seat that Labour has dominated for nearly a century represents an embarrassing setback for the prime minister.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "英国首相基尔·斯塔默在其所在党派在关键投票中获得第三名后遭受重大打击",
        "summary": "首相基尔·斯塔默面临重大挫折，因为工党在该党近一个世纪来一直主导的选区的关键投票中获得第三名。这个结果对政府来说是一个令人尴尬的失败。"
      },
      "fr": {
        "title": "Le Premier ministre britannique Keir Starmer subit un coup majeur après que son parti arrive troisième à un vote clé",
        "summary": "Le Premier ministre Keir Starmer a fait face à un revers majeur alors que le Labour arrive troisième à un vote clé dans une circonscription que le parti domine depuis près d'un siècle. Le résultat est une perte embarrassante pour le gouvernement."
      },
      "de": {
        "title": "Der britische Premierminister Keir Starmer erleidet einen großen Rückschlag, nachdem seine Partei bei einer Schlüsselabstimmung den dritten Platz belegt",
        "summary": "Premierminister Keir Starmer erlitt einen großen Rückschlag, als Labour bei einer Schlüsselabstimmung in einem Wahlkreis, den die Partei seit fast einem Jahrhundert dominiert, den dritten Platz belegte. Das Ergebnis ist eine peinliche Niederlage für die Regierung."
      },
      "es": {
        "title": "El Primer Ministro británico Keir Starmer sufre un golpe importante después de que su partido queda tercero en una votación clave",
        "summary": "El Primer Ministro Keir Starmer enfrentó un retroceso importante cuando el Laborismo llegó al tercer lugar en una votación clave en una circunscripción que el partido ha dominado durante casi un siglo. El resultado es una derrota vergonzosa para el gobierno."
      }
    }
  },
  {
    "title": "Big Tech and banking stocks helped Norway's $2 trillion wealth fund book a $250 billion profit in 2025",
    "slug": "big-tech-banking-stocks-norways-2-trillion-wealth-fund-250-billion-profit",
    "url": "https://www.cnbc.com/2026/02/27/norway-sovereign-wealth-fund.html",
    "source": "CNBC",
    "date": "2026-02-27T11:45:08.000Z",
    "summary": "Norway's sovereign wealth fund, managed by Norges Bank Investment Management, achieved a $250 billion profit in 2025. The world's largest sovereign wealth fund benefited from strong performance in Big Tech and banking stocks.",
    "content": "Norges Bank Investment Management manages the world's largest sovereign wealth fund.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "大型科技和银行股帮助挪威2万亿美元主权财富基金在2025年实现2500亿美元利润",
        "summary": "由挪威银行投资管理公司(Norges Bank Investment Management)管理的挪威主权财富基金在2025年实现了2500亿美元的利润。全球最大的主权财富基金从大型科技和银行股的强劲表现中受益。"
      },
      "fr": {
        "title": "Les grandes entreprises technologiques et les actions bancaires ont aidé le fonds souverain de 2 000 milliards de dollars de la Norvège à enregistrer un bénéfice de 250 milliards de dollars en 2025",
        "summary": "Le fonds souverain de la Norvège, géré par Norges Bank Investment Management, a réalisé un bénéfice de 250 milliards de dollars en 2025. Le plus grand fonds souverain du monde a bénéficié de la forte performance des grandes entreprises technologiques et des actions bancaires."
      },
      "de": {
        "title": "Große Technologie- und Bankaktien halfen dem 2-Billionen-Dollar-Staatsfonds von Norwegen 2025 einen Gewinn von 250 Milliarden Dollar zu verbuchen",
        "summary": "Der norwegische Staatsfonds, der von Norges Bank Investment Management verwaltet wird, erzielte 2025 einen Gewinn von 250 Milliarden Dollar. Der weltgrößte Staatsfonds profitierte von der starken Wertentwicklung großer Technologie- und Bankaktien."
      },
      "es": {
        "title": "Las grandes empresas tecnológicas y acciones bancarias ayudaron al fondo de riqueza soberano de 2 billones de dólares de Noruega a obtener una ganancia de 250 mil millones de dólares en 2025",
        "summary": "El fondo de riqueza soberana de Noruega, administrado por Norges Bank Investment Management, logró una ganancia de 250 mil millones de dólares en 2025. El mayor fondo de riqueza soberana del mundo se benefició del fuerte desempeño de las grandes empresas tecnológicas y acciones bancarias."
      }
    }
  },
  {
    "title": "Smartphone market poised for 'sharpest decline on record' in 2026",
    "slug": "smartphone-market-sharpest-decline-record-2026",
    "url": "https://www.cnbc.com/2026/02/27/smartphone-market-poised-for-sharpest-decline-on-record-in-2026-according-to-reports-memory-chip-data-center-ai-samsung-apple-google-meta.html",
    "source": "CNBC",
    "date": "2026-02-27T11:43:50.000Z",
    "summary": "Reports predict the smartphone market will experience its sharpest decline on record in 2026. The downturn is driven by dwindling memory supplies that continue to push up consumer electronics prices.",
    "content": "Two recent reports predict further declines in the smartphone market in 2026, as dwindling memory supplies continue to drive up prices of consumer electronics.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "智能手机市场2026年面临\"有记录以来最严重的衰退\"",
        "summary": "报告预测智能手机市场在2026年将经历有记录以来最严重的衰退。这种下滑由持续减少的存储芯片供应推动，继续推高消费电子产品的价格。"
      },
      "fr": {
        "title": "Le marché des smartphones confronté au \"déclin le plus important jamais enregistré\" en 2026",
        "summary": "Les rapports prédisent que le marché des smartphones connaîtra son déclin le plus important jamais enregistré en 2026. La baisse est due à l'épuisement des stocks de mémoire qui continue de faire monter les prix de l'électronique grand public."
      },
      "de": {
        "title": "Smartphone-Markt steht 2026 vor \"beispiellosem Rückgang\"",
        "summary": "Berichte sagen einen beispiellosen Rückgang des Smartphone-Marktes im Jahr 2026 voraus. Der Rückgang wird durch schwindende Speicherbestände angetrieben, die die Preise für Unterhaltungselektronik weiter in die Höhe treiben."
      },
      "es": {
        "title": "El mercado de teléfonos inteligentes enfrentará la \"caída más pronunciada jamás registrada\" en 2026",
        "summary": "Los informes predicen que el mercado de teléfonos inteligentes experimentará su caída más pronunciada jamás registrada en 2026. La caída es impulsada por el agotamiento de suministros de memoria que continúa empujando los precios de la electrónica de consumo hacia arriba."
      }
    }
  },
  {
    "title": "How did Paramount beat Netflix to Warner Bros?",
    "slug": "how-did-paramount-beat-netflix-to-warner-bros",
    "url": "https://www.bbc.com/news/articles/cm21z4zgkx7o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-27T11:38:36.000Z",
    "summary": "Paramount and Netflix are engaged in a major battle to gain control of Warner Bros Discovery. The acquisition represents a significant competitive struggle in the entertainment industry.",
    "content": "What to know about the two firms' blockbuster battle to control Warner Bros Discovery.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Paramount如何战胜Netflix争夺华纳兄弟公司？",
        "summary": "Paramount和Netflix正在进行一场重大竞争，争夺对华纳兄弟探索公司的控制权。这项收购代表娱乐行业的一场重要竞争斗争。"
      },
      "fr": {
        "title": "Comment Paramount a-t-il devancé Netflix pour Warner Bros ?",
        "summary": "Paramount et Netflix sont engagés dans une bataille majeure pour gagner le contrôle de Warner Bros Discovery. L'acquisition représente une lutte concurrentielle importante dans l'industrie du divertissement."
      },
      "de": {
        "title": "Wie schlug Paramount Netflix bei Warner Bros?",
        "summary": "Paramount und Netflix befinden sich in einem großen Kampf um die Kontrolle über Warner Bros Discovery. Die Übernahme stellt einen erheblichen Wettbewerbskampf in der Unterhaltungsindustrie dar."
      },
      "es": {
        "title": "¿Cómo Paramount le ganó a Netflix para Warner Bros?",
        "summary": "Paramount y Netflix están en una batalla importante por tomar el control de Warner Bros Discovery. La adquisición representa una importante lucha competitiva en la industria del entretenimiento."
      }
    }
  },
  {
    "title": "Opinion: Block's layoffs might just be the biggest story of a tumultuous week. Here's why",
    "slug": "blocks-layoffs-biggest-story-tumultuous-week",
    "url": "https://www.cnbc.com/2026/02/27/block-layoffs-ai-jack-dorsey-jobs.html",
    "source": "CNBC",
    "date": "2026-02-27T11:37:45.000Z",
    "summary": "Jack Dorsey's payments company Block is laying off 6,000 of its 10,000 workers while shifting toward AI adoption. According to CNBC's Steve Sedgwick, this represents the biggest story of a turbulent week.",
    "content": "Block, Jack Dorsey's payments company, will cut 6,000 of its 10,000 workers as it embraces AI. CNBC's Steve Sedgwick says it's the biggest story of the week.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "观点：Block的裁员可能是动荡一周中最大的故事。以下是原因",
        "summary": "Jack Dorsey的支付公司Block在10000名员工中裁掉了6000人，同时转向AI采用。根据CNBC的Steve Sedgwick的说法，这代表了一个动荡周期中最大的故事。"
      },
      "fr": {
        "title": "Opinion : Les licenciements chez Block pourraient être la plus grande histoire d'une semaine tumultueuse. Voici pourquoi",
        "summary": "La société de paiement de Jack Dorsey, Block, licencie 6 000 de ses 10 000 travailleurs tout en se tournant vers l'adoption de l'IA. Selon Steve Sedgwick de CNBC, cela représente la plus grande histoire d'une semaine turbulente."
      },
      "de": {
        "title": "Meinung: Block's Entlassungen könnten die größte Geschichte einer turbulenten Woche sein",
        "summary": "Jack Dorseys Zahlungsunternehmen Block entlässt 6.000 seiner 10.000 Mitarbeiter und wendet sich der KI-Adoption zu. Nach Angaben von Steve Sedgwick von CNBC stellt dies die größte Geschichte einer turbulenten Woche dar."
      },
      "es": {
        "title": "Opinión: Los despidos de Block podrían ser la historia más importante de una semana tumultuosa",
        "summary": "La compañía de pagos de Jack Dorsey, Block, está despidiendo a 6.000 de sus 10.000 trabajadores mientras se enfoca hacia la adopción de IA. Según Steve Sedgwick de CNBC, esto representa la historia más importante de una semana turbulenta."
      }
    }
  },
  {
    "title": "Russia and Ukraine agree local truce to allow repairs at Europe’s largest nuclear power plant",
    "slug": "russia-ukraine-truce-zaporizhzhia-nuclear-power-plant",
    "url": "https://www.cnbc.com/2026/02/27/russia-ukraine-war-local-ceasefire-zaporizhzhia-nuclear-power-plant.html",
    "source": "CNBC",
    "date": "2026-02-27T11:34:05.000Z",
    "summary": "Russia and Ukraine have agreed to a local ceasefire to allow repairs at Europe's largest nuclear power plant, the Zaporizhzhia facility. Russia has controlled the plant since early 2022 during its full-scale invasion of Ukraine.",
    "content": "Russian forces have controlled the Zaporizhzhia nuclear power plant since early 2022, shortly after Moscow launched its full-scale invasion of Ukraine.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "俄罗斯和乌克兰同意在欧洲最大核电站实施局部停火以进行修复",
        "summary": "俄罗斯和乌克兰已同意在欧洲最大核电站扎波罗热核电站进行局部停火，以允许进行修复。自2022年初全面入侵乌克兰以来，俄罗斯一直控制着该核电站。"
      },
      "fr": {
        "title": "La Russie et l'Ukraine conviennent d'une trêve locale pour permettre les réparations à la plus grande centrale nucléaire d'Europe",
        "summary": "La Russie et l'Ukraine ont convenu d'une cessation des hostilités locale pour permettre les réparations à la plus grande centrale nucléaire d'Europe, l'installation de Zaporizhzhia. La Russie contrôle l'usine depuis le début de 2022 lors de son invasion à grande échelle de l'Ukraine."
      },
      "de": {
        "title": "Russland und Ukraine einigen sich auf lokalen Waffenstillstand zur Ermöglichung von Reparaturen am größten Kernkraftwerk Europas",
        "summary": "Russland und die Ukraine haben sich auf einen lokalen Waffenstillstand geeinigt, um Reparaturen am größten Kernkraftwerk Europas, der Anlage Zaporizhzhia, zu ermöglichen. Russland kontrolliert die Anlage seit Anfang 2022 während seiner umfassenden Invasion der Ukraine."
      },
      "es": {
        "title": "Rusia y Ucrania acuerdan tregua local para permitir reparaciones en la central nuclear más grande de Europa",
        "summary": "Rusia y Ucrania han acordado un alto el fuego local para permitir reparaciones en la central nuclear más grande de Europa, la instalación de Zaporizhzhia. Rusia ha controlado la planta desde principios de 2022 durante su invasión a gran escala de Ucrania."
      }
    }
  },
  {
    "title": "Waitrose to suspend mackerel sales due to overfishing concerns",
    "slug": "waitrose-suspend-mackerel-sales-overfishing-concerns",
    "url": "https://www.bbc.com/news/articles/cgl5gee07xzo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-27T11:24:43.000Z",
    "summary": "UK supermarket Waitrose will suspend sales of fresh, chilled, and frozen mackerel by April 29 due to overfishing concerns. The move reflects growing awareness of sustainable seafood sourcing.",
    "content": "The supermarket chain says it will stop sourcing fresh, chilled and frozen mackerel by 29 April.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Waitrose因过度捕捞担忧暂停鲭鱼销售",
        "summary": "英国超市Waitrose将在4月29日前暂停新鲜、冷藏和冷冻鲭鱼的销售，原因是对过度捕捞的担忧。此举反映了人们对可持续海产品采购意识的增加。"
      },
      "fr": {
        "title": "Waitrose suspend la vente de maquereau en raison des craintes de surpêche",
        "summary": "La chaîne de supermarchés britannique Waitrose suspendra la vente de maquereau frais, réfrigéré et congelé avant le 29 avril en raison des craintes de surpêche. Cette mesure reflète une prise de conscience croissante de l'approvisionnement durable en produits de la mer."
      },
      "de": {
        "title": "Waitrose setzt Makrelenverkäufe aufgrund von Überfischungsbedenken aus",
        "summary": "Der britische Supermarkt Waitrose wird den Verkauf von frischen, gekühlten und gefrorenen Makrelen bis zum 29. April einstellen, da Bedenken bezüglich der Überfischung bestehen. Der Schritt spiegelt wachsendes Bewusstsein für nachhaltige Fischereibeschaffung wider."
      },
      "es": {
        "title": "Waitrose suspende las ventas de caballa debido a preocupaciones por la sobrepesca",
        "summary": "El supermercado británico Waitrose suspenderá la venta de caballa fresca, refrigerada y congelada antes del 29 de abril debido a preocupaciones por la sobrepesca. El movimiento refleja una creciente conciencia sobre el abastecimiento sostenible de productos del mar."
      }
    }
  },
  {
    "title": "India's economy grows at faster-than-expected pace of 7.8% in December quarter",
    "slug": "indias-economy-grows-faster-than-expected-7-8-percent-december-quarter",
    "url": "https://www.cnbc.com/2026/02/27/india-gdp-december-quarter-economy.html",
    "source": "CNBC",
    "date": "2026-02-27T11:18:04.000Z",
    "summary": "India's economy expanded 7.8% in the December quarter, faster than expected, maintaining its position as the world's fastest-growing major economy. The strong growth demonstrates economic resilience.",
    "content": "The world's fastest-growing major economy expanded by 7.8% in the December quarter.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "印度经济在12月季度以7.8%的超预期速度增长",
        "summary": "印度经济在12月季度增长了7.8%，超过预期，维持了其作为全球增长最快的主要经济体的地位。强劲的增长表明了经济韧性。"
      },
      "fr": {
        "title": "L'économie de l'Inde croît à un rythme plus rapide que prévu de 7,8% au trimestre de décembre",
        "summary": "L'économie indienne s'est développée à un rythme de 7,8% au trimestre de décembre, plus rapide que prévu, maintenant sa position en tant que plus grande économie à la croissance la plus rapide du monde. La croissance robuste démontre la résilience économique."
      },
      "de": {
        "title": "Indiens Wirtschaft wächst im Dezemberquartal schneller als erwartet um 7,8%",
        "summary": "Indiens Wirtschaft wuchs im Dezemberquartal um 7,8%, schneller als erwartet, und behielt seine Position als am schnellsten wachsende Großwirtschaft der Welt. Das starke Wachstum demonstriert wirtschaftliche Widerstandsfähigkeit."
      },
      "es": {
        "title": "La economía de India crece a un ritmo más rápido de lo esperado del 7,8% en el trimestre de diciembre",
        "summary": "La economía de India se expandió 7.8% en el trimestre de diciembre, más rápido de lo esperado, manteniendo su posición como la economía más grande que crece más rápido en el mundo. El fuerte crecimiento demuestra la resiliencia económica."
      }
    }
  },
  {
    "title": "After 46 years working, I’m not retiring — instead, I take a vacation every month. Is that a good life in your 70s?",
    "slug": "after-46-years-working-not-retiring-vacation-every-month-70s",
    "url": "https://www.marketwatch.com/story/after-46-years-working-im-not-retiring-instead-i-take-a-vacation-every-month-is-that-a-good-life-in-your-70s-447f7c75?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T11:15:00.000Z",
    "summary": "A 70-year-old entrepreneur with an $8.5 million company chooses to remain working rather than retire, taking monthly vacations instead. The personal finance question explores alternative approaches to work-life balance in later years.",
    "content": "“I’ve owned my own company for the last 15 years. It’s worth $8.5 million.”",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "工作46年后，我不退休——而是每个月度假。这是你70多岁时的好生活吗？",
        "summary": "一位70岁的企业家拥有一家价值850万美元的公司，他选择继续工作而不退休，每月度假。这个个人理财问题探讨了晚年工作与生活平衡的替代方法。"
      },
      "fr": {
        "title": "Après 46 ans de travail, je ne prends pas ma retraite — au lieu de cela, je prends des vacances chaque mois. Est-ce une bonne vie à vos 70 ans ?",
        "summary": "Un entrepreneur de 70 ans avec une entreprise de 8,5 millions de dollars choisit de continuer à travailler plutôt que de prendre sa retraite, prenant plutôt des vacances mensuelles. La question de finances personnelles explore des approches alternatives à l'équilibre travail-vie dans les années ultérieures."
      },
      "de": {
        "title": "Nach 46 Jahren Arbeit gehe ich nicht in den Ruhestand — stattdessen mache ich jeden Monat Urlaub. Ist das ein gutes Leben in deinen 70ern?",
        "summary": "Ein 70 Jahre alter Unternehmer mit einem Unternehmen im Wert von 8,5 Millionen Dollar entscheidet sich, weiterzuarbeiten, anstatt in den Ruhestand zu gehen, und macht stattdessen monatliche Urlaube. Die persönliche Finanzfrage untersucht alternative Ansätze zur Work-Life-Balance in späteren Jahren."
      },
      "es": {
        "title": "Después de 46 años trabajando, no me jubilo — en cambio, tomo vacaciones cada mes. ¿Es esa una buena vida en tus 70?",
        "summary": "Un empresario de 70 años con una empresa de 8,5 millones de dólares elige seguir trabajando en lugar de jubilarse, tomando vacaciones mensuales. La pregunta de finanzas personales explora enfoques alternativos al equilibrio entre el trabajo y la vida en años posteriores."
      }
    }
  },
  {
    "title": "Pakistan bombs targets in Afghan cities, minister calls it 'open war'",
    "slug": "pakistan-bombs-afghan-cities-open-war",
    "url": "https://www.cnbc.com/2026/02/27/pakistan-bombs-targets-in-afghan-cities-minister-calls-it-open-war.html",
    "source": "CNBC",
    "date": "2026-02-27T10:57:30.000Z",
    "summary": "Pakistan conducted strikes on Afghan cities in a significant escalation, marking the first direct attacks on the Taliban rather than alleged militants. The minister characterized the action as an 'open war,' signaling a major rupture in relations between the Islamic neighbors.",
    "content": "The strikes are the first time Islamabad has attacked the Taliban rather than militants allegedly backed by them, a stark rupture in ties between the Islamic neighbours.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "巴基斯坦轰炸阿富汗城市，部长称其为\"公开战争\"",
        "summary": "巴基斯坦对阿富汗城市进行了打击，这是一次重大升级，标志着对塔利班而非所谓武装分子的首次直接攻击。部长将这一行为描述为\"公开战争\"，表明伊斯兰邻国之间关系出现重大破裂。"
      },
      "fr": {
        "title": "Le Pakistan bombarde les cibles dans les villes afghanes, le ministre l'appelle « guerre ouverte »",
        "summary": "Le Pakistan a mené des frappes sur les villes afghanes dans une escalade importante, marquant les premières attaques directes contre les Talibans plutôt que contre des militants présumés. Le ministre a qualifié l'action de « guerre ouverte », signalant une rupture majeure des relations entre les voisins islamiques."
      },
      "de": {
        "title": "Pakistan bombardiert Ziele in afghanischen Städten, Minister nennt es „offenen Krieg\"",
        "summary": "Pakistan führte Anschläge auf afghanische Städte in einer bedeutenden Eskalation durch, was die ersten direkten Anschläge gegen die Taliban statt gegen angebliche Militante markiert. Der Minister charakterisierte die Aktion als „offenen Krieg\" und signalisierte eine große Bruchstelle in den Beziehungen zwischen den islamischen Nachbarn."
      },
      "es": {
        "title": "Pakistán bombardea objetivos en ciudades afganas, ministro lo llama 'guerra abierta'",
        "summary": "Pakistán realizó ataques a ciudades afganas en una escalada significativa, marcando los primeros ataques directos contra los Talibanes en lugar de presuntos militantes. El ministro caracterizó la acción como una 'guerra abierta', señalando una ruptura importante en las relaciones entre los vecinos islámicos."
      }
    }
  },
  {
    "title": "‘My sister and I are his only family’: My brother is paranoid and forgot he sold his house. What can I do?",
    "slug": "my-sister-and-i-are-his-only-family-brother-paranoid-forgot-sold-house",
    "url": "https://www.marketwatch.com/story/my-sister-and-i-are-his-only-family-my-brother-is-paranoid-and-forgot-he-sold-his-house-what-can-i-do-006a8d3a?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T10:15:00.000Z",
    "summary": "A person seeks advice on managing their brother's mental health issues and memory loss, including difficulty remembering a house sale. The situation raises questions about guardianship and family support for cognitive challenges.",
    "content": "In an email, his lawyer said, “He’s gone over the deep end.”",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "\"我和我的妹妹是他唯一的家人\"：我的哥哥偏执且忘记了他卖掉了房子。我能做什么？",
        "summary": "一个人寻求建议来管理他们兄弟的心理健康问题和记忆丧失，包括忘记房屋销售。这种情况引发了关于监护权和家庭对认知挑战的支持的问题。"
      },
      "fr": {
        "title": "« Ma sœur et moi sommes sa seule famille » : Mon frère est paranoïaque et a oublié qu'il avait vendu sa maison. Que puis-je faire ?",
        "summary": "Une personne cherche des conseils pour gérer les problèmes de santé mentale et la perte de mémoire de son frère, y compris l'oubli d'une vente de maison. La situation soulève des questions sur la tutelle et le soutien familial pour les défis cognitifs."
      },
      "de": {
        "title": "„Meine Schwester und ich sind seine einzige Familie\": Mein Bruder ist paranoid und hat vergessen, dass er sein Haus verkauft hat. Was kann ich tun?",
        "summary": "Eine Person sucht Rat zur Bewältigung von psychischen Gesundheitsproblemen und Gedächtnisverlust ihres Bruders, einschließlich des Vergessenens eines Hausverkaufs. Die Situation stellt Fragen zur Vormundschaft und familiärer Unterstützung für kognitive Herausforderungen."
      },
      "es": {
        "title": "\"Mi hermana y yo somos su única familia\": Mi hermano es paranoico y olvidó que vendió su casa. ¿Qué puedo hacer?",
        "summary": "Una persona busca consejo sobre cómo manejar los problemas de salud mental y pérdida de memoria de su hermano, incluida la dificultad para recordar una venta de casa. La situación plantea preguntas sobre tutela y apoyo familiar para desafíos cognitivos."
      }
    }
  },
  {
    "title": "Dyson settles forced labour suit in landmark UK case",
    "slug": "dyson-forced-labour-settlement",
    "url": "https://www.bbc.com/news/articles/cddnry8dnl7o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-27T09:44:40.000Z",
    "summary": "Dyson has settled a landmark forced labor lawsuit with migrant workers in the United Kingdom who alleged abusive treatment in the company's Malaysian factory. The settlement represents a significant liability resolution for the manufacturer.",
    "content": "Migrant workers alleged they were subjected to abusive treatment in a Malaysian factory for Dyson.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "戴森在英国标志性案件中和解强制劳动诉讼",
        "summary": "戴森与英国移民工人达成和解，这些工人曾指控该公司在马来西亚工厂中的虐待行为。该和解代表了该制造商的重大责任解决方案。"
      },
      "fr": {
        "title": "Dyson règle un procès historique sur le travail forcé au Royaume-Uni",
        "summary": "Dyson a réglé un procès historique sur le travail forcé avec des travailleurs migrants au Royaume-Uni qui ont allégué un traitement abusif dans l'usine malaisienne de l'entreprise. Le règlement représente une résolution importante de la responsabilité pour le fabricant."
      },
      "de": {
        "title": "Dyson beilegt Zwangsarbeitsklage in wegweisendem britischem Fall",
        "summary": "Dyson hat eine wegweisende Zwangsarbeitsklage mit Wanderarbeitern im Vereinigten Königreich beigelegt, die Misshandlung in der malaysischen Fabrik des Unternehmens geltend gemacht haben. Der Vergleich stellt eine bedeutende Haftungsauflösung für den Hersteller dar."
      },
      "es": {
        "title": "Dyson resuelve demanda histórica de trabajo forzado en Reino Unido",
        "summary": "Dyson ha resuelto una demanda histórica de trabajo forzado con trabajadores migrantes en el Reino Unido que alegaron trato abusivo en la fábrica malaya de la empresa. El acuerdo representa una resolución importante de responsabilidad para el fabricante."
      }
    }
  },
  {
    "title": "Private equity enters its 'Darwinian' era as experts warn some funds face extinction",
    "slug": "private-equity-enters-its-darwinian-era-as-experts-warn-some-funds-face-extincti",
    "url": "https://www.cnbc.com/2026/02/27/private-equity-funds-face-closure-and-extinction-in-darwinian-era.html",
    "source": "CNBC",
    "date": "2026-02-27T06:19:33.000Z",
    "summary": "Lower exits, longer holding periods, smaller returns, and tougher fundraising conditions are reshaping the industry, where only the strongest managers will survive.",
    "content": "Lower exits, longer holding periods, smaller returns, and tougher fundraising conditions are reshaping the industry, where only the strongest managers will survive.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "私募股权进入'达尔文式'时代，专家警告某些基金面临灭绝",
        "summary": "更低的退出率、更长的持有期、更小的回报和更严峻的融资条件正在重塑该行业，只有最强大的管理者才能生存。"
      },
      "fr": {
        "title": "Le capital-investissement entre dans son ère 'darwinienne' alors que les experts avertissent que certains fonds risquent l'extinction",
        "summary": "Les sorties plus faibles, les périodes de détention plus longues, les rendements plus faibles et les conditions de levée de fonds plus difficiles remodelent l'industrie, où seuls les gestionnaires les plus forts survivront."
      },
      "de": {
        "title": "Private Equity betritt sein 'darwinsches' Zeitalter, da Experten warnen, dass einige Fonds aussterben könnten",
        "summary": "Niedrigere Ausstiegsmöglichkeiten, längere Haltedauern, geringere Renditen und schwierigere Finanzierungsbedingungen gestalten die Branche neu, in der nur die stärksten Manager überleben werden."
      },
      "es": {
        "title": "El capital privado entra en su era 'darwiniana' mientras expertos advierten que algunos fondos enfrentan extinción",
        "summary": "Las salidas más bajas, períodos de tenencia más largos, rendimientos más pequeños y condiciones de recaudación de fondos más difíciles están remodelando la industria, donde solo sobrevivirán los gestores más fuertes."
      }
    }
  },
  {
    "title": "An Indian company is set to build a $2 billion AI hub with Nvidia’s GPUs and go public. Here's what we know so far",
    "slug": "an-indian-company-is-set-to-build-a-2-billion-ai-hub-with-nvidia-s-gpus-and-go-p",
    "url": "https://www.cnbc.com/2026/02/27/india-yotta-nvidia-ai-gpu-demand-data-centers-investment.html",
    "source": "CNBC",
    "date": "2026-02-27T05:54:53.000Z",
    "summary": "Yotta Data Services, which controls up to 70% of India’s GPU capacity, said surging demand from local AI startups and global tech firms is tightening supply.",
    "content": "Yotta Data Services, which controls up to 70% of India’s GPU capacity, said surging demand from local AI startups and global tech firms is tightening supply.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "一家印度公司计划建立价值20亿美元的AI中心，使用英伟达的GPU并上市",
        "summary": "控制印度高达70%GPU容量的Yotta Data Services表示，来自本地AI初创企业和全球科技公司的激增需求正在收紧供应。"
      },
      "fr": {
        "title": "Une société indienne s'apprête à construire un hub IA de 2 milliards de dollars avec les GPU d'Nvidia et à devenir publique",
        "summary": "Yotta Data Services, qui contrôle jusqu'à 70% de la capacité GPU en Inde, a déclaré que la demande croissante des startups IA locales et des entreprises technologiques mondiales resserre l'approvisionnement."
      },
      "de": {
        "title": "Ein indisches Unternehmen plant den Bau eines 2-Milliarden-Dollar-KI-Hubs mit Nvidias GPUs und geht an die Börse",
        "summary": "Yotta Data Services, das bis zu 70% der GPU-Kapazität Indiens kontrolliert, sagte, dass die steigende Nachfrage von lokalen KI-Startups und globalen Tech-Unternehmen das Angebot verknnappt."
      },
      "es": {
        "title": "Una empresa india se prepara para construir un centro de IA de $2 mil millones con las GPU de Nvidia e ir al mercado público",
        "summary": "Yotta Data Services, que controla hasta el 70% de la capacidad de GPU de India, dijo que la creciente demanda de startups de IA locales y empresas tecnológicas globales está apretando el suministro."
      }
    }
  },
  {
    "title": "Data tool to spot families due financial support",
    "slug": "data-tool-to-spot-families-due-financial-support",
    "url": "https://www.bbc.com/news/articles/cvg3j27zwz7o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-27T05:49:18.000Z",
    "summary": "Households entitled to national benefits will be identified by the new system.",
    "content": "Households entitled to national benefits will be identified by the new system.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "发现符合条件家庭的数据工具获得财务支持",
        "summary": "新系统将识别有权获得国家福利的家庭。"
      },
      "fr": {
        "title": "Outil de données pour identifier les familles ayant droit à une aide financière",
        "summary": "Le nouveau système identifiera les ménages ayant droit aux allocations nationales."
      },
      "de": {
        "title": "Datentool zur Identifikation von Familien, die finanzielle Unterstützung erhalten",
        "summary": "Das neue System wird Haushalte identifizieren, die Anspruch auf nationale Leistungen haben."
      },
      "es": {
        "title": "Herramienta de datos para identificar familias que deben recibir apoyo financiero",
        "summary": "El nuevo sistema identificará a los hogares con derecho a beneficios nacionales."
      }
    }
  },
  {
    "title": "Community larder helps 117 people in one day",
    "slug": "community-larder-helps-117-people-in-one-day",
    "url": "https://www.bbc.com/news/articles/cy7jplgk0pxo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-27T05:29:54.000Z",
    "summary": "Jo Haywood says the volunteer-led group is seeing \"record numbers\" of people needing cheaper food.",
    "content": "Jo Haywood says the volunteer-led group is seeing \"record numbers\" of people needing cheaper food.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "社区食物储备库一天帮助117人",
        "summary": "乔·海伍德表示，由志愿者领导的小组正在看到\"创纪录数量\"的人需要便宜食物。"
      },
      "fr": {
        "title": "Le garde-manger communautaire aide 117 personnes en un jour",
        "summary": "Jo Haywood affirme que le groupe dirigé par des bénévoles connaît un nombre \"record\" de personnes ayant besoin d'une nourriture moins chère."
      },
      "de": {
        "title": "Gemeindekammer hilft an einem Tag 117 Menschen",
        "summary": "Jo Haywood sagt, dass die von Freiwilligen geleitete Gruppe eine \"Rekordzahl\" von Menschen sieht, die billigere Lebensmittel benötigen."
      },
      "es": {
        "title": "La despensa comunitaria ayuda a 117 personas en un día",
        "summary": "Jo Haywood dice que el grupo dirigido por voluntarios está viendo un número \"récord\" de personas que necesitan alimentos más baratos."
      }
    }
  },
  {
    "title": "Nintendo plans around $1.9 billion share sale by Kyoto bank and others, sources say: Reuters",
    "slug": "nintendo-plans-around-1-9-billion-share-sale-by-kyoto-bank-and-others-sources-sa",
    "url": "https://www.cnbc.com/2026/02/27/nintendo-plans-around-1point9-billion-share-sale-by-kyoto-bank-and-others-sources-say-reuters.html",
    "source": "CNBC",
    "date": "2026-02-27T05:25:04.000Z",
    "summary": "The sale is expected to total roughly 300 billion yen ($1.9 billion) and Nintendo could make a decision as soon as Friday, two of the sources said.",
    "content": "The sale is expected to total roughly 300 billion yen ($1.9 billion) and Nintendo could make a decision as soon as Friday, two of the sources said.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "任天堂计划进行约19亿美元的股份出售，由京都银行等领导",
        "summary": "此次出售预计总额约为3000亿日元（19亿美元），任天堂最早可能在周五做出决定，两位消息人士表示。"
      },
      "fr": {
        "title": "Nintendo prévoit une vente d'actions d'environ 1,9 milliard de dollars par la Banque de Kyoto et d'autres",
        "summary": "La vente devrait totaliser environ 300 milliards de yens (1,9 milliard de dollars) et Nintendo pourrait prendre une décision dès vendredi, ont déclaré deux des sources."
      },
      "de": {
        "title": "Nintendo plant Aktienverkauf in Höhe von etwa 1,9 Milliarden Dollar durch die Kyoto Bank und andere",
        "summary": "Der Verkauf soll insgesamt etwa 300 Milliarden Yen (1,9 Milliarden Dollar) betragen, und Nintendo könnte bereits Freitag eine Entscheidung treffen, sagten zwei der Quellen."
      },
      "es": {
        "title": "Nintendo planea una venta de acciones de alrededor de $1.9 mil millones por parte del Banco de Kyoto y otros",
        "summary": "Se espera que la venta totalice aproximadamente 300 mil millones de yenes ($1.9 mil millones) y Nintendo podría tomar una decisión el viernes, dijeron dos de las fuentes."
      }
    }
  },
  {
    "title": "Block plans to lay off nearly half its staff in ‘deliberate and bold’ embrace of AI",
    "slug": "block-plans-to-lay-off-nearly-half-its-staff-in-deliberate-and-bold-embrace-of-a",
    "url": "https://www.marketwatch.com/story/block-plans-to-lay-off-nearly-half-its-staff-in-deliberate-and-bold-embrace-of-ai-81e99247?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T04:07:00.000Z",
    "summary": "Block’s stock surges 20% as Wall Street rewards massive job cuts at the parent company of Square and the Cash App.",
    "content": "Block’s stock surges 20% as Wall Street rewards massive job cuts at the parent company of Square and the Cash App.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Block计划裁员近一半，\"刻意和大胆\"地拥抱AI",
        "summary": "Block股价上涨了20%，华尔街奖励了Square和Cash App母公司的大规模裁员。"
      },
      "fr": {
        "title": "Block prévoit de licencier près de la moitié de son personnel dans une \"adoption délibérée et audacieuse\" de l'IA",
        "summary": "Le cours de l'action de Block augmente de 20% alors que Wall Street récompense les réductions massives d'effectifs chez la société mère de Square et Cash App."
      },
      "de": {
        "title": "Block plant, fast die Hälfte seiner Mitarbeiter in einer \"bewussten und kühnen\" Annahme von KI zu entlassen",
        "summary": "Die Aktie von Block steigt um 20%, da die Wall Street massive Entlassungen bei der Muttergesellschaft von Square und der Cash App belohnt."
      },
      "es": {
        "title": "Block planea despedir a casi la mitad de su personal en una aceptación \"deliberada y audaz\" de IA",
        "summary": "Las acciones de Block suben un 20% mientras Wall Street recompensa los despidos masivos en la empresa matriz de Square y Cash App."
      }
    }
  },
  {
    "title": "Anthropic boss rejects Pentagon demand to drop AI safeguards",
    "slug": "anthropic-boss-rejects-pentagon-demand-to-drop-ai-safeguards",
    "url": "https://www.bbc.com/news/articles/cvg3vlzzkqeo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-27T03:54:27.000Z",
    "summary": "Defense Secretary Pete Hegseth previously threatened to remove the firm from the department's supply chain.",
    "content": "Defense Secretary Pete Hegseth previously threatened to remove the firm from the department's supply chain.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "Anthropic首席执行官拒绝五角大楼要求放弃AI安全防护",
        "summary": "防务部长彼得·赫格塞斯之前威胁将该公司从国防部供应链中移除。"
      },
      "fr": {
        "title": "Le patron d'Anthropic rejette la demande du Pentagone d'abandonner les garanties en matière d'IA",
        "summary": "Le secrétaire à la Défense Pete Hegseth a précédemment menacé de retirer l'entreprise de la chaîne d'approvisionnement du ministère."
      },
      "de": {
        "title": "Anthropic-Chef lehnt Forderung des Pentagon ab, KI-Schutzmaßnahmen aufzugeben",
        "summary": "Verteidigungsminister Pete Hegseth drohte zuvor, das Unternehmen aus der Lieferkette des Ministeriums zu entfernen."
      },
      "es": {
        "title": "El jefe de Anthropic rechaza la demanda del Pentágono de abandonar las garantías de seguridad de IA",
        "summary": "El Secretario de Defensa Pete Hegseth amenazó previamente con eliminar a la empresa de la cadena de suministro del departamento."
      }
    }
  },
  {
    "title": "U.S. and Iran wrap up 'most intense' nuclear talks with no deal — more negotiations ahead",
    "slug": "u-s-and-iran-wrap-up-most-intense-nuclear-talks-with-no-deal-more-negotiations-a",
    "url": "https://www.cnbc.com/2026/02/27/us-iran-nuclear-talks-oil-middle-east.html",
    "source": "CNBC",
    "date": "2026-02-27T03:24:44.000Z",
    "summary": "Iran's nuclear program, enrichment of uranium and its ballistic-missle development program have been at the crux of the negotiations.",
    "content": "Iran's nuclear program, enrichment of uranium and its ballistic-missle development program have been at the crux of the negotiations.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "美国和伊朗结束\"最激烈\"的核谈判，未达成协议——更多协商即将进行",
        "summary": "伊朗的核计划、铀浓缩和弹道导弹发展计划一直是谈判的核心问题。"
      },
      "fr": {
        "title": "Les États-Unis et l'Iran terminent les pourparlers nucléaires \"les plus intenses\" sans accord — d'autres négociations à venir",
        "summary": "Le programme nucléaire iranien, l'enrichissement de l'uranium et le programme de développement des missiles balistiques ont été au cœur des négociations."
      },
      "de": {
        "title": "USA und Iran beenden \"intensivste\" Atomgespräche ohne Einigung — weitere Verhandlungen stehen bevor",
        "summary": "Irans Atomprogramm, die Urananreicherung und sein Programm zur Entwicklung ballistischer Raketen waren das Kernstück der Verhandlungen."
      },
      "es": {
        "title": "EE.UU. e Irán cierran \"más intensas\" negociaciones nucleares sin acuerdo — más negociaciones por venir",
        "summary": "El programa nuclear iraní, el enriquecimiento de uranio y el programa de desarrollo de misiles balísticos han sido el núcleo de las negociaciones."
      }
    }
  },
  {
    "title": "FAA closes airspace in Fort Hancock, Texas after reported accidental use of anti-drone laser",
    "slug": "faa-closes-airspace-in-fort-hancock-texas-after-reported-accidental-use-of-anti-",
    "url": "https://www.cnbc.com/2026/02/27/faa-closes-fort-hancock-airspace-texas-reports-accidental-laser-use.html",
    "source": "CNBC",
    "date": "2026-02-27T03:07:15.000Z",
    "summary": "The Federal Aviation Administration (FAA) barred flights on Thursday after an anti-drone system was believed to accidentally shoot a U.S. government drone.",
    "content": "The Federal Aviation Administration (FAA) barred flights on Thursday after an anti-drone system was believed to accidentally shoot a U.S. government drone.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "FAA在得克萨斯州堡垒汉考克上空禁飞，原因是无人机激光系统被指意外使用",
        "summary": "美国联邦航空局(FAA)在周四禁止航班起飞，因为一个反无人机系统被认为意外射击了一架美国政府无人机。"
      },
      "fr": {
        "title": "La FAA ferme l'espace aérien à Fort Hancock, Texas après l'utilisation accidentelle présumée d'un laser anti-drone",
        "summary": "L'Administration fédérale de l'aviation (FAA) a interdit les vols jeudi après qu'un système anti-drone aurait accidentellement tiré sur un drone du gouvernement américain."
      },
      "de": {
        "title": "FAA schließt Luftraum in Fort Hancock, Texas nach berichteter versehentlicher Nutzung von Anti-Drohnen-Laser",
        "summary": "Die Bundesluftfahrtbehörde (FAA) sperrte am Donnerstag Flüge, nachdem ein Anti-Drohnen-System versehentlich eine US-Regierungsdrohne beschoss."
      },
      "es": {
        "title": "FAA cierra espacio aéreo en Fort Hancock, Texas después del uso accidental reportado de láser anti-drones",
        "summary": "La Administración Federal de Aviación (FAA) prohibió vuelos el jueves después de que un sistema anti-drones disparó accidentalmente a un dron del gobierno estadounidense."
      }
    }
  },
  {
    "title": "Yes, consumers in China are consuming again. It’s just not their No. 1 priority these days.",
    "slug": "yes-consumers-in-china-are-consuming-again-it-s-just-not-their-no-1-priority-the",
    "url": "https://www.marketwatch.com/story/yes-consumers-in-china-are-consuming-again-its-just-not-their-no-1-priority-these-days-598c2c02?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T02:00:00.000Z",
    "summary": "Retail sales are still rising, but record household savings, stepped-up gold buying and reined-in income expectations suggest the population of the world’s second largest economy is now prioritizing s",
    "content": "Retail sales are still rising, but record household savings, stepped-up gold buying and reined-in income expectations suggest the population of the world’s second largest economy is now prioritizing security over splurges — with consequences for global brands and investors.",
    "category": "economic"
  },
  {
    "title": "Rocket Lab’s stock slides as yet another rocket delay overshadows ‘record year’",
    "slug": "rocket-lab-s-stock-slides-as-yet-another-rocket-delay-overshadows-record-year",
    "url": "https://www.marketwatch.com/story/rocket-labs-stock-slides-as-yet-another-rocket-delay-overshadows-record-year-5b9987ea?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T01:31:00.000Z",
    "summary": "The Neutron rocket was expected to have its debut last year. Now, it’s projected to launch at the end of 2026.",
    "content": "The Neutron rocket was expected to have its debut last year. Now, it’s projected to launch at the end of 2026.",
    "category": "economic"
  },
  {
    "title": "Dell’s stock soars, as record earnings signal the company is managing memory shortages well",
    "slug": "dell-s-stock-soars-as-record-earnings-signal-the-company-is-managing-memory-shor",
    "url": "https://www.marketwatch.com/story/dells-stock-soars-as-record-earnings-signal-the-company-is-managing-memory-shortages-well-41620e00?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T01:31:00.000Z",
    "summary": "The maker of servers and PCs is also boosting its dividend by 20%.",
    "content": "The maker of servers and PCs is also boosting its dividend by 20%.",
    "category": "economic"
  },
  {
    "title": "Stocks making the biggest moves after hours: Block, Intuit, Dell Technologies, Zscaler & more",
    "slug": "stocks-making-the-biggest-moves-after-hours-block-intuit-dell-technologies-zscal",
    "url": "https://www.cnbc.com/2026/02/26/stocks-making-the-biggest-moves-after-hours-xyz-intu-dell.html",
    "source": "CNBC",
    "date": "2026-02-27T00:58:37.000Z",
    "summary": "These are the stocks posting the largest moves in extended trading.",
    "content": "These are the stocks posting the largest moves in extended trading.",
    "category": "economic"
  },
  {
    "title": "CoreWeave shares slip 8% as quarterly revenue guidance disappoints",
    "slug": "coreweave-shares-slip-quarterly-revenue",
    "url": "https://www.cnbc.com/2026/02/26/coreweave-crwv-q4-earnings-report-2025.html",
    "source": "CNBC",
    "date": "2026-02-27T00:32:39.000Z",
    "summary": "CoreWeave's shares fell 8% after the company's quarterly revenue forecast missed consensus estimates. The disappointing guidance signals investor concerns about the company's growth trajectory despite strong AI infrastructure demand.",
    "content": "The company's quarterly revenue forecast fell short of consensus.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "CoreWeave股价下跌8%，季度收入指引令人失望",
        "summary": "CoreWeave股价在公司的季度收入预测未达市场一致预期后下跌了8%。令人失望的指引表明投资者对公司增长轨迹感到担忧，尽管人工智能基础设施需求强劲。"
      },
      "fr": {
        "title": "Les actions de CoreWeave chutent de 8% alors que les prévisions de revenus trimestriels déçoivent",
        "summary": "Les actions de CoreWeave ont chuté de 8% après que les prévisions de revenus trimestriels de l'entreprise aient déçu les estimations de consensus. Les prévisions décevantes signalent les préoccupations des investisseurs concernant la trajectoire de croissance de l'entreprise malgré la forte demande en infrastructures d'IA."
      },
      "de": {
        "title": "CoreWeave-Aktien fallen um 8%, da die Quartalserlösprognose enttäuscht",
        "summary": "Die CoreWeave-Aktien fielen um 8%, nachdem die Prognose der Quartalseinnahmen des Unternehmens die Konsensprognosen verfehlt hat. Die enttäuschende Prognose signalisiert Anlegerbedenken bezüglich der Wachstumsbahn des Unternehmens trotz starker Nachfrage nach KI-Infrastruktur."
      },
      "es": {
        "title": "Las acciones de CoreWeave se deslizan un 8% cuando la orientación de ingresos trimestral decepciona",
        "summary": "Las acciones de CoreWeave cayeron un 8% después de que la previsión de ingresos trimestral de la empresa no cumpliera las estimaciones de consenso. Las prognosis decepcionantes indican la preocupación de los inversores sobre la trayectoria de crecimiento de la empresa a pesar de la fuerte demanda de infraestructura de IA."
      }
    }
  },
  {
    "title": "Stock futures slide after S&P 500 closes lower; wholesale inflation reading looms: Live updates",
    "slug": "stock-futures-slide-s-p-500-closes-lower",
    "url": "https://www.cnbc.com/2026/02/26/stock-market-today-live-updates.html",
    "source": "CNBC",
    "date": "2026-02-27T00:28:46.000Z",
    "summary": "The S&P 500 and Nasdaq Composite declined on Thursday, with Nvidia shares leading the selloff in major indices. A wholesale inflation reading is expected, which could influence market direction going forward.",
    "content": "The S&P 500 and the Nasdaq Composite slid on Thursday, dragged lower by Nvidia shares.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "标普500指数下跌后股指期货下滑；批发通胀数据即将公布：实时更新",
        "summary": "周四标普500指数和纳斯达克综合指数下跌，英伟达股票领跌主要指数。预期将公布批发通胀数据，这可能会影响今后的市场走向。"
      },
      "fr": {
        "title": "Les contrats à terme sur actions glissent après la clôture inférieure du S&P 500 ; une lecture de l'inflation de gros se profile",
        "summary": "L'indice S&P 500 et le Nasdaq Composite ont baissé jeudi, les actions Nvidia menant la vente massive dans les principaux indices. Un indicateur d'inflation de gros est attendu, ce qui pourrait influencer l'orientation du marché à l'avenir."
      },
      "de": {
        "title": "Aktienindex-Futures rutschen nach dem Rückgang des S&P 500; Großhandelsinflationslesung rückt näher",
        "summary": "Der S&P 500 und der Nasdaq Composite sanken am Donnerstag, wobei Nvidia-Aktien den Ausverkauf bei den wichtigsten Indizes anführten. Eine Großhandelsinflationslesung wird erwartet, die die zukünftige Marktrichtung beeinflussen könnte."
      },
      "es": {
        "title": "Los futuros bursátiles se deslizan después de que el S&P 500 cierre más bajo; se acerca la lectura de inflación mayorista",
        "summary": "El S&P 500 y el Nasdaq Composite cayeron el jueves, con las acciones de Nvidia liderando la venta masiva en los principales índices. Se espera una lectura de inflación mayorista, que podría influir en la dirección del mercado en el futuro."
      }
    }
  },
  {
    "title": "Columbia U. student Elmina Aghayeva released from ICE custody after Trump, NY mayor meeting",
    "slug": "columbia-student-elmina-aghayeva-released-ice",
    "url": "https://www.cnbc.com/2026/02/26/columbia-ice-dhs-immigration-detainment.html",
    "source": "CNBC",
    "date": "2026-02-27T00:23:49.000Z",
    "summary": "Columbia University student Elmina Aghayev was released from ICE custody following a meeting between Trump administration officials and New York's mayor. The case drew attention due to her status as an international student detained from university housing.",
    "content": "Elmina Aghayev was taken into custody by ICE agents from a student residential building owned by Columbia University.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "哥伦比亚大学学生埃尔米娜·阿加耶娃在特朗普与纽约市长会面后获得ICE释放",
        "summary": "在特朗普政府官员与纽约市长会面后，哥伦比亚大学学生埃尔米娜·阿加耶夫从ICE羁押中被释放。该案件因她作为国际学生从大学宿舍被拘留而引起关注。"
      },
      "fr": {
        "title": "L'étudiante de l'Université Columbia, Elmina Aghayeva, est libérée de la garde de l'ICE après la réunion entre Trump et le maire de New York",
        "summary": "L'étudiante de l'Université Columbia, Elmina Aghayev, a été libérée de la garde de l'ICE suite à une réunion entre les responsables de l'administration Trump et le maire de New York. L'affaire a attiré l'attention en raison de son statut d'étudiante internationale détenue du logement universitaire."
      },
      "de": {
        "title": "Studentin der Columbia University, Elmina Aghayeva, aus ICE-Verwahrung nach Treffen zwischen Trump und New Yorks Bürgermeister freigelassen",
        "summary": "Die Studentin der Columbia University, Elmina Aghayev, wurde aus der ICE-Verwahrung nach einem Treffen zwischen Beamten der Trump-Administration und dem Bürgermeister von New York entlassen. Der Fall zog Aufmerksamkeit auf sich aufgrund ihres Status als internationale Studentin, die aus Universitätswohnungen festgenommen wurde."
      },
      "es": {
        "title": "La estudiante de la Universidad de Columbia, Elmina Aghayeva, es liberada de la custodia del ICE después de la reunión entre Trump y el alcalde de Nueva York",
        "summary": "La estudiante de la Universidad de Columbia, Elmina Aghayev, fue liberada de la custodia del ICE tras una reunión entre funcionarios de la administración Trump y el alcalde de Nueva York. El caso atrajo atención debido a su estado como estudiante internacional detenida de la vivienda universitaria."
      }
    }
  },
  {
    "title": "Trump allies David and Larry Ellison win battle for Warner Bros. Discovery after Netflix bows out",
    "slug": "trump-allies-ellison-win-warner-bros-discovery",
    "url": "https://www.marketwatch.com/story/warner-bros-discovery-deems-paramounts-bid-superior-putting-netflix-in-the-hot-seat-a1fcea7c?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-02-27T00:14:00.000Z",
    "summary": "David and Larry Ellison have won the bid for Warner Bros. Discovery after Netflix withdrew from the bidding war. Netflix determined that counteracting Paramount's offer was no longer economically justified.",
    "content": "The streaming giant said countering Paramount’s bid was “no longer financially attractive.”",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "特朗普盟友埃利森兄弟赢得华纳兄弟探索公司争夺战，Netflix退出",
        "summary": "大卫·埃利森和拉里·埃利森在Netflix退出竞购后赢得了华纳兄弟探索公司的竞购。Netflix认为抵抗派拉蒙的报价不再在经济上合理。"
      },
      "fr": {
        "title": "Les alliés de Trump David et Larry Ellison remportent la bataille pour Warner Bros. Discovery après le retrait de Netflix",
        "summary": "David et Larry Ellison ont remporté l'enchère pour Warner Bros. Discovery après que Netflix s'est retiré de la guerre des enchères. Netflix a déterminé que contrecarrer l'offre de Paramount n'était plus économiquement justifié."
      },
      "de": {
        "title": "Trumps Verbündete David und Larry Ellison gewinnen Kampf um Warner Bros. Discovery, nachdem Netflix aussteigt",
        "summary": "David und Larry Ellison haben das Gebot für Warner Bros. Discovery gewonnen, nachdem Netflix sich aus dem Bieterkampf zurückgezogen hat. Netflix stellte fest, dass es wirtschaftlich nicht mehr gerechtfertigt war, Paramounts Angebot zu bekämpfen."
      },
      "es": {
        "title": "Los aliados de Trump David y Larry Ellison ganan la batalla por Warner Bros. Discovery después de que Netflix se retire",
        "summary": "David y Larry Ellison ganaron la puja por Warner Bros. Discovery después de que Netflix se retirara de la guerra de ofertas. Netflix determinó que contrarrestar la oferta de Paramount ya no estaba económicamente justificado."
      }
    }
  },
  {
    "title": "Asia markets opens mixed after Wall Street pullback on Nvidia slump",
    "slug": "asia-markets-mixed-wall-street-nvidia-slump",
    "url": "https://www.cnbc.com/2026/02/27/asia-markets-nikkei-225-kospi-nifty-50.html",
    "source": "CNBC",
    "date": "2026-02-27T00:13:20.000Z",
    "summary": "Asia-Pacific markets opened mixed on Friday following overnight U.S. stock declines as Nvidia shares tumbled despite beating quarterly earnings expectations. The tech-heavy selloff reflected broader market caution despite positive earnings results.",
    "content": "Asia-Pacific markets opened mixed on Friday, after U.S. stocks declined overnight as Nvidia shares tumbled despite a quarterly earnings beat.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "美国股市回调、英伟达股价下跌后，亚洲市场周五开盘涨跌混合",
        "summary": "周五亚太市场在美国股市隔夜下跌后开盘涨跌混合，尽管英伟达的季度收益超过预期，但其股价大幅下跌。尽管收益结果为正，科技股的大幅抛售反映了市场更广泛的谨慎态度。"
      },
      "fr": {
        "title": "Les marchés asiatiques ouvrent mitigés après le recul de Wall Street en raison de la baisse d'Nvidia",
        "summary": "Les marchés d'Asie-Pacifique ont ouvert mitigés vendredi suite aux baisses des actions américaines du jour au lendemain, car les actions Nvidia ont chuté malgré le dépassement des attentes concernant les bénéfices trimestriels. La forte liquidation du secteur technologique reflétait une prudence plus large du marché malgré des résultats de bénéfices positifs."
      },
      "de": {
        "title": "Asiatische Märkte öffnen gemischt nach Wall-Street-Rückgang bei Nvidia-Einbruch",
        "summary": "Die Märkte in Asien-Pazifik öffneten am Freitag gemischt nach den Rückgängen an der Wall Street über Nacht, da die Nvidia-Aktien trotz besserer als erwarteter Quartalsgewinne einbrachen. Der starke Tech-Ausverkauf spiegelte eine breitere Marktvorsicht trotz positiver Gewinnenergebnisse wider."
      },
      "es": {
        "title": "Los mercados asiáticos abren mixtos después de la caída de Wall Street por la caída de Nvidia",
        "summary": "Los mercados de Asia-Pacífico abrieron mixtos el viernes tras las caídas de las acciones estadounidenses durante la noche, ya que las acciones de Nvidia se desplomaron a pesar de superar las expectativas de ganancias trimestrales. La fuerte liquidación de tecnología reflejó una precaución más amplia del mercado a pesar de resultados de ganancias positivos."
      }
    }
  },
  {
    "title": "Jack Dorsey's Block cuts thousands of jobs as it embraces AI",
    "slug": "jack-dorsey-block-cuts-jobs-ai",
    "url": "https://www.bbc.com/news/articles/cq570d12y9do?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-27T00:06:40.000Z",
    "summary": "Block, led by former Twitter co-founder Jack Dorsey, is laying off over 4,000 employees and restructuring to prioritize artificial intelligence. Dorsey says AI fundamentally changes how companies are built and operated.",
    "content": "The Twitter co-founder says artificial intelligence \"fundamentally changes what it means to build and run a company.\"",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "杰克·多西的Block公司在拥抱AI之际裁减数千名员工",
        "summary": "由前Twitter联合创始人杰克·多西领导的Block公司正在裁员超过4000名员工并进行重组，以优先考虑人工智能。多西表示人工智能根本上改变了公司的构建和运营方式。"
      },
      "fr": {
        "title": "Block de Jack Dorsey réduit les effectifs de milliers d'employés alors qu'il adopte l'IA",
        "summary": "Block, dirigée par le co-fondateur de Twitter Jack Dorsey, licencie plus de 4 000 employés et restructure pour prioriser l'intelligence artificielle. Dorsey affirme que l'IA change fondamentalement la façon dont les entreprises sont construites et exploitées."
      },
      "de": {
        "title": "Jack Dorseys Block entlässt Tausende von Mitarbeitern während es künstliche Intelligenz umarmt",
        "summary": "Block unter der Leitung des ehemaligen Twitter-Mitgründers Jack Dorsey entlässt über 4.000 Mitarbeiter und wird umstrukturiert, um künstliche Intelligenz zu priorisieren. Dorsey sagt, dass KI grundlegend verändert, wie Unternehmen gebaut und betrieben werden."
      },
      "es": {
        "title": "Block de Jack Dorsey despide a miles de empleados mientras adopta la IA",
        "summary": "Block, liderada por el cofundador de Twitter Jack Dorsey, está despidiendo a más de 4.000 empleados y reestructurándose para priorizar la inteligencia artificial. Dorsey dice que la IA cambia fundamentalmente cómo se construyen y operan las empresas."
      }
    }
  },
  {
    "title": "Why you can't get a signal at festivals and sports matches",
    "slug": "no-signal-festivals-sports-matches",
    "url": "https://www.bbc.com/news/articles/c3rzq8d24y9o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-27T00:03:10.000Z",
    "summary": "Providing internet connectivity at large music and sports events is a complex logistical challenge involving significant infrastructure investment. Event organizers struggle to accommodate the concentrated demand from thousands of attendees in confined spaces.",
    "content": "Connecting up music and sports events to the internet is a massive undertaking.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "为什么在音乐节和体育赛事上无法获得信号",
        "summary": "为大型音乐和体育赛事提供互联网连接是一个复杂的后勤挑战，需要大量的基础设施投资。活动组织者难以应对数千名参与者在有限空间内的集中需求。"
      },
      "fr": {
        "title": "Pourquoi vous ne pouvez pas avoir de signal aux festivals et aux matchs sportifs",
        "summary": "Fournir une connectivité Internet aux grands événements musicaux et sportifs est un défi logistique complexe impliquant un investissement infrastructurel important. Les organisateurs d'événements ont du mal à satisfaire la demande concentrée de milliers de participants dans des espaces confinés."
      },
      "de": {
        "title": "Warum Sie bei Festivals und Sportveranstaltungen keinen Empfang bekommen",
        "summary": "Die Bereitstellung von Internetkonnektivität bei großen Musik- und Sportveranstaltungen ist eine komplexe logistische Herausforderung mit erheblichen Infrastrukturinvestitionen. Veranstalter haben Schwierigkeiten, die konzentrierte Nachfrage von Tausenden von Besuchern in begrenzten Räumen zu bewältigen."
      },
      "es": {
        "title": "Por qué no puedes obtener señal en festivales y eventos deportivos",
        "summary": "Proporcionar conectividad a Internet en grandes eventos musicales y deportivos es un desafío logístico complejo que requiere una inversión significativa en infraestructura. Los organizadores de eventos luchan por satisfacer la demanda concentrada de miles de asistentes en espacios confinados."
      }
    }
  }
]