[
  {
    "title": "Live updates: Iran security chief Ali Larijani rejects U.S. talks, blames Trump for 'chaos'",
    "slug": "iran-security-chief-ali-larijani-rejects-us-talks",
    "url": "https://www.cnbc.com/2026/03/02/us-iran-live-updates-trump-oil-gold.html",
    "source": "CNBC",
    "date": "2026-03-02T06:22:33.000Z",
    "summary": "Iran's security chief Ali Larijani rejected direct talks with the U.S., blaming Trump for regional instability following a major U.S.-Israel military strike that killed Iran's Supreme Leader. The rejection signals Tehran's hardened stance in the escalating conflict.",
    "content": "Follow the latest news after the U.S. and Israel launched a massive attack on Iran that killed Iran's Supreme Leader Ayatollah Ali Khamenei.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "实时更新：伊朗安全总长拉里贾尼拒绝与美国谈判，指责特朗普造成\"混乱\"",
        "summary": "伊朗安全总长阿里·拉里贾尼拒绝与美国进行直接谈判，指责特朗普在美以联合军事打击杀死伊朗最高领袖后造成地区不稳定。这一拒绝表明德黑兰在不断升级的冲突中态度强硬。"
      },
      "fr": {
        "title": "Mise à jour en direct : le chef de la sécurité iranienne Ali Larijani refuse les pourparlers avec les États-Unis, blâme Trump pour le 'chaos'",
        "summary": "Le chef de la sécurité iranienne Ali Larijani a rejeté les pourparlers directs avec les États-Unis, blâmant Trump de l'instabilité régionale suite à une frappe militaire majeure entre les États-Unis et Israël qui a tué le Guide suprême de l'Iran. Le rejet signale le durcissement de la position de Téhéran dans le conflit qui s'intensifie."
      },
      "de": {
        "title": "Live-Updates: Iranischer Sicherheitschef Ali Larijani lehnt US-Gespräche ab, beschuldigt Trump des 'Chaos'",
        "summary": "Irans Sicherheitschef Ali Larijani lehnte direkte Gespräche mit den USA ab und machte Trump für regionale Instabilität nach einem großen US-israelischen Militärschlag verantwortlich, der Irans Obersten Führer tötete. Die Ablehnung signalisiert Teherans verhärtete Position in dem eskalierenden Konflikt."
      },
      "es": {
        "title": "Actualizaciones en vivo: el jefe de seguridad iraní Ali Larijani rechaza conversaciones con EE.UU., culpa a Trump del 'caos'",
        "summary": "El jefe de seguridad de Irán Ali Larijani rechazó conversaciones directas con Estados Unidos, culpando a Trump de la inestabilidad regional tras un gran ataque militar conjunto entre EE.UU. e Israel que mató al Líder Supremo de Irán. El rechazo señala la posición endurecida de Teherán en el conflicto que se intensifica."
      }
    }
  },
  {
    "title": "European stocks set to slump as markets react to U.S., Israeli strikes on Iran",
    "slug": "european-stocks-set-to-slump-iran-strikes",
    "url": "https://www.cnbc.com/2026/03/02/european-markets-stoxx-600-ftse-dax-cac-iran-strikes-reaction.html",
    "source": "CNBC",
    "date": "2026-03-02T06:08:12.000Z",
    "summary": "European stock markets are expected to open sharply lower as investors react to U.S. and Israeli military strikes on Iran. The negative sentiment reflects growing concerns over regional escalation and its economic impact.",
    "content": "European stocks are expected to start the new trading week firmly in negative territory.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "欧洲股市将大幅下跌，因市场对美国、以色列对伊朗的打击作出反应",
        "summary": "随着投资者对美国和以色列对伊朗的军事打击做出反应，欧洲股市预计将大幅低开。负面情绪反映了对地区升级及其经济影响日益增长的担忧。"
      },
      "fr": {
        "title": "Les actions européennes devraient plonger alors que les marchés réagissent aux frappes américaines et israéliennes sur l'Iran",
        "summary": "Les marchés boursiers européens devraient ouvrir nettement plus bas à mesure que les investisseurs réagissent aux frappes militaires américaines et israéliennes contre l'Iran. Le sentiment négatif reflète les préoccupations croissantes concernant l'escalade régionale et ses impacts économiques."
      },
      "de": {
        "title": "Europäische Aktien werden einbrechen, da Märkte auf US- und israelische Anschläge auf den Iran reagieren",
        "summary": "Europäische Aktienmärkte werden voraussichtlich deutlich niedriger eröffnen, da Anleger auf US- und israelische Militäranschläge auf den Iran reagieren. Die negative Stimmung widerspiegelt wachsende Bedenken über regionale Eskalation und ihre wirtschaftlichen Auswirkungen."
      },
      "es": {
        "title": "Las acciones europeas se desplomarán mientras los mercados reaccionan a los ataques estadounidenses e israelíes a Irán",
        "summary": "Se espera que los mercados bursátiles europeos abran significativamente más bajos a medida que los inversores reaccionan a los ataques militares estadounidenses e israelíes contra Irán. El sentimiento negativo refleja crecientes preocupaciones sobre la escalada regional y su impacto económico."
      }
    }
  },
  {
    "title": "Iran conflict: Where things stand, global responses — and what comes next",
    "slug": "iran-conflict-where-things-stand-global-responses",
    "url": "https://www.cnbc.com/2026/03/02/iran-israel-us-conflict-oil-jumps-trump-netanyahu-what-is-next.html",
    "source": "CNBC",
    "date": "2026-03-02T05:28:28.000Z",
    "summary": "The U.S.-Israel conflict with Iran has entered its third day with both sides threatening further escalation, while countries worldwide respond to the widening crisis. The situation remains fluid with no clear de-escalation path.",
    "content": "The U.S.-Israel conflict with Iran is extending into its third day with each side pledging escalation.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "伊朗冲突：事态发展、全球反应——接下来会发生什么",
        "summary": "美以与伊朗的冲突已进入第三天，双方威胁进一步升级，同时世界各国对不断扩大的危机作出反应。局势仍不明朗，没有明确的缓和路径。"
      },
      "fr": {
        "title": "Conflit en Iran : où les choses en sont, réactions mondiales — et ce qui vient ensuite",
        "summary": "Le conflit entre les États-Unis et Israël avec l'Iran est entré dans sa troisième journée, les deux côtés menaçant d'une nouvelle escalade, tandis que les pays du monde entier réagissent à la crise qui s'élargit. La situation reste fluide sans voie de désescalade claire."
      },
      "de": {
        "title": "Iran-Konflikt: Wie die Dinge stehen, globale Reaktionen — und was kommt als nächstes",
        "summary": "Der US-israelische Konflikt mit dem Iran hat seinen dritten Tag erreicht, wobei beide Seiten eine weitere Eskalation androhen, während Länder weltweit auf die sich ausbreitende Krise reagieren. Die Situation bleibt unklar ohne klaren Deeskalationsweg."
      },
      "es": {
        "title": "Conflicto en Irán: cómo están las cosas, respuestas globales — y qué viene después",
        "summary": "El conflicto entre EE.UU. e Israel con Irán ha entrado en su tercer día con ambos lados amenazando una mayor escalada, mientras que países de todo el mundo responden a la crisis que se amplía. La situación sigue siendo fluida sin un camino claro hacia la desescalada."
      }
    }
  },
  {
    "title": "Asia airline stocks drop while energy shares rise as Iran conflict escalates",
    "slug": "asia-airline-stocks-drop-energy-shares-rise-iran",
    "url": "https://www.cnbc.com/2026/03/02/asia-markets-live-trump-iran-oil-prices-nikkei-hang-seng-us-israel-strikes-oil.html",
    "source": "CNBC",
    "date": "2026-03-02T04:19:35.000Z",
    "summary": "Oil futures surged over 8% as the Iran conflict intensifies, with WTI and Brent crude trading at $72.52 and $79.04 respectively, driving declines in airline stocks while energy shares gain. The oil market reaction underscores supply concerns from the geopolitical tension.",
    "content": "Oil futures on Monday jumped by over 8%, with West Texas Intermediate futures and Brent trading at $72.52 and $79.04 per barrel respectively.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "伊朗冲突升级，亚洲航空股下跌而能源股上升",
        "summary": "随着伊朗冲突加剧，油期货飙升超过8%，WTI和布伦特原油分别交易价格为72.52美元和79.04美元，导致航空股下跌，而能源股上升。油市反应凸显地缘政治紧张带来的供应担忧。"
      },
      "fr": {
        "title": "Les actions des compagnies aériennes asiatiques baissent tandis que les actions énergétiques augmentent à mesure que le conflit iranien s'intensifie",
        "summary": "Les contrats à terme sur le pétrole ont bondi de plus de 8% alors que le conflit iranien s'intensifie, le WTI et le pétrole brut Brent se négociant respectivement à 72,52 $ et 79,04 $, entraînant des baisses des actions des compagnies aériennes tandis que les actions énergétiques progressent. La réaction du marché pétrolier souligne les préoccupations concernant l'approvisionnement dues à la tension géopolitique."
      },
      "de": {
        "title": "Asiatische Fluggesellschaftsaktien fallen, während Energieaktien bei Eskalation des Iran-Konflikts steigen",
        "summary": "Die Ölkontraktpreise stiegen um über 8%, da sich der Iran-Konflikt verschärft, mit WTI und Brent-Rohöl, die jeweils bei 72,52 $ und 79,04 $ gehandelt werden, was zu Rückgängen bei Fluggesellschaftsaktien führt, während Energieaktien gewinnen. Die Ölmarktreaktion unterstreicht Versorgungsbedenken aufgrund der geopolitischen Spannungen."
      },
      "es": {
        "title": "Las acciones de las aerolíneas asiáticas caen mientras que las acciones de energía suben a medida que el conflicto de Irán se intensifica",
        "summary": "Los futuros del petróleo se dispararon más del 8% a medida que el conflicto de Irán se intensifica, con el WTI y el crudo Brent cotizando a $72.52 y $79.04 respectivamente, impulsando caídas en las acciones de aerolíneas mientras que las acciones de energía ganan terreno. La reacción del mercado petrolero subraya las preocupaciones de suministro por la tensión geopolítica."
      }
    }
  },
  {
    "title": "Anthropic’s Claude tops App Store charts as backlash builds against OpenAI’s ChatGPT",
    "slug": "anthropic-claude-tops-app-store-openai-backlash",
    "url": "https://www.marketwatch.com/story/anthropics-claude-tops-app-store-charts-as-backlash-builds-against-openais-chatgpt-3fdce792?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-03-02T01:32:00.000Z",
    "summary": "Anthropic's Claude AI app is climbing Apple's App Store charts as OpenAI's ChatGPT faces user backlash over a new Department of Defense partnership deal. The shift reflects growing competition and user sensitivity to military applications.",
    "content": "OpenAI faces some user criticism over its new deal with the Department of Defense.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "在用户反对OpenAI ChatGPT的浪潮中，Anthropic的Claude登顶App Store排行榜",
        "summary": "随着OpenAI的ChatGPT因新的国防部合作协议而面临用户反对，Anthropic的Claude AI应用正在苹果App Store排行榜上攀升。这一转变反映了日益增长的竞争和用户对军事应用的敏感性。"
      },
      "fr": {
        "title": "Claude d'Anthropic arrive en tête des classements de l'App Store tandis que le contrecoup contre ChatGPT d'OpenAI s'intensifie",
        "summary": "L'application Claude AI d'Anthropic grimpe dans les classements de l'Apple App Store alors que ChatGPT d'OpenAI fait face à une réaction négative des utilisateurs concernant un nouvel accord de partenariat avec le Département de la Défense. Ce changement reflète une concurrence croissante et une sensibilité des utilisateurs aux applications militaires."
      },
      "de": {
        "title": "Anthropic's Claude führt die App Store-Charts an, während sich Gegenwehr gegen OpenAI's ChatGPT aufbaut",
        "summary": "Die Claude-KI-App von Anthropic klettert in den Apple App Store-Charts, während OpenAIs ChatGPT wegen eines neuen Partnerschaftsabkommens mit dem Verteidigungsministerium mit Gegenwind von Benutzern konfrontiert ist. Die Verschiebung spiegelt wachsende Konkurrenz und Benutzersensibilität gegenüber Militäranwendungen wider."
      },
      "es": {
        "title": "Claude de Anthropic encabeza los gráficos de la App Store mientras crece la reacción adversa contra ChatGPT de OpenAI",
        "summary": "La aplicación Claude AI de Anthropic está subiendo en los gráficos de la App Store de Apple mientras ChatGPT de OpenAI enfrenta reacciones negativas de usuarios por un nuevo acuerdo de asociación con el Departamento de Defensa. El cambio refleja la creciente competencia y la sensibilidad de los usuarios a las aplicaciones militares."
      }
    }
  }
]