[
  {
    "title": "Company director jailed over £7m airline parts fraud",
    "slug": "company-director-jailed-airline-parts-fraud-7m",
    "url": "https://www.bbc.com/news/articles/c14mgl4ddr2o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-23T16:43:44.000Z",
    "summary": "A company director has been imprisoned for perpetrating a £7 million fraud involving airline parts, with the judge noting the actions undermined critical safety regulations. The case highlights the dangers of fraud affecting aviation safety and passenger security.",
    "content": "The judge said the actions were a \"more or less complete undermining\" of rules designed to ensure passenger flights are safe.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "公司董事因£700万航空零件欺诈案被判监禁",
        "summary": "一名公司董事因涉及£700万航空零件欺诈案被监禁，法官指出其行为破坏了关键安全法规。该案突显了欺诈对航空安全和乘客安全的危害。"
      },
      "fr": {
        "title": "Un directeur d'entreprise emprisonné pour fraude sur les pièces aéronautiques de 7 millions de livres",
        "summary": "Un directeur d'entreprise a été emprisonné pour avoir perpétré une fraude de 7 millions de livres impliquant des pièces aéronautiques, le juge notant que ses actions ont compromis les réglementations de sécurité essentielles. L'affaire met en lumière les dangers de la fraude affectant la sécurité aérienne et la sécurité des passagers."
      },
      "de": {
        "title": "Geschäftsführer wegen £7-Millionen-Betrugs mit Flugzeugteilen inhaftiert",
        "summary": "Ein Geschäftsführer wurde wegen eines £7-Millionen-Betrugs mit Flugzeugteilen inhaftiert. Der Richter merkte an, dass die Handlungen kritische Sicherheitsbestimmungen untergruben. Der Fall zeigt die Gefahren von Betrug, der die Luftfahrtsicherheit und Passagiersicherheit gefährdet."
      },
      "es": {
        "title": "Director de empresa encarcelado por fraude de £7 millones en piezas de aviación",
        "summary": "Un director de empresa ha sido encarcelado por perpetrar un fraude de £7 millones que involucraba piezas de aviación, con el juez señalando que sus acciones socavaron regulaciones de seguridad críticas. El caso destaca los peligros del fraude que afecta la seguridad de la aviación y la seguridad de los pasajeros."
      }
    }
  },
  {
    "title": "When is the Spring Statement and what might be in it?",
    "slug": "spring-statement-rachel-reeves-march-3",
    "url": "https://www.bbc.com/news/articles/c5yv255914xo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-02-23T13:02:11.000Z",
    "summary": "UK Chancellor Rachel Reeves will deliver a Spring Statement on March 3, providing updates on her economic plans and including a new economic forecast. The statement is a key opportunity for the government to outline its fiscal and economic priorities.",
    "content": "Chancellor Rachel Reeves will give an update on her plans for the UK economy when she gives a statement alongside an economic forecast on 3 March.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "春季声明是什么时候，可能包含什么？",
        "summary": "英国财政大臣瑞秋·里夫斯将在3月3日发表春季声明，提供其经济计划的最新信息和新的经济预测。该声明是政府阐述其财政和经济优先事项的关键机会。"
      },
      "fr": {
        "title": "Quand est la Déclaration de printemps et qu'est-ce qu'elle pourrait contenir?",
        "summary": "La chancelière britannique Rachel Reeves présentera une Déclaration de printemps le 3 mars, fournissant des mises à jour sur ses plans économiques et incluant une nouvelle prévision économique. La déclaration est une opportunité clé pour le gouvernement d'exposer ses priorités fiscales et économiques."
      },
      "de": {
        "title": "Wann ist die Frühjahrserklärung und was könnte sie enthalten?",
        "summary": "Die britische Finanzministerin Rachel Reeves wird am 3. März eine Frühjahrserklärung abgeben, die Aktualisierungen ihrer Wirtschaftspläne und eine neue Wirtschaftsprognose enthält. Die Erklärung ist eine wichtige Gelegenheit für die Regierung, ihre fiskalischen und wirtschaftlichen Prioritäten darzulegen."
      },
      "es": {
        "title": "¿Cuándo es la Declaración de primavera y qué podría contener?",
        "summary": "La canciller británica Rachel Reeves presentará una Declaración de primavera el 3 de marzo, proporcionando actualizaciones sobre sus planes económicos e incluyendo una nueva previsión económica. La declaración es una oportunidad clave para que el gobierno exponga sus prioridades fiscales y económicas."
      }
    }
  }
]