[
  {
    "title": "Defense stocks jump as U.S., Iran exchange attacks",
    "slug": "defense-stocks-jump-us-iran-exchange-attacks",
    "url": "https://www.cnbc.com/2026/03/02/defense-stocks-us-iran-israel-attacks-lockheed-renk-leonardo.html",
    "source": "CNBC",
    "date": "2026-03-02T12:12:13.000Z",
    "summary": "U.S. and Iran military escalation drove defense sector gains despite a broader market decline. The conflict creates geopolitical risks that could reshape market dynamics.",
    "content": "The defense sector was a rare bright spot amid a broader market sell-off triggered by fears of a wider regional conflict following U.S. attacks on Iran.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "防御股票随美伊冲突上涨",
        "summary": "美伊军事升级推动国防部门增长，尽管更广泛的市场下降。冲突造成的地缘政治风险可能改变市场动态。"
      },
      "fr": {
        "title": "Les actions de défense augmentent alors que les États-Unis et l'Iran échangent des attaques",
        "summary": "L'escalade militaire entre les États-Unis et l'Iran a stimulé les gains du secteur de la défense malgré un déclin plus large du marché. Le conflit crée des risques géopolitiques qui pourraient remodeler la dynamique du marché."
      },
      "de": {
        "title": "Rüstungsbestände steigen, während USA und Iran Anschläge austauschen",
        "summary": "Die militärische Eskalation zwischen den USA und dem Iran trieb die Gewinne des Verteidigungssektors an, trotz eines breiteren Markteinbruchs. Der Konflikt schafft geopolitische Risiken, die die Marktdynamik umgestalten könnten."
      },
      "es": {
        "title": "Las acciones de defensa suben mientras EE.UU. e Irán intercambian ataques",
        "summary": "La escalada militar entre EE.UU. e Irán impulsó ganancias en el sector de defensa a pesar de una caída más amplia del mercado. El conflicto crea riesgos geopolíticos que podrían remodelar la dinámica del mercado."
      }
    }
  },
  {
    "title": "This cybersecurity stock has taken a beating on AI worries. Why one analyst sees an opportunity",
    "slug": "cybersecurity-stock-beaten-ai-worries-analyst-opportunity",
    "url": "https://www.cnbc.com/2026/03/02/crowdstrike-has-taken-a-beating-on-ai-worries-why-one-analyst-sees-an-opportunity.html",
    "source": "CNBC",
    "date": "2026-03-02T11:56:00.000Z",
    "summary": "CrowdStrike shares have declined amid AI-related concerns, but Piper Sandler analyst identifies a potential 40% upside opportunity. The stock may be oversold relative to its fundamentals.",
    "content": "Piper Sandler sees shares of CrowdStrike rallying 40% from here.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "这只网络安全股票因人工智能担忧而下跌。为什么一位分析师看到了机会",
        "summary": "CrowdStrike股价因人工智能相关担忧而下跌，但派杰桑德勒分析师确定了潜在的40%上升空间。相对于其基本面，该股票可能被低估。"
      },
      "fr": {
        "title": "Ce titre de cybersécurité a été maltraité par les préoccupations liées à l'IA. Pourquoi un analyste voit une opportunité",
        "summary": "Les actions CrowdStrike ont baissé au milieu des préoccupations liées à l'IA, mais l'analyste Piper Sandler identifie une opportunité de hausse potentielle de 40%. L'action pourrait être survendue par rapport à ses fondamentales."
      },
      "de": {
        "title": "Diese Cybersecurity-Aktie hat unter AI-Bedenken gelitten. Warum ein Analyst eine Gelegenheit sieht",
        "summary": "CrowdStrike-Aktien sind inmitten von KI-bezogenen Bedenken gefallen, aber der Analyst von Piper Sandler identifiziert ein potenzielles Aufwärtspotenzial von 40%. Die Aktie könnte im Vergleich zu ihren Fundamentaldaten überverkauft sein."
      },
      "es": {
        "title": "Esta acción de ciberseguridad ha sido castigada por preocupaciones de IA. Por qué un analista ve una oportunidad",
        "summary": "Las acciones de CrowdStrike han caído en medio de preocupaciones relacionadas con la IA, pero un analista de Piper Sandler identifica una posible oportunidad alcista del 40%. La acción puede estar sobrevendida en relación con sus fundamentos."
      }
    }
  },
  {
    "title": "The Strait of Hormuz crisis explained: What it means for global shipping",
    "slug": "strait-hormuz-crisis-global-shipping",
    "url": "https://www.cnbc.com/2026/03/02/strait-of-hormuz-crisis-us-iran-israel-war-shipping-trade-oil.html",
    "source": "CNBC",
    "date": "2026-03-02T11:38:26.000Z",
    "summary": "Middle East tensions threaten disruption to critical maritime trade routes through the Strait of Hormuz. The potential supply chain impact could affect global commerce.",
    "content": "The Middle East conflict has stoked fears of prolonged disruption to global trade via key maritime corridors.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "霍尔木兹海峡危机解释：对全球航运的意义",
        "summary": "中东局势威胁中断经过霍尔木兹海峡的关键海上贸易路线。潜在的供应链影响可能会影响全球商业。"
      },
      "fr": {
        "title": "La crise du détroit d'Ormuz expliquée : ce que cela signifie pour le transport maritime mondial",
        "summary": "Les tensions au Moyen-Orient menacent de perturber les voies de commerce maritime critiques à travers le détroit d'Ormuz. L'impact potentiel sur la chaîne d'approvisionnement pourrait affecter le commerce mondial."
      },
      "de": {
        "title": "Die Krise der Straße von Hormus erklärt: Was sie für die globale Schifffahrt bedeutet",
        "summary": "Spannungen im Nahen Osten bedrohen die Unterbrechung kritischer Seerouten durch die Straße von Hormus. Die möglichen Auswirkungen auf die Lieferkette könnten den globalen Handel beeinflussen."
      },
      "es": {
        "title": "La crisis del Estrecho de Ormuz explicada: Lo que significa para el transporte marítimo mundial",
        "summary": "Las tensiones de Oriente Medio amenazan con interrumpir rutas comerciales marítimas críticas a través del Estrecho de Ormuz. El impacto potencial en la cadena de suministro podría afectar el comercio global."
      }
    }
  },
  {
    "title": "Here’s how far oil is away from dragging stocks into a bear market, according to Morgan Stanley",
    "slug": "oil-bear-market-morgan-stanley",
    "url": "https://www.marketwatch.com/story/heres-how-far-oil-is-away-from-dragging-stocks-into-a-bear-market-according-to-morgan-stanley-b8e1932b?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-03-02T11:38:00.000Z",
    "summary": "Morgan Stanley analysis shows markets have historically recovered quickly from geopolitical shocks despite current oil-driven concerns. Current conditions suggest limited immediate bear market risk.",
    "content": "History shows market can recover quite quickly from geopolitical shocks",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "摩根士丹利分析：石油距离将股票拖入熊市还有多远",
        "summary": "摩根士丹利分析显示，尽管目前存在石油驱动的担忧，市场历来能够快速从地缘政治冲击中恢复。当前条件表明熊市风险有限。"
      },
      "fr": {
        "title": "Selon Morgan Stanley, le pétrole est-il loin de traîner les actions vers un marché baissier ?",
        "summary": "L'analyse de Morgan Stanley montre que les marchés se sont historiquement rétablis rapidement après les chocs géopolitiques malgré les préoccupations actuelles liées au pétrole. Les conditions actuelles suggèrent un risque limité de marché baissier immédiat."
      },
      "de": {
        "title": "Wie weit ist Öl noch davon entfernt, die Aktien in einen Bärenmarkt zu ziehen, nach Morgan Stanley",
        "summary": "Die Analyse von Morgan Stanley zeigt, dass sich die Märkte historisch schnell von geopolitischen Schocks erholt haben, trotz aktueller Bedenken in Bezug auf Öl. Die aktuellen Bedingungen deuten auf ein begrenztes unmittelbares Bärenmarktrisiko hin."
      },
      "es": {
        "title": "Según Morgan Stanley, ¿qué tan lejos está el petróleo de llevar las acciones a un mercado bajista?",
        "summary": "El análisis de Morgan Stanley muestra que los mercados históricamente se han recuperado rápidamente de los shocks geopolíticos a pesar de las preocupaciones actuales impulsadas por el petróleo. Las condiciones actuales sugieren un riesgo limitado de mercado bajista inmediato."
      }
    }
  },
  {
    "title": "What are my rights if my flight is cancelled or delayed?",
    "slug": "flight-cancelled-delayed-rights",
    "url": "https://www.bbc.com/news/articles/c9qxnyengdjo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Business",
    "date": "2026-03-02T11:26:35.000Z",
    "summary": "BBC Business outlines consumer protections and refund rights for passengers facing cancelled or delayed flights. Different circumstances determine eligibility for compensation.",
    "content": "We look at the different circumstances that affect you if you're due a refund for cancelled or delayed flights.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "航班取消或延误，我有什么权利？",
        "summary": "BBC商业频道概述了面临航班取消或延误的乘客的消费者保护和退款权利。不同情况决定了赔偿资格。"
      },
      "fr": {
        "title": "Quels sont mes droits si mon vol est annulé ou retardé ?",
        "summary": "BBC Business expose les protections des consommateurs et les droits de remboursement des passagers confrontés à des vols annulés ou retardés. Différentes circonstances déterminent l'éligibilité à la compensation."
      },
      "de": {
        "title": "Welche Rechte habe ich, wenn mein Flug annulliert oder verspätet ist?",
        "summary": "BBC Business beschreibt Verbraucherschutzbestimmungen und Rückerstattungsrechte für Passagiere, deren Flüge annulliert oder verspätet sind. Unterschiedliche Umstände bestimmen die Berechtigung zur Entschädigung."
      },
      "es": {
        "title": "¿Cuáles son mis derechos si mi vuelo se cancela o se retrasa?",
        "summary": "BBC Business describe las protecciones del consumidor y los derechos de reembolso para pasajeros que enfrentan vuelos cancelados o retrasados. Diferentes circunstancias determinan la elegibilidad para la compensación."
      }
    }
  },
  {
    "title": "Here’s oil’s path to $120 per barrel, according to JPMorgan",
    "slug": "oil-120-barrel-jpmorgan",
    "url": "https://www.marketwatch.com/story/heres-the-path-to-oil-hitting-120-per-barrel-according-to-jpmorgan-71792b31?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-03-02T10:55:00.000Z",
    "summary": "JPMorgan analysis outlines scenarios where oil could reach $120 per barrel amid Middle East conflict escalation. Sustained regional tensions could drive significant price increases.",
    "content": "The question is how high could oil prices go in the case of a sustained conflict.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "摩根大通分析：石油如何达到每桶120美元",
        "summary": "摩根大通分析概述了中东冲突升级中石油可能达到每桶120美元的情景。持续的地区紧张局势可能会推动油价大幅上涨。"
      },
      "fr": {
        "title": "Voici le chemin du pétrole vers 120 dollars le baril, selon JPMorgan",
        "summary": "L'analyse de JPMorgan décrit des scénarios où le pétrole pourrait atteindre 120 dollars le baril au milieu d'une escalade du conflit au Moyen-Orient. Les tensions régionales soutenues pourraient entraîner des augmentations de prix significatives."
      },
      "de": {
        "title": "Hier ist der Weg des Öls zu 120 Dollar pro Barrel nach JPMorgan",
        "summary": "Die JPMorgan-Analyse beschreibt Szenarien, in denen Öl angesichts einer Eskalation des Konflikts im Nahen Osten 120 Dollar pro Barrel erreichen könnte. Anhaltende regionale Spannungen könnten zu erheblichen Preiserhöhungen führen."
      },
      "es": {
        "title": "Aquí está el camino del petróleo a $120 por barril, según JPMorgan",
        "summary": "El análisis de JPMorgan describe escenarios en los que el petróleo podría alcanzar $120 por barril en medio de una escalada del conflicto en Oriente Medio. Las tensiones regionales sostenidas podrían impulsar aumentos de precios significativos."
      }
    }
  },
  {
    "title": "Markets after Iran strikes: oil surges, airlines sink, bonds defy safe-haven playbook",
    "slug": "markets-iran-strikes-oil-airlines-bonds",
    "url": "https://www.cnbc.com/2026/03/02/global-markets-after-iran-strikes-oil-surges-airlines-sink-bonds-defy-safe-haven-playbook.html",
    "source": "CNBC",
    "date": "2026-03-02T10:51:20.000Z",
    "summary": "Iran strikes triggered mixed market reactions with oil prices rising sharply while airline stocks declined despite broader equity weakness. Bond markets defied typical safe-haven behavior patterns.",
    "content": "Global markets started the day lower across the board, with major sectors in Europe and Asia negative.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "伊朗袭击后的市场：油价飙升，航空股下跌，债券打破避险模式",
        "summary": "伊朗袭击引发市场混合反应，油价大幅上升，同时航空股下跌，尽管股市整体疲软。债券市场违背了典型的避险行为模式。"
      },
      "fr": {
        "title": "Les marchés après les frappes iraniennes : le pétrole s'envole, les compagnies aériennes s'effondrent, les obligations défient la stratégie de valeur refuge",
        "summary": "Les frappes iraniennes ont déclenché des réactions mitigées du marché avec une forte hausse des prix du pétrole tandis que les actions aériennes ont baissé malgré une faiblesse plus large des actions. Les marchés obligataires ont défié les schémas typiques de refuge sûr."
      },
      "de": {
        "title": "Märkte nach iranischen Angriffen: Öl steigt, Fluglinien fallen, Anleihen trotzen dem sicheren Hafen",
        "summary": "Iranische Anschläge lösten gemischte Marktreaktionen aus, wobei die Ölpreise stark anstiegen, während die Flugaktien trotz breiterer Aktienschwäche sanken. Die Anleihemärkte trotzten dem typischen Muster der Flucht in sichere Häfen."
      },
      "es": {
        "title": "Mercados después de los ataques iraníes: petróleo sube, aerolíneas caen, bonos desafían el juego de refugio seguro",
        "summary": "Los ataques iraníes desencadenaron reacciones mixtas en el mercado con precios del petróleo subiendo bruscamente mientras que las acciones de aerolíneas bajaban a pesar del debilitamiento más amplio del capital. Los mercados de bonos desafiaron los patrones típicos de comportamiento de refugio seguro."
      }
    }
  },
  {
    "title": "Why India looks especially vulnerable as conflict rages in Middle East",
    "slug": "india-vulnerable-middle-east-conflict",
    "url": "https://www.cnbc.com/2026/03/02/india-impact-iran-middle-east-conflict-oil-prices-airlines.html",
    "source": "CNBC",
    "date": "2026-03-02T10:37:27.000Z",
    "summary": "India faces particular exposure to Middle East conflict through rising oil prices and aviation sector disruptions. The country's economic vulnerabilities amplify geopolitical risks.",
    "content": "As conflict in the Middle East causes surging oil prices and disrupts the aviation sector, India is coming under pressure.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "为什么印度在中东冲突加剧时显得特别脆弱",
        "summary": "印度通过油价上涨和航空部门中断面临特殊的中东冲突风险。该国的经济脆弱性加剧了地缘政治风险。"
      },
      "fr": {
        "title": "Pourquoi l'Inde semble particulièrement vulnérable alors que le conflit fait rage au Moyen-Orient",
        "summary": "L'Inde fait face à une exposition particulière au conflit du Moyen-Orient par le biais de la hausse des prix du pétrole et des perturbations du secteur de l'aviation. Les vulnérabilités économiques du pays amplifient les risques géopolitiques."
      },
      "de": {
        "title": "Warum Indien besonders anfällig ist, wenn der Konflikt im Nahen Osten tobt",
        "summary": "Indien sieht sich dem Nahost-Konflikt durch steigende Ölpreise und Störungen im Luftfahrtsektor besonders ausgesetzt. Die wirtschaftlichen Anfälligkeiten des Landes verstärken geopolitische Risiken."
      },
      "es": {
        "title": "Por qué India parece especialmente vulnerable mientras continúa el conflicto en Oriente Medio",
        "summary": "India enfrenta una exposición particular al conflicto de Oriente Medio a través de la subida de los precios del petróleo y las interrupciones del sector de la aviación. Las vulnerabilidades económicas del país amplifican los riesgos geopolíticos."
      }
    }
  },
  {
    "title": "Gasoil is spiking more than crude. What it is and why prices are soaring amid Iran conflict.",
    "slug": "gasoil-spiking-crude-iran-conflict",
    "url": "https://www.marketwatch.com/story/gasoil-is-spiking-more-than-crude-what-it-is-and-why-prices-are-soaring-amid-iran-conflict-af45ca50?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-03-02T10:31:00.000Z",
    "summary": "Gasoil prices are surging faster than crude oil following a Saudi Arabia refinery strike during Iran tensions. The fuel derivative is critical to global transportation and heating.",
    "content": "The workhorse of the fuel world was climbing on Monday, with a strike on a major Saudi Arabia refinery getting the blame.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "燃油价格上升幅度超过原油。它是什么以及伊朗冲突中为什么价格飙升",
        "summary": "在伊朗紧张局势期间沙特阿拉伯炼油厂遭袭后，燃油价格比原油上升更快。这种燃料衍生物对全球运输和供暖至关重要。"
      },
      "fr": {
        "title": "Le gasoil augmente plus que le brut. Qu'est-ce que c'est et pourquoi les prix montent en flèche au milieu du conflit iranien",
        "summary": "Les prix du gasoil augmentent plus vite que le pétrole brut suite à une attaque contre une raffinerie en Arabie saoudite lors des tensions iraniennes. Ce dérivé de carburant est essentiel pour le transport et le chauffage mondiaux."
      },
      "de": {
        "title": "Gasöl steigt stärker als Rohöl. Was es ist und warum die Preise während des iranischen Konflikts in die Höhe schnellen",
        "summary": "Die Gasölpreise steigen schneller als das Rohöl nach einem Anschlag auf eine saudisch-arabische Raffinerie während der iranischen Spannungen. Dieser Brennstoffderivat ist für den weltweiten Transport und die Heizung von entscheidender Bedeutung."
      },
      "es": {
        "title": "El gasóleo sube más que el crudo. Qué es y por qué los precios se disparan en medio del conflicto iraní",
        "summary": "Los precios del gasóleo están aumentando más rápido que el petróleo crudo después del ataque a una refinería de Arabia Saudita durante las tensiones iraníes. Este derivado de combustible es crítico para el transporte y calefacción global."
      }
    }
  },
  {
    "title": "Iran conflicts just adds to wall of worry for U.S. stocks, says Citi strategist",
    "slug": "iran-conflict-wall-worry-us-stocks",
    "url": "https://www.marketwatch.com/story/iran-conflicts-just-adds-to-wall-of-worry-for-u-s-stocks-says-citi-strategist-25c0d655?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-03-02T10:26:00.000Z",
    "summary": "Citi strategist identifies rising oil prices from Iran conflict as another concern dampening U.S. equity performance in 2026. The geopolitical issue compounds an already challenging investment environment.",
    "content": "The rising oil price is just one more addition to the growing list of concerns that have stalled U.S. equity performance so far in 2026.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "伊朗冲突加剧美国股市的忧虑之墙，花旗策略师称",
        "summary": "花旗策略师表示，伊朗冲突导致的油价上升是压低2026年美国股票表现的另一个因素。这一地缘政治问题加剧了本已充满挑战的投资环境。"
      },
      "fr": {
        "title": "Les conflits iraniens s'ajoutent au mur d'inquiétude pour les actions américaines, selon un stratégiste de Citi",
        "summary": "Un stratégiste de Citi identifie la hausse des prix du pétrole due au conflit iranien comme une autre préoccupation freinant la performance des actions américaines en 2026. Cette question géopolitique aggrave un environnement d'investissement déjà difficile."
      },
      "de": {
        "title": "Der Iran-Konflikt trägt zur Wand der Sorge um US-Aktien bei, sagt ein Citi-Stratege",
        "summary": "Ein Stratege der Citi identifiziert steigende Ölpreise aus dem Iran-Konflikt als ein weiteres Problem, das die Leistung von US-Aktien im Jahr 2026 beeinträchtigt. Das geopolitische Problem verschärft ein bereits schwieriges Investitionsumfeld."
      },
      "es": {
        "title": "Los conflictos de Irán se suman al muro de preocupaciones sobre las acciones estadounidenses, dice un estratega de Citi",
        "summary": "Un estratega de Citi identifica el aumento de los precios del petróleo debido al conflicto con Irán como otra preocupación que afecta el desempeño de las acciones estadounidenses en 2026. El problema geopolítico agrava un entorno de inversión ya desafiante."
      }
    }
  },
  {
    "title": "‘Wonder Woman’ star Gal Gadot lists her elegant beachfront penthouse in Malibu for $8.75 million",
    "slug": "gal-gadot-malibu-penthouse-8-75-million",
    "url": "https://www.marketwatch.com/story/wonder-woman-star-gal-gadot-lists-her-elegant-beachfront-penthouse-in-malibu-for-8-75-million-88c5bd00?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-03-02T10:02:00.000Z",
    "summary": "Gal Gadot and her husband are selling their renovated Malibu beachfront penthouse for $8.75 million. The luxury property sits directly on the beach.",
    "content": "Gadot and her husband have carried out extensive renovations of the home, which sits right on the beach.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "《神奇女侠》明星盖尔·加朵在马里布挂牌出售优雅海滨豪宅，价格875万美元",
        "summary": "盖尔·加朵和她的丈夫正在以875万美元的价格出售他们经过翻新的马里布海滨豪宅。这处豪华地产直接坐落在海滩上。"
      },
      "fr": {
        "title": "La star de \"Wonder Woman\" Gal Gadot met son élégant penthouse en bord de mer à Malibu en vente pour 8,75 millions de dollars",
        "summary": "Gal Gadot et son mari vendent leur penthouse rénové en bord de mer à Malibu pour 8,75 millions de dollars. La propriété de luxe est située directement sur la plage."
      },
      "de": {
        "title": "\"Wonder Woman\"-Star Gal Gadot inseriert elegantes Strandpenthouse in Malibu für 8,75 Millionen Dollar",
        "summary": "Gal Gadot und ihr Ehemann verkaufen ihr renoviertes Strandpenthouse in Malibu für 8,75 Millionen Dollar. Das Luxusanwesen liegt direkt am Strand."
      },
      "es": {
        "title": "La estrella de \"Mujer Maravilla\" Gal Gadot vende su elegante penthouse frente al mar en Malibú por $8,75 millones",
        "summary": "Gal Gadot y su esposo están vendiendo su penthouse renovado frente al mar en Malibú por $8,75 millones. La propiedad de lujo se encuentra directamente en la playa."
      }
    }
  },
  {
    "title": "‘Home Alone’ star Macaulay Culkin sells California estate for $14.25 million",
    "slug": "macaulay-culkin-california-estate-14-25-million",
    "url": "https://www.marketwatch.com/story/home-alone-star-macaulay-culkin-sells-california-estate-for-14-25-million-a306071a?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-03-02T10:01:00.000Z",
    "summary": "Macaulay Culkin quietly sold his California estate for $14.25 million, a year after discussing his life as a \"homebody dad\" with partner Brenda Song. The sale marks a significant real estate transaction for the actor.",
    "content": "Macaulay Culkin has quietly sold his sprawling California estate for $14.25 million—one year after he opened up about his role as a “homebody dad” with longtime partner Brenda Song.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "《小鬼当家》明星麦考利·卡尔金以1425万美元出售加州庄园",
        "summary": "麦考利·卡尔金悄悄地以1425万美元出售了他的加州庄园，这是在他与搭档布伦达·宋讨论他\"宅爸爸\"生活一年后的事。这次出售标志着这位演员的一笔重要房产交易。"
      },
      "fr": {
        "title": "La star de \"Seul à la maison\" Macaulay Culkin vend son domaine en Californie pour 14,25 millions de dollars",
        "summary": "Macaulay Culkin a discrètement vendu son domaine en Californie pour 14,25 millions de dollars, un an après avoir discuté de sa vie de \"papa casanier\" avec sa partenaire Brenda Song. La vente marque une importante transaction immobilière pour l'acteur."
      },
      "de": {
        "title": "\"Allein zu Hause\"-Star Macaulay Culkin verkauft sein kalifornisches Anwesen für 14,25 Millionen Dollar",
        "summary": "Macaulay Culkin verkaufte sein kalifornisches Anwesen stillschweigend für 14,25 Millionen Dollar, ein Jahr, nachdem er mit seiner Partnerin Brenda Song über sein Leben als \"Homebody-Vater\" sprach. Der Verkauf kennzeichnet eine bedeutende Immobilientransaktion für den Schauspieler."
      },
      "es": {
        "title": "La estrella de \"Solo en casa\" Macaulay Culkin vende su finca de California por $14,25 millones",
        "summary": "Macaulay Culkin vendió silenciosamente su finca de California por $14,25 millones, un año después de hablar sobre su vida como \"papá casero\" con su pareja Brenda Song. La venta marca una importante transacción inmobiliaria para el actor."
      }
    }
  },
  {
    "title": "Khamenei's death raises questions about Trump's China trip",
    "slug": "khamenei-death-trump-china-trip",
    "url": "https://www.cnbc.com/2026/03/02/khameneis-death-trump-china-visit-uncertainty-iran-strikes-trade-truce.html",
    "source": "CNBC",
    "date": "2026-03-02T09:49:08.000Z",
    "summary": "Ayatollah Khamenei's death complicates Trump's scheduled late-March China visit amid tense trade relations. The Iranian leadership transition adds uncertainty to diplomatic timing.",
    "content": "U.S. President Donald Trump has been scheduled to visit China at the end of March, following tense trade relations with Beijing.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "哈梅内伊去世引发对特朗普中国之行的疑问",
        "summary": "阿亚图拉·哈梅内伊的去世使特朗普计划的3月末中国访问变得复杂，贸易关系紧张。伊朗领导力过渡为外交时机增添了不确定性。"
      },
      "fr": {
        "title": "La mort de Khamenei soulève des questions sur le voyage en Chine de Trump",
        "summary": "La mort de l'Ayatollah Khamenei complique la visite prévue en Chine de Trump à la fin mars, au milieu des relations commerciales tendues. La transition du leadership iranien ajoute de l'incertitude au calendrier diplomatique."
      },
      "de": {
        "title": "Chameneis Tod wirft Fragen zum China-Besuch Trumps auf",
        "summary": "Der Tod von Ayatollah Chamenei erschwert Trumps geplanten Besuch in China Ende März inmitten angespannter Handelsbeziehungen. Der iranische Führungswechsel sorgt für Unsicherheit beim diplomatischen Zeitplan."
      },
      "es": {
        "title": "La muerte de Jamenei plantea preguntas sobre el viaje de Trump a China",
        "summary": "La muerte del Ayatola Jamenei complica la visita programada de Trump a China a finales de marzo en medio de tensas relaciones comerciales. La transición del liderazgo iraní añade incertidumbre al calendario diplomático."
      }
    }
  },
  {
    "title": "The digital front: Iran’s internet down for second day amid reports of U.S.-Israel cyberattacks",
    "slug": "iran-internet-down-us-israel-cyberattacks",
    "url": "https://www.cnbc.com/2026/03/02/irans-internet-down-amid-reports-of-us-israel-cyberattacks.html",
    "source": "CNBC",
    "date": "2026-03-02T09:26:48.000Z",
    "summary": "Iran is experiencing widespread internet outages following reported U.S.-Israeli cyberattacks over the weekend. The disruptions mark a significant escalation in digital warfare tactics.",
    "content": "Iran is facing widespread internet disruptions following the U.S.-Israeli airstrikes over the weekend.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "数字前线：伊朗互联网中断第二天，美以网络攻击报告频出",
        "summary": "伊朗在美国和以色列报道的网络攻击后经历了广泛的互联网中断。这些中断标志着数字战争战术的重大升级。"
      },
      "fr": {
        "title": "Le front numérique : Internet en Iran coupé pour le deuxième jour suite aux rapports de cyberattaques États-Unis-Israël",
        "summary": "L'Iran connaît des pannes Internet généralisées suite aux cyberattaques signalées des États-Unis et d'Israël le week-end. Les perturbations marquent une escalade significative dans les tactiques de guerre numérique."
      },
      "de": {
        "title": "Die digitale Front: Irans Internet für zweiten Tag ausgefallen inmitten von Berichten über US-Israel-Cyberangriffen",
        "summary": "Der Iran erlebt weitverbreitete Internetausfälle nach gemeldeten US-israelischen Cyberangriffen am Wochenende. Die Störungen markieren eine signifikante Eskalation in den Taktiken der digitalen Kriegsführung."
      },
      "es": {
        "title": "El frente digital: Internet en Irán desconectado por segundo día entre informes de ciberataques de EE.UU.-Israel",
        "summary": "Irán está experimentando apagones de Internet generalizados tras los ciberataques informados de EE.UU. e Israel durante el fin de semana. Las interrupciones marcan una escalada significativa en las tácticas de guerra digital."
      }
    }
  },
  {
    "title": "How Iran chooses its supreme leader, and who could be next?",
    "slug": "iran-supreme-leader-selection-khamenei",
    "url": "https://www.cnbc.com/2026/03/02/iran-ayatollah-trump-supreme-leader.html",
    "source": "CNBC",
    "date": "2026-03-02T07:52:05.000Z",
    "summary": "Ayatollah Khamenei's death following joint U.S.-Israeli airstrikes forces Iran to select a new supreme leader. The succession process will shape the country's political and strategic direction.",
    "content": "Ayatollah Khamenei's death following the joint U.S.-Israeli airstrikes has compelled country's leadership to confront the task of selecting a new supreme leader.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "伊朗如何选择最高领导人，下一个会是谁？",
        "summary": "美以联合空袭后阿亚图拉·哈梅内伊去世，迫使伊朗选择新的最高领导人。继任过程将塑造该国的政治和战略方向。"
      },
      "fr": {
        "title": "Comment l'Iran choisit son leader suprême, et qui pourrait être le suivant ?",
        "summary": "La mort de l'Ayatollah Khamenei suite aux frappes aériennes conjointes États-Unis-Israël force l'Iran à choisir un nouveau leader suprême. Le processus de succession façonnera la direction politique et stratégique du pays."
      },
      "de": {
        "title": "Wie der Iran seinen Obersten Führer wählt und wer könnte der nächste sein?",
        "summary": "Der Tod von Ayatollah Chamenei nach gemeinsamen US-israelischen Luftangriffen zwingt den Iran, einen neuen Obersten Führer zu wählen. Der Nachfolgeprozess wird die politische und strategische Ausrichtung des Landes prägen."
      },
      "es": {
        "title": "¿Cómo elige Irán a su líder supremo y quién podría ser el siguiente?",
        "summary": "La muerte del Ayatola Jamenei tras los ataques aéreos conjuntos de EE.UU. e Israel obliga a Irán a elegir un nuevo líder supremo. El proceso de sucesión dará forma a la dirección política y estratégica del país."
      }
    }
  },
  {
    "title": "Live updates: Iran security chief Ali Larijani rejects U.S. talks, blames Trump for 'chaos'",
    "slug": "iran-security-chief-ali-larijani-rejects-us-talks",
    "url": "https://www.cnbc.com/2026/03/02/us-iran-live-updates-trump-oil-gold.html",
    "source": "CNBC",
    "date": "2026-03-02T06:22:33.000Z",
    "summary": "Iran's security chief Ali Larijani rejected direct talks with the U.S., blaming Trump for regional instability following a major U.S.-Israel military strike that killed Iran's Supreme Leader. The rejection signals Tehran's hardened stance in the escalating conflict.",
    "content": "Follow the latest news after the U.S. and Israel launched a massive attack on Iran that killed Iran's Supreme Leader Ayatollah Ali Khamenei.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "实时更新：伊朗安全总长拉里贾尼拒绝与美国谈判，指责特朗普造成\"混乱\"",
        "summary": "伊朗安全总长阿里·拉里贾尼拒绝与美国进行直接谈判，指责特朗普在美以联合军事打击杀死伊朗最高领袖后造成地区不稳定。这一拒绝表明德黑兰在不断升级的冲突中态度强硬。"
      },
      "fr": {
        "title": "Mise à jour en direct : le chef de la sécurité iranienne Ali Larijani refuse les pourparlers avec les États-Unis, blâme Trump pour le 'chaos'",
        "summary": "Le chef de la sécurité iranienne Ali Larijani a rejeté les pourparlers directs avec les États-Unis, blâmant Trump de l'instabilité régionale suite à une frappe militaire majeure entre les États-Unis et Israël qui a tué le Guide suprême de l'Iran. Le rejet signale le durcissement de la position de Téhéran dans le conflit qui s'intensifie."
      },
      "de": {
        "title": "Live-Updates: Iranischer Sicherheitschef Ali Larijani lehnt US-Gespräche ab, beschuldigt Trump des 'Chaos'",
        "summary": "Irans Sicherheitschef Ali Larijani lehnte direkte Gespräche mit den USA ab und machte Trump für regionale Instabilität nach einem großen US-israelischen Militärschlag verantwortlich, der Irans Obersten Führer tötete. Die Ablehnung signalisiert Teherans verhärtete Position in dem eskalierenden Konflikt."
      },
      "es": {
        "title": "Actualizaciones en vivo: el jefe de seguridad iraní Ali Larijani rechaza conversaciones con EE.UU., culpa a Trump del 'caos'",
        "summary": "El jefe de seguridad de Irán Ali Larijani rechazó conversaciones directas con Estados Unidos, culpando a Trump de la inestabilidad regional tras un gran ataque militar conjunto entre EE.UU. e Israel que mató al Líder Supremo de Irán. El rechazo señala la posición endurecida de Teherán en el conflicto que se intensifica."
      }
    }
  },
  {
    "title": "European stocks set to slump as markets react to U.S., Israeli strikes on Iran",
    "slug": "european-stocks-set-to-slump-iran-strikes",
    "url": "https://www.cnbc.com/2026/03/02/european-markets-stoxx-600-ftse-dax-cac-iran-strikes-reaction.html",
    "source": "CNBC",
    "date": "2026-03-02T06:08:12.000Z",
    "summary": "European stock markets are expected to open sharply lower as investors react to U.S. and Israeli military strikes on Iran. The negative sentiment reflects growing concerns over regional escalation and its economic impact.",
    "content": "European stocks are expected to start the new trading week firmly in negative territory.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "欧洲股市将大幅下跌，因市场对美国、以色列对伊朗的打击作出反应",
        "summary": "随着投资者对美国和以色列对伊朗的军事打击做出反应，欧洲股市预计将大幅低开。负面情绪反映了对地区升级及其经济影响日益增长的担忧。"
      },
      "fr": {
        "title": "Les actions européennes devraient plonger alors que les marchés réagissent aux frappes américaines et israéliennes sur l'Iran",
        "summary": "Les marchés boursiers européens devraient ouvrir nettement plus bas à mesure que les investisseurs réagissent aux frappes militaires américaines et israéliennes contre l'Iran. Le sentiment négatif reflète les préoccupations croissantes concernant l'escalade régionale et ses impacts économiques."
      },
      "de": {
        "title": "Europäische Aktien werden einbrechen, da Märkte auf US- und israelische Anschläge auf den Iran reagieren",
        "summary": "Europäische Aktienmärkte werden voraussichtlich deutlich niedriger eröffnen, da Anleger auf US- und israelische Militäranschläge auf den Iran reagieren. Die negative Stimmung widerspiegelt wachsende Bedenken über regionale Eskalation und ihre wirtschaftlichen Auswirkungen."
      },
      "es": {
        "title": "Las acciones europeas se desplomarán mientras los mercados reaccionan a los ataques estadounidenses e israelíes a Irán",
        "summary": "Se espera que los mercados bursátiles europeos abran significativamente más bajos a medida que los inversores reaccionan a los ataques militares estadounidenses e israelíes contra Irán. El sentimiento negativo refleja crecientes preocupaciones sobre la escalada regional y su impacto económico."
      }
    }
  },
  {
    "title": "Iran conflict: Where things stand, global responses — and what comes next",
    "slug": "iran-conflict-where-things-stand-global-responses",
    "url": "https://www.cnbc.com/2026/03/02/iran-israel-us-conflict-oil-jumps-trump-netanyahu-what-is-next.html",
    "source": "CNBC",
    "date": "2026-03-02T05:28:28.000Z",
    "summary": "The U.S.-Israel conflict with Iran has entered its third day with both sides threatening further escalation, while countries worldwide respond to the widening crisis. The situation remains fluid with no clear de-escalation path.",
    "content": "The U.S.-Israel conflict with Iran is extending into its third day with each side pledging escalation.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "伊朗冲突：事态发展、全球反应——接下来会发生什么",
        "summary": "美以与伊朗的冲突已进入第三天，双方威胁进一步升级，同时世界各国对不断扩大的危机作出反应。局势仍不明朗，没有明确的缓和路径。"
      },
      "fr": {
        "title": "Conflit en Iran : où les choses en sont, réactions mondiales — et ce qui vient ensuite",
        "summary": "Le conflit entre les États-Unis et Israël avec l'Iran est entré dans sa troisième journée, les deux côtés menaçant d'une nouvelle escalade, tandis que les pays du monde entier réagissent à la crise qui s'élargit. La situation reste fluide sans voie de désescalade claire."
      },
      "de": {
        "title": "Iran-Konflikt: Wie die Dinge stehen, globale Reaktionen — und was kommt als nächstes",
        "summary": "Der US-israelische Konflikt mit dem Iran hat seinen dritten Tag erreicht, wobei beide Seiten eine weitere Eskalation androhen, während Länder weltweit auf die sich ausbreitende Krise reagieren. Die Situation bleibt unklar ohne klaren Deeskalationsweg."
      },
      "es": {
        "title": "Conflicto en Irán: cómo están las cosas, respuestas globales — y qué viene después",
        "summary": "El conflicto entre EE.UU. e Israel con Irán ha entrado en su tercer día con ambos lados amenazando una mayor escalada, mientras que países de todo el mundo responden a la crisis que se amplía. La situación sigue siendo fluida sin un camino claro hacia la desescalada."
      }
    }
  },
  {
    "title": "Asia airline stocks drop while energy shares rise as Iran conflict escalates",
    "slug": "asia-airline-stocks-drop-energy-shares-rise-iran",
    "url": "https://www.cnbc.com/2026/03/02/asia-markets-live-trump-iran-oil-prices-nikkei-hang-seng-us-israel-strikes-oil.html",
    "source": "CNBC",
    "date": "2026-03-02T04:19:35.000Z",
    "summary": "Oil futures surged over 8% as the Iran conflict intensifies, with WTI and Brent crude trading at $72.52 and $79.04 respectively, driving declines in airline stocks while energy shares gain. The oil market reaction underscores supply concerns from the geopolitical tension.",
    "content": "Oil futures on Monday jumped by over 8%, with West Texas Intermediate futures and Brent trading at $72.52 and $79.04 per barrel respectively.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "伊朗冲突升级，亚洲航空股下跌而能源股上升",
        "summary": "随着伊朗冲突加剧，油期货飙升超过8%，WTI和布伦特原油分别交易价格为72.52美元和79.04美元，导致航空股下跌，而能源股上升。油市反应凸显地缘政治紧张带来的供应担忧。"
      },
      "fr": {
        "title": "Les actions des compagnies aériennes asiatiques baissent tandis que les actions énergétiques augmentent à mesure que le conflit iranien s'intensifie",
        "summary": "Les contrats à terme sur le pétrole ont bondi de plus de 8% alors que le conflit iranien s'intensifie, le WTI et le pétrole brut Brent se négociant respectivement à 72,52 $ et 79,04 $, entraînant des baisses des actions des compagnies aériennes tandis que les actions énergétiques progressent. La réaction du marché pétrolier souligne les préoccupations concernant l'approvisionnement dues à la tension géopolitique."
      },
      "de": {
        "title": "Asiatische Fluggesellschaftsaktien fallen, während Energieaktien bei Eskalation des Iran-Konflikts steigen",
        "summary": "Die Ölkontraktpreise stiegen um über 8%, da sich der Iran-Konflikt verschärft, mit WTI und Brent-Rohöl, die jeweils bei 72,52 $ und 79,04 $ gehandelt werden, was zu Rückgängen bei Fluggesellschaftsaktien führt, während Energieaktien gewinnen. Die Ölmarktreaktion unterstreicht Versorgungsbedenken aufgrund der geopolitischen Spannungen."
      },
      "es": {
        "title": "Las acciones de las aerolíneas asiáticas caen mientras que las acciones de energía suben a medida que el conflicto de Irán se intensifica",
        "summary": "Los futuros del petróleo se dispararon más del 8% a medida que el conflicto de Irán se intensifica, con el WTI y el crudo Brent cotizando a $72.52 y $79.04 respectivamente, impulsando caídas en las acciones de aerolíneas mientras que las acciones de energía ganan terreno. La reacción del mercado petrolero subraya las preocupaciones de suministro por la tensión geopolítica."
      }
    }
  },
  {
    "title": "Anthropic’s Claude tops App Store charts as backlash builds against OpenAI’s ChatGPT",
    "slug": "anthropic-claude-tops-app-store-openai-backlash",
    "url": "https://www.marketwatch.com/story/anthropics-claude-tops-app-store-charts-as-backlash-builds-against-openais-chatgpt-3fdce792?mod=mw_rss_topstories",
    "source": "MarketWatch",
    "date": "2026-03-02T01:32:00.000Z",
    "summary": "Anthropic's Claude AI app is climbing Apple's App Store charts as OpenAI's ChatGPT faces user backlash over a new Department of Defense partnership deal. The shift reflects growing competition and user sensitivity to military applications.",
    "content": "OpenAI faces some user criticism over its new deal with the Department of Defense.",
    "category": "economic",
    "translations": {
      "zh": {
        "title": "在用户反对OpenAI ChatGPT的浪潮中，Anthropic的Claude登顶App Store排行榜",
        "summary": "随着OpenAI的ChatGPT因新的国防部合作协议而面临用户反对，Anthropic的Claude AI应用正在苹果App Store排行榜上攀升。这一转变反映了日益增长的竞争和用户对军事应用的敏感性。"
      },
      "fr": {
        "title": "Claude d'Anthropic arrive en tête des classements de l'App Store tandis que le contrecoup contre ChatGPT d'OpenAI s'intensifie",
        "summary": "L'application Claude AI d'Anthropic grimpe dans les classements de l'Apple App Store alors que ChatGPT d'OpenAI fait face à une réaction négative des utilisateurs concernant un nouvel accord de partenariat avec le Département de la Défense. Ce changement reflète une concurrence croissante et une sensibilité des utilisateurs aux applications militaires."
      },
      "de": {
        "title": "Anthropic's Claude führt die App Store-Charts an, während sich Gegenwehr gegen OpenAI's ChatGPT aufbaut",
        "summary": "Die Claude-KI-App von Anthropic klettert in den Apple App Store-Charts, während OpenAIs ChatGPT wegen eines neuen Partnerschaftsabkommens mit dem Verteidigungsministerium mit Gegenwind von Benutzern konfrontiert ist. Die Verschiebung spiegelt wachsende Konkurrenz und Benutzersensibilität gegenüber Militäranwendungen wider."
      },
      "es": {
        "title": "Claude de Anthropic encabeza los gráficos de la App Store mientras crece la reacción adversa contra ChatGPT de OpenAI",
        "summary": "La aplicación Claude AI de Anthropic está subiendo en los gráficos de la App Store de Apple mientras ChatGPT de OpenAI enfrenta reacciones negativas de usuarios por un nuevo acuerdo de asociación con el Departamento de Defensa. El cambio refleja la creciente competencia y la sensibilidad de los usuarios a las aplicaciones militares."
      }
    }
  }
]