[
  {
    "title": "How Guehi & Dias partnership shone against Leeds",
    "slug": "guehi-dias-partnership-manchester-city-leeds",
    "url": "https://www.bbc.com/sport/football/videos/cg4gnk2qkndo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T23:55:14.000Z",
    "summary": "Marc Guehi and Ruben Dias formed an impressive defensive partnership in Manchester City's 1-0 victory over Leeds, anchoring the team's clean sheet performance according to expert analysis.",
    "content": "Match of the Day pundits Alan Shearer and Ashley Williams look at Marc Guehi's impressive partnership with Ruben Dias in Manchester City's 1-0 win at Leeds.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "盖埃希与迪亚斯的搭档在利兹的精彩表现",
        "summary": "马克·盖埃希和鲁本·迪亚斯在曼城1-0击败利兹的比赛中形成了令人印象深刻的防线搭档，根据专家分析，他们巩固了球队的零封表现。"
      },
      "fr": {
        "title": "Comment le partenariat Guehi et Dias a brillé contre Leeds",
        "summary": "Marc Guehi et Ruben Dias ont formé un partenariat défensif impressionnant dans la victoire 1-0 de Manchester City contre Leeds, renforçant la performance de clean sheet de l'équipe selon l'analyse des experts."
      },
      "de": {
        "title": "Wie die Partnerschaft von Guehi und Dias gegen Leeds glänzte",
        "summary": "Marc Guehi und Ruben Dias bildeten eine beeindruckende Abwehrpartnerschaft in Manchester Citys 1:0-Sieg gegen Leeds und verankerten die Zu-Null-Leistung des Teams laut Expertenanalyse."
      },
      "es": {
        "title": "Cómo la asociación de Guehi y Días brilló contra Leeds",
        "summary": "Marc Guehi y Rubén Días formaron una impresionante asociación defensiva en la victoria 1-0 del Manchester City sobre Leeds, consolidando la actuación de portería invicta del equipo según el análisis de expertos."
      }
    }
  },
  {
    "title": "'Handball rule is a mess' - Shearer unimpressed by Burnley VAR decision",
    "slug": "handball-rule-mess-shearer-burnley-var",
    "url": "https://www.bbc.com/sport/football/videos/c1kgpj73z4jo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T23:54:27.000Z",
    "summary": "Alan Shearer criticized the handball rule following a controversial VAR decision in Burnley's match, arguing the current regulations are unclear and poorly enforced.",
    "content": "'Handball rule is a mess' - Alan Shearer unimpressed by Burnley VAR decision.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"手球规则是一团糟\" - 谢雷尔对伯恩利VAR判罚不满",
        "summary": "阿兰·谢雷尔批评了伯恩利比赛中一个有争议的VAR判罚后的手球规则，认为现有规则不清楚且执行不力。"
      },
      "fr": {
        "title": "\"La règle du handball est un désastre\" - Shearer mécontent de la décision VAR de Burnley",
        "summary": "Alan Shearer a critiqué la règle du handball suite à une décision VAR controversée dans le match de Burnley, arguant que les règlements actuels sont flous et mal appliqués."
      },
      "de": {
        "title": "\"Die Handballregel ist ein Durcheinander\" - Shearer unzufrieden mit Burnleys VAR-Entscheidung",
        "summary": "Alan Shearer kritisierte die Handballregel nach einer umstrittenen VAR-Entscheidung in Burnleys Spiel und argumentierte, dass die aktuellen Bestimmungen unklar und schlecht durchgesetzt sind."
      },
      "es": {
        "title": "\"La regla de handball es un desastre\" - Shearer descontento con la decisión del VAR de Burnley",
        "summary": "Alan Shearer criticó la regla de handball después de una decisión controvertida del VAR en el partido de Burnley, argumentando que las regulaciones actuales son confusas y mal aplicadas."
      }
    }
  },
  {
    "title": "Kane eyes Lewa goal record after Klassiker brace",
    "slug": "kane-lewandowski-goal-record-bayern-dortmund",
    "url": "https://www.espn.com/soccer/story/_/id/48064869/harry-kane-robert-lewandowski-bundesliga-goal-record-klassiker",
    "source": "ESPN Soccer",
    "date": "2026-02-28T23:28:20.000Z",
    "summary": "Harry Kane is pursuing Robert Lewandowski's Bundesliga record of 41 goals in a season after scoring twice in Bayern Munich's 3-2 comeback victory over Borussia Dortmund.",
    "content": "Harry Kane is targeting Robert Lewandowski's Bundesliga record of 41 goals in a season after notching another two in Bayern Munich's 3-2 win over Borussia Dortmund on Saturday.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "凯恩追逐莱万进球纪录 经典战双响",
        "summary": "哈里·凯恩在拜仁慕尼黑客场3-2逆转多特蒙德的比赛中打进两球，追逐罗伯特·莱万多夫斯基的德甲单赛季41球纪录。"
      },
      "fr": {
        "title": "Kane pourchasse le record de buts de Lewandowski après un doublé au Klassiker",
        "summary": "Harry Kane poursuit le record de la Bundesliga de Robert Lewandowski (41 buts en une saison) après avoir marqué deux fois lors de la victoire 3-2 au retour du Bayern Munich contre le Borussia Dortmund."
      },
      "de": {
        "title": "Kane zielt auf Lewandowskis Torrekord ab nach Klassiker-Doppelpack",
        "summary": "Harry Kane verfolgt Robert Lewandowskis Bundesliga-Rekord von 41 Toren in einer Saison, nachdem er beim 3:2-Comeback-Sieg des FC Bayern gegen Borussia Dortmund zweimal traf."
      },
      "es": {
        "title": "Kane persigue el récord de goles de Lewandowski tras doblete en el Clásico",
        "summary": "Harry Kane persigue el récord de la Bundesliga de Robert Lewandowski de 41 goles en una temporada después de marcar dos veces en la victoria 3-2 de remontada del Bayern Munich sobre el Borussia Dortmund."
      }
    }
  },
  {
    "title": "Pep condemns boos during Ramadan fasting break",
    "slug": "pep-condemns-boos-ramadan-fasting-break",
    "url": "https://www.espn.com/soccer/story/_/id/48063518/pep-guardiola-kick-condemn-booing-man-city-ramadan-leeds-united-elland-road",
    "source": "ESPN Soccer",
    "date": "2026-02-28T23:28:20.000Z",
    "summary": "Pep Guardiola condemned Leeds United supporters who booed a first-half stoppage allowing players observing Ramadan to break their fast during Manchester City's match at Elland Road.",
    "content": "A first-half stoppage allowing players who are observing Ramadan to break their fast was booed by sections of Leeds United supporters at Elland Road.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "瓜帅谴责球迷在斋月祈祷时间的嘘声",
        "summary": "瓜迪奥拉谴责利兹联球迷在曼城客场对阵埃兰路的比赛中，在上半场为遵守斋月禁食的球员提供休息时间时发出的嘘声。"
      },
      "fr": {
        "title": "Pep condamne les huées lors de la pause du jeûne du Ramadan",
        "summary": "Pep Guardiola a condamné les supporters de Leeds United qui ont hué l'arrêt de la première mi-temps permettant aux joueurs observant le Ramadan de rompre leur jeûne lors du match de Manchester City à Elland Road."
      },
      "de": {
        "title": "Pep verurteilt Buhrufe während der Ramadan-Fastenpause",
        "summary": "Pep Guardiola verurteilte Leeds-United-Anhänger, die die Pause in der ersten Halbzeit booten, um Spielern, die den Ramadan beobachteten, zu ermöglichen, ihr Fasten zu brechen, während des Spiels von Manchester City auf dem Elland Road."
      },
      "es": {
        "title": "Pep condena los abucheos durante el descanso del ayuno de Ramadán",
        "summary": "Pep Guardiola condenó a los aficionados del Leeds United que abuchearon la pausa de la primera mitad que permitía a los jugadores que observaban el Ramadán romper su ayuno durante el partido del Manchester City en Elland Road."
      }
    }
  },
  {
    "title": "Barça's Yamal after 1st hat trick: I'm happy again",
    "slug": "yamal-first-hat-trick-barcelona-happy",
    "url": "https://www.espn.com/soccer/story/_/id/48063364/lamine-yamal-first-career-hat-trick-barcelona-happy-again",
    "source": "ESPN Soccer",
    "date": "2026-02-28T23:28:20.000Z",
    "summary": "Barcelona forward Lamine Yamal scored his first career hat trick and expressed renewed enjoyment in football after experiencing a difficult spell earlier in the season.",
    "content": "Lamine Yamal has revealed he has not felt good this season but says he is finally enjoying football again after scoring the first hat trick of his career",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "巴萨的亚马尔首次帽子戏法后：我又开心了",
        "summary": "巴塞罗那前锋拉明·亚马尔打进职业生涯首个帽子戏法，并在经历赛季早期的困难时期后表示对足球重拾热情。"
      },
      "fr": {
        "title": "Yamal de Barça après son premier hat-trick : Je suis heureux à nouveau",
        "summary": "L'attaquant du FC Barcelone Lamine Yamal a marqué son premier hat-trick en carrière et a exprimé une joie retrouvée pour le football après avoir traversé une période difficile plus tôt dans la saison."
      },
      "de": {
        "title": "Barcelonas Yamal nach seinem ersten Hattrick: Mir geht es wieder gut",
        "summary": "Der Barcelona-Stürmer Lamine Yamal erzielte seinen ersten Karriere-Hattrick und drückte erneuerte Freude am Fußballspiel aus, nachdem er früher in der Saison eine schwierige Phase durchlebte."
      },
      "es": {
        "title": "El Yamal del Barça tras su primer hat-trick: Estoy feliz de nuevo",
        "summary": "El delantero del Barcelona Lamine Yamal anotó su primer hat-trick en carrera y expresó renovado disfrute del fútbol después de experimentar un período difícil anteriormente en la temporada."
      }
    }
  },
  {
    "title": "Sources: Thorns hire ex-Spurs coach Vilahamn",
    "slug": "thorns-hire-vilahamn-head-coach",
    "url": "https://www.espn.com/soccer/story/_/id/48065756/portland-thorns-new-coach-tottenham-robert-vilahamn-nwsl",
    "source": "ESPN Soccer",
    "date": "2026-02-28T23:28:20.000Z",
    "summary": "The Portland Thorns announced the hiring of Robert Vilahamn as head coach following an extensive managerial search after his previous tenure with Tottenham.",
    "content": "The Portland Thorns have hired Robert Vilahamn as head coach, multiple sources confirmed to ESPN, after a lengthy search.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "消息人士：刺儿队聘请前热刺教练维拉汉姆",
        "summary": "波特兰刺儿队宣布聘请罗伯特·维拉汉姆为主教练，此前他曾在托特纳姆执教，球队进行了广泛的主教练搜索。"
      },
      "fr": {
        "title": "Sources: Les Thorns embauchent l'ancien entraîneur de Tottenham Vilahamn",
        "summary": "Les Portland Thorns ont annoncé l'embauche de Robert Vilahamn en tant qu'entraîneur-chef suite à une vaste recherche d'entraîneur après sa précédente période avec Tottenham."
      },
      "de": {
        "title": "Quellen: Thorns stellen Ex-Spurs-Trainer Vilahamn ein",
        "summary": "Die Portland Thorns kündigten die Einstellung von Robert Vilahamn als Cheftrainer nach einer umfangreichen Trainersuche nach seinem vorherigen Engagement bei Tottenham an."
      },
      "es": {
        "title": "Fuentes: Thorns contratan al ex entrenador del Tottenham Vilahamn",
        "summary": "Los Portland Thorns anunciaron la contratación de Robert Vilahamn como entrenador en jefe tras una exhaustiva búsqueda de entrenador después de su anterior etapa con el Tottenham."
      }
    }
  },
  {
    "title": "USMNT's Balogun maintains red-hot Monaco form",
    "slug": "balogun-monaco-form-ligue-1",
    "url": "https://www.espn.com/soccer/story/_/id/48065962/usa-folarin-balogun-goal-monaco-form-world-cup",
    "source": "ESPN Soccer",
    "date": "2026-02-28T23:28:20.000Z",
    "summary": "USMNT forward Folarin Balogun continued his impressive scoring form with a goal in Monaco's 2-0 Ligue 1 victory over Angers, maintaining his hot streak this season.",
    "content": "American forward Folarin Balogun continued his excellent run of form with another goal as Monaco defeated Angers 2-0 in Ligue 1 on Saturday.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "美国国家队球员巴洛贡保持摩纳哥火热状态",
        "summary": "美国国家队前锋福拉林·巴洛贡在摩纳哥2-0战胜昂热的法甲比赛中打进一球，继续保持本赛季的连胜状态。"
      },
      "fr": {
        "title": "Balogun de l'USMNT maintient sa forme brûlante à Monaco",
        "summary": "L'attaquant de l'USMNT Folarin Balogun a continué sa forme impressionnante en marquant lors de la victoire 2-0 de Monaco en Ligue 1 contre Angers, maintenant sa série positive cette saison."
      },
      "de": {
        "title": "USMNTs Balogun behält glänzende Form in Monaco",
        "summary": "Der USMNT-Stürmer Folarin Balogun setzte seine beeindruckende Torform mit einem Tor bei Monacos 2:0-Sieg in der Ligue 1 gegen Angers fort und behielt seine hervorragende Form in dieser Saison."
      },
      "es": {
        "title": "Balogun de USMNT mantiene forma ardiente en Mónaco",
        "summary": "El delantero de USMNT Folarin Balogun continuó su forma impresionante anotando un gol en la victoria 2-0 de Mónaco en la Ligue 1 contra Angers, manteniendo su racha positiva esta temporada."
      }
    }
  },
  {
    "title": "'Exceptional' Wrexham's promotion push rolls on",
    "slug": "wrexham-promotion-push-championship",
    "url": "https://www.espn.com/soccer/story/_/id/48063091/phil-parkinson-praises-wrexham-championship-promotion-push-oliver-rathbone",
    "source": "ESPN Soccer",
    "date": "2026-02-28T23:28:20.000Z",
    "summary": "Wrexham extended their impressive away record in the Championship with a 1-0 win at Charlton, keeping their promotion push on track under Phil Parkinson's leadership.",
    "content": "Phil Parkinson praised the tenacity of his Wrexham side as they maintained their fine away record in the Championship with a 1-0 success at Charlton.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"杰出\"的雷克瑟姆升级推动继续进行",
        "summary": "雷克瑟姆在英冠中保持印象深刻的客场记录，以1-0战胜查尔顿，在菲尔·帕金森的带领下保持升级势头。"
      },
      "fr": {
        "title": "La poussée de promotion \"exceptionnelle\" de Wrexham continue",
        "summary": "Wrexham a prolongé son impressionnant bilan à l'extérieur en Championnat avec une victoire 1-0 à Charlton, maintenant sa poussée de promotion en bonne voie sous la direction de Phil Parkinson."
      },
      "de": {
        "title": "\"Außergewöhnlicher\" Aufstiegskampf von Wrexham läuft weiter",
        "summary": "Wrexham verlängerte seine beeindruckende Auswärtsbilanz im Championship mit einem 1:0-Sieg in Charlton und behielt unter Phil Parkinsons Führung seinen Aufstiegskampf bei."
      },
      "es": {
        "title": "El empuje de promoción \"excepcional\" del Wrexham continúa",
        "summary": "Wrexham extendió su impresionante récord de visita en el Campeonato con una victoria 1-0 en Charlton, manteniendo su empuje promocional en buen camino bajo el liderazgo de Phil Parkinson."
      }
    }
  },
  {
    "title": "Lukaku in tears after 1st goal since father's death",
    "slug": "lukaku-tears-first-goal-father-death",
    "url": "https://www.espn.com/soccer/story/_/id/48064337/romelu-lukaku-napoli-first-goal-tears-healls-verona",
    "source": "ESPN Soccer",
    "date": "2026-02-28T23:28:20.000Z",
    "summary": "Romelu Lukaku scored his first goal of the season in an emotional performance following his father's death, marking a breakthrough in both personal and professional struggles.",
    "content": "An emotional Romelu Lukaku fought back tears after scoring his first goal of a season that has brought both extreme professional and personal struggles.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "卢卡库父亲去世后首粒进球时泪流满面",
        "summary": "罗梅卢·卢卡库在一场充满情感的比赛中打入赛季首粒进球，这是在他父亲去世后的表现，标志着个人和职业困境的突破。"
      },
      "fr": {
        "title": "Lukaku en larmes après son premier but depuis la mort de son père",
        "summary": "Romelu Lukaku a marqué son premier but de la saison lors d'une performance émouvante suite au décès de son père, marquant une avancée dans ses luttes personnelles et professionnelles."
      },
      "de": {
        "title": "Lukaku in Tränen nach erstem Tor seit Vaters Tod",
        "summary": "Romelu Lukaku erzielte sein erstes Tor der Saison in einer emotionalen Leistung nach dem Tod seines Vaters und markiert damit einen Durchbruch in seinen persönlichen und beruflichen Kämpfen."
      },
      "es": {
        "title": "Lukaku en lágrimas tras su primer gol desde la muerte de su padre",
        "summary": "Romelu Lukaku marcó su primer gol de la temporada en una actuación emotiva tras la muerte de su padre, marcando un punto de inflexión en sus luchas personales y profesionales."
      }
    }
  },
  {
    "title": "Carrick not interested in personal Glasner duel",
    "slug": "carrick-glasner-manchester-united-crystal-palace",
    "url": "https://www.bbc.com/sport/football/articles/cd03402x4edo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T22:35:21.000Z",
    "summary": "Manchester United interim manager Michael Carrick faces Crystal Palace and Oliver Glasner on Sunday, with Glasner among the top candidates for the permanent United position.",
    "content": "Manchester United interim boss Michael Carrick comes up against one of the major contenders for the permanent job when Oliver Glasner's Crystal Palace go to Old Trafford on Sunday.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "卡里克对个人与格拉斯纳的对决不感兴趣",
        "summary": "曼联代理主帅迈克尔·卡里克周日将面对水晶宫和奥利弗·格拉斯纳，而格拉斯纳是曼联永久主管职位的主要候选人之一。"
      },
      "fr": {
        "title": "Carrick pas intéressé par un duel personnel avec Glasner",
        "summary": "Le directeur intérimaire de Manchester United, Michael Carrick, affrontera Crystal Palace et Oliver Glasner dimanche, Glasner étant parmi les principaux candidats pour le poste permanent à United."
      },
      "de": {
        "title": "Carrick hat kein Interesse an persönlichem Duell mit Glasner",
        "summary": "Der Interimmanager von Manchester United, Michael Carrick, trifft am Sonntag auf Crystal Palace und Oliver Glasner, wobei Glasner einer der Top-Kandidaten für die permanente Managerstelle ist."
      },
      "es": {
        "title": "Carrick no está interesado en un duelo personal con Glasner",
        "summary": "El director interino del Manchester United, Michael Carrick, se enfrenta a Crystal Palace y Oliver Glasner el domingo, siendo Glasner uno de los principales candidatos para el puesto permanente en United."
      }
    }
  },
  {
    "title": "Kane scores twice as Bayern come from behind to beat Dortmund",
    "slug": "kane-scores-bayern-dortmund-bundesliga",
    "url": "https://www.bbc.com/sport/football/videos/cqlgkd044pgo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T22:28:46.000Z",
    "summary": "Harry Kane scored twice in the second half as Bayern Munich staged a comeback to defeat Borussia Dortmund 3-2, extending their Bundesliga lead to 11 points.",
    "content": "Harry Kane scores two second-half goals as Bayern Munich came from behind to beat Borussia Dortmund in a thrilling match and move 11 points clear at the top of the Bundesliga.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "凯恩攻入两球 拜仁逆转战胜多特蒙德",
        "summary": "哈里·凯恩在下半场攻入两球，拜仁慕尼黑完成逆转击败多特蒙德3-2，将英超积分榜领先优势扩大至11分。"
      },
      "fr": {
        "title": "Kane marque deux fois alors que le Bayern remonte et bat Dortmund",
        "summary": "Harry Kane a marqué deux fois en deuxième mi-temps alors que le Bayern Munich a réalisé un retour pour vaincre Borussia Dortmund 3-2, étendant son avance en Bundesliga à 11 points."
      },
      "de": {
        "title": "Kane erzielt zwei Tore, Bayern dreht auf und schlägt Dortmund",
        "summary": "Harry Kane erzielte zwei Tore in der zweiten Halbzeit, als Bayern München ein Comeback hinlegte, um Borussia Dortmund 3-2 zu besiegen und ihren Bundesliga-Vorsprung auf 11 Punkte zu erhöhen."
      },
      "es": {
        "title": "Kane anota dos goles cuando Bayern se recupera y vence a Dortmund",
        "summary": "Harry Kane anotó dos goles en la segunda mitad cuando el Bayern Munich logró un regreso para derrotar al Borussia Dortmund 3-2, extendiendo su ventaja en la Bundesliga a 11 puntos."
      }
    }
  },
  {
    "title": "Free-scoring Semenyo takes burden off Haaland",
    "slug": "semenyo-haaland-manchester-city",
    "url": "https://www.bbc.com/sport/football/articles/cg5nm2n9zzpo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T22:18:16.000Z",
    "summary": "Winger Semenyo's prolific scoring is helping Manchester City distribute attacking responsibility and reduce their historical over-reliance on Erling Haaland in offensive play.",
    "content": "Manchester City have often been accused of being too reliant on Erling Haaland this season. There are signs that could be changing.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "得分能力强的塞门约减轻了哈兰德的负担",
        "summary": "边锋塞门约的高产进球帮助曼城分散进攻责任，减少了他们在进攻中对埃林·哈兰德的历史依赖。"
      },
      "fr": {
        "title": "Le prolifique Semenyo soulage Haaland",
        "summary": "L'ailier Semenyo, avec son scoring prolifique, aide Manchester City à distribuer la responsabilité de l'attaque et à réduire leur dépendance historique à Erling Haaland dans le jeu offensif."
      },
      "de": {
        "title": "Der torreich Semenyo entlastet Haaland",
        "summary": "Flügelstürmer Semenyo hilft Manchester City mit seinen vielen Toren, die Angriffsverantwortung zu verteilen und ihre historische Überabhängigkeit von Erling Haaland im Offensivspiel zu verringern."
      },
      "es": {
        "title": "El prolífico Semenyo alivia la carga de Haaland",
        "summary": "El extremo Semenyo, con su anotación prolífica, está ayudando al Manchester City a distribuir la responsabilidad del ataque y reducir su dependencia histórica de Erling Haaland en el juego ofensivo."
      }
    }
  },
  {
    "title": "Impossible to ignore Millwall - Aaron McLean's EFL takeaways",
    "slug": "millwall-efl-takeaways-saturday",
    "url": "https://www.bbc.com/sport/football/articles/cz7gn30xdrqo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T21:18:32.000Z",
    "summary": "EFL pundit Aaron McLean reviews the standout performances and takeaways from Saturday's action across England's football league divisions.",
    "content": "Final Score EFL pundit Aaron McLean reflects on the highs and lows after Saturday's action.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "无法忽视的米尔沃尔——亚伦·麦克莱恩的EFL分析",
        "summary": "EFL专家亚伦·麦克莱恩评论了周六英格兰足球联赛各级别比赛中的出色表现和关键要点。"
      },
      "fr": {
        "title": "Impossible d'ignorer Millwall - Les analyses EFL d'Aaron McLean",
        "summary": "L'expert EFL Aaron McLean examine les performances remarquables et les enseignements tirés de l'action de samedi dans les divisions de la ligue de football anglaise."
      },
      "de": {
        "title": "Millwall ist unmöglich zu ignorieren - Aaron McLeans EFL-Analyse",
        "summary": "Der EFL-Experte Aaron McLean bespricht die herausragenden Leistungen und Erkenntnisse aus der Samstagsaktion in den Abteilungen der englischen Fußballliga."
      },
      "es": {
        "title": "Imposible ignorar Millwall - Los análisis EFL de Aaron McLean",
        "summary": "El experto EFL Aaron McLean analiza las destacadas actuaciones y conclusiones de la acción del sábado en las divisiones de la liga de fútbol inglesa."
      }
    }
  },
  {
    "title": "Boos heard during Ramadan pause at Elland Road",
    "slug": "boos-ramadan-pause-elland-road",
    "url": "https://www.bbc.com/sport/football/articles/c178x0jppelo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T21:02:18.000Z",
    "summary": "Leeds United supporters booed during a brief stoppage allowing Manchester City players observing Ramadan to break their fast during Saturday's match at Elland Road.",
    "content": "Boos are heard during a brief break in play to allow players observing Ramadan to break their fast during Saturday's match between Leeds United and Manchester City.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "埃兰路球场斋月暂停期间听到嘘声",
        "summary": "周六在埃兰路球场的比赛中，利兹联合队球迷在短暂停赛期间被听到嘘声，此停赛是为了让观察斋月的曼城球员可以打破他们的斋戒。"
      },
      "fr": {
        "title": "Des huées entendues lors d'une pause du Ramadan à Elland Road",
        "summary": "Les supporters de Leeds United ont exprimé leur mécontentement lors d'une brève interruption permettant aux joueurs de Manchester City observant le Ramadan de rompre leur jeûne lors du match de samedi à Elland Road."
      },
      "de": {
        "title": "Buhrufe während einer Ramadan-Pause am Elland Road zu hören",
        "summary": "Leeds-United-Anhänger buhten während einer kurzen Unterbrechung, die Manchester-City-Spielern, die den Ramadan beobachten, ermöglichte, ihr Fasten am Samstag am Elland Road zu brechen."
      },
      "es": {
        "title": "Se escucharon abucheos durante un descanso de Ramadán en Elland Road",
        "summary": "Los aficionados del Leeds United abuchearon durante una breve interrupción que permitía a los jugadores del Manchester City que observan el Ramadán romper su ayuno durante el partido del sábado en Elland Road."
      }
    }
  },
  {
    "title": "Rashford agrees Barcelona deal - Sunday's gossip",
    "slug": "rashford-agrees-barcelona-deal-transfer-gossip",
    "url": "https://www.bbc.com/sport/football/articles/cn0e916y547o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T20:56:55.000Z",
    "summary": "Manchester United's Marcus Rashford has agreed to join Barcelona on a permanent transfer, while Aston Villa pursue Chelsea's Nicolas Jackson and Real Madrid target Manchester City's Rodri. Multiple high-profile player transfers are in motion across European football.",
    "content": "Barcelona's on-loan Manchester United forward Marcus Rashford agrees a deal with the Spanish club, Aston Villa are keen on Chelsea striker Nicolas Jackson, Real Madrid want Manchester City's Rodri, plus more.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "拉什福德同意巴塞罗那交易 - 周日新闻",
        "summary": "曼联的马库斯·拉什福德已同意以永久转会身份加入巴塞罗那，而阿斯顿维拉正在追逐切尔西的尼古拉斯·杰克逊，皇马目标是曼城的罗德里。欧洲足球界正在进行多项高调球员交易。"
      },
      "fr": {
        "title": "Rashford accepte l'accord de Barcelone - Potins du dimanche",
        "summary": "Marcus Rashford de Manchester United a accepté de rejoindre Barcelone en transfert permanent, tandis qu'Aston Villa poursuit Nicolas Jackson de Chelsea et que le Real Madrid cible Rodri de Manchester City. De multiples transferts de joueurs très médiatisés sont en cours dans le football européen."
      },
      "de": {
        "title": "Rashford einigt sich auf Barcelona-Deal - Sonntagsklatsch",
        "summary": "Marcus Rashford von Manchester United hat sich darauf geeinigt, Barcelona als permanenter Transfer zu unterstützen, während Aston Villa Nicolas Jackson von Chelsea verfolgt und Real Madrid Rodri von Manchester City anvisiert. In Europa laufen mehrere hochkarätige Spielertransfers."
      },
      "es": {
        "title": "Rashford acepta acuerdo de Barcelona - Cotilleo del domingo",
        "summary": "Marcus Rashford del Manchester United ha aceptado unirse a Barcelona en una transferencia permanente, mientras que Aston Villa busca a Nicolas Jackson de Chelsea y el Real Madrid apunta a Rodri del Manchester City. Múltiples transferencias de jugadores de alto perfil están en curso en el fútbol europeo."
      }
    }
  },
  {
    "title": "'Manager of season contender' Andrews has Brentford dreaming of Europe",
    "slug": "andrews-brentford-manager-season-europe-dreams",
    "url": "https://www.bbc.com/sport/football/articles/c15x740p2wko?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T20:53:35.000Z",
    "summary": "Brentford manager Keith Andrews, in his debut managerial season, has guided the club to seventh place in the Premier League and is being considered for Manager of the Season honors. The team's success has them dreaming of qualifying for European competition.",
    "content": "That Brentford are seventh in the Premier League is credit to Keith Andrews, who - it is easy to forget - is in his debut season as a manager.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"经理赛季竞争者\"安德鲁斯让布伦特福德梦想欧洲",
        "summary": "布伦特福德经理基思·安德鲁斯在他的首个执教赛季中将球队带至英超第七位，并被考虑获得赛季最佳经理荣誉。球队的成功让他们梦想有资格参加欧洲比赛。"
      },
      "fr": {
        "title": "Andrew fait rêver Brentford d'Europe, candidat au meilleur entraîneur",
        "summary": "Le manager de Brentford Keith Andrews, dans sa première saison d'entraînement, a guidé le club à la septième place de la Premier League et est considéré pour les honneurs du Manager de la saison. Le succès de l'équipe les fait rêver de se qualifier pour la compétition européenne."
      },
      "de": {
        "title": "Andrews lässt Brentford von Europa träumen – Kandidat für Manager des Jahres",
        "summary": "Brentford-Manager Keith Andrews hat den Verein in seiner ersten Trainersaison auf Platz sieben der Premier League geführt und wird für die Auszeichnung als Manager der Saison in Betracht gezogen. Der Erfolg des Teams lässt sie von der Teilnahme an europäischen Wettbewerben träumen."
      },
      "es": {
        "title": "Andrews hace soñar a Brentford con Europa, candidato a Mejor Entrenador",
        "summary": "El manager de Brentford Keith Andrews, en su primera temporada como entrenador, ha guiado al club al séptimo lugar en la Premier League y está siendo considerado para los honores de Manager de la Temporada. El éxito del equipo los hace soñar con calificar para la competencia europea."
      }
    }
  },
  {
    "title": "New set-piece kings Liverpool can still achieve 'something beautiful'",
    "slug": "liverpool-set-piece-kings-beautiful-win-west-ham",
    "url": "https://www.bbc.com/sport/football/articles/c4g2972nrpeo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T20:38:13.000Z",
    "summary": "Liverpool strengthened their Champions League qualification hopes with a dominant 5-2 victory over West Ham, scoring three goals from set-pieces in the first half. The performance demonstrates their improved set-piece efficiency and attacking prowess.",
    "content": "Liverpool boosted their Champions League hopes with a 5-2 win against West Ham, helped by three goals from set-pieces in the first half.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "新的定位球之王利物浦仍可成就\"美好的事\"",
        "summary": "利物浦凭借对西汉姆联的5-2统治性胜利强化了他们的欧冠资格希望，在上半场从定位球中打进三球。这场表现展示了他们改进的定位球效率和进攻能力。"
      },
      "fr": {
        "title": "Les nouveaux rois des coups de pied arrêtés, Liverpool peut encore accomplir quelque chose de \"beau\"",
        "summary": "Liverpool a renforcé ses espoirs de qualification pour la Ligue des champions avec une victoire dominante 5-2 sur West Ham, marquant trois buts sur coup de pied arrêté en première mi-temps. La performance démontre leur efficacité améliorée sur coup de pied arrêté et leur puissance offensive."
      },
      "de": {
        "title": "Die neuen Standardspiel-Könige: Liverpool kann immer noch etwas \"Schönes\" erreichen",
        "summary": "Liverpool stärkte ihre Hoffnungen auf die Qualifikation für die Champions League mit einem dominanten 5:2-Sieg über West Ham und erzielte in der ersten Halbzeit drei Tore aus Standards. Die Leistung zeigt ihre verbesserte Standard-Effizienz und Angriffskraft."
      },
      "es": {
        "title": "Los nuevos reyes de saques fijos, Liverpool puede lograr algo \"hermoso\"",
        "summary": "Liverpool fortaleció sus esperanzas de calificación para la Liga de Campeones con una victoria dominante 5-2 sobre West Ham, anotando tres goles de saques fijos en el primer tiempo. El desempeño demuestra su eficiencia mejorada en saques fijos y poder ofensivo."
      }
    }
  },
  {
    "title": "Watch: Sportscene - Saturday's Premiership highlights",
    "slug": "sportscene-saturdays-premiership-highlights",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002s8vn?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T20:30:35.000Z",
    "summary": "BBC Sportscene features highlights from Scottish Premiership matches including Falkirk v Kilmarnock, Hearts v Aberdeen, and Livingston v St Mirren. The segment covers Saturday's top Scottish football action.",
    "content": "Featuring Falkirk v Kilmarnock, Hearts v Aberdeen and Livingston v St Mirren.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "观看：体育场景 - 周六超级联赛精彩集锦",
        "summary": "BBC体育场景节目展示了苏超比赛的精彩片段，包括法尔柯vs基马诺克、哈茨vs阿伯丁和利文斯顿vs圣米伦。该节目涵盖了周六苏超足球的精彩比赛。"
      },
      "fr": {
        "title": "Regardez: Sportscene - Faits saillants de la Premiership samedi",
        "summary": "Sportscene de la BBC présente les faits saillants des matchs de la Premiership écossaise, y compris Falkirk contre Kilmarnock, Hearts contre Aberdeen et Livingston contre St Mirren. Le segment couvre l'action de football de haut niveau du samedi en Écosse."
      },
      "de": {
        "title": "Schauen Sie: Sportscene - Samstags Premiership-Highlights",
        "summary": "BBC Sportscene zeigt Highlights von schottischen Premiership-Spielen, einschließlich Falkirk gegen Kilmarnock, Hearts gegen Aberdeen und Livingston gegen St Mirren. Das Segment zeigt die Top-Fußballaktionen am Samstag aus Schottland."
      },
      "es": {
        "title": "Ver: Sportscene - Resumen de lo mejor de la Premier División del sábado",
        "summary": "BBC Sportscene presenta los mejores momentos de los partidos de la Premiership escocesa, incluyendo Falkirk vs Kilmarnock, Hearts vs Aberdeen y Livingston vs St Mirren. El segmento cubre la acción de fútbol de élite del sábado en Escocia."
      }
    }
  },
  {
    "title": "'A very harsh decision' - assistant Riemer on Farke red card",
    "slug": "harsh-decision-riemer-farke-red-card",
    "url": "https://www.bbc.com/sport/football/videos/c5yj4yxgz12o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Premier League",
    "date": "2026-02-28T20:28:14.000Z",
    "summary": "Leeds United assistant manager Edmund Riemer criticized the red card given to manager Daniel Farke at the end of their loss to Manchester City, calling it very harsh. The dismissal came during a match where Leeds were already suffering defeat.",
    "content": "Leeds United assistant manager Edmund Riemer belives manager Daniel Farke's sending off at the end of their loss against Manchester City was \"very harsh\".",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"非常不公平的判罚\" - 助理教练里默对法克红牌的评价",
        "summary": "利兹联合队助理教练埃德蒙·里默批评了给予主教练丹尼尔·法克的红牌，称其非常不公平。这张红牌是在利兹已经处于失败中的比赛末尾得到的。"
      },
      "fr": {
        "title": "\"Une décision très injuste\" - l'assistant Riemer sur le carton rouge de Farke",
        "summary": "L'assistant manager de Leeds United Edmund Riemer a critiqué le carton rouge donné au manager Daniel Farke à la fin de leur défaite contre Manchester City, le qualifiant de très injuste. L'expulsion est intervenue lors d'un match où Leeds souffrait déjà de la défaite."
      },
      "de": {
        "title": "\"Eine sehr unfaire Entscheidung\" - Assistent Riemer zur Roten Karte von Farke",
        "summary": "Der Assistenztrainer von Leeds United Edmund Riemer kritisierte die rote Karte gegen Manager Daniel Farke am Ende ihrer Niederlage gegen Manchester City und nannte sie sehr unfair. Die Rote Karte kam während eines Spiels, in dem Leeds bereits mit einer Niederlage kämpfte."
      },
      "es": {
        "title": "\"Una decisión muy injusta\" - asistente Riemer sobre la tarjeta roja de Farke",
        "summary": "El asistente del manager de Leeds United Edmund Riemer criticó la tarjeta roja que se le dio al manager Daniel Farke al final de su derrota contra Manchester City, llamándola muy injusta. La expulsión ocurrió durante un partido donde Leeds ya sufría una derrota."
      }
    }
  },
  {
    "title": "Guardiola lauds 'complete' Man City performance at Leeds",
    "slug": "guardiola-lauds-complete-man-city-leeds",
    "url": "https://www.bbc.com/sport/football/videos/cn4g04pvk8qo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T20:24:51.000Z",
    "summary": "Manchester City manager Pep Guardiola praised his team's complete performance in their win over Leeds as important for closing the gap with leaders Arsenal and solidifying their Champions League qualification position. The victory represents a significant step in their pursuit of multiple trophies.",
    "content": "Manchester City manager Pep Guardiola says his side's win tonight was an important one in closing the gap with Arsenal, and growing the gap for Champions League qualification.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "瓜迪奥拉称曼城在利兹的表现\"完美\"",
        "summary": "曼城主教练佩普·瓜迪奥拉赞扬了他的球队在对利兹的胜利中的完美表现，认为这对于缩小与领跑者阿森纳的差距和巩固欧冠资格很重要。这场胜利代表了他们追求多个奖杯的重要一步。"
      },
      "fr": {
        "title": "Guardiola vante la performance \"complète\" de Man City à Leeds",
        "summary": "Le manager de Manchester City Pep Guardiola a félicité la performance complète de son équipe lors de sa victoire sur Leeds, ce qui est important pour réduire l'écart avec le leader Arsenal et consolider leur qualification pour la Ligue des Champions. La victoire représente une étape importante dans leur quête de plusieurs trophées."
      },
      "de": {
        "title": "Guardiola lobt \"komplette\" Leistung von Man City bei Leeds",
        "summary": "Manchesters City-Manager Pep Guardiola lobte die komplette Leistung seines Teams in ihrem Sieg über Leeds als wichtig, um den Rückstand auf Leader Arsenal zu verkürzen und ihre Champions-League-Qualifikation zu festigen. Der Sieg stellt einen wichtigen Schritt in ihrem Streben nach mehreren Trophäen dar."
      },
      "es": {
        "title": "Guardiola elogia el desempeño \"completo\" del Man City en Leeds",
        "summary": "El manager del Manchester City Pep Guardiola elogió el desempeño completo de su equipo en su victoria sobre Leeds como importante para cerrar la brecha con el líder Arsenal y consolidar su calificación para la Liga de Campeones. La victoria representa un paso importante en su búsqueda de múltiples trofeos."
      }
    }
  },
  {
    "title": "'Not fair to fans' - how VAR denied Burnley one of greatest comebacks",
    "slug": "var-denied-burnley-greatest-comeback",
    "url": "https://www.bbc.com/sport/football/articles/cdjm83ljpmno?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T20:24:29.000Z",
    "summary": "Burnley's attempt at one of the greatest Premier League comebacks was halted by VAR intervention, with BBC Sport examining whether the controversial decisions were correct. The outcome has drawn criticism regarding fairness to the club and its supporters.",
    "content": "Burnley were set to complete one of the greatest Premier League comebacks - until VAR intervened. BBC Sport takes a look at whether the decisions were correct.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"对球迷不公平\" - VAR如何阻止了伯恩利最伟大的逆转之一",
        "summary": "伯恩利试图完成英超最伟大的逆转之一的尝试被VAR干预中止。BBC体育审查了这些有争议的判罚是否正确。这一结果引发了关于对俱乐部及其支持者的公平性的批评。"
      },
      "fr": {
        "title": "\"Ce n'est pas juste pour les supporters\" - comment le VAR a refusé à Burnley un des plus grands retours",
        "summary": "La tentative de Burnley pour l'un des plus grands retours de la Premier League a été arrêtée par l'intervention de la VAR, BBC Sport examinant si les décisions controversées étaient correctes. Le résultat a suscité des critiques concernant l'équité envers le club et ses supporters."
      },
      "de": {
        "title": "\"Nicht fair für die Fans\" - wie VAR Burnley eines der größten Comebacks verweigerte",
        "summary": "Burnleys Versuch auf eines der größten Premier-League-Comebacks wurde durch VAR-Eingriff gestoppt, wobei BBC Sport untersucht, ob die umstrittenen Entscheidungen korrekt waren. Das Ergebnis hat zu Kritik bezüglich der Fairness gegenüber dem Verein und seinen Anhängern geführt."
      },
      "es": {
        "title": "\"No es justo para los aficionados\" - cómo VAR negó a Burnley uno de los mayores regresos",
        "summary": "El intento de Burnley por uno de los mayores regresos de la Premier League fue detenido por la intervención de VAR, siendo examinado por BBC Sport si las decisiones controvertidas fueron correctas. El resultado ha generado críticas sobre la equidad hacia el club y sus aficionados."
      }
    }
  },
  {
    "title": "Late Brentford winner thwarts spirited Burnley comeback",
    "slug": "late-brentford-winner-thwarts-burnley-comeback",
    "url": "https://www.bbc.com/sport/football/videos/cn71e2xkxrno?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T20:17:13.000Z",
    "summary": "Brentford secured a narrow victory over Burnley with a stoppage-time goal from Mikel Damsgaard, denying Burnley's dramatic three-goal comeback after Ashley Barnes' equalizing goal was ruled out. The result ended Burnley's hopes of an improbable turnaround.",
    "content": "Brentford hold on as Burnley have their three-goal comeback against squashed by Mikel Damsgaard's injury-time winner, with Ashley Barnes' last gasp equaliser ruled out.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "布伦特福德补时绝杀阻止伯恩利惊人逆转",
        "summary": "布伦特福德通过米克尔·达姆斯加德的补时进球击败伯恩利，获得窄小胜利，阻止了伯恩利在阿什利·巴恩斯的进球被判无效后的三球逆转。这个结果结束了伯恩利不可能翻盘的希望。"
      },
      "fr": {
        "title": "Un dernier but de Brentford déjoue la remontada spectaculaire de Burnley",
        "summary": "Brentford a assuré une victoire étroite sur Burnley avec un but en temps additionnel de Mikel Damsgaard, empêchant la remontada dramatique de trois buts de Burnley après que le but égalisateur d'Ashley Barnes soit annulé. Le résultat a mis fin aux espoirs d'un improbable retournement de situation de Burnley."
      },
      "de": {
        "title": "Spätes Brentford-Tor vereitelt Burnleys atemberaubende Aufholjagd",
        "summary": "Brentford sicherte sich einen knappen Sieg über Burnley durch ein Tor in der Nachspielzeit von Mikel Damsgaard und vereitelte damit Burnleys dramatisches Comeback von drei Toren, nachdem Ashleys Ausgleichstor annulliert wurde. Das Ergebnis beendete Burnleys Hoffnungen auf ein unwahrscheinliches Comeback."
      },
      "es": {
        "title": "Un gol tardío de Brentford frustra la remontada de Burnley",
        "summary": "Brentford aseguró una estrecha victoria sobre Burnley con un gol de Mikel Damsgaard en tiempo de descuento, negando la dramática remontada de tres goles de Burnley después de que el gol de empate de Ashley Barnes fuera anulado. El resultado terminó con las esperanzas de Burnley de una improbable vuelta."
      }
    }
  },
  {
    "title": "'Not the sign of a top team' - Newcastle take huge step backwards",
    "slug": "newcastle-huge-step-backwards-defensive-crisis",
    "url": "https://www.bbc.com/sport/football/articles/cly80vd4nvdo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T20:16:41.000Z",
    "summary": "Newcastle United are struggling in 12th place in the Premier League, having conceded 23 goals without a clean sheet in any competition recently, raising concerns about their defensive capabilities. The poor form suggests the club is moving away from title contention.",
    "content": "Newcastle are languishing in 12th place in the Premier League for a reason - they have conceded 23 goals since they last kept a clean sheet in any competition.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"不是顶级球队的表现\"——纽卡斯尔大幅倒退",
        "summary": "纽卡斯尔联在英超联赛中排名第12位，在最近的任何比赛中都没有零封，并丢了23个球，这引发了人们对其防线能力的担忧。糟糕的表现表明该俱乐部正在远离争冠行列。"
      },
      "fr": {
        "title": "« Pas le signe d'une grande équipe » - Newcastle prend un grand recul",
        "summary": "Newcastle United lutte à la 12ème place de la Premier League, ayant encaissé 23 buts sans une seule feuille blanche dans aucune compétition récemment, soulevant des préoccupations concernant ses capacités défensives. La mauvaise forme suggère que le club s'éloigne de la course au titre."
      },
      "de": {
        "title": "\"Nicht das Zeichen einer Top-Mannschaft\" - Newcastle macht großen Rückschritt",
        "summary": "Newcastle United kämpft auf Platz 12 in der Premier League, hat in letzter Zeit 23 Tore zugelassen und hat in keinem Wettbewerb ein Zu-Null gespielt, was Bedenken hinsichtlich ihrer defensiven Fähigkeiten aufwirft. Die schlechte Form deutet darauf hin, dass der Verein sich von der Titelkampf entfernt."
      },
      "es": {
        "title": "\"No es el signo de un equipo de élite\" - Newcastle retrocede enormemente",
        "summary": "Newcastle United está luchando en el 12º lugar en la Premier League, habiendo encajado 23 goles sin una portería a cero en ninguna competición recientemente, lo que genera preocupaciones sobre sus capacidades defensivas. La mala forma sugiere que el club se está alejando de la pelea por el título."
      }
    }
  },
  {
    "title": "Semenyo makes the difference as Man City beat Leeds",
    "slug": "semenyo-makes-difference-man-city-beat-leeds",
    "url": "https://www.bbc.com/sport/football/videos/ce8wg3zrr29o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T20:01:57.000Z",
    "summary": "Antoine Semenyo's goal moments before half-time secured Manchester City's victory over Leeds United, helping them close the gap with Premier League leaders Arsenal. The win strengthens City's position in the title race.",
    "content": "Antoine Semenyo's goal for Man City moments before half-time is enough to beat Leeds United and close in on leaders Arsenal in the Premier League.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "塞门约建功，曼城击败利兹",
        "summary": "安托万·塞门约在上半场结束前进球，确保了曼城战胜利兹联，帮助他们缩小与英超领头羊阿森纳的差距。这场胜利加强了曼城在争冠中的地位。"
      },
      "fr": {
        "title": "Semenyo fait la différence alors que Man City bat Leeds",
        "summary": "Le but d'Antoine Semenyo peu avant la mi-temps a assuré la victoire de Manchester City sur Leeds United, les aidant à réduire l'écart avec les leaders de la Premier League Arsenal. La victoire renforce la position de City dans la course au titre."
      },
      "de": {
        "title": "Semenyo macht den Unterschied, als Man City Leeds schlägt",
        "summary": "Das Tor von Antoine Semenyo kurz vor der Halbzeit sicherte Manchesters Sieg über Leeds United und half ihnen, den Rückstand auf Spitzenreiter Arsenal zu verkürzen. Der Sieg festigt Citys Position im Titelkampf."
      },
      "es": {
        "title": "Semenyo marca la diferencia cuando Man City vence a Leeds",
        "summary": "El gol de Antoine Semenyo poco antes del descanso aseguró la victoria de Manchester City sobre Leeds United, ayudándolos a cerrar la brecha con los líderes de la Premier League Arsenal. La victoria fortalece la posición de City en la lucha por el título."
      }
    }
  },
  {
    "title": "Pickford and Barry heroics earn Everton late win at Newcastle",
    "slug": "pickford-barry-heroics-everton-newcastle-win",
    "url": "https://www.bbc.com/sport/football/videos/c80j3dpe78do?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T20:00:24.000Z",
    "summary": "Thierno Barry scored a late goal to give Everton a 3-2 comeback victory over Newcastle, with goalkeeper Jordan Pickford making crucial saves contributing to the dramatic win. Everton fought back from behind to secure an important three points.",
    "content": "Thierno Barry responds to Newcastle's late equaliser with a goal of his own to see Everton beat Newcastle 3-2.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "皮克福德和巴里的英勇表现为埃弗顿赢得纽卡斯尔后期胜利",
        "summary": "蒂埃尔诺·巴里在比赛后期进球，帮助埃弗顿以3-2战胜纽卡斯尔，门神乔丹·皮克福德做出了关键扑救。埃弗顿从落后局面中反扑，赢得宝贵的三分。"
      },
      "fr": {
        "title": "Les exploits de Pickford et Barry donnent une victoire tardive à Everton à Newcastle",
        "summary": "Thierno Barry a marqué un but en fin de match pour offrir à Everton une victoire de retour 3-2 contre Newcastle, le gardien Jordan Pickford effectuant des arrêts cruciaux contribuant à cette victoire dramatique. Everton s'est battu pour revenir de derrière et sécuriser trois points importants."
      },
      "de": {
        "title": "Pickford und Barry helfen Everton zu spätem Sieg über Newcastle",
        "summary": "Thierno Barry erzielte ein spätes Tor für Evertons 3:2-Comeback-Sieg über Newcastle, wobei Torwart Jordan Pickford entscheidende Paraden machte. Everton kämpfte sich von hinten zurück, um wichtige drei Punkte zu sichern."
      },
      "es": {
        "title": "Los heroicos Pickford y Barry logran la victoria tardía de Everton ante Newcastle",
        "summary": "Thierno Barry anotó un gol tardío para darle a Everton una victoria de regreso 3-2 sobre Newcastle, con el arquero Jordan Pickford haciendo atajadas cruciales. Everton se recuperó del atraso para asegurar tres puntos importantes."
      }
    }
  },
  {
    "title": "Liverpool score five in dominant win over West Ham",
    "slug": "liverpool-five-dominant-win-west-ham",
    "url": "https://www.bbc.com/sport/football/videos/c62d07zy202o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T20:00:19.000Z",
    "summary": "Liverpool produced a dominant performance to defeat West Ham 5-2, moving up to fifth place in the Premier League table. The comprehensive victory showcases their attacking capabilities and strengthens their push for European qualification.",
    "content": "Liverpool put five past West Ham United in a dominant performance that moves them up to fifth in the Premier League table.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "利物浦在对西汉姆的压倒性胜利中打入五球",
        "summary": "利物浦以5-2战胜西汉姆，在英超排行榜中上升至第五位。这场全面的胜利展示了他们的进攻能力，并加强了他们争夺欧洲资格的努力。"
      },
      "fr": {
        "title": "Liverpool marque cinq dans une victoire écrasante contre West Ham",
        "summary": "Liverpool a produit une performance dominante pour vaincre West Ham 5-2, se plaçant à la cinquième place du classement de la Premier League. La victoire complète montre leurs capacités offensives et renforce leur poussée pour la qualification européenne."
      },
      "de": {
        "title": "Liverpool erziielt fünf Tore in dominantem Sieg über West Ham",
        "summary": "Liverpool zeigte eine dominante Leistung und besiegte West Ham 5:2, wodurch sie auf den fünften Platz in der Premier-League-Tabelle aufstiegen. Der umfassende Sieg zeigt ihre Angriffsfähigkeiten und stärkt ihr Streben nach europäischer Qualifikation."
      },
      "es": {
        "title": "Liverpool anota cinco en victoria dominante sobre West Ham",
        "summary": "Liverpool produjo una actuación dominante para derrotar a West Ham 5-2, subiendo al quinto lugar en la tabla de la Premier League. La victoria completa muestra sus capacidades ofensivas y fortalece su empuje por la calificación europea."
      }
    }
  },
  {
    "title": "Evanilson goal extends Bournemouth unbeaten run",
    "slug": "evanilson-extends-bournemouth-unbeaten-run",
    "url": "https://www.bbc.com/sport/football/videos/c86y70jlyezo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T20:00:16.000Z",
    "summary": "Bournemouth extended their unbeaten run to eight Premier League matches with a 1-1 draw against Sunderland after fighting back from a goal down. The result demonstrates the team's resilience and consistency.",
    "content": "Bournemouth's unbeaten run extends to eight Premier League games after coming from behind to draw 1-1 with Sunderland.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "埃瓦尼尔松的进球延续伯恩茅斯不败纪录",
        "summary": "伯恩茅斯在对桑德兰的比赛中以1-1战平，从落后一球的局面中反扑，将英超不败纪录延续至八场。这个结果展示了球队的韧性和稳定性。"
      },
      "fr": {
        "title": "Le but d'Evanilson prolonge la série d'invincibilité de Bournemouth",
        "summary": "Bournemouth a prolongé leur série d'invincibilité à huit matches de Premier League avec un match nul 1-1 contre Sunderland après s'être battu après un but encaissé. Le résultat démontre la résilience et la cohérence de l'équipe."
      },
      "de": {
        "title": "Evanilsons Tor verlängert Bournemouths ungeschlagene Serie",
        "summary": "Bournemouth verlängerte ihre ungeschlagene Serie auf acht Premier-League-Spiele mit einem 1:1-Unentschieden gegen Sunderland, nachdem sie von einem Tor hinten zurückgekämpft waren. Das Ergebnis zeigt die Widerstandskraft und Konsistenz des Teams."
      },
      "es": {
        "title": "El gol de Evanilson extiende la racha invicta de Bournemouth",
        "summary": "Bournemouth extendió su racha invicta a ocho partidos de la Premier League con un empate 1-1 contra Sunderland después de remontar desde un gol en contra. El resultado demuestra la resistencia y consistencia del equipo."
      }
    }
  },
  {
    "title": "Yamal scores first career hat-trick as Barcelona see off Villarreal",
    "slug": "yamal-scores-first-career-hat-trick-barcelona-villarreal",
    "url": "https://www.bbc.com/sport/football/videos/cn9e8xy1x1ro?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T18:04:37.000Z",
    "summary": "Lamine Yamal scored his first career hat-trick to lead Barcelona to a 4-1 victory over Villarreal in La Liga. The dominant performance extends Barcelona's lead at the top of the standings to four points.",
    "content": "Lamine Yamal puts on a show, scoring the first hat-trick of his career, as Barcelona soundly defeat Villarreal 4-1 to extend their lead at the top of La Liga to four points.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "亚马尔首次职业帽子戏法，巴塞罗那击败比利亚雷亚尔",
        "summary": "拉米内·亚马尔打进职业生涯首个帽子戏法，带领巴塞罗那4:1战胜比利亚雷亚尔。这次压倒性的胜利使巴塞罗那在西甲积分榜上的领先优势扩大到4分。"
      },
      "fr": {
        "title": "Yamal marque son premier but en triplé de sa carrière, Barcelone écrase Villarreal",
        "summary": "Lamine Yamal a marqué son premier but en triplé de sa carrière pour mener Barcelone à une victoire 4-1 sur Villarreal en La Liga. Cette performance dominante étend l'avance de Barcelone en haut du classement à quatre points."
      },
      "de": {
        "title": "Yamal erzielt sein erstes Karriere-Hattrick, Barcelona schlägt Villarreal",
        "summary": "Lamine Yamal erzielte sein erstes Karriere-Hattrick und führte Barcelona zu einem 4:1-Sieg über Villarreal in La Liga. Die dominante Leistung erweitert Barcelonas Vorsprung an der Tabellenspitze auf vier Punkte."
      },
      "es": {
        "title": "Yamal anota su primer hat-trick en carrera profesional, Barcelona vence a Villarreal",
        "summary": "Lamine Yamal anotó su primer hat-trick en carrera profesional para llevar a Barcelona a una victoria 4-1 sobre Villarreal en La Liga. Esta actuación dominante amplía la ventaja de Barcelona en la cima de la clasificación a cuatro puntos."
      }
    }
  },
  {
    "title": "'Out of absolutely nothing' - Yamal scores solo stunner",
    "slug": "yamal-scores-solo-stunner",
    "url": "https://www.bbc.com/sport/football/videos/cddn50mjy23o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T18:04:25.000Z",
    "summary": "Lamine Yamal scored his second goal in Barcelona's 4-1 La Liga victory over Villarreal with a brilliant solo run and curling finish into the far corner. The goal was part of his first career hat-trick performance.",
    "content": "Lamine Yamal goes on a brilliant solo run before curling an effort into the far corner to score his second goal, enroute to his first career hat-trick in Barcelona's 4-1 win over Villarreal in La Liga.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"凭空而出\"——亚马尔打进惊人远射",
        "summary": "拉米内·亚马尔在巴塞罗那4:1战胜比利亚雷亚尔的西甲比赛中，通过精彩的单独突破和远角漂亮的弧线远射打进第二粒进球。这粒进球是他职业生涯首个帽子戏法表现的一部分。"
      },
      "fr": {
        "title": "\"De nulle part\" - Yamal marque un but spectaculaire",
        "summary": "Lamine Yamal a marqué son deuxième but dans la victoire 4-1 de Barcelone sur Villarreal en La Liga avec une brillante course solo et une finition courbe dans le coin lointain. Le but faisait partie de sa première performance en triplé de sa carrière."
      },
      "de": {
        "title": "\"Aus dem Nichts\" - Yamal erzielt einen spektakulären Treffer",
        "summary": "Lamine Yamal erzielte sein zweites Tor in Barcelonas 4:1-Sieg über Villarreal in La Liga mit einem brillanten Soloanflug und einem gekrümmten Abschluss in die ferne Ecke. Das Tor war Teil seiner ersten Karriere-Hattrick-Leistung."
      },
      "es": {
        "title": "\"De la nada\" - Yamal anota un gol espectacular",
        "summary": "Lamine Yamal anotó su segundo gol en la victoria 4-1 de Barcelona sobre Villarreal en La Liga con una carrera solo brillante y un remate curveado en la esquina lejana. El gol fue parte de su primer desempeño de hat-trick en carrera profesional."
      }
    }
  },
  {
    "title": "Did Sydney Sweeney hit Bruno Fernandes' celebration on visit to Man Utd star's old club?",
    "slug": "sydney-sweeney-bruno-fernandes-celebration-sporting",
    "url": "https://www.espn.com/soccer/story/_/id/48062455/did-sydney-sweeney-hit-manchester-united-bruno-fernandes-goal-celebration-sporting-cp",
    "source": "ESPN Soccer",
    "date": "2026-02-28T18:02:59.000Z",
    "summary": "Hollywood actress Sydney Sweeney visited Sporting and appeared to imitate the trademark celebration of Bruno Fernandes, the club's former player now at Manchester United.",
    "content": "Hollywood star Sydney Sweeney visited Sporting and appeared to imitate the trademark celebration of one of the club's former players, Bruno Fernandes.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "悉尼·斯威尼访问曼联前锋的旧东家时，是否模仿了布鲁诺·费尔南德斯的庆祝动作？",
        "summary": "好莱坞女演员悉尼·斯威尼访问了体育队，似乎模仿了布鲁诺·费尔南德斯的标志性庆祝动作。费尔南德斯是该俱乐部的前球员，现效力曼彻斯特联队。"
      },
      "fr": {
        "title": "Sydney Sweeney a-t-elle imité la célébration de Bruno Fernandes lors de sa visite à l'ancien club de la star de Man Utd ?",
        "summary": "L'actrice hollywoodienne Sydney Sweeney a visité le Sporting et a semblé imiter la célébration emblématique de Bruno Fernandes, l'ancien joueur du club maintenant à Manchester United."
      },
      "de": {
        "title": "Hat Sydney Sweeney Bruno Fernandes' Jubel beim Besuch des Clubs der Man-Utd-Star nachgeahmt?",
        "summary": "Die Hollywoodschauspielerin Sydney Sweeney besuchte Sporting und ahmte anscheinend die charakteristische Jubelgeste von Bruno Fernandes nach, dem ehemaligen Spieler des Clubs, der jetzt bei Manchester United spielt."
      },
      "es": {
        "title": "¿Sydney Sweeney imitó la celebración de Bruno Fernandes durante su visita al antiguo club de la estrella del Man Utd?",
        "summary": "La actriz de Hollywood Sydney Sweeney visitó al Sporting e aparentemente imitó la celebración característica de Bruno Fernandes, el antiguo jugador del club ahora en el Manchester United."
      }
    }
  },
  {
    "title": "Haaland left out of City squad with 'little injury'",
    "slug": "haaland-left-out-city-squad-injury",
    "url": "https://www.espn.com/soccer/story/_/id/48062103/erling-haaland-left-man-city-squad-trip-leeds",
    "source": "ESPN Soccer",
    "date": "2026-02-28T18:02:06.000Z",
    "summary": "Erling Haaland has been excluded from Manchester City's squad for their upcoming match against Leeds United on Saturday evening due to a minor injury.",
    "content": "Erling Haaland has been left out of Manchester City's squad for their trip to Leeds United on Saturday evening.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "哈兰德因\"轻伤\"被曼城排除在阵容外",
        "summary": "埃尔林·哈兰德因轻伤被曼彻斯特城队排除在周六晚间对阵利兹联队比赛的阵容外。"
      },
      "fr": {
        "title": "Haaland exclu de l'effectif de City pour une \"petite blessure\"",
        "summary": "Erling Haaland a été exclu de l'effectif de Manchester City pour leur match à venir contre Leeds United samedi soir en raison d'une blessure mineure."
      },
      "de": {
        "title": "Haaland wegen \"leichter Verletzung\" aus dem City-Kader ausgeschlossen",
        "summary": "Erling Haaland wurde aufgrund einer leichten Verletzung aus dem Kader von Manchester City für ihr bevorstehendes Spiel gegen Leeds United am Samstagabend ausgeschlossen."
      },
      "es": {
        "title": "Haaland excluido de la alineación del City por \"lesión leve\"",
        "summary": "Erling Haaland ha sido excluido de la alineación del Manchester City para su próximo partido contra Leeds United el sábado por la noche debido a una lesión menor."
      }
    }
  },
  {
    "title": "Yamal gets first Barça hat trick in Villarreal win",
    "slug": "yamal-first-barca-hat-trick-villarreal",
    "url": "https://www.espn.com/soccer/report/_/gameId/748402",
    "source": "ESPN Soccer",
    "date": "2026-02-28T18:02:06.000Z",
    "summary": "Lamine Yamal scored his first career hat-trick as Barcelona defeated Villarreal 4-1 in La Liga, marking manager Hansi Flick's 100th game in charge.",
    "content": "Lamine Yamal scored his first career hat trick as Barcelona celebrated Hansi Flick's 100th game in charge with a 4-1 LaLiga victory over Villarreal.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "亚马尔在对阵比利亚雷亚尔的胜利中获得巴萨生涯首个帽子戏法",
        "summary": "拉米内·亚马尔在巴塞罗那4-1战胜比利亚雷亚尔的西甲比赛中打入职业生涯首个帽子戏法，这是主帅汉西·弗利克执教的第100场比赛。"
      },
      "fr": {
        "title": "Yamal obtient son premier hat-trick du Barça contre Villarreal",
        "summary": "Lamine Yamal a marqué son premier hat-trick en carrière alors que Barcelone a battu Villarreal 4-1 en La Liga, marquant le 100e match de l'entraîneur Hansi Flick en tant que responsable."
      },
      "de": {
        "title": "Yamal erzielt seinen ersten Barça-Hattrick im Sieg gegen Villarreal",
        "summary": "Lamine Yamal erzielte seinen ersten Karriere-Hattrick, als Barcelona Villarreal 4-1 in der La Liga besiegte, was das 100. Spiel von Manager Hansi Flick als Verantwortlicher markierte."
      },
      "es": {
        "title": "Yamal logra su primer hat-trick del Barça en victoria ante Villarreal",
        "summary": "Lamine Yamal marcó su primer hat-trick de carrera cuando Barcelona derrotó 4-1 a Villarreal en La Liga, marcando el juego número 100 del entrenador Hansi Flick a cargo."
      }
    }
  },
  {
    "title": "Wrexham playoff push continues with another win",
    "slug": "wrexham-playoff-push-continues-another-win",
    "url": "https://www.espn.com/soccer/report/_/gameId/745012",
    "source": "ESPN Soccer",
    "date": "2026-02-28T18:02:06.000Z",
    "summary": "Oliver Rathbone's seventh goal of the season earned Wrexham a 1-0 victory at Charlton, bolstering the club's push for the Championship playoffs.",
    "content": "Oliver Rathbone's seventh goal of the season earned playoff chasing Wrexham a 1-0 victory at Charlton in the Championship.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "雷克瑟姆继续推进季后赛竞争再获一胜",
        "summary": "奥利弗·拉思邦本赛季第七球为雷克瑟姆在查尔顿1-0获胜，增强了球队冲击英冠季后赛的希望。"
      },
      "fr": {
        "title": "La poussée des playoffs de Wrexham continue avec une autre victoire",
        "summary": "Le septième but de la saison d'Oliver Rathbone a valu à Wrexham une victoire 1-0 à Charlton, renforçant la poussée du club pour les playoffs du Championnat."
      },
      "de": {
        "title": "Wrexhams Playoff-Drang setzt sich mit einem weiteren Sieg fort",
        "summary": "Das siebte Tor der Saison von Oliver Rathbone brachte Wrexham einen 1-0-Sieg in Charlton ein und stärkte das Streben des Clubs nach den Championship-Playoffs."
      },
      "es": {
        "title": "La lucha de Wrexham por los playoffs continúa con otra victoria",
        "summary": "El séptimo gol de la temporada de Oliver Rathbone le dio a Wrexham una victoria 1-0 en Charlton, fortaleciendo el empuje del club hacia los playoffs del Campeonato."
      }
    }
  },
  {
    "title": "Liverpool boost UCL hopes with 5-2 West Ham win",
    "slug": "liverpool-boost-ucl-hopes-5-2-west-ham-win",
    "url": "https://www.espn.com/soccer/report/_/gameId/740872",
    "source": "ESPN Soccer",
    "date": "2026-02-28T18:02:06.000Z",
    "summary": "Liverpool defeated West Ham United 5-2 at Anfield on Saturday, significantly boosting their chances of securing Champions League qualification.",
    "content": "Liverpool boosted their hopes of Champions League qualification after beating West Ham United 5-2 at Anfield on Saturday.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "利物浦以5-2击败西汉姆联，提升欧冠希望",
        "summary": "利物浦周六在安菲尔德主场以5-2击败西汉姆联，大幅提升了他们获得欧冠资格的机会。"
      },
      "fr": {
        "title": "Liverpool ravive ses espoirs de LDC avec une victoire 5-2 contre West Ham",
        "summary": "Liverpool a vaincu West Ham United 5-2 à Anfield samedi, améliorant considérablement ses chances de se qualifier pour la Ligue des champions."
      },
      "de": {
        "title": "Liverpool erhöht Champions-League-Chancen mit 5-2-Sieg gegen West Ham",
        "summary": "Liverpool besiegte West Ham United am Samstag mit 5-2 in Anfield und verbesserte damit deutlich ihre Chancen auf die Teilnahme an der Champions League."
      },
      "es": {
        "title": "Liverpool impulsa sus esperanzas de Champions con victoria 5-2 sobre West Ham",
        "summary": "Liverpool derrotó a West Ham United 5-2 en Anfield el sábado, mejorando significativamente sus posibilidades de asegurar la calificación para la Liga de Campeones."
      }
    }
  },
  {
    "title": "FIFA to 'monitor developments' in Iran ahead of WC",
    "slug": "fifa-monitor-developments-iran-world-cup",
    "url": "https://www.espn.com/soccer/story/_/id/48060986/fifa-monitor-developments-iran-ahead-2026-world-cup",
    "source": "ESPN Soccer",
    "date": "2026-02-28T18:02:06.000Z",
    "summary": "FIFA announced it will monitor developments in Iran following military action by the United States against the Middle Eastern nation, which is co-hosting this summer's men's World Cup.",
    "content": "FIFA will \"monitor developments\" in Iran following the outbreak of military action by the United States -- the co-hosts of this summer's men's World Cup -- against the Middle Eastern nation.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "国际足联将\"关注\"伊朗世界杯前的局势发展",
        "summary": "国际足联宣布将关注伊朗的局势发展，此前美国对这个中东国家采取了军事行动，该国今年夏天将与其他国家共同举办男足世界杯。"
      },
      "fr": {
        "title": "La FIFA va \"surveiller les développements\" en Iran avant la Coupe du monde",
        "summary": "La FIFA a annoncé qu'elle surveillerait les développements en Iran suite à l'action militaire des États-Unis contre la nation du Moyen-Orient, qui co-organise la Coupe du monde masculine cet été."
      },
      "de": {
        "title": "FIFA wird Entwicklungen im Iran vor WM \"überwachen\"",
        "summary": "Die FIFA kündigte an, dass sie die Entwicklungen im Iran überwachen wird, nachdem die Vereinigten Staaten gegen die Mittlost-Nation militärische Maßnahmen ergriffen haben, die diesen Sommer die Männer-Weltmeisterschaft mitausträgt."
      },
      "es": {
        "title": "FIFA \"monitoreará los desarrollos\" en Irán antes del Mundial",
        "summary": "La FIFA anunció que monitoreará los desarrollos en Irán tras la acción militar de los Estados Unidos contra la nación del Medio Oriente, que será anfitriona conjunta de la Copa Mundial masculina este verano."
      }
    }
  },
  {
    "title": "Source: MLS champs Miami get White House invite",
    "slug": "inter-miami-white-house-invite-mls-champs",
    "url": "https://www.espn.com/soccer/story/_/id/48062232/inter-miami-invited-white-house-mark-mls-cup-win-source",
    "source": "ESPN Soccer",
    "date": "2026-02-28T18:02:06.000Z",
    "summary": "Inter Miami, the 2025 Major League Soccer Cup champions, have received an invitation to visit the White House to celebrate their title victory.",
    "content": "Inter Miami received an invitation to attend the White House to celebrate the team's 2025 Major League Soccer Cup triumph, a club source confirmed to ESPN.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "消息人士：美职联冠军迈阿密获邀访问白宫",
        "summary": "2025年美职联杯冠军国际迈阿密收到了访问白宫的邀请，以庆祝他们的冠军胜利。"
      },
      "fr": {
        "title": "Source : les champions MLS Miami reçoivent une invitation à la Maison-Blanche",
        "summary": "L'Inter Miami, champions de la Coupe de la Major League Soccer 2025, a reçu une invitation à visiter la Maison-Blanche pour célébrer sa victoire au titre."
      },
      "de": {
        "title": "Quelle: MLS-Champions Miami bekommen White-House-Einladung",
        "summary": "Inter Miami, die Meister des 2025 Major League Soccer Cup, haben eine Einladung erhalten, das Weiße Haus zu besuchen, um ihren Titelgewinn zu feiern."
      },
      "es": {
        "title": "Fuente: Campeones de la MLS Miami reciben invitación a la Casa Blanca",
        "summary": "Inter Miami, los campeones de la Copa de la Major League Soccer 2025, han recibido una invitación para visitar la Casa Blanca para celebrar su victoria en el título."
      }
    }
  },
  {
    "title": "FIFA weighs mouth-covering rule after Vini Jr case",
    "slug": "fifa-mouth-covering-rule-vini-jr",
    "url": "https://www.espn.com/soccer/story/_/id/48061058/ifab-consult-mouth-covering-players-vinicius-junior-gianluca-prestianni-var-countdown-changes-2026-world-cup",
    "source": "ESPN Soccer",
    "date": "2026-02-28T18:02:06.000Z",
    "summary": "FIFA is consulting on potential measures to prevent players from covering their mouth when confronting opponents during matches, following an incident involving Vini Jr.",
    "content": "Consultations will be held about measures to combat players covering their mouth when confronting opponents during matches, it was announced on Saturday.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "FIFA在Vini Jr事件后考虑遮口规则",
        "summary": "FIFA正在就阻止球员在比赛中与对手对峙时遮住嘴部的潜在措施进行磋商,这是在一起涉及Vini Jr的事件后进行的。"
      },
      "fr": {
        "title": "La FIFA envisage une règle sur le port du masque après l'affaire Vini Jr",
        "summary": "La FIFA consulte sur les mesures potentielles pour empêcher les joueurs de se couvrir la bouche lors de confrontations avec les adversaires en match, suite à un incident impliquant Vini Jr."
      },
      "de": {
        "title": "FIFA erwägt Mundschutzregel nach Vini-Jr.-Fall",
        "summary": "Die FIFA konsultiert über potenzielle Maßnahmen, um zu verhindern, dass Spieler ihren Mund während der Konfrontation mit Gegnern während Spielen bedecken, nach einem Zwischenfall mit Vini Jr."
      },
      "es": {
        "title": "La FIFA contempla una regla de cobertura bucal tras el caso de Vini Jr",
        "summary": "La FIFA está consultando sobre medidas potenciales para evitar que los jugadores se cubran la boca cuando se enfrentan a los oponentes durante los partidos, tras un incidente que involucra a Vini Jr."
      }
    }
  },
  {
    "title": "European soccer live updates: Haaland-less Man City travel to Leeds",
    "slug": "european-soccer-man-city-leeds-haaland",
    "url": "https://www.espn.com/soccer/story/_/id/48046977/european-soccer-live-updates-liverpool-west-ham-leedsman-city-barcelona-villarreal-borussia-dortmund-bayern-munich",
    "source": "ESPN Soccer",
    "date": "2026-02-28T17:18:34.000Z",
    "summary": "Manchester City travel to Leeds United in a key fixture without star striker Erling Haaland, who is unavailable due to a minor injury.",
    "content": "null",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "欧洲足球直播更新:无哈兰德的曼城前往利兹",
        "summary": "曼彻斯特城队在没有明星前锋厄林·哈兰德的情况下前往利兹联队进行一场关键比赛,哈兰德因小伤无法上阵。"
      },
      "fr": {
        "title": "Mises à jour en direct du soccer européen: Manchester City sans Haaland se rend à Leeds",
        "summary": "Manchester City se rend à Leeds United pour un match important sans sa vedette attaquante Erling Haaland, qui est indisponible en raison d'une blessure mineure."
      },
      "de": {
        "title": "European-Fußball-Live-Updates: Manchester City ohne Haaland reist nach Leeds",
        "summary": "Manchester City reist ohne seinen Superstar Stürmer Erling Haaland nach Leeds United für ein wichtiges Spiel, da dieser aufgrund einer leichten Verletzung nicht verfügbar ist."
      },
      "es": {
        "title": "Actualizaciones en vivo de fútbol europeo: Manchester City sin Haaland viaja a Leeds",
        "summary": "Manchester City viaja a Leeds United para un partido clave sin su estrella delantero Erling Haaland, quien no está disponible debido a una lesión menor."
      }
    }
  },
  {
    "title": "More VAR challenge trials expected during two-year review",
    "slug": "more-var-challenge-trials-two-year-review",
    "url": "https://www.bbc.com/sport/football/articles/cdxzerk1yr9o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T17:00:35.000Z",
    "summary": "FIFA official Pierluigi Collina announced that additional trials of a challenge system will be conducted as part of a two-year comprehensive review of VAR protocols.",
    "content": "Pierluigi Collina says there will be further trials of a challenge system as part of a two-year review of VAR.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "两年审查期间预计进行更多VAR挑战试验",
        "summary": "FIFA官员皮埃鲁路易吉·科利纳宣布,将进行额外的挑战系统试验,作为两年全面审查VAR协议的一部分。"
      },
      "fr": {
        "title": "D'autres essais de défi VAR sont attendus lors de l'examen de deux ans",
        "summary": "Le responsable de la FIFA Pierluigi Collina a annoncé que des essais supplémentaires d'un système de défi seront menés dans le cadre d'un examen complet de deux ans des protocoles VAR."
      },
      "de": {
        "title": "Weitere VAR-Challenge-Tests während zweijähriger Überprüfung erwartet",
        "summary": "Der FIFA-Offiziell Pierluigi Collina kündigte an, dass zusätzliche Tests eines Challenge-Systems als Teil einer umfassenden zweijährigen Überprüfung der VAR-Protokolle durchgeführt werden."
      },
      "es": {
        "title": "Se esperan más pruebas de desafío VAR durante la revisión de dos años",
        "summary": "El oficial de la FIFA Pierluigi Collina anunció que se realizarán pruebas adicionales de un sistema de desafío como parte de una revisión integral de dos años de los protocolos del VAR."
      }
    }
  },
  {
    "title": "Sunderland proved themselves against 'intense' Bournemouth",
    "slug": "sunderland-proved-themselves-bournemouth",
    "url": "https://www.bbc.com/sport/football/videos/cgqglxg59n7o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Premier League",
    "date": "2026-02-28T15:36:09.000Z",
    "summary": "Sunderland manager Regis Le Bris praised his team's resilience after drawing with Bournemouth, highlighting their unity following three consecutive defeats in the Premier League.",
    "content": "Sunderland manager Regis Le Bris says he has positive takeaways after his side showed their \"togetherness\" to draw with Bournemouth after three defeats in a row in the Premier League.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "桑德兰在\"激烈\"伯恩茅斯面前证明了自己",
        "summary": "桑德兰主教练雷吉斯·勒·布里斯在与伯恩茅斯平局后称赞了球队的韧性，强调了他们在英超连续三场失败后的团结。"
      },
      "fr": {
        "title": "Sunderland s'est prouvé contre Bournemouth \"intensif\"",
        "summary": "Le manager de Sunderland, Regis Le Bris, a félicité la résilience de son équipe après un match nul avec Bournemouth, soulignant leur unité suite à trois défaites consécutives en Premier League."
      },
      "de": {
        "title": "Sunderland bewies sich gegen das \"intensive\" Bournemouth",
        "summary": "Sunderlands Manager Regis Le Bris lobte die Widerstandsfähigkeit seines Teams nach einem Unentschieden mit Bournemouth und hob ihre Einheit nach drei aufeinanderfolgenden Niederlagen in der Premier League hervor."
      },
      "es": {
        "title": "Sunderland se demostró contra el Bournemouth \"intenso\"",
        "summary": "El manager de Sunderland, Regis Le Bris, elogió la resiliencia de su equipo después del empate contra Bournemouth, destacando su unidad después de tres derrotas consecutivas en la Premier League."
      }
    }
  },
  {
    "title": "'We paid for the slow start' - Iraola on Sunderland draw",
    "slug": "we-paid-for-slow-start-iraola-sunderland",
    "url": "https://www.bbc.com/sport/football/videos/cx2j07j3nq9o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Premier League",
    "date": "2026-02-28T15:32:30.000Z",
    "summary": "Bournemouth manager Andoni Iraola attributed his team's draw with Sunderland to a slow start in the match, noting his team \"did more\" to win the game.",
    "content": "Andoni Iraola blames Bournemouth's slow start for their draw against Sunderland, claiming he thought his side \"did more\" to win the game.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"我们为缓慢的开局付出了代价\" - 伊拉奥拉谈桑德兰平局",
        "summary": "伯恩茅斯主教练安东尼·伊拉奥拉将球队与桑德兰的平局归因于比赛中的缓慢开局，指出他的球队为赢得比赛而\"做了更多\"。"
      },
      "fr": {
        "title": "\"Nous avons payé pour ce mauvais départ\" - Iraola sur le match nul avec Sunderland",
        "summary": "Le manager de Bournemouth, Andoni Iraola, a attribué le match nul de son équipe avec Sunderland à un mauvais départ du match, notant que son équipe \"en a fait plus\" pour gagner."
      },
      "de": {
        "title": "\"Wir haben für den langsamen Start bezahlt\" - Iraola zum Unentschieden gegen Sunderland",
        "summary": "Bournemouths Manager Andoni Iraola führte das Unentschieden seines Teams gegen Sunderland auf einen langsamen Spielstart zurück und merkte an, dass sein Team \"mehr tat\", um das Spiel zu gewinnen."
      },
      "es": {
        "title": "\"Pagamos por el comienzo lento\" - Iraola sobre el empate con Sunderland",
        "summary": "El manager de Bournemouth, Andoni Iraola, atribuyó el empate de su equipo con Sunderland a un inicio lento en el partido, señalando que su equipo \"hizo más\" para ganar el juego."
      }
    }
  },
  {
    "title": "PSG granted more time off between Chelsea ties",
    "slug": "psg-granted-more-time-off-between-chelsea-ties",
    "url": "https://www.bbc.com/sport/football/articles/cy4wp49wvp3o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T14:22:50.000Z",
    "summary": "Paris St-Germain received approval to postpone a Ligue 1 match, granting them five days of rest between the two legs of their Champions League last-16 tie against Chelsea.",
    "content": "Paris St-Germain will have five days off between the two legs of their Champions League last-16 tie against Chelsea after their request to postpone a Ligue 1 match is granted.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "巴黎圣日耳曼获得了切尔西比赛之间的更多休息时间",
        "summary": "巴黎圣日耳曼获得了延迟法甲比赛的批准，在与切尔西的欧冠1/8决赛两轮之间获得了五天的休息。"
      },
      "fr": {
        "title": "Le PSG a obtenu plus de temps de repos entre les matchs contre Chelsea",
        "summary": "Le Paris Saint-Germain a reçu l'approbation pour reporter un match de Ligue 1, lui accordant cinq jours de repos entre les deux manches de leur duel des huitièmes de finale de la Ligue des champions contre Chelsea."
      },
      "de": {
        "title": "PSG erhielt mehr Ruhezeit zwischen den Chelsea-Spielen",
        "summary": "Paris Saint-Germain erhielt die Genehmigung, ein Ligue-1-Spiel zu verschieben, was ihnen fünf Tage Ruhe zwischen den beiden Spielen ihrer Achtelfinal-Begegnung der Champions League gegen Chelsea ermöglichte."
      },
      "es": {
        "title": "El PSG obtuvo más descanso entre los enfrentamientos contra Chelsea",
        "summary": "Paris Saint-Germain recibió aprobación para posponer un partido de Ligue 1, otorgándoles cinco días de descanso entre las dos fechas de su enfrentamiento de los dieciseisavos de final de la Liga de Campeones contra Chelsea."
      }
    }
  },
  {
    "title": "West Ham must sell players in summer after £104m loss",
    "slug": "west-ham-must-sell-players-summer-104m-loss",
    "url": "https://www.bbc.com/sport/football/articles/cn4g0e2weqdo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T10:03:43.000Z",
    "summary": "West Ham revealed a £104.2m loss for the last financial year and must sell players this summer to address financial challenges, even if they avoid relegation. The substantial deficit puts pressure on the club's ability to retain talent and invest in squad improvements.",
    "content": "West Ham will need to sell players this summer even if they avoid relegation from the Premier League, after revealing a £104.2m loss for the last financial year.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "韦斯特汉姆必须在夏天出售球员以弥补1.04亿英镑的亏损",
        "summary": "韦斯特汉姆公布去年亏损1.042亿英镑，必须在今年夏天出售球员以应对财务挑战，即使他们避免降级。这笔巨大的赤字给俱乐部保留人才和投资阵容改进的能力带来压力。"
      },
      "fr": {
        "title": "West Ham doit vendre des joueurs cet été après une perte de 104 millions de livres",
        "summary": "West Ham a révélé une perte de 104,2 millions de livres pour le dernier exercice financier et doit vendre des joueurs cet été pour faire face aux défis financiers, même s'ils évitent la relégation. Le déficit substantiel exerce une pression sur la capacité du club à conserver les talents et à investir dans les améliorations de l'équipe."
      },
      "de": {
        "title": "West Ham muss Spieler im Sommer nach Verlust von 104 Millionen Pfund verkaufen",
        "summary": "West Ham meldete einen Verlust von 104,2 Millionen Pfund für das letzte Geschäftsjahr und muss Spieler in diesem Sommer verkaufen, um sich finanziellen Herausforderungen zu stellen, auch wenn sie den Abstieg vermeiden. Das erhebliche Defizit belastet die Fähigkeit des Clubs, Talente zu halten und in Kaderverbesserungen zu investieren."
      },
      "es": {
        "title": "West Ham debe vender jugadores en verano después de una pérdida de 104 millones de libras",
        "summary": "West Ham reveló una pérdida de 104,2 millones de libras para el último año fiscal y debe vender jugadores este verano para hacer frente a los desafíos financieros, incluso si evitan el descenso. El déficit sustancial ejerce presión sobre la capacidad del club para retener talento e invertir en mejoras de la plantilla."
      }
    }
  },
  {
    "title": "Transfer rumors, news: Man City, Man United in race to sign Anderson",
    "slug": "man-city-man-united-anderson-transfer",
    "url": "https://www.espn.com/soccer/story/_/id/48060133/transfer-rumors-news-manchester-city-manchester-united-nottingham-forest-elliot-anderson",
    "source": "ESPN Soccer",
    "date": "2026-02-28T09:51:59.000Z",
    "summary": "Manchester City and Manchester United are competing to sign Nottingham Forest's Elliot Anderson this summer. The transfer battle reflects both clubs' interest in the midfielder as a key target.",
    "content": "Manchester City and Manchester United are set for a battle to sign Nottingham Forest's Elliot Anderson this summer. Transfer Talk has the latest.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "转会传闻：曼城和曼联争夺安德森",
        "summary": "曼彻斯特城和曼彻斯特联正在竞争签下诺丁汉森林的埃利奥特·安德森。这场转会争夺战反映了两家俱乐部对中场球员作为关键目标的兴趣。"
      },
      "fr": {
        "title": "Rumeurs et nouvelles de transfert : Manchester City, Manchester United en course pour signer Anderson",
        "summary": "Manchester City et Manchester United se disputent la signature d'Elliot Anderson de Nottingham Forest cet été. La bataille de transfert reflète l'intérêt des deux clubs pour le milieu de terrain en tant que cible clé."
      },
      "de": {
        "title": "Transfergerüchte: Manchester City und Manchester United konkurrieren um Anderson",
        "summary": "Manchester City und Manchester United konkurrieren um die Verpflichtung von Elliot Anderson von Nottingham Forest in diesem Sommer. Der Transferkampf spiegelt das Interesse beider Clubs an dem Mittelfeldspieler als Schlüsselziel wider."
      },
      "es": {
        "title": "Rumores de transferencia: Manchester City y Manchester United compiten por fichar a Anderson",
        "summary": "Manchester City y Manchester United compiten por fichar a Elliot Anderson del Nottingham Forest este verano. La batalla de transferencia refleja el interés de ambos clubes en el centrocampista como objetivo clave."
      }
    }
  },
  {
    "title": "Rangers keen on midfielder Ashia - gossip",
    "slug": "rangers-keen-midfielder-ashia",
    "url": "https://www.bbc.com/sport/football/articles/cjd90v4grxpo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T08:44:21.000Z",
    "summary": "Rangers are pursuing an attacking midfielder from England's League One while Celtic missed out on a Norwegian striker target. Both Scottish clubs remain active in the transfer market.",
    "content": "Rangers eye attacking midfielder in England's League One, while Celtic miss the boat on Norwegian striker...",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "流浪者队对中场球员阿西亚感兴趣——八卦",
        "summary": "流浪者队正在追求英格兰英乙联赛的一名前腰球员，而凯尔特人队错过了一名挪威前锋目标。两支苏格兰球队仍在转会市场上保持活跃。"
      },
      "fr": {
        "title": "Les Rangers intéressés par le milieu de terrain Ashia - commérages",
        "summary": "Les Rangers poursuivent un milieu offensif de la Ligue anglaise One tandis que Celtic a raté une cible attaquante norvégienne. Les deux clubs écossais restent actifs sur le marché des transferts."
      },
      "de": {
        "title": "Rangers interessiert an Mittelfeldspieler Ashia – Gerüchte",
        "summary": "Rangers verfolgt einen angreifenden Mittelfeldspieler aus Englands League One, während Celtic ein norwegisches Stürmer-Ziel verpasste. Beide schottischen Clubs bleiben auf dem Transfermarkt aktiv."
      },
      "es": {
        "title": "Rangers interesados en el centrocampista Ashia - cotilleo",
        "summary": "Rangers persigue a un centrocampista atacante de la League One de Inglaterra, mientras que Celtic se perdió un objetivo de delantero noruego. Ambos clubes escoceses siguen activos en el mercado de transferencias."
      }
    }
  },
  {
    "title": "Benfica suspend five fans over racist incidents",
    "slug": "benfica-suspend-five-fans-racist-incidents",
    "url": "https://www.bbc.com/sport/football/articles/cwy6kz692lyo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T08:38:04.000Z",
    "summary": "Benfica suspended five supporters following racist incidents during the recent Champions League match against Real Madrid. The club's action reflects ongoing efforts to combat racism in football.",
    "content": "Benfica suspend five supporters for racist incidents following the recent Champions League game against Real Madrid.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "本菲卡因种族歧视事件暂停五名球迷资格",
        "summary": "本菲卡因最近对阵皇家马德里的欧冠比赛中发生的种族歧视事件，暂停了五名支持者的资格。俱乐部的行动反映了对抗足球运动中种族歧视的持续努力。"
      },
      "fr": {
        "title": "Benfica suspend cinq supporters pour incidents racistes",
        "summary": "Benfica a suspendu cinq supporters suite à des incidents racistes lors du récent match de Ligue des champions contre le Real Madrid. L'action du club reflète les efforts continus pour combattre le racisme dans le football."
      },
      "de": {
        "title": "Benfica sperrt fünf Fans wegen rassistischer Vorfälle",
        "summary": "Benfica sperrte fünf Anhänger nach rassistischen Vorfällen beim jüngsten Champions-League-Spiel gegen Real Madrid. Die Maßnahme des Clubs spiegelt die andauernden Bemühungen wider, Rassismus im Fußball zu bekämpfen."
      },
      "es": {
        "title": "Benfica suspende a cinco aficionados por incidentes racistas",
        "summary": "Benfica suspendió a cinco seguidores tras incidentes racistas durante el reciente partido de la Champions League contra el Real Madrid. La acción del club refleja los esfuerzos continuos por combatir el racismo en el fútbol."
      }
    }
  },
  {
    "title": "What next for Salah and Liverpool?",
    "slug": "what-next-salah-liverpool",
    "url": "https://www.bbc.com/sport/football/articles/ce8w4r130z8o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T06:18:43.000Z",
    "summary": "Mohamed Salah is regularly starting for Liverpool again, but questions linger about the record-breaking Egyptian's future at the club. The situation suggests a potential farewell may be approaching.",
    "content": "Mohamed Salah is once again regularly starting for Liverpool but is this the start of a long goodbye for the record-breaking Egyptian at Anfield",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "萨拉赫和利物浦的下一步是什么?",
        "summary": "穆罕默德·萨拉赫再次经常为利物浦首发出场，但人们对这位创纪录的埃及球员在俱乐部的未来仍有疑问。这种情况表明可能的告别即将来临。"
      },
      "fr": {
        "title": "Quel avenir pour Salah et Liverpool?",
        "summary": "Mohamed Salah joue régulièrement à nouveau pour Liverpool, mais des questions subsistent sur l'avenir de l'Égyptien qui détient des records au club. La situation suggère qu'un potentiel adieu pourrait être imminent."
      },
      "de": {
        "title": "Was kommt als nächstes für Salah und Liverpool?",
        "summary": "Mohamed Salah spielt regelmäßig wieder für Liverpool, aber es bleiben Fragen über die Zukunft des ägyptischen Rekordhalters im Club. Die Situation deutet darauf hin, dass ein mögliches Abschied bevorstehen könnte."
      },
      "es": {
        "title": "¿Qué sigue para Salah y Liverpool?",
        "summary": "Mohamed Salah está jugando regularmente de nuevo para Liverpool, pero persisten las dudas sobre el futuro del egipcio que establece récords en el club. La situación sugiere que una posible despedida podría estar cerca."
      }
    }
  },
  {
    "title": "The moment I told my mum I wanted to stop football - and how life changed",
    "slug": "leah-williamson-stop-football-life-changed",
    "url": "https://www.bbc.com/sport/football/articles/c363j2ygwy8o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T06:18:00.000Z",
    "summary": "England captain Leah Williamson shares her journey in football and life away from the game in an interview with Kelly Somers. She discusses the moment she told her mother about stepping away from football and how that decision changed her life.",
    "content": "England captain Leah Williamson tells presenter Kelly Somers about her journey in football - and life away from the game.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "我告诉妈妈我想停止踢足球的时刻——以及生活如何改变",
        "summary": "英格兰队长利亚·威廉姆森在与凯利·萨默斯的采访中分享了她在足球和远离足球生活中的旅程。她讨论了告诉母亲自己决定远离足球的时刻，以及这个决定如何改变了她的生活。"
      },
      "fr": {
        "title": "Le moment où j'ai dit à ma mère que je voulais arrêter le football - et comment la vie a changé",
        "summary": "La capitaine de l'Angleterre Leah Williamson partage son parcours dans le football et la vie loin du jeu dans une interview avec Kelly Somers. Elle discute du moment où elle a dit à sa mère qu'elle voulait s'éloigner du football et comment cette décision a changé sa vie."
      },
      "de": {
        "title": "Der Moment, in dem ich meiner Mutter sagte, dass ich Fußball aufgeben wollte - und wie sich das Leben veränderte",
        "summary": "Englands Kapitänin Leah Williamson teilt ihre Reise im Fußball und im Leben jenseits des Spiels in einem Interview mit Kelly Somers. Sie diskutiert den Moment, in dem sie ihrer Mutter sagte, dass sie sich vom Fußball zurückziehen wollte, und wie diese Entscheidung ihr Leben veränderte."
      },
      "es": {
        "title": "El momento en que le dije a mi madre que quería dejar el fútbol - y cómo cambió la vida",
        "summary": "La capitana de Inglaterra Leah Williamson comparte su viaje en el fútbol y la vida lejos del juego en una entrevista con Kelly Somers. Ella discute el momento en que le dijo a su madre que quería alejarse del fútbol y cómo esa decisión cambió su vida."
      }
    }
  },
  {
    "title": "'Everybody knew what they were part of' - Williamson on Euro 2022",
    "slug": "williamson-euro-2022-everybody-knew",
    "url": "https://www.bbc.com/sport/football/videos/c5y40z8n6jzo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T06:16:24.000Z",
    "summary": "Leah Williamson reflects on her Euro 2022 experience in an interview with Kelly Somers. She discusses the shared understanding among everyone involved about being part of that historic tournament.",
    "content": "Leah Williamson speaks to Kelly Somers on The Football Interview.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"每个人都知道他们是其中的一部分\" - 威廉森谈欧洲杯2022",
        "summary": "利亚·威廉森在与凯利·桑默斯的采访中反思了她在欧洲杯2022的经历。她讨论了所有参与者对于成为那个历史性赛事一部分的共同理解。"
      },
      "fr": {
        "title": "\"Tout le monde savait ce dont ils faisaient partie\" - Williamson sur Euro 2022",
        "summary": "Leah Williamson revient sur son expérience à l'Euro 2022 dans une interview avec Kelly Somers. Elle discute de la compréhension commune chez tous les participants d'être partie de ce tournoi historique."
      },
      "de": {
        "title": "\"Jeder wusste, wessen Teil sie waren\" - Williamson über Euro 2022",
        "summary": "Leah Williamson reflektiert auf ihr Erlebnis bei der Euro 2022 in einem Interview mit Kelly Somers. Sie spricht über das gemeinsame Verständnis aller Beteiligten, Teil dieses historischen Turniers zu sein."
      },
      "es": {
        "title": "\"Todos sabían de qué eran parte\" - Williamson sobre Euro 2022",
        "summary": "Leah Williamson reflexiona sobre su experiencia en la Euro 2022 en una entrevista con Kelly Somers. Ella discute la comprensión compartida entre todos los involucrados sobre ser parte de ese torneo histórico."
      }
    }
  }
]