[
  {
    "title": "West Ham must sell players in summer after £104m loss",
    "slug": "west-ham-must-sell-players-summer-104m-loss",
    "url": "https://www.bbc.com/sport/football/articles/cn4g0e2weqdo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T10:03:43.000Z",
    "summary": "West Ham revealed a £104.2m loss for the last financial year and must sell players this summer to address financial challenges, even if they avoid relegation. The substantial deficit puts pressure on the club's ability to retain talent and invest in squad improvements.",
    "content": "West Ham will need to sell players this summer even if they avoid relegation from the Premier League, after revealing a £104.2m loss for the last financial year.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "韦斯特汉姆必须在夏天出售球员以弥补1.04亿英镑的亏损",
        "summary": "韦斯特汉姆公布去年亏损1.042亿英镑，必须在今年夏天出售球员以应对财务挑战，即使他们避免降级。这笔巨大的赤字给俱乐部保留人才和投资阵容改进的能力带来压力。"
      },
      "fr": {
        "title": "West Ham doit vendre des joueurs cet été après une perte de 104 millions de livres",
        "summary": "West Ham a révélé une perte de 104,2 millions de livres pour le dernier exercice financier et doit vendre des joueurs cet été pour faire face aux défis financiers, même s'ils évitent la relégation. Le déficit substantiel exerce une pression sur la capacité du club à conserver les talents et à investir dans les améliorations de l'équipe."
      },
      "de": {
        "title": "West Ham muss Spieler im Sommer nach Verlust von 104 Millionen Pfund verkaufen",
        "summary": "West Ham meldete einen Verlust von 104,2 Millionen Pfund für das letzte Geschäftsjahr und muss Spieler in diesem Sommer verkaufen, um sich finanziellen Herausforderungen zu stellen, auch wenn sie den Abstieg vermeiden. Das erhebliche Defizit belastet die Fähigkeit des Clubs, Talente zu halten und in Kaderverbesserungen zu investieren."
      },
      "es": {
        "title": "West Ham debe vender jugadores en verano después de una pérdida de 104 millones de libras",
        "summary": "West Ham reveló una pérdida de 104,2 millones de libras para el último año fiscal y debe vender jugadores este verano para hacer frente a los desafíos financieros, incluso si evitan el descenso. El déficit sustancial ejerce presión sobre la capacidad del club para retener talento e invertir en mejoras de la plantilla."
      }
    }
  },
  {
    "title": "Transfer rumors, news: Man City, Man United in race to sign Anderson",
    "slug": "man-city-man-united-anderson-transfer",
    "url": "https://www.espn.com/soccer/story/_/id/48060133/transfer-rumors-news-manchester-city-manchester-united-nottingham-forest-elliot-anderson",
    "source": "ESPN Soccer",
    "date": "2026-02-28T09:51:59.000Z",
    "summary": "Manchester City and Manchester United are competing to sign Nottingham Forest's Elliot Anderson this summer. The transfer battle reflects both clubs' interest in the midfielder as a key target.",
    "content": "Manchester City and Manchester United are set for a battle to sign Nottingham Forest's Elliot Anderson this summer. Transfer Talk has the latest.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "转会传闻：曼城和曼联争夺安德森",
        "summary": "曼彻斯特城和曼彻斯特联正在竞争签下诺丁汉森林的埃利奥特·安德森。这场转会争夺战反映了两家俱乐部对中场球员作为关键目标的兴趣。"
      },
      "fr": {
        "title": "Rumeurs et nouvelles de transfert : Manchester City, Manchester United en course pour signer Anderson",
        "summary": "Manchester City et Manchester United se disputent la signature d'Elliot Anderson de Nottingham Forest cet été. La bataille de transfert reflète l'intérêt des deux clubs pour le milieu de terrain en tant que cible clé."
      },
      "de": {
        "title": "Transfergerüchte: Manchester City und Manchester United konkurrieren um Anderson",
        "summary": "Manchester City und Manchester United konkurrieren um die Verpflichtung von Elliot Anderson von Nottingham Forest in diesem Sommer. Der Transferkampf spiegelt das Interesse beider Clubs an dem Mittelfeldspieler als Schlüsselziel wider."
      },
      "es": {
        "title": "Rumores de transferencia: Manchester City y Manchester United compiten por fichar a Anderson",
        "summary": "Manchester City y Manchester United compiten por fichar a Elliot Anderson del Nottingham Forest este verano. La batalla de transferencia refleja el interés de ambos clubes en el centrocampista como objetivo clave."
      }
    }
  },
  {
    "title": "Rangers keen on midfielder Ashia - gossip",
    "slug": "rangers-keen-midfielder-ashia",
    "url": "https://www.bbc.com/sport/football/articles/cjd90v4grxpo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T08:44:21.000Z",
    "summary": "Rangers are pursuing an attacking midfielder from England's League One while Celtic missed out on a Norwegian striker target. Both Scottish clubs remain active in the transfer market.",
    "content": "Rangers eye attacking midfielder in England's League One, while Celtic miss the boat on Norwegian striker...",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "流浪者队对中场球员阿西亚感兴趣——八卦",
        "summary": "流浪者队正在追求英格兰英乙联赛的一名前腰球员，而凯尔特人队错过了一名挪威前锋目标。两支苏格兰球队仍在转会市场上保持活跃。"
      },
      "fr": {
        "title": "Les Rangers intéressés par le milieu de terrain Ashia - commérages",
        "summary": "Les Rangers poursuivent un milieu offensif de la Ligue anglaise One tandis que Celtic a raté une cible attaquante norvégienne. Les deux clubs écossais restent actifs sur le marché des transferts."
      },
      "de": {
        "title": "Rangers interessiert an Mittelfeldspieler Ashia – Gerüchte",
        "summary": "Rangers verfolgt einen angreifenden Mittelfeldspieler aus Englands League One, während Celtic ein norwegisches Stürmer-Ziel verpasste. Beide schottischen Clubs bleiben auf dem Transfermarkt aktiv."
      },
      "es": {
        "title": "Rangers interesados en el centrocampista Ashia - cotilleo",
        "summary": "Rangers persigue a un centrocampista atacante de la League One de Inglaterra, mientras que Celtic se perdió un objetivo de delantero noruego. Ambos clubes escoceses siguen activos en el mercado de transferencias."
      }
    }
  },
  {
    "title": "Benfica suspend five fans over racist incidents",
    "slug": "benfica-suspend-five-fans-racist-incidents",
    "url": "https://www.bbc.com/sport/football/articles/cwy6kz692lyo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T08:38:04.000Z",
    "summary": "Benfica suspended five supporters following racist incidents during the recent Champions League match against Real Madrid. The club's action reflects ongoing efforts to combat racism in football.",
    "content": "Benfica suspend five supporters for racist incidents following the recent Champions League game against Real Madrid.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "本菲卡因种族歧视事件暂停五名球迷资格",
        "summary": "本菲卡因最近对阵皇家马德里的欧冠比赛中发生的种族歧视事件，暂停了五名支持者的资格。俱乐部的行动反映了对抗足球运动中种族歧视的持续努力。"
      },
      "fr": {
        "title": "Benfica suspend cinq supporters pour incidents racistes",
        "summary": "Benfica a suspendu cinq supporters suite à des incidents racistes lors du récent match de Ligue des champions contre le Real Madrid. L'action du club reflète les efforts continus pour combattre le racisme dans le football."
      },
      "de": {
        "title": "Benfica sperrt fünf Fans wegen rassistischer Vorfälle",
        "summary": "Benfica sperrte fünf Anhänger nach rassistischen Vorfällen beim jüngsten Champions-League-Spiel gegen Real Madrid. Die Maßnahme des Clubs spiegelt die andauernden Bemühungen wider, Rassismus im Fußball zu bekämpfen."
      },
      "es": {
        "title": "Benfica suspende a cinco aficionados por incidentes racistas",
        "summary": "Benfica suspendió a cinco seguidores tras incidentes racistas durante el reciente partido de la Champions League contra el Real Madrid. La acción del club refleja los esfuerzos continuos por combatir el racismo en el fútbol."
      }
    }
  },
  {
    "title": "What next for Salah and Liverpool?",
    "slug": "what-next-salah-liverpool",
    "url": "https://www.bbc.com/sport/football/articles/ce8w4r130z8o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T06:18:43.000Z",
    "summary": "Mohamed Salah is regularly starting for Liverpool again, but questions linger about the record-breaking Egyptian's future at the club. The situation suggests a potential farewell may be approaching.",
    "content": "Mohamed Salah is once again regularly starting for Liverpool but is this the start of a long goodbye for the record-breaking Egyptian at Anfield",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "萨拉赫和利物浦的下一步是什么?",
        "summary": "穆罕默德·萨拉赫再次经常为利物浦首发出场，但人们对这位创纪录的埃及球员在俱乐部的未来仍有疑问。这种情况表明可能的告别即将来临。"
      },
      "fr": {
        "title": "Quel avenir pour Salah et Liverpool?",
        "summary": "Mohamed Salah joue régulièrement à nouveau pour Liverpool, mais des questions subsistent sur l'avenir de l'Égyptien qui détient des records au club. La situation suggère qu'un potentiel adieu pourrait être imminent."
      },
      "de": {
        "title": "Was kommt als nächstes für Salah und Liverpool?",
        "summary": "Mohamed Salah spielt regelmäßig wieder für Liverpool, aber es bleiben Fragen über die Zukunft des ägyptischen Rekordhalters im Club. Die Situation deutet darauf hin, dass ein mögliches Abschied bevorstehen könnte."
      },
      "es": {
        "title": "¿Qué sigue para Salah y Liverpool?",
        "summary": "Mohamed Salah está jugando regularmente de nuevo para Liverpool, pero persisten las dudas sobre el futuro del egipcio que establece récords en el club. La situación sugiere que una posible despedida podría estar cerca."
      }
    }
  },
  {
    "title": "The moment I told my mum I wanted to stop football - and how life changed",
    "slug": "leah-williamson-stop-football-life-changed",
    "url": "https://www.bbc.com/sport/football/articles/c363j2ygwy8o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T06:18:00.000Z",
    "summary": "England captain Leah Williamson shares her journey in football and life away from the game in an interview with Kelly Somers. She discusses the moment she told her mother about stepping away from football and how that decision changed her life.",
    "content": "England captain Leah Williamson tells presenter Kelly Somers about her journey in football - and life away from the game.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "我告诉妈妈我想停止踢足球的时刻——以及生活如何改变",
        "summary": "英格兰队长利亚·威廉姆森在与凯利·萨默斯的采访中分享了她在足球和远离足球生活中的旅程。她讨论了告诉母亲自己决定远离足球的时刻，以及这个决定如何改变了她的生活。"
      },
      "fr": {
        "title": "Le moment où j'ai dit à ma mère que je voulais arrêter le football - et comment la vie a changé",
        "summary": "La capitaine de l'Angleterre Leah Williamson partage son parcours dans le football et la vie loin du jeu dans une interview avec Kelly Somers. Elle discute du moment où elle a dit à sa mère qu'elle voulait s'éloigner du football et comment cette décision a changé sa vie."
      },
      "de": {
        "title": "Der Moment, in dem ich meiner Mutter sagte, dass ich Fußball aufgeben wollte - und wie sich das Leben veränderte",
        "summary": "Englands Kapitänin Leah Williamson teilt ihre Reise im Fußball und im Leben jenseits des Spiels in einem Interview mit Kelly Somers. Sie diskutiert den Moment, in dem sie ihrer Mutter sagte, dass sie sich vom Fußball zurückziehen wollte, und wie diese Entscheidung ihr Leben veränderte."
      },
      "es": {
        "title": "El momento en que le dije a mi madre que quería dejar el fútbol - y cómo cambió la vida",
        "summary": "La capitana de Inglaterra Leah Williamson comparte su viaje en el fútbol y la vida lejos del juego en una entrevista con Kelly Somers. Ella discute el momento en que le dijo a su madre que quería alejarse del fútbol y cómo esa decisión cambió su vida."
      }
    }
  },
  {
    "title": "'Everybody knew what they were part of' - Williamson on Euro 2022",
    "slug": "williamson-euro-2022-everybody-knew",
    "url": "https://www.bbc.com/sport/football/videos/c5y40z8n6jzo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-28T06:16:24.000Z",
    "summary": "Leah Williamson reflects on her Euro 2022 experience in an interview with Kelly Somers. She discusses the shared understanding among everyone involved about being part of that historic tournament.",
    "content": "Leah Williamson speaks to Kelly Somers on The Football Interview.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"每个人都知道他们是其中的一部分\" - 威廉森谈欧洲杯2022",
        "summary": "利亚·威廉森在与凯利·桑默斯的采访中反思了她在欧洲杯2022的经历。她讨论了所有参与者对于成为那个历史性赛事一部分的共同理解。"
      },
      "fr": {
        "title": "\"Tout le monde savait ce dont ils faisaient partie\" - Williamson sur Euro 2022",
        "summary": "Leah Williamson revient sur son expérience à l'Euro 2022 dans une interview avec Kelly Somers. Elle discute de la compréhension commune chez tous les participants d'être partie de ce tournoi historique."
      },
      "de": {
        "title": "\"Jeder wusste, wessen Teil sie waren\" - Williamson über Euro 2022",
        "summary": "Leah Williamson reflektiert auf ihr Erlebnis bei der Euro 2022 in einem Interview mit Kelly Somers. Sie spricht über das gemeinsame Verständnis aller Beteiligten, Teil dieses historischen Turniers zu sein."
      },
      "es": {
        "title": "\"Todos sabían de qué eran parte\" - Williamson sobre Euro 2022",
        "summary": "Leah Williamson reflexiona sobre su experiencia en la Euro 2022 en una entrevista con Kelly Somers. Ella discute la comprensión compartida entre todos los involucrados sobre ser parte de ese torneo histórico."
      }
    }
  }
]