[
  {
    "title": "Chelsea to host Spurs - full FA Cup quarter-final draw",
    "slug": "chelsea-hosts-spurs-fa-cup-quarter-final-draw",
    "url": "https://www.bbc.com/sport/football/articles/c2046ddmm67o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-23T22:43:45.000Z",
    "summary": "The FA Cup quarter-final draw features Chelsea hosting Tottenham, while WSL leaders Charlton Athletic face Liverpool in the Women's FA Cup quarter-finals.",
    "content": "Chelsea host Tottenham and WSL 2 leaders Charlton Athletic face Liverpool in the Women's FA Cup quarter-finals.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "切尔西主场对热刺——英足总杯八强抽签完整结果",
        "summary": "英足总杯八强抽签中，切尔西主场对阵托特纳姆，英超女子足球联赛领先者查尔顿竞技将对阵利物浦。"
      },
      "ja": {
        "title": "チェルシーがスパーズをホスト - FA杯準々決勝抽選完全結果",
        "summary": "FA杯準々決勝の抽選では、チェルシーがトットナムをホストし、一方WSLの首位チャールトン・アスレティックはリバプールと対戦します。"
      },
      "ko": {
        "title": "첼시가 스퍼스 맞이 - FA컵 8강 드로우 전체 결과",
        "summary": "FA컵 8강 드로우에서 첼시는 토트넘을 맞이하고, WSL 리더 찰튼 애슬레틱은 리버풀과 맞닥뜨립니다."
      },
      "fr": {
        "title": "Chelsea accueille Spurs - tirage complet de la Coupe FA en quart de finale",
        "summary": "Le tirage des quarts de finale de la Coupe FA présente Chelsea accueillant Tottenham, tandis que les leaders du WSL Charlton Athletic affronteront Liverpool aux quarts de finale de la Coupe FA féminine."
      },
      "de": {
        "title": "Chelsea empfängt Spurs - komplette FA-Cup-Viertelfinale-Auslosung",
        "summary": "Die FA-Cup-Viertelfinale-Auslosung sieht Chelsea, das Tottenham empfängt, während die WSL-Führenden Charlton Athletic auf Liverpool treffen."
      },
      "es": {
        "title": "Chelsea recibe a Spurs - sorteo completo de la FA Cup cuartos de final",
        "summary": "El sorteo de la cuarta ronda de la FA Cup presenta a Chelsea recibiendo a Tottenham, mientras que el líder del WSL Charlton Athletic se enfrenta a Liverpool en la cuarta ronda de la FA Cup Femenina."
      }
    }
  },
  {
    "title": "Everton worthy of more than a defeat - Moyes",
    "slug": "everton-worthy-of-more-than-defeat-moyes",
    "url": "https://www.bbc.com/sport/football/videos/cy4wdv9znwyo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-23T22:40:48.000Z",
    "summary": "Everton manager David Moyes expressed frustration after his team's 1-0 loss to Manchester United, believing they deserved a better result despite the defeat.",
    "content": "Everton manager David Moyes says his side were \"worth more than a defeat\" after losing 1-0 to Manchester United in the Premier League.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "埃弗顿配得更好——莫耶斯",
        "summary": "埃弗顿主帅大卫·莫耶斯在球队1-0负于曼联后表达了失望，认为他们应该取得更好的成绩。"
      },
      "ja": {
        "title": "エヴァートンはそれ以上の価値がある - モイーズ",
        "summary": "エヴァートンの監督デイビッド・モイーズは、チームのマンチェスター・ユナイテッドへの1-0敗北後に不満を表明し、より良い結果に値すると信じています。"
      },
      "ko": {
        "title": "에버튼은 패배 이상의 가치가 있다 - 모예스",
        "summary": "에버튼의 데이빗 모예스 감독은 맨유에 1-0으로 패배한 후 불만을 표했으며, 패배에도 불구하고 더 나은 결과를 얻을 자격이 있다고 생각합니다."
      },
      "fr": {
        "title": "Everton méritait mieux qu'une défaite - Moyes",
        "summary": "Le manager d'Everton, David Moyes, a exprimé sa frustration après la défaite 1-0 de son équipe contre Manchester United, croyant qu'ils méritaient un meilleur résultat malgré la défaite."
      },
      "de": {
        "title": "Everton verdient besser als eine Niederlage - Moyes",
        "summary": "Evertons Trainer David Moyes äußerte Frustration nach der 1:0-Niederlage seiner Mannschaft gegen Manchester United und glaubte, dass sie trotz der Niederlage ein besseres Ergebnis verdient hätten."
      },
      "es": {
        "title": "Everton merecía algo mejor que una derrota - Moyes",
        "summary": "El director de Everton, David Moyes, expresó frustración después de la derrota 1-0 de su equipo contra Manchester United, creyendo que merecían un mejor resultado a pesar de la derrota."
      }
    }
  },
  {
    "title": "Super-sub Sesko earns Man Utd win at Everton",
    "slug": "super-sub-sesko-earns-man-utd-win-everton",
    "url": "https://www.bbc.com/sport/football/videos/cwy953z4vedo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-23T22:30:11.000Z",
    "summary": "Manchester United secured a narrow 1-0 victory over Everton in the Premier League, with substitute Benjamin Sesko scoring the decisive goal.",
    "content": "Watch Premier League highlights as Manchester United earn a narrow win over Everton thanks to a goal from substitute Benjamin Sesko.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "超级替补塞斯科助曼联胜埃弗顿",
        "summary": "曼联在英超1-0险胜埃弗顿,替补球员塞斯科打进制胜球。"
      },
      "ja": {
        "title": "セスコが劇的決勝点、マンUがエバートン勝利",
        "summary": "マンUはプレミアリーグでエバートンに1-0で勝利、替え選手セスコが決勝点を決めた。"
      },
      "ko": {
        "title": "슈퍼 서브 세스코, 맨유가 에버턴 승리",
        "summary": "맨유는 프리미어리그에서 에버턴을 1-0으로 이기고, 교체 선수 세스코가 승리골을 올렸다."
      },
      "fr": {
        "title": "Sesko offre une victoire à Man Utd à Everton",
        "summary": "Man Utd a remporté une étroite victoire 1-0 sur Everton en Premier League, le remplaçant Sesko marquant le but décisif."
      },
      "de": {
        "title": "Sesko beschert Man Utd Sieg gegen Everton",
        "summary": "Man Utd sicherte sich einen knappen 1:0-Sieg gegen Everton, der Ersatzspieler Sesko erzielte das entscheidende Tor."
      },
      "es": {
        "title": "Sesko otorga victoria al Man Utd en Everton",
        "summary": "Man Utd aseguró una ajustada victoria 1-0 sobre Everton en la Premier League, el suplente Sesko anotó el gol decisivo."
      }
    }
  },
  {
    "title": "Carrick praises 'ruthless' goalscorer Sesko",
    "slug": "carrick-praises-ruthless-goalscorer-sesko",
    "url": "https://www.bbc.com/sport/football/videos/cg4gxz9xl24o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-23T22:29:19.000Z",
    "summary": "Manchester United manager Michael Carrick praised striker Benjamin Sesko's ruthless finishing and impact after he came off the bench to secure a 1-0 win at Everton.",
    "content": "Manchester United manager Michael Carrick praises the impact of striker Benjamin Sesko, who came off the bench to score in a 1-0 win at Everton.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "卡里克赞扬'无情'射手塞斯科",
        "summary": "曼联主教练卡里克赞扬前锋塞斯科无情的得分能力和影响力,他替补登场后为球队1-0战胜埃弗顿立功。"
      },
      "ja": {
        "title": "カリック監督が'冷酷な'ゴールスコアラーセスコを称賛",
        "summary": "マンチェスターUのマイケル・カリック監督はストライカーセスコの'冷酷な'得点能力と影響力を称賛、替え選手から登板して1-0勝利をもたらした。"
      },
      "ko": {
        "title": "카리크 감독이 '냉정한' 골스코어러 세스코를 칭찬",
        "summary": "맨체스터 유나이티드 감독 마이클 카리크가 스트라이커 세스코의 '냉정한' 골결정력과 영향력을 칭찬했으며, 교체로 투입된 그가 에버턴과의 경기에서 1-0 승리를 가져왔다."
      },
      "fr": {
        "title": "Carrick loue le buteur 'impitoyable' Sesko",
        "summary": "Le manager de Manchester United, Michael Carrick, a loué la finition 'impitoyable' et l'impact du buteur Benjamin Sesko après qu'il soit sorti du banc pour assurer une victoire 1-0 à Everton."
      },
      "de": {
        "title": "Carrick lobt den 'rücksichtslosen' Torschützen Sesko",
        "summary": "Manchester Uniteds Manager Michael Carrick lobte die 'rücksichtslose' Trefferquote und den Einfluss des Stürmers Benjamin Sesko, nachdem dieser von der Bank kam und einen 1:0-Sieg gegen Everton sicherte."
      },
      "es": {
        "title": "Carrick elogia al goleador 'despiadado' Sesko",
        "summary": "El manager de Manchester United, Michael Carrick, elogió la terminación 'despiadada' e impacto del delantero Benjamin Sesko después de que saliera de la banca para asegurar una victoria 1-0 en Everton."
      }
    }
  },
  {
    "title": "Police investigate 'unacceptable' online abuse of Rangers duo",
    "slug": "police-investigate-online-abuse-rangers-duo",
    "url": "https://www.bbc.com/sport/football/articles/ce823456kmmo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-23T17:01:13.000Z",
    "summary": "Police Scotland is investigating racist abuse targeting Rangers players Emmanuel Fernandez and Djeidi Gassama after they shared screenshots of hateful messages on social media.",
    "content": "Police Scotland is investigating after Rangers players Emmanuel Fernandez and Djeidi Gassama shared screenshots of racist abuse aimed at them on their social media accounts after Sunday's match in Livingston.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "警方调查对兰杰斯二人'无法接受'的网络骚扰",
        "summary": "苏格兰警方正在调查针对兰杰斯球员埃曼努埃尔·费尔南德斯和迪迪·加萨玛的种族虐待,两人在社交媒体上分享了仇恨信息的截图。"
      },
      "ja": {
        "title": "警察が'受け入れられない'ネット虐待を調査、レンジャーズ二人組が対象",
        "summary": "スコットランド警察はレンジャーズ選手エマヌエル・フェルナンデスとジェイディ・ガッサマを対象とした人種差別的虐待を調査している。両選手がソーシャルメディアで憎悪メッセージのスクリーンショットを共有した後。"
      },
      "ko": {
        "title": "경찰, 레인저스 이중주 대상 '받아들일 수 없는' 온라인 학대 조사",
        "summary": "스코틀랜드 경찰이 레인저스 선수 에마누엘 페르난데스와 제이디 가사마를 겨냥한 인종차별 학대를 조사 중이다. 두 선수가 소셜 미디어에 혐오 메시지 스크린샷을 공개한 후."
      },
      "fr": {
        "title": "La police enquête sur les abus en ligne 'inacceptables' du duo des Rangers",
        "summary": "La police écossaise enquête sur des abus racistes visant les joueurs des Rangers Emmanuel Fernandez et Djeidi Gassama après qu'ils aient partagé des captures d'écran de messages haineux sur les réseaux sociaux."
      },
      "de": {
        "title": "Polizei untersucht 'inakzeptable' Online-Anfeindungen gegen Rangers-Duo",
        "summary": "Die schottische Polizei untersucht rassistische Anfeindungen gegen die Rangers-Spieler Emmanuel Fernandez und Djeidi Gassama, nachdem diese Screenshots von Hasskommentaren in den sozialen Medien geteilt hatten."
      },
      "es": {
        "title": "Policía investiga 'inaceptable' abuso en línea contra dúo de Rangers",
        "summary": "La policía de Escocia está investigando abuso racial dirigido a los jugadores de Rangers Emmanuel Fernández y Djeidi Gassama después de que compartieron capturas de pantalla de mensajes de odio en las redes sociales."
      }
    }
  },
  {
    "title": "Benfica's Prestianni gets provisional one-match ban after Vinicius incident",
    "slug": "benfica-prestianni-provisional-ban-vinicius",
    "url": "https://www.bbc.com/sport/football/articles/cly2vj1d443o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Champions League",
    "date": "2026-02-23T15:44:45.000Z",
    "summary": "Benfica midfielder Gianluca Prestianni received a provisional one-match UEFA suspension after Real Madrid's Vinicius Jr reported alleged racist abuse during their Champions League meeting.",
    "content": "Benfica's Gianluca Prestianni receives a provisional one-match Uefa suspension after Real Madrid's Vinicius Jr reported alleged racist abuse during last week's Champions League meeting.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "本菲卡普雷斯蒂亚尼在维尼修斯事件后获得临时禁赛一场",
        "summary": "本菲卡中场吉安卢卡·普雷斯蒂亚尼在皇马球员维尼修斯Jr在欧冠比赛中报告涉嫌种族歧视辱骂后，获得临时禁赛一场的欧足联处罚。"
      },
      "ja": {
        "title": "ベンフィカのプレスティアーニ、ヴィニシウスインシデント後の仮一試合出場禁止",
        "summary": "ベンフィカのミッドフィルダー、ジャンルカ・プレスティアーニは、チャンピオンズリーグの試合でレアル・マドリードのヴィニシウスJrが人種差別的虐待の疑いを報告した後、UEFA から仮の一試合出場禁止処分を受けた。"
      },
      "ko": {
        "title": "비니시우스 사건 후 벤피카 프레스티아니 한 경기 임시 출전 금지",
        "summary": "벤피카 미드필더 지안루카 프레스티아니는 챔피언스리그 경기에서 레알 마드리드의 비니시우스 주니어가 인종 차별 학대 혐의를 보도한 후 UEFA로부터 한 경기 임시 출전 금지 처분을 받았다."
      },
      "fr": {
        "title": "Prestianni de Benfica reçoit une suspension provisoire d'un match après l'incident Vinicius",
        "summary": "Le milieu de terrain de Benfica Gianluca Prestianni a reçu une suspension provisoire d'un match de l'UEFA après que le rapport de Vinicius Jr de Real Madrid ait allégué des abus racistes lors de leur rencontre de Ligue des champions."
      },
      "de": {
        "title": "Benficas Prestianni erhält nach Vinicius-Vorfall provisorisches Einspielverbot",
        "summary": "Benficas Mittelfeldspieler Gianluca Prestianni erhielt nach Vinicius Jr. von Real Madrid einen provisorischen einspielbedingten UEFA-Sperrantrag wegen mutmaßlichen rassistischen Missbrauchs während ihres Champions-League-Treffens."
      },
      "es": {
        "title": "Prestianni del Benfica recibe prohibición provisional de un partido tras incidente de Vinicius",
        "summary": "El centrocampista del Benfica Gianluca Prestianni recibió una suspensión provisional de un partido de la UEFA después de que el lateral de Real Madrid Vinicius Jr informara de presuntos abusos racistas durante su encuentro de Liga de Campeones."
      }
    }
  },
  {
    "title": "How league-worst late-goal record continues to cost Leeds",
    "slug": "how-league-worst-late-goal-record-costs-leeds",
    "url": "https://www.bbc.com/sport/football/articles/c8xy5ppnn15o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Premier League",
    "date": "2026-02-23T15:32:42.000Z",
    "summary": "Leeds United's league-worst record of conceding late goals cost them again on Saturday; statistics show they would rank ninth if matches ended after 85 minutes.",
    "content": "After conceding another late goal on Saturday, we look at the stats that show Leeds would be ninth in the Premier League if games ended after 85 minutes.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "联赛最差的后期进球纪录如何继续伤害利兹",
        "summary": "利兹联队在周六再次被他们联赛最差的后期丢球纪录所伤害；数据显示如果比赛在85分钟后结束，他们将排名第九。"
      },
      "ja": {
        "title": "リーグ最悪の後半ゴール記録がリーズを継続して傷つける",
        "summary": "リーズ・ユナイテッドのリーグ最悪の後半ゴール失点記録は土曜日に再び彼らを傷つけた。統計によると、試合が85分後に終了した場合、彼らは9位にランクされます。"
      },
      "ko": {
        "title": "리그 최악의 후반 골 기록이 리즈에 계속 해를 끼치는 방법",
        "summary": "리즈 유나이티드의 리그 최악의 후반 실점 기록은 토요일 다시 그들에게 해를 끼쳤다. 통계에 따르면 85분 후 경기가 끝났다면 그들은 9위에 랭크될 것이다."
      },
      "fr": {
        "title": "Comment le pire bilan des buts tardifs de la ligue coûte cher à Leeds",
        "summary": "Le pire bilan de Leeds en termes de buts encaissés tardivement a à nouveau coûté cher à l'équipe samedi ; les statistiques montrent qu'ils se classaient neuvièmes si les matchs se terminaient après 85 minutes."
      },
      "de": {
        "title": "Wie Leedsʼ schlechteste Spättor-Bilanz der Liga sie weiterhin kostet",
        "summary": "Leedsʼ ligaweit schlechteste Bilanz der späten Gegentore kostete sie am Samstag erneut; die Statistiken zeigen, dass sie neuntplatziert wären, wenn Spiele nach 85 Minuten endeten."
      },
      "es": {
        "title": "Cómo el peor récord de goles tardíos de la liga continúa costándole a Leeds",
        "summary": "El peor récord de la liga de Leeds de goles encajados en los últimos minutos volvió a perjudicarlos el sábado; las estadísticas muestran que ocuparían el noveno lugar si los partidos terminaran después de 85 minutos."
      }
    }
  },
  {
    "title": "VAR vs TMO – what are the key differences?",
    "slug": "var-vs-tmo-key-differences",
    "url": "https://www.bbc.com/sport/articles/cvgjp5v000go?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-23T15:14:37.000Z",
    "summary": "BBC Sport compares football's Video Assistant Referee system with rugby union's Television Match Official approach, highlighting key operational differences between the two systems.",
    "content": "BBC Sport's Ask Me Anything looks at the key differences between football's video assistant referees and rugby union's use of television match officials.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "VAR与TMO——主要区别是什么？",
        "summary": "BBC体育对比了足球的视频助理裁判系统与橄榄球的电视裁判方式，突出了两个系统之间的关键操作差异。"
      },
      "ja": {
        "title": "VARとTMO——主な違いは何か？",
        "summary": "BBC Sportは、フットボールのビデオアシスタントレフェリーシステムとラグビーユニオンのテレビマッチオフィシャルアプローチを比較し、2つのシステム間の主な運営上の違いを強調しています。"
      },
      "ko": {
        "title": "VAR 대 TMO — 주요 차이점은 무엇입니까?",
        "summary": "BBC Sport은 축구의 비디오 어시스턴트 심판 시스템과 럭비 유니온의 텔레비전 매치 오피셜 방식을 비교하여 두 시스템 간의 주요 운영 차이점을 강조합니다."
      },
      "fr": {
        "title": "VAR vs TMO – quelles sont les différences clés ?",
        "summary": "BBC Sport compare le système d'arbitre assistant vidéo du football avec l'approche de l'arbitre vidéo du rugby à XV, en soulignant les différences opérationnelles clés entre les deux systèmes."
      },
      "de": {
        "title": "VAR vs. TMO – Was sind die Hauptunterschiede?",
        "summary": "BBC Sport vergleicht das Video-Schiedsrichter-System des Fußballs mit dem Fernseh-Match-Official-Ansatz des Rugbys und hebt die wichtigsten operativen Unterschiede zwischen den beiden Systemen hervor."
      },
      "es": {
        "title": "VAR vs TMO – ¿Cuáles son las diferencias clave?",
        "summary": "BBC Sport compara el sistema de árbitro asistente de video del fútbol con el enfoque de árbitro de partido de televisión del rugby, destacando las diferencias operacionales clave entre los dos sistemas."
      }
    }
  },
  {
    "title": "Police investigate 'abhorrent' online racist abuse of players",
    "slug": "police-investigate-online-racist-abuse-players",
    "url": "https://www.bbc.com/sport/football/articles/cx24x0vg4jvo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Premier League",
    "date": "2026-02-23T13:08:25.000Z",
    "summary": "Police are investigating after four Premier League players were targeted with online racist abuse during the weekend.",
    "content": "Police confirm they are investigating after four Premier League players were targeted by online racial abuse at the weekend.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "警方调查球员遭网络种族歧视辱骂事件",
        "summary": "四名英超球员在周末遭到网络种族歧视辱骂，警方正在调查此事。"
      },
      "ja": {
        "title": "警察が選手への『嫌悪すべき』オンラインレイシズム虐待を調査",
        "summary": "プレミアリーグの4人の選手が週末にオンラインレイシズム虐待の標的にされ、警察が調査を行っています。"
      },
      "ko": {
        "title": "경찰, 선수들을 향한 '혐오스러운' 온라인 인종차별 학대 조사",
        "summary": "프리미어 리그 선수 4명이 주말에 온라인 인종차별 학대의 표적이 되었으며, 경찰이 조사 중입니다."
      },
      "fr": {
        "title": "La police enquête sur le harcèlement raciste en ligne « répugnant » envers les joueurs",
        "summary": "La police enquête après que quatre joueurs de la Premier League ont été ciblés par du harcèlement raciste en ligne pendant le week-end."
      },
      "de": {
        "title": "Polizei untersucht 'abscheuliche' rassistische Online-Belästigung von Spielern",
        "summary": "Die Polizei untersucht, nachdem vier Premier-League-Spieler am Wochenende Ziel von rassistischer Online-Belästigung waren."
      },
      "es": {
        "title": "La policía investiga el acoso racista en línea 'abominable' de los jugadores",
        "summary": "La policía investiga después de que cuatro jugadores de la Premier League fueran atacados con abuso racista en línea durante el fin de semana."
      }
    }
  },
  {
    "title": "Unlicensed betting firms face ban on sponsoring British sports teams",
    "slug": "unlicensed-betting-firms-ban-sponsoring-british-sports",
    "url": "https://www.bbc.com/sport/football/articles/cx289xwl03vo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-23T12:59:58.000Z",
    "summary": "The UK government is proposing a ban on unlicensed gambling companies from sponsoring British sports teams, including Premier League clubs, as part of enhanced gambling regulations.",
    "content": "Gambling firms not licensed in the UK could be banned from sponsoring British sports teams - including Premier League clubs - as part of a government crackdown.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "无执照博彩公司面临禁止赞助英国体育队伍",
        "summary": "英国政府提议禁止无执照博彩公司赞助英国体育队伍，包括英超俱乐部，作为加强博彩监管的一部分。"
      },
      "ja": {
        "title": "違法賭博会社、英国スポーツチームのスポンサーシップ禁止に直面",
        "summary": "英国政府は、強化されたギャンブル規制の一部として、違法ギャンブル企業に対して英国スポーツチーム（プレミアリーグクラブを含む）のスポンサーシップを禁止することを提案しています。"
      },
      "ko": {
        "title": "미허가 베팅 회사, 영국 스포츠팀 스폰서 금지 직면",
        "summary": "영국 정부는 강화된 도박 규제의 일부로 미허가 도박 회사가 프리미어 리그 클럽을 포함한 영국 스포츠팀을 스폰서하는 것을 금지할 것을 제안하고 있습니다."
      },
      "fr": {
        "title": "Les sociétés de paris non agréées font face à une interdiction de parrainage des équipes sportives britanniques",
        "summary": "Le gouvernement britannique propose une interdiction aux sociétés de jeux d'argent non agréées de parrainer les équipes sportives britanniques, y compris les clubs de la Premier League, dans le cadre d'une réglementation renforcée des jeux d'argent."
      },
      "de": {
        "title": "Unlizenzierte Wettunternehmen erhalten Verbot für die Sponserung britischer Sportmannschaften",
        "summary": "Die britische Regierung schlägt ein Verbot für unlizenzierte Glücksspielunternehmen vor, britische Sportmannschaften, einschließlich Premier-League-Clubs, zu sponsern, als Teil verstärkter Glücksspielvorschriften."
      },
      "es": {
        "title": "Casas de apuestas sin licencia enfrentan prohibición de patrocinio de equipos deportivos británicos",
        "summary": "El gobierno del Reino Unido propone prohibir que las compañías de juegos de azar sin licencia patrocinen equipos deportivos británicos, incluidos los clubes de la Premier League, como parte de una regulación de juegos más estricta."
      }
    }
  },
  {
    "title": "Scotland lose Maclean and Cornet for World Cup qualifying openers",
    "slug": "scotland-lose-maclean-cornet-world-cup-qualifying",
    "url": "https://www.bbc.com/sport/football/articles/cy0dqr1en95o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-23T11:41:27.000Z",
    "summary": "Scotland's women's football team has lost midfielders Kirsty Maclean and Chelsea Cornet to injury for their opening World Cup qualifying matches against Luxembourg.",
    "content": "Scotland have lost midfield duo Kirsty Maclean and Chelsea Cornet to injury for their opening World Cup qualifiers against Luxembourg.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "苏格兰在世界杯预选赛首战中失去麦克莱恩和科尔内",
        "summary": "苏格兰女子足球队的中场球员克里斯蒂·麦克莱恩和切尔西·科尔内因伤无法参加对卢森堡的世界杯预选赛首场比赛。"
      },
      "ja": {
        "title": "スコットランドが世界杯予選オープナーでマクリーンとコルネットを失う",
        "summary": "スコットランドの女子サッカーチームは、ルクセンブルクとの世界杯予選オープニングマッチのために、MFクリスティ・マクリーンとチェルシー・コルネットを怪我で失いました。"
      },
      "ko": {
        "title": "스코틀랜드, 월드컵 예선전 개막전에서 매클린과 코르넷 상실",
        "summary": "스코틀랜드 여자 축구팀은 룩셈부르크와의 월드컵 예선 개막전에서 미드필더 크리스티 매클린과 첼시 코르넷을 부상으로 잃었습니다."
      },
      "fr": {
        "title": "L'Écosse perd Maclean et Cornet pour les premiers matchs des qualifications de la Coupe du monde",
        "summary": "L'équipe de football féminin d'Écosse a perdu les milieux de terrain Kirsty Maclean et Chelsea Cornet en raison de blessures pour ses premiers matchs de qualification pour la Coupe du monde contre le Luxembourg."
      },
      "de": {
        "title": "Schottland verliert Maclean und Cornet für die Eröffnungsspiele der Weltmeisterschaftsqualifikation",
        "summary": "Schottlands Frauenfußballnationalmannschaft verliert die Mittelfeldspieler Kirsty Maclean und Chelsea Cornet durch Verletzungen für ihre Eröffnungsspiele der Weltmeisterschaftsqualifikation gegen Luxemburg."
      },
      "es": {
        "title": "Escocia pierde a Maclean y Cornet para los primeros partidos de la clasificación de la Copa Mundial",
        "summary": "El equipo de fútbol femenino de Escocia ha perdido a los centrocampistas Kirsty Maclean y Chelsea Cornet por lesión para sus primeros partidos de clasificación para la Copa Mundial contra Luxemburgo."
      }
    }
  },
  {
    "title": "Spurs' league position is a 'big concern' - Rooney",
    "slug": "spurs-league-position-big-concern-rooney",
    "url": "https://www.bbc.com/sport/football/videos/cgl5zld2wxzo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-23T09:44:36.000Z",
    "summary": "Wayne Rooney discusses concerns about Tottenham Hotspur's league position and the risk of relegation this season.",
    "content": "Wayne Rooney discusses the possibility of Tottenham Hotspur getting relegated this season.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "托特纳姆的联赛位置是'大问题'——鲁尼",
        "summary": "韦恩·鲁尼讨论了热刺的联赛位置以及本赛季降级风险的担忧。"
      },
      "ja": {
        "title": "トッテナムのリーグ順位は'大きな懸念'—ルーニー",
        "summary": "ウェイン・ルーニーはトッテナムのリーグ順位と今シーズンの降格リスクについての懸念を議論している。"
      },
      "ko": {
        "title": "토트넘의 리그 위치는 '큰 우려'—루니",
        "summary": "웨인 루니가 토트넘의 리그 위치와 이번 시즌 강등 위험에 대한 우려를 논의한다."
      },
      "fr": {
        "title": "La position de Tottenham en ligue est une 'grande préoccupation' - Rooney",
        "summary": "Wayne Rooney discute des préoccupations concernant la position de Tottenham en ligue et le risque de relégation cette saison."
      },
      "de": {
        "title": "Tottenhams Ligaposition ist ein 'großes Anliegen' - Rooney",
        "summary": "Wayne Rooney erörtert Bedenken bezüglich Tottenhams Ligaposition und des Abstiegsrisikos in dieser Saison."
      },
      "es": {
        "title": "La posición del Tottenham en la liga es una 'gran preocupación' - Rooney",
        "summary": "Wayne Rooney discute las preocupaciones sobre la posición del Tottenham en la liga y el riesgo de descenso esta temporada."
      }
    }
  },
  {
    "title": "Why Man Utd fans should be glad if Maguire extends stay",
    "slug": "why-man-utd-fans-glad-maguire-extends-stay",
    "url": "https://www.bbc.com/sport/football/articles/cg4gvxw24l0o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Premier League",
    "date": "2026-02-23T06:20:58.000Z",
    "summary": "According to multiple sources, Harry Maguire is likely to remain at Manchester United for at least next season, a development analyst Simon Stone argues fans should welcome.",
    "content": "Fans should welcome the belief of sources on all sides that Harry Maguire will remain at Manchester United at least for next season, writes Simon Stone.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "曼联球迷应该庆幸马奎尔延长留队",
        "summary": "据多个消息来源，哈里·马奎尔可能会至少在下个赛季继续效力曼联，分析师西蒙·斯通认为球迷应该为此高兴。"
      },
      "ja": {
        "title": "マグワイアが留任を延長した場合、マンUファンが喜ぶべき理由",
        "summary": "複数の情報筋によると、ハリー・マグワイアは来シーズン少なくとも1シーズンはマンチェスター・ユナイテッドに留まる可能性が高く、アナリストのサイモン・ストーンは、ファンはこの動きを歓迎すべきだと主張している。"
      },
      "ko": {
        "title": "맥과이어가 잔류를 연장할 경우 맨유 팬들이 기뻐할 이유",
        "summary": "여러 소식통에 따르면 해리 맥과이어는 최소한 내시즌까지 맨체스터 유나이티드에 남을 가능성이 높으며, 분석가 사이먼 스톤은 팬들이 이를 환영해야 한다고 주장한다."
      },
      "fr": {
        "title": "Pourquoi les fans de Man Utd devraient être heureux si Maguire prolonge son séjour",
        "summary": "Selon plusieurs sources, Harry Maguire est susceptible de rester à Manchester United au moins la saison prochaine, un développement que l'analyste Simon Stone argue que les fans devraient accueillir."
      },
      "de": {
        "title": "Warum sich Manchester United-Fans freuen sollten, wenn Maguire verlängert",
        "summary": "Nach Angaben mehrerer Quellen wird Harry Maguire wahrscheinlich mindestens nächste Saison bei Manchester United bleiben, eine Entwicklung, die Analyst Simon Stone argumentiert, sollten die Fans begrüßen."
      },
      "es": {
        "title": "Por qué los aficionados del Manchester United deberían estar felices si Maguire se queda",
        "summary": "Según múltiples fuentes, Harry Maguire probablemente permanecerá en el Manchester United al menos la próxima temporada, un desarrollo que el analista Simon Stone argumenta que los aficionados deberían acoger."
      }
    }
  },
  {
    "title": "The former kitman, 102, who left his mark on the World Cup",
    "slug": "former-kitman-102-left-mark-world-cup",
    "url": "https://www.bbc.com/news/articles/cjwz01gzwy2o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-23T06:13:17.000Z",
    "summary": "Charlie O'Leary, 102, was the Republic of Ireland kitman whose influence extends far beyond his official role, shaping football development across the island.",
    "content": "Charlie O'Leary was the Republic of Ireland kitman, but his influence extends to football across the island.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "那位102岁的前球队管理员对世界杯的深远影响",
        "summary": "102岁的查理·奥利利是爱尔兰共和国的球队管理员，他的影响远超其官方角色，塑造了整个爱尔兰的足球发展。"
      },
      "ja": {
        "title": "ワールドカップに足跡を残した102歳の元キットマン",
        "summary": "102歳のチャーリー・オリアリーはアイルランド共和国のキットマンで、公式な役割をはるかに超えた影響力を持ち、アイルランド全島の足球発展を形作った。"
      },
      "ko": {
        "title": "월드컵에 영향을 미친 102세 전(前) 킷맨",
        "summary": "102세의 찰리 오리어리는 아일랜드 공화국의 킷맨으로, 공식 역할을 훨씬 넘어 영향력을 행사하며 아일랜드 전역의 축구 발전을 형성했다."
      },
      "fr": {
        "title": "L'ancien soigneur, 102 ans, qui a laissé son empreinte sur la Coupe du monde",
        "summary": "Charlie O'Leary, 102 ans, était le soigneur de la République d'Irlande dont l'influence s'étend bien au-delà de son rôle officiel, façonnant le développement du football sur toute l'île."
      },
      "de": {
        "title": "Der ehemalige Betreuer, 102 Jahre alt, der seine Spuren bei der Weltmeisterschaft hinterließ",
        "summary": "Charlie O'Leary, 102 Jahre alt, war der irische Betreuer, dessen Einfluss weit über seine offizielle Rolle hinausgeht und die Fußballentwicklung auf der ganzen Insel geprägt hat."
      },
      "es": {
        "title": "El antiguo encargado de equipaje, 102 años, que dejó su huella en el Mundial",
        "summary": "Charlie O'Leary, 102 años, fue el encargado de equipaje de la República de Irlanda cuya influencia va mucho más allá de su rol oficial, moldeando el desarrollo del fútbol en toda la isla."
      }
    }
  }
]