[
  {
    "title": "Emery's title 'dream' over - but will Villa salvage top-five hopes?",
    "slug": "emerys-title-dream-over-villa-salvage-top-five",
    "url": "https://www.bbc.com/sport/football/articles/c78x13vvnv5o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T23:55:02.000Z",
    "summary": "Aston Villa manager Unai Emery has accepted that his side's Premier League title ambitions are no longer realistic. The club now focuses on salvaging their Champions League qualification hopes after recent setbacks.",
    "content": "Aston Villa boss Unai Emery concedes his Premier League title \"dreams\" are over, but will the club resurrect their Champions League hopes?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "埃梅里的冠军\"梦想\"落空——阿斯顿维拉能否拯救前五的希望？",
        "summary": "阿斯顿维拉主教练乌奈·埃梅里已接受球队英超联赛冠军雄心不再现实的事实。在近期挫折后，俱乐部现在专注于拯救欧冠资格赛的希望。"
      },
      "fr": {
        "title": "Le \"rêve\" de titre d'Emery est terminé - mais la Villa pourra-t-elle sauver ses espoirs de top 5 ?",
        "summary": "Le manager d'Aston Villa, Unai Emery, a accepté que les ambitions de titre de Premier League de son équipe ne soient plus réalistes. Le club se concentre désormais sur le sauvetage de ses espoirs de qualification pour la Ligue des champions après des revers récents."
      },
      "de": {
        "title": "Emerys Titel-\"Traum\" vorbei - aber kann Villa die Top-Five-Hoffnungen retten?",
        "summary": "Aston-Villa-Manager Unai Emery hat akzeptiert, dass die Meisterschaftsambitionen seines Teams in der Premier League nicht mehr realistisch sind. Der Club konzentriert sich nun darauf, seine Hoffnungen auf die Champions-League-Qualifikation nach den jüngsten Rückschlägen zu retten."
      },
      "es": {
        "title": "El \"sueño\" de título de Emery ha terminado - ¿pero puede Villa salvaguardar sus esperanzas de top cinco?",
        "summary": "El manager del Aston Villa, Unai Emery, ha aceptado que las ambiciones de título de la Premier League de su equipo ya no son realistas. El club ahora se enfoca en salvaguardar sus esperanzas de calificación para la Liga de Campeones después de los reveses recientes."
      }
    }
  },
  {
    "title": "Kompany: Klassiker win deserves its own title",
    "slug": "kompany-klassiker-win-deserves-own-title",
    "url": "https://www.espn.com/soccer/story/_/id/48055929/bayern-munich-vincent-kompany-borussia-dormund-der-klassiker-title",
    "source": "ESPN Soccer",
    "date": "2026-02-27T23:51:45.000Z",
    "summary": "Bayern Munich manager Vincent Kompany emphasized the significance of his team's Der Klassiker victory over Borussia Dortmund. The German derby win was substantial enough to warrant special recognition according to Kompany.",
    "content": "Bayern Munich boss Vincent Kompany says winning Der Klassiker against Borussia Dortmund deserves a title in itself.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "康帕尼：德比大赛胜利值得拥有自己的名号",
        "summary": "拜仁慕尼黑主教练文森特·康帕尼强调了他的球队在德国德比中战胜多特蒙德的意义。这场德国德比胜利具有重大意义，值得特别认可。"
      },
      "fr": {
        "title": "Kompany: La victoire du Klassiker mérite son propre titre",
        "summary": "Le manager du Bayern Munich, Vincent Kompany, a souligné l'importance de la victoire de son équipe sur le Borussia Dortmund au Der Klassiker. La victoire du derby allemand était assez substantielle pour justifier une reconnaissance spéciale selon Kompany."
      },
      "de": {
        "title": "Kompany: Der Klassiker-Sieg verdient seinen eigenen Titel",
        "summary": "Bayerns Manager Vincent Kompany betonte die Bedeutung des Sieges seines Teams über Borussia Dortmund im Der Klassiker. Der deutsche Derbysieg war umfangreich genug, um laut Kompany eine besondere Anerkennung zu verdienen."
      },
      "es": {
        "title": "Kompany: La victoria del Klassiker merece su propio título",
        "summary": "El manager del Bayern Munich, Vincent Kompany, enfatizó la importancia de la victoria de su equipo sobre el Borussia Dortmund en el Der Klassiker. La victoria del derbi alemán fue lo suficientemente sustancial como para justificar un reconocimiento especial según Kompany."
      }
    }
  },
  {
    "title": "Benfica suspend 5 fans for racist acts vs. Madrid",
    "slug": "benfica-suspend-5-fans-racist-acts-madrid",
    "url": "https://www.espn.com/soccer/story/_/id/48056632/benfica-suspend-fans-racist-behaviour-real-madrid-vini-jr",
    "source": "ESPN Soccer",
    "date": "2026-02-27T23:51:45.000Z",
    "summary": "Benfica has suspended five supporters following an investigation that confirmed racist behavior during their match against Real Madrid. The action reflects the club's commitment to addressing discriminatory conduct by its fanbase.",
    "content": "Benfica suspended five supporters after an investigation found they engaged in behaviour of a \"racist nature\" in the club's match with Real Madrid.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "本菲卡禁赛5名球迷，因其在马德里比赛中的种族歧视行为",
        "summary": "本菲卡在调查证实了球队与皇家马德里比赛中的种族歧视行为后，禁赛了五名支持者。这一行动反映了俱乐部致力于解决其球迷群体中的歧视性行为的承诺。"
      },
      "fr": {
        "title": "Benfica suspend 5 supporters pour actes racistes contre Madrid",
        "summary": "Benfica a suspendu cinq supporters suite à une enquête qui a confirmé des comportements racistes lors de leur match contre le Real Madrid. Cette action reflète l'engagement du club à lutter contre les comportements discriminatoires de ses supporters."
      },
      "de": {
        "title": "Benfica sperrt 5 Fans wegen rassistischer Handlungen gegen Madrid",
        "summary": "Benfica hat fünf Anhänger nach einer Untersuchung gesperrt, die rassistisches Verhalten während ihres Spiels gegen Real Madrid bestätigt hat. Diese Maßnahme spiegelt das Engagement des Clubs wider, diskriminierendes Verhalten seiner Anhänger zu bekämpfen."
      },
      "es": {
        "title": "Benfica suspende a 5 aficionados por actos racistas contra Madrid",
        "summary": "Benfica ha suspendido a cinco aficionados tras una investigación que confirmó comportamiento racista durante su partido contra el Real Madrid. La acción refleja el compromiso del club de abordar la conducta discriminatoria de sus aficionados."
      }
    }
  },
  {
    "title": "MLS' Sullivan, 16, gets 1st goals, U.S. record",
    "slug": "mls-sullivan-16-first-goals-us-record",
    "url": "https://www.espn.com/soccer/story/_/id/48055095/philadelphia-union-cavan-sullivan-goals-concacaf-champions-cup",
    "source": "ESPN Soccer",
    "date": "2026-02-27T23:51:45.000Z",
    "summary": "Philadelphia Union's 16-year-old sensation Cavan Sullivan has scored his first professional goals, setting an American record. The teen prodigy continues to establish himself as the MLS' most promising young talent.",
    "content": "Hailed as the MLS' teen soccer sensation, 16-year-old Cavan Sullivan delivered an American scoring record with his first professional goals for the Philadelphia Union.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "MLS球员沙利文16岁打入首球,创美国纪录",
        "summary": "费城工会队16岁天才少年卡文·沙利文打进了职业生涯首球,创造了美国纪录。这位年轻天才继续证明自己是美职联最有前景的新星。"
      },
      "fr": {
        "title": "Sullivan de la MLS, 16 ans, marque ses premiers buts, record américain",
        "summary": "La sensation de 16 ans de l'Union de Philadelphie, Cavan Sullivan, a marqué ses premiers buts professionnels, établissant un record américain. Le jeune prodige continue à s'établir comme le talent le plus prometteur de la MLS."
      },
      "de": {
        "title": "MLS' Sullivan, 16, erzielt erste Tore, US-Rekord",
        "summary": "Das 16-jährige Wunderkind Cavan Sullivan von Philadelphia Union hat seine ersten Profitore erzielt und einen amerikanischen Rekord aufgestellt. Der junge Prodigy etabliert sich weiterhin als das vielversprechendste Talent der MLS."
      },
      "es": {
        "title": "Sullivan de la MLS, 16 años, anota sus primeros goles, récord estadounidense",
        "summary": "La sensación de 16 años de la Unión de Filadelfia, Cavan Sullivan, ha anotado sus primeros goles profesionales, estableciendo un récord estadounidense. El joven prodigio continúa estableciéndose como el talento más prometedor de la MLS."
      }
    }
  },
  {
    "title": "Barça now punishing late players with 'huge' fines",
    "slug": "barca-punishing-late-players-huge-fines",
    "url": "https://www.espn.com/soccer/story/_/id/48056354/barcelona-punishment-late-players-fines-bench-hansi-flick",
    "source": "ESPN Soccer",
    "date": "2026-02-27T23:51:45.000Z",
    "summary": "Barcelona coach Hansi Flick has replaced player suspensions with substantial fines as punishment for late arrivals on match days. This new disciplinary approach aims to enforce punctuality and maintain team standards.",
    "content": "Barcelona coach Hansi Flick confirmed he has replaced dropping players with \"huge\" fines in the event they arrive late on match days.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "巴塞罗那现在用\"巨额\"罚款惩罚迟到球员",
        "summary": "巴塞罗那主教练汉西·弗利克用实质性罚款代替球员禁赛来惩罚比赛日迟到。这种新的纪律处分方式旨在加强准时性并维持球队标准。"
      },
      "fr": {
        "title": "Barcelone punit maintenant les joueurs en retard avec des amendes \"énormes\"",
        "summary": "L'entraîneur de Barcelone Hansi Flick a remplacé les suspensions de joueurs par des amendes substantielles comme punition pour les arrivées tardives aux jours de match. Cette nouvelle approche disciplinaire vise à renforcer la ponctualité et à maintenir les normes de l'équipe."
      },
      "de": {
        "title": "Barcelona bestraft jetzt zu spät kommende Spieler mit \"enormen\" Geldstrafen",
        "summary": "Barcelonas Trainer Hansi Flick hat Spielersperrungen durch erhebliche Geldstrafen als Strafe für verspätete Ankünfte an Spieltagen ersetzt. Dieser neue Disziplinaransatz zielt darauf ab, Pünktlichkeit durchzusetzen und Teamstandards zu wahren."
      },
      "es": {
        "title": "Barcelona ahora castiga a los jugadores tardíos con multas \"enormes\"",
        "summary": "El entrenador del Barcelona, Hansi Flick, ha reemplazado las suspensiones de jugadores con multas sustanciales como castigo por llegadas tardías en días de partidos. Este nuevo enfoque disciplinario tiene como objetivo reforzar la puntualidad y mantener los estándares del equipo."
      }
    }
  },
  {
    "title": "Crew owner exploring Columbus NWSL expansion",
    "slug": "crew-owner-exploring-columbus-nwsl-expansion",
    "url": "https://www.espn.com/soccer/story/_/id/48055169/columbus-crew-owners-columbus-nwsl-expansion-cleveland-browns",
    "source": "ESPN Soccer",
    "date": "2026-02-27T23:51:45.000Z",
    "summary": "A prospective ownership group from Columbus, Ohio, led by the Haslam family, is actively pursuing a National Women's Soccer League expansion franchise. The initiative signals growing investment and interest in women's professional soccer in the Midwest.",
    "content": "A prospective ownership group from Columbus, Ohio, led by the Haslam family, is seriously exploring a National Women's Soccer League expansion franchise, the group confirmed to ESPN.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "克鲁队老板探索哥伦布女足联赛扩张",
        "summary": "来自俄亥俄州哥伦布市由哈斯拉姆家族领导的潜在所有权团队正在积极争取全国女子足球联赛扩张特许经营权。这一举措表明了中西部对女子职业足球投资和兴趣的增长。"
      },
      "fr": {
        "title": "Le propriétaire des Crew explore l'expansion NWSL de Columbus",
        "summary": "Un groupe de propriétaires potentiels de Columbus, Ohio, dirigé par la famille Haslam, poursuit activement une franchise d'expansion de la Ligue nationale de football féminin. L'initiative signale un intérêt et un investissement croissants dans le soccer professionnel féminin dans le Midwest."
      },
      "de": {
        "title": "Crew-Besitzer erkundet NWSL-Expansion in Columbus",
        "summary": "Eine potenzielle Eigentümergruppe aus Columbus, Ohio, unter der Leitung der Familie Haslam, verfolgt aktiv eine Expansionslizenz der National Women's Soccer League. Die Initiative signalisiert wachsende Investitionen und Interesse an professionellem Frauenfußball im Mittleren Westen."
      },
      "es": {
        "title": "El dueño del Crew explora la expansión de NWSL en Columbus",
        "summary": "Un grupo de propietarios prospectivos de Columbus, Ohio, encabezado por la familia Haslam, está buscando activamente una franquicia de expansión de la Liga Nacional de Fútbol Femenino. La iniciativa señala un creciente interés e inversión en fútbol profesional femenino en el Medio Oeste."
      }
    }
  },
  {
    "title": "Emery preaches positivity after loss to bottom side Wolves",
    "slug": "emery-preaches-positivity-after-loss-wolves",
    "url": "https://www.bbc.com/sport/football/videos/cj6dnx9kge4o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T23:05:45.000Z",
    "summary": "Aston Villa manager Unai Emery emphasized team unity following his side's 2-0 defeat to bottom-placed Wolves. He stressed the importance of togetherness as Villa continues competing for a top-four Premier League finish.",
    "content": "Aston Villa manager Unai Emery reflects on his side's performance against Wolves and says \"now is the time to be together\" in the Premier League top-four race after their 2-0 defeat at Molineux.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "埃梅里在输给沃尔夫斯后鼓励积极态度",
        "summary": "阿斯顿维拉主教练乌奈·埃梅里在球队以0:2负于垫底球队沃尔夫斯后强调了球队团结的重要性。他在维拉继续争夺英超前四名次的过程中强调了团结的重要性。"
      },
      "fr": {
        "title": "Emery prêche la positivité après la défaite contre Wolves",
        "summary": "Le manager d'Aston Villa Unai Emery a souligné l'unité de l'équipe suite à la défaite 2-0 de son équipe contre les Wolves, derniers du classement. Il a insisté sur l'importance de l'unité alors que Villa continue à concourir pour une place dans le top quatre de la Premier League."
      },
      "de": {
        "title": "Emery predigt Positivität nach Niederlage gegen Wolves",
        "summary": "Aston Villas Trainer Unai Emery betonte die Teameinheit nach der 2:0-Niederlage seines Teams gegen die abstiegsbedrohten Wolves. Er betonte die Bedeutung von Zusammenhalt, während Villa weiterhin um einen Platz in den Top vier der Premier League konkurriert."
      },
      "es": {
        "title": "Emery predica positividad tras derrota ante el colista Wolves",
        "summary": "El manager del Aston Villa Unai Emery enfatizó la unidad del equipo tras la derrota 2-0 de su equipo ante el colista Wolves. Enfatizó la importancia de la unidad mientras Villa continúa compitiendo por un lugar en los cuatro primeros de la Premier League."
      }
    }
  },
  {
    "title": "Derby points record was 'hanging over our heads' - Edwards",
    "slug": "derby-points-record-hanging-over-heads-edwards",
    "url": "https://www.bbc.com/sport/football/videos/cdr2z6z8dxpo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T22:50:48.000Z",
    "summary": "Wolves head coach Rob Edwards revealed that the threat of setting the Premier League's worst points record weighed heavily on his team. The 2-0 victory over Aston Villa allowed Wolves to avoid this unwanted distinction and gave Edwards confidence for the run-in.",
    "content": "Wolves head coach Rob Edwards says the prospect of ending the season with fewer points than record-holders Derby County was \"hanging over their heads\", and believes his side will have more confidence going forward after their 2-0 win over local rivals Aston Villa.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "德比积分纪录\"悬在我们头上\" - 爱德华兹",
        "summary": "沃尔夫斯主教练罗布·爱德华兹透露，创造英超最低积分纪录的威胁给他的球队带来了沉重的压力。对阿斯顿维拉的2:0胜利让沃尔夫斯避免了这个不受欢迎的记录，也给了爱德华兹对剩余赛程的信心。"
      },
      "fr": {
        "title": "Le record de points de Derby 'pesait sur nos têtes' - Edwards",
        "summary": "L'entraîneur de Wolves Rob Edwards a révélé que la menace de battre le record des pires points de la Premier League pesait lourdement sur son équipe. La victoire 2-0 sur Aston Villa a permis aux Wolves d'éviter cette distinction indésirable et a donné confiance à Edwards pour la fin de saison."
      },
      "de": {
        "title": "Derby-Punktrekord war 'über unseren Köpfen hängend' - Edwards",
        "summary": "Wolves-Trainer Rob Edwards verriet, dass die Drohung, den schlechtesten Punktrekord der Premier League zu setzen, schwer auf seinem Team lastete. Der 2:0-Sieg über Aston Villa ermöglichte es Wolves, diese unerwünschte Unterscheidung zu vermeiden und gab Edwards Vertrauen für die verbleibende Saison."
      },
      "es": {
        "title": "El récord de puntos de Derby estaba 'colgando sobre nuestras cabezas' - Edwards",
        "summary": "El entrenador de Wolves Rob Edwards reveló que la amenaza de establecer el peor récord de puntos de la Premier League pesaba mucho en su equipo. La victoria 2-0 sobre el Aston Villa permitió al Wolves evitar esta distinción indeseada y dio confianza a Edwards para la recta final."
      }
    }
  },
  {
    "title": "Wolves beat Aston Villa to avoid Premier League fewest-points record",
    "slug": "wolves-beat-aston-villa-avoid-premier-league-record",
    "url": "https://www.bbc.com/sport/football/videos/cm217k34lg2o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T22:34:37.000Z",
    "summary": "Wolves secured a 2-0 home victory over Aston Villa, avoiding the Premier League's lowest points total record set by Derby County. The win damaged Villa's Champions League qualification prospects while providing Wolves crucial breathing room.",
    "content": "Watch highlights as Wolves dent Aston Villa's Champions League qualification hopes with a 2-0 home win, ensuring they better the worst Premier League points tally set by Derby County.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "沃尔夫斯击败阿斯顿维拉避免英超最少积分纪录",
        "summary": "沃尔夫斯在主场以2:0击败阿斯顿维拉，避免了创造英超最少积分纪录（由德比郡创造）。这场胜利损害了维拉欧冠资格的前景，同时为沃尔夫斯提供了喘息的机会。"
      },
      "fr": {
        "title": "Wolves bat Aston Villa pour éviter le record du plus faible nombre de points de la Premier League",
        "summary": "Wolves a assuré une victoire 2-0 à domicile contre Aston Villa, évitant le record du plus faible nombre de points total de la Premier League établi par Derby County. La victoire a endommagé les perspectives de qualification en Ligue des champions de Villa tout en donnant à Wolves une respiration cruciale."
      },
      "de": {
        "title": "Wolves besiegt Aston Villa, um den Premier-League-Rekord der wenigsten Punkte zu vermeiden",
        "summary": "Wolves sicherte sich einen 2:0-Heimsieg über Aston Villa und vermied damit den Rekord der wenigsten Punkte in der Premier League, der von Derby County aufgestellt wurde. Der Sieg schadete Villas Chancen auf Champions-League-Qualifikation, während er Wolves wichtigen Spielraum gab."
      },
      "es": {
        "title": "Wolves vence al Aston Villa para evitar el récord de menos puntos de la Premier League",
        "summary": "Wolves aseguró una victoria 2-0 en casa sobre el Aston Villa, evitando el récord de menor puntuación total de la Premier League establecido por el Derby County. La victoria dañó las perspectivas de calificación para la Liga de Campeones del Villa mientras proporcionaba a Wolves un respiro crucial."
      }
    }
  },
  {
    "title": "Do the USWNT's up-and-comers really have a shot at the Women's World Cup roster?",
    "slug": "uswnt-up-and-comers-women-world-cup-roster",
    "url": "https://www.espn.com/soccer/story/_/id/47982164/do-uswnt-newbies-2026-shebelieves-cup-shot-world-cup-next-year",
    "source": "ESPN Soccer",
    "date": "2026-02-27T22:07:19.000Z",
    "summary": "Eight relatively inexperienced players with six caps or fewer were selected for the USWNT's SheBelieves Cup squad. The selection raises questions about whether these emerging talents can realistically compete for spots on the Women's World Cup roster.",
    "content": "The USWNT's roster for the SheBelieves Cup had eight players with six caps or less. Are these youngsters competing for World Cup spots?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "美国女足的新秀真的有机会进入女足世界杯名单吗？",
        "summary": "八名经验相对不足的球员（上场次数在6次或以下）被选入美国女足SheBelieves杯队伍。这一选择引发了关于这些新兴人才是否能真实地争夺女足世界杯名单位置的问题。"
      },
      "fr": {
        "title": "Les jeunes talents de l'USWNT ont-ils vraiment une chance de figurer sur la liste du Mondial féminin ?",
        "summary": "Huit joueurs relativement inexpérimentés avec six sélections ou moins ont été sélectionnés pour l'effectif de la SheBelieves Cup de l'USWNT. Cette sélection soulève des questions sur la possibilité que ces talents émergents concourent réalistement pour des places en liste du Mondial féminin."
      },
      "de": {
        "title": "Haben die Neueinsteiger der USWNT wirklich eine Chance auf den Kader der Frauenfußball-Weltmeisterschaft?",
        "summary": "Acht relativ unerfahrene Spieler mit sechs oder weniger Einsätzen wurden für die SheBelieves Cup-Mannschaft der USWNT ausgewählt. Die Auswahl wirft Fragen auf, ob diese aufstrebenden Talente realistisch um Plätze im Kader der Frauenfußball-Weltmeisterschaft konkurrieren können."
      },
      "es": {
        "title": "¿Los nuevos valores de la USWNT realmente tienen oportunidad de estar en la lista para el Mundial femenino?",
        "summary": "Ocho jugadores relativamente inexpertos con seis o menos participaciones fueron seleccionados para el equipo de la SheBelieves Cup de la USWNT. La selección plantea dudas sobre si estos talentos emergentes pueden competir realísticamente por lugares en la lista del Mundial femenino."
      }
    }
  },
  {
    "title": "'I'm not used to the fuss': James Milner, the Premier League's reluctant record breaker",
    "slug": "james-milner-reluctant-record-breaker-premier-league",
    "url": "https://www.espn.com/soccer/story/_/id/48045659/james-milner-premier-league-reluctant-record-breaker",
    "source": "ESPN Soccer",
    "date": "2026-02-27T22:07:01.000Z",
    "summary": "James Milner has become the Premier League's all-time appearances leader, achieving the milestone with characteristic humility. The veteran midfielder's understated reaction reflects his consistent, exemplary career in England's top division.",
    "content": "After becoming the Premier League's all-time appearances leader, what's next for James Milner?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"我不习惯这种关注\"：詹姆斯·米尔纳，英超历史出场次数纪录的不情愿缔造者",
        "summary": "詹姆斯·米尔纳已经成为英超历史上出场次数最多的球员，以其典型的谦逊态度达到了这一里程碑。这位资深中场球员的低调反应反映了他在英超长期以来的稳定和模范职业生涯。"
      },
      "fr": {
        "title": "\"Je ne suis pas habitué à ce battage médiatique\" : James Milner, le briseur de record réticent de la Premier League",
        "summary": "James Milner est devenu le joueur ayant le plus de matchs joués dans l'histoire de la Premier League, atteignant ce jalon avec son humilité caractéristique. La réaction discrète du milieu de terrain expérimenté reflète sa carrière cohérente et exemplaire dans le plus haut niveau anglais."
      },
      "de": {
        "title": "\"Ich bin diese Aufmerksamkeit nicht gewohnt\": James Milner, der widerstrebende Rekordbrecher der Premier League",
        "summary": "James Milner ist zum Spieler mit den meisten Einsätzen in der Geschichte der Premier League geworden und hat diesen Meilenstein mit seiner charakteristischen Demut erreicht. Die unterschätzte Reaktion des erfahrenen Mittelfeldspielers spiegelt seine konstante und vorbildliche Karriere in Englands höchster Spielklasse wider."
      },
      "es": {
        "title": "\"No estoy acostumbrado al alboroto\": James Milner, el rompedor de récords reacio de la Premier League",
        "summary": "James Milner se ha convertido en el jugador con más apariciones en la historia de la Premier League, alcanzando el hito con su característica humildad. La reacción contenida del veterano centrocampista refleja su carrera consistente y ejemplar en la máxima división inglesa."
      }
    }
  },
  {
    "title": "Augsburg mark landmark game with win over Cologne",
    "slug": "augsburg-landmark-500th-game-win-cologne",
    "url": "https://www.bbc.com/sport/football/videos/c0j5d57x50po?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T22:05:59.000Z",
    "summary": "Augsburg celebrated their 500th Bundesliga match with a victory over Cologne, with Rodrigo Ribeiro scoring the decisive goal. The milestone win represents a significant achievement in the club's competition history.",
    "content": "Watch Bundesliga highlights, as hostAugsburg celebrate their 500th game in the competition with a win over Cologne, thanks to a well-taken goal by Rodrigo Ribeiro.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "奥格斯堡以战胜科隆庆祝标志性的第500场比赛",
        "summary": "奥格斯堡以战胜科隆庆祝他们在德甲的第500场比赛，罗德里戈·里贝罗打入决定性的一球。这场具有里程碑意义的胜利代表了该俱乐部在这项赛事历史中的一项重大成就。"
      },
      "fr": {
        "title": "Augsbourg célèbre son 500e match historique par une victoire contre Cologne",
        "summary": "Augsbourg a célébré son 500e match en Bundesliga avec une victoire contre Cologne, Rodrigo Ribeiro marquant le but décisif. Cette victoire historique représente une réussite majeure dans l'histoire de la compétition du club."
      },
      "de": {
        "title": "Augsburg feiert Meilenstein-Spiel mit Sieg gegen Köln",
        "summary": "Augsburg feierte sein 500. Bundesliga-Spiel mit einem Sieg gegen Köln, wobei Rodrigo Ribeiro das entscheidende Tor erzielte. Der Meilenstein-Sieg stellt eine bedeutende Errungenschaft in der Wettbewerbsgeschichte des Clubs dar."
      },
      "es": {
        "title": "Augsburgo marca su partido número 500 con victoria sobre Colonia",
        "summary": "Augsburgo celebró su partido número 500 en la Bundesliga con una victoria sobre Colonia, con Rodrigo Ribeiro anotando el gol decisivo. La victoria histórica representa un logro significativo en la historia de la competencia del club."
      }
    }
  },
  {
    "title": "Man City & Man Utd set for Anderson battle - Saturday's gossip",
    "slug": "man-city-man-utd-anderson-battle-gossip",
    "url": "https://www.bbc.com/sport/football/articles/c4gjkv8x3dyo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T21:26:49.000Z",
    "summary": "Manchester City and Manchester United are competing for Nottingham Forest's Elliot Anderson in the transfer market. Inter Milan is also reportedly considering renewed interest in Liverpool's Curtis Jones.",
    "content": "Manchester City and Manchester United want Nottingham Forest's Elliot Anderson, Inter Milan could revisit interest in Liverpool's Curtis Jones, plus more.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "曼城与曼联争夺安德森——周六的转会传言",
        "summary": "曼城和曼联正在争夺诺丁汉森林的埃利奥特·安德森。据报道，国际米兰也在考虑重新关注利物浦的柯蒂斯·琼斯。"
      },
      "fr": {
        "title": "Man City et Man Utd s'affrontent pour Anderson - Les rumeurs du samedi",
        "summary": "Manchester City et Manchester United se font concurrence pour Elliot Anderson de Nottingham Forest sur le marché des transferts. L'Inter Milan envisagerait également un intérêt renouvelé pour Curtis Jones de Liverpool."
      },
      "de": {
        "title": "Man City und Man Utd kämpfen um Anderson - Samstags Gerüchte",
        "summary": "Manchester City und Manchester United konkurrieren um Elliot Anderson vom Nottingham Forest auf dem Transfermarkt. Inter Mailand erwägt Berichten zufolge auch ein erneuertes Interesse an Liverpools Curtis Jones."
      },
      "es": {
        "title": "Man City y Man Utd se disputan a Anderson - Rumores del sábado",
        "summary": "Manchester City y Manchester United compiten por Elliot Anderson del Nottingham Forest en el mercado de transferencias. Según los informes, el Inter de Milán también está considerando un interés renovado en Curtis Jones del Liverpool."
      }
    }
  },
  {
    "title": "Messi tackled by pitch invader in Inter Miami game",
    "slug": "messi-tackled-pitch-invader-inter-miami",
    "url": "https://www.bbc.com/sport/football/articles/cy4w0q7e490o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T21:09:45.000Z",
    "summary": "Argentina captain Lionel Messi was tackled by a pitch invader during Inter Miami's friendly match in Puerto Rico. The incident momentarily disrupted play in the exhibition game.",
    "content": "Argentina captain Lionel Messi is hauled to the ground by a pitch invader during Inter Miami's friendly in Puerto Rico.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "梅西在迈阿密国际队比赛中被球迷铲倒",
        "summary": "阿根廷队长莱昂内尔·梅西在迈阿密国际队在波多黎各的友谊赛中被一名球迷铲倒。这一事件暂时中断了表演赛的比赛。"
      },
      "fr": {
        "title": "Messi plaqué par un envahisseur de terrain dans le match de l'Inter Miami",
        "summary": "Le capitaine argentin Lionel Messi a été plaqué par un envahisseur de terrain lors du match amical de l'Inter Miami à Porto Rico. L'incident a momentanément perturbé le jeu dans le match d'exposition."
      },
      "de": {
        "title": "Messi von Platzstürmer im Inter-Miami-Spiel angegriffen",
        "summary": "Der argentinische Kapitän Lionel Messi wurde während des Freundschaftsspiels von Inter Miami in Puerto Rico von einem Platzstürmer angegriffen. Der Vorfall unterbrach das Spiel im Ausstellungsspiel vorübergehend."
      },
      "es": {
        "title": "Messi derribado por invasor de cancha en partido de Inter Miami",
        "summary": "El capitán argentino Lionel Messi fue derribado por un invasor de cancha durante el partido amistoso del Inter Miami en Puerto Rico. El incidente interrumpió momentáneamente el juego en el partido de exhibición."
      }
    }
  },
  {
    "title": "All February's done deals, including deadline day, in one place",
    "slug": "all-februarys-done-deals-deadline-day",
    "url": "https://www.bbc.com/sport/football/articles/cy59zrq4ywgo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T19:17:09.000Z",
    "summary": "A comprehensive roundup of all significant player transfers and departures across major English and Scottish leagues during February. The summary covers moves in the Premier League, Scottish Premiership, EFL, and Women's Super League.",
    "content": "Check out the significant signings and departures in the Premier League, Scottish Premiership, EFL and Women's Super League.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "二月份的所有交易，包括截止日期，都在一个地方",
        "summary": "对二月份英超和苏超等主要联赛中所有重要球员转会和离队的全面总结。该总结涵盖英超、苏超、英甲和女超的转会。"
      },
      "fr": {
        "title": "Tous les accords de février, y compris le jour de la date limite, en un seul endroit",
        "summary": "Un résumé complet de tous les transferts de joueurs importants et des départs à travers les grandes ligues anglaises et écossaises en février. Le résumé couvre les mouvements en Premier League, Scottish Premiership, EFL et Women's Super League."
      },
      "de": {
        "title": "Alle Februardeals, einschließlich des Stichtags, an einem Ort",
        "summary": "Eine umfassende Zusammenfassung aller bedeutenden Spielertransfers und Abgänge in den großen englischen und schottischen Ligen im Februar. Die Zusammenfassung deckt Transfers in der Premier League, Scottish Premiership, EFL und Women's Super League ab."
      },
      "es": {
        "title": "Todos los acuerdos de febrero, incluido el día de la fecha límite, en un solo lugar",
        "summary": "Un resumen integral de todos los traspasos significativos de jugadores y salidas en las principales ligas inglesas y escocesas durante febrero. El resumen cubre movimientos en la Premier League, Scottish Premiership, EFL y Women's Super League."
      }
    }
  },
  {
    "title": "Messi knocked to ground as fans invade field in PR",
    "slug": "messi-knocked-to-ground-fans-invade-field-pr",
    "url": "https://www.espn.com/soccer/story/_/id/48054088/lionel-messi-inter-miami-friendly-pitch-invasion",
    "source": "ESPN Soccer",
    "date": "2026-02-27T17:41:11.000Z",
    "summary": "Lionel Messi was knocked to the ground by a fan and security guard during an Inter Miami friendly in Puerto Rico, highlighting ongoing security concerns at high-profile soccer events.",
    "content": "Lionel Messi was knocked to the ground by a fan and a security guard at the end of Inter Miami's friendly match in Puerto Rico on Thursday.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "梅西在波多黎各被球迷撞倒，球场入侵",
        "summary": "莱昂内尔·梅西在迈阿密国际队与波多黎各进行友谊赛期间被一名球迷和保安撞倒，突显了高级别足球赛事的安全问题。"
      },
      "fr": {
        "title": "Messi renversé au sol alors que des fans envahissent le terrain à Porto Rico",
        "summary": "Lionel Messi a été renversé au sol par un fan et un agent de sécurité lors d'un match amical de l'Inter Miami à Porto Rico, mettant en évidence les préoccupations de sécurité persistantes aux grands événements de soccer."
      },
      "de": {
        "title": "Messi zu Boden geworfen, als Fans in Puerto Rico das Spielfeld stürmen",
        "summary": "Lionel Messi wurde von einem Fan und einem Sicherheitsbeamten während eines Freundschaftsspiels von Inter Miami in Puerto Rico zu Boden geworfen, was auf anhaltende Sicherheitsbedenken bei großen Fußballveranstaltungen hinweist."
      },
      "es": {
        "title": "Messi derribado mientras aficionados invaden el campo en Puerto Rico",
        "summary": "Lionel Messi fue derribado por un aficionado y un guardia de seguridad durante un partido amistoso del Inter Miami en Puerto Rico, destacando las preocupaciones de seguridad en los principales eventos de fútbol."
      }
    }
  },
  {
    "title": "USMNT's Sargent joins Toronto FC from Norwich",
    "slug": "usmnt-sargent-joins-toronto-fc-norwich",
    "url": "https://www.espn.com/soccer/story/_/id/47986546/usmnt-forward-josh-sargent-joins-toronto-fc-norwich-city",
    "source": "ESPN Soccer",
    "date": "2026-02-27T17:41:11.000Z",
    "summary": "United States international Josh Sargent has completed his transfer to Toronto FC from Norwich City, strengthening the MLS club's attacking options.",
    "content": "Toronto FC have completed the signing of United States international Josh Sargent from Norwich City.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "美国国家队前锋萨金特加盟多伦多FC",
        "summary": "美国国际球员乔什·萨金特完成了从诺维奇城到多伦多FC的转会，加强了美国职业足球大联盟球队的进攻选择。"
      },
      "fr": {
        "title": "Le joueur américain Sargent rejoint Toronto FC de Norwich",
        "summary": "L'international américain Josh Sargent a complété son transfert vers Toronto FC en provenance de Norwich City, renforçant les options offensives du club de la MLS."
      },
      "de": {
        "title": "US-Nationalspieler Sargent wechselt zu Toronto FC von Norwich",
        "summary": "Der amerikanische Nationalspieler Josh Sargent hat seinen Wechsel vom FC Norwich zu Toronto FC abgeschlossen und verstärkt die Offensivoptionen des MLS-Clubs."
      },
      "es": {
        "title": "El internacional estadounidense Sargent se une al Toronto FC desde Norwich",
        "summary": "El internacional estadounidense Josh Sargent completó su transferencia al Toronto FC desde Norwich City, fortaleciendo las opciones de ataque del equipo de la MLS."
      }
    }
  },
  {
    "title": "Simeone unsure on future of Griezmann",
    "slug": "simeone-unsure-on-future-griezmann",
    "url": "https://www.espn.com/soccer/story/_/id/48052989/diego-simeone-unsure-antoine-griezmann-finish-season-atletico-madrid-orlando-move-looms",
    "source": "ESPN Soccer",
    "date": "2026-02-27T17:41:11.000Z",
    "summary": "Atletico Madrid manager Diego Simeone expressed uncertainty about Antoine Griezmann's future with the club as the forward negotiates a move to Orlando City.",
    "content": "Diego Simeone has admitted he \"doesn't know\" if Antoine Griezmann will finish the season with Atletico Madrid, as the forward negotiates a switch to Orlando City.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "西蒙尼对格里兹曼的未来感到不确定",
        "summary": "马德里竞技主教练迭戈·西蒙尼对安托万·格里兹曼的未来表示不确定，因为这位前锋正在与奥兰多城谈判转会。"
      },
      "fr": {
        "title": "Simeone incertain sur l'avenir de Griezmann",
        "summary": "Le manager de l'Atlético Madrid Diego Simeone a exprimé de l'incertitude quant à l'avenir d'Antoine Griezmann au club alors que l'attaquant négocie un passage à Orlando City."
      },
      "de": {
        "title": "Simeone unsicher über Griezmanns Zukunft",
        "summary": "Der Trainer von Atlético Madrid Diego Simeone äußerte sich unsicher über die Zukunft von Antoine Griezmann im Verein, da der Stürmer einen Wechsel zu Orlando City aushandelt."
      },
      "es": {
        "title": "Simeone inseguro sobre el futuro de Griezmann",
        "summary": "El entrenador del Atlético Madrid Diego Simeone expresó incertidumbre sobre el futuro de Antoine Griezmann en el club mientras el delantero negocia un movimiento a Orlando City."
      }
    }
  },
  {
    "title": "Arteta tempers Arsenal quadruple chat after draw",
    "slug": "arteta-tempers-arsenal-quadruple-chat-draw",
    "url": "https://www.espn.com/soccer/story/_/id/48053585/arsenal-mikel-arteta-tempers-quadruple-chat-champions-league-draw",
    "source": "ESPN Soccer",
    "date": "2026-02-27T17:41:11.000Z",
    "summary": "Arsenal manager Mikel Arteta downplayed talk of a quadruple title push following the club's Champions League draw, though he acknowledges the promising competitive situation.",
    "content": "Mikel Arteta has insisted he is not thinking about Arsenal winning the quadruple but says he is excited by the possibilities that have opened up after Friday's Champions League draw.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "阿尔特塔在平局后淡化阿森纳四冠王言论",
        "summary": "阿森纳主帅米克尔·阿尔特塔在俱乐部欧冠平局后淡化了四冠王话题，但他承认了有前景的竞争形势。"
      },
      "fr": {
        "title": "Arteta tempère les discussions sur le quadruplé d'Arsenal après le match nul",
        "summary": "Le manager d'Arsenal, Mikel Arteta, a minimisé les discussions sur une poussée pour un quadruplé suite au match nul en Ligue des champions du club, bien qu'il reconnaisse la situation compétitive prometteuse."
      },
      "de": {
        "title": "Arteta beruhigt Diskussionen über Arsenals Quadrupel nach Unentschieden",
        "summary": "Arsenals Manager Mikel Arteta spielte die Gespräche über einen Quadrupel-Titelgewinn nach dem Unentschieden in der Champions League herunter, erkannte aber die vielversprechende Wettbewerbssituation an."
      },
      "es": {
        "title": "Arteta modera el chat del cuádruplete del Arsenal tras el empate",
        "summary": "El gerente del Arsenal, Mikel Arteta, minimizó las conversaciones sobre una carrera al cuádruplete tras el empate de la Liga de Campeones del club, aunque reconoce la prometedora situación competitiva."
      }
    }
  },
  {
    "title": "Infantino speaks to Mexico president amid unrest",
    "slug": "infantino-speaks-mexico-president-unrest",
    "url": "https://www.espn.com/soccer/story/_/id/48054324/fifa-gianni-infantino-speaks-mexico-president-ahead-world-cup",
    "source": "ESPN Soccer",
    "date": "2026-02-27T17:41:10.000Z",
    "summary": "FIFA President Gianni Infantino spoke with Mexico's president to reaffirm confidence in the country hosting World Cup matches this summer amid recent security concerns.",
    "content": "FIFA President Gianni Infantino has spoken with Mexican president Claudia Sheinbaum to reiterate his trust in the country hosting World Cup games this summer.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "因凡蒂诺在骚乱中与墨西哥总统交谈",
        "summary": "国际足联主席詹尼·因凡蒂诺与墨西哥总统进行了交谈，以重申对该国今年夏天主办世界杯比赛的信心，尽管最近存在安全隐忧。"
      },
      "fr": {
        "title": "Infantino parle au président mexicain au milieu des troubles",
        "summary": "Le président de la FIFA, Gianni Infantino, a parlé au président du Mexique pour réaffirmer la confiance dans le pays accueillant les matchs de la Coupe du monde cet été malgré les récentes préoccupations en matière de sécurité."
      },
      "de": {
        "title": "Infantino spricht mit Mexikos Präsident inmitten von Unruhen",
        "summary": "FIFA-Präsident Gianni Infantino sprach mit Mexikos Präsident, um das Vertrauen in das Land für die Ausrichtung von Weltcup-Spielen in diesem Sommer trotz jüngster Sicherheitsbedenken zu bekräftigen."
      },
      "es": {
        "title": "Infantino habla con el presidente de México en medio de disturbios",
        "summary": "El presidente de la FIFA, Gianni Infantino, habló con el presidente de México para reafirmar la confianza en que el país sea anfitrión de los partidos de la Copa Mundial este verano ante las recientes preocupaciones de seguridad."
      }
    }
  },
  {
    "title": "'Breath of fresh air' Lindsay backed for NI job",
    "slug": "breath-of-fresh-air-lindsay-backed-ni-job",
    "url": "https://www.bbc.com/sport/football/articles/c1d60q3ygp1o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T17:23:24.000Z",
    "summary": "Northern Ireland midfielder Nadene Caldwell endorsed Kris Lindsay for the permanent manager position after his impressive performance with the squad ahead of World Cup qualifiers.",
    "content": "Northern Ireland midfielder Nadene Caldwell backs Kris Lindsay to take the manager's job permanently after impressing players in camp before their opening two World Cup qualifiers",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"新鲜空气\"林赛获支持担任北爱尔兰职位",
        "summary": "北爱尔兰中场纳迪内·考德威尔在克里斯·林赛给球队留下深刻印象之后，支持他获得永久主教练职位，球队即将参加世界杯预选赛。"
      },
      "fr": {
        "title": "«Bouffée d'air frais» Lindsay soutenu pour le poste nord-irlandais",
        "summary": "La milieu de terrain nord-irlandaise Nadene Caldwell a approuvé Kris Lindsay pour le poste de manager permanent après sa performance impressionnante avec l'équipe avant les qualifications de la Coupe du monde."
      },
      "de": {
        "title": "«Ein Hauch frischer Luft» Lindsay für den Posten in Nordirland unterstützt",
        "summary": "Die nordirische Mittelspielerin Nadene Caldwell unterstützte Kris Lindsay für die ständige Managementposition nach seiner beeindruckenden Leistung mit der Mannschaft vor den Weltcup-Qualifikationen."
      },
      "es": {
        "title": "'Bocanada de aire fresco' Lindsay respaldado para el puesto de Irlanda del Norte",
        "summary": "La centrocampista de Irlanda del Norte Nadene Caldwell respaldó a Kris Lindsay para el puesto de gerente permanente después de su desempeño impresionante con el equipo antes de las clasificatorias de la Copa Mundial."
      }
    }
  },
  {
    "title": "Champions League round of 16 predictions: Real Madrid over Man City",
    "slug": "champions-league-round-of-16-predictions-real-madrid-man-city",
    "url": "https://www.espn.com/soccer/story/_/id/48045987/uefa-champions-league-predictions-picks-bracket-round-16-mark-ogden",
    "source": "ESPN Soccer",
    "date": "2026-02-27T17:17:23.000Z",
    "summary": "Analysts have mapped out the Champions League round of 16 bracket, with predictions identifying Real Madrid as a potential threat to Manchester City's path to the Budapest final.",
    "content": "The path to the Champions League final is now mapped out, but who do we think makes it all the way to Budapest? Mark Ogden makes his picks.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "欧冠十六强预测：皇马挑战曼城",
        "summary": "分析师已规划出欧冠十六强对阵表，预测皇马可能成为曼城布达佩斯之路的潜在威胁。"
      },
      "fr": {
        "title": "Prédictions de la Ligue des champions seizièmes de finale : Real Madrid face à Manchester City",
        "summary": "Les analystes ont établi le tableau des seizièmes de finale de la Ligue des champions, avec des prédictions identifiant le Real Madrid comme une menace potentielle pour le parcours de Manchester City vers la finale de Budapest."
      },
      "de": {
        "title": "Champions-League-Vorhersagen im Achtelfinale: Real Madrid gegen Man City",
        "summary": "Analysten haben die Tabelle des Champions-League-Achtelfinals skizziert, wobei Real Madrid als potenzielle Bedrohung für Manchester Citys Weg zum Budapest-Finale identifiziert wird."
      },
      "es": {
        "title": "Predicciones de la Liga de Campeones de los dieciseisavos de final: Real Madrid sobre Man City",
        "summary": "Los analistas han trazado el cuadro de los dieciseisavos de final de la Liga de Campeones, con predicciones que identifican al Real Madrid como una amenaza potencial para el camino del Manchester City hacia la final de Budapest."
      }
    }
  },
  {
    "title": "'Laser-focused' - is lack of European football helping Man United?",
    "slug": "laser-focused-lack-of-european-football-helping-man-united",
    "url": "https://www.bbc.com/sport/football/videos/cx2rnne0rp1o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T17:11:08.000Z",
    "summary": "Manchester United caretaker coach Michael Carrick credits the absence of European competition for allowing the squad to focus solely on the Premier League, where they remain unbeaten in six matches.",
    "content": "Manchester United caretaker head coach Michael Carrick says \"it's a relief\" his side aren't in any European competitions this season, which has allowed them to focus solely on the Premier League with the club unbeaten in six matches in all competitions.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"目标坚定\" - 缺乏欧洲足球是否帮助曼联？",
        "summary": "曼联代理主教练迈克尔·卡里克表示，缺乏欧洲赛事使球队能够完全专注于英超联赛，目前球队已连续六场保持不败。"
      },
      "fr": {
        "title": "« Concentré » - l'absence de football européen aide-t-elle Manchester United ?",
        "summary": "L'entraîneur intérimaire de Manchester United, Michael Carrick, attribue l'absence de compétition européenne au fait que l'équipe puisse se concentrer uniquement sur la Premier League, où elle reste invincible depuis six matchs."
      },
      "de": {
        "title": "\"Hochfokussiert\" - hilft der fehlende europäische Fußball Manchester United?",
        "summary": "Manchesters United Interimstrainer Michael Carrick führt das Fehlen des europäischen Wettbewerbs darauf zurück, dass die Mannschaft sich ausschließlich auf die Premier League konzentrieren kann, wo sie in sechs Spielen ungeschlagen bleibt."
      },
      "es": {
        "title": "\"Enfocado\" - ¿la falta de fútbol europeo ayuda a Man United?",
        "summary": "El entrenador interino del Manchester United, Michael Carrick, atribuye la ausencia de competencia europea al hecho de que el equipo puede concentrarse únicamente en la Premier League, donde permanecen invictos en seis partidos."
      }
    }
  },
  {
    "title": "Marathe stands down as Rangers vice-chair",
    "slug": "marathe-stands-down-rangers-vice-chair",
    "url": "https://www.bbc.com/sport/football/articles/c8egyyxw1l1o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T17:00:30.000Z",
    "summary": "Rangers vice-chair Paraag Marathe and fellow director Gene Schneur are stepping down due to multi-club ownership rules that prevent them from holding their positions.",
    "content": "Paraag Marathe is standing as Rangers' vice-chair, while fellow director Gene Schneur is doing the same because of multi-club ownership rules.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "马拉塞辞去流浪者队副主席职务",
        "summary": "流浪者队副主席帕拉格·马拉塞和董事基因·施纳尔因多俱乐部所有权规则而辞职，该规则不允许他们继续担任这些职位。"
      },
      "fr": {
        "title": "Marathe se retire en tant que vice-président des Rangers",
        "summary": "Le vice-président des Rangers, Paraag Marathe, et son collègue administrateur Gene Schneur se retirent en raison des règles de propriété multi-clubs qui les empêchent de conserver leurs positions."
      },
      "de": {
        "title": "Marathe tritt als Vizevorsitzender der Rangers zurück",
        "summary": "Der Rangers-Vizevorsitzende Paraag Marathe und sein Mitdirektor Gene Schneur treten aufgrund von Mehrclub-Eigentumsregeln zurück, die ihnen verbieten, ihre Positionen zu halten."
      },
      "es": {
        "title": "Marathe renuncia como vicepresidente de los Rangers",
        "summary": "El vicepresidente de los Rangers, Paraag Marathe, y el director Gene Schneur se retiran debido a las reglas de propiedad de múltiples clubes que les impiden mantener sus posiciones."
      }
    }
  },
  {
    "title": "Wales 'grateful' to have Fishlock on board",
    "slug": "wales-grateful-to-have-fishlock-on-board",
    "url": "https://www.bbc.com/sport/football/articles/cdr2z6r8rg3o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T16:40:24.000Z",
    "summary": "Wales midfielder Carrie Jones expressed appreciation for Jess Fishlock's presence in the squad as the team prepares for their Women's World Cup qualifying campaign.",
    "content": "Carrie Jones says Wales' players are grateful to have Jess Fishlock in the dressing room as they head into their Women's World Cup qualifying campaign.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "威尔士\"感谢\"拥有费什洛克在队",
        "summary": "威尔士中场球员卡里·琼斯对杰斯·费什洛克在球队中的出现表示感谢，因为球队正在为女性世界杯预选赛做准备。"
      },
      "fr": {
        "title": "Le Pays de Galles 'reconnaissant' d'avoir Fishlock à bord",
        "summary": "La milieu de terrain galloise Carrie Jones a exprimé son appréciation pour la présence de Jess Fishlock dans l'équipe alors que l'équipe se prépare pour sa campagne de qualification à la Coupe du monde féminine."
      },
      "de": {
        "title": "Wales 'dankbar', Fishlock an Bord zu haben",
        "summary": "Die walisische Mittelfeldspielerin Carrie Jones drückte ihre Dankbarkeit für die Anwesenheit von Jess Fishlock im Kader aus, da sich das Team auf ihre Kampagne zur Frauen-Weltmeisterschaft-Qualifikation vorbereitet."
      },
      "es": {
        "title": "Gales 'agradecido' de tener a Fishlock a bordo",
        "summary": "La centrocampista galesa Carrie Jones expresó su agradecimiento por la presencia de Jess Fishlock en el equipo mientras el equipo se prepara para su campaña de clasificación para la Copa del Mundo Femenina."
      }
    }
  },
  {
    "title": "'He's a tough guy' - Rosenior supports Fofana after online racist abuse",
    "slug": "hes-a-tough-guy-rosenior-supports-fofana-racist-abuse",
    "url": "https://www.bbc.com/sport/football/videos/cj6dnxl35wko?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T16:24:18.000Z",
    "summary": "Chelsea manager Liam Rosenior backed defender Wesley Fofana following online racist abuse directed at him after Chelsea's draw with Burnley, urging players to disregard social media comments.",
    "content": "Chelsea head coach Liam Rosenior has urged his squad to ignore comments on social media after defender Wesley Fofana was subject to racist abuse following Chelsea's 1-1 draw against Burnley in the Premier League.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"他是个硬汉\" - 罗塞尼奥支持遭受网络种族仇恨的福法纳",
        "summary": "切尔西经理利亚姆·罗塞尼奥在后卫韦斯利·福法纳因切尔西与伯恩利的平局后遭到在线种族辱骂后支持他，敦促球员忽视社交媒体评论。"
      },
      "fr": {
        "title": "\"C'est un gars dur\" - Rosenior soutient Fofana après les abus racistes en ligne",
        "summary": "Le manager de Chelsea, Liam Rosenior, a soutenu le défenseur Wesley Fofana suite aux abus racistes en ligne qui lui ont été adressés après le match nul de Chelsea avec Burnley, exhortant les joueurs à ignorer les commentaires sur les réseaux sociaux."
      },
      "de": {
        "title": "\"Er ist ein harter Kerl\" - Rosenior unterstützt Fofana nach rassistischen Missbrauch online",
        "summary": "Chelseas Manager Liam Rosenior unterstützte Verteidiger Wesley Fofana nach rassistischen Beleidigungen im Internet, die ihm nach Chelseas Unentschieden gegen Burnley zugefügt wurden, und forderte Spieler auf, Kommentare in sozialen Medien zu ignorieren."
      },
      "es": {
        "title": "\"Es un tipo duro\" - Rosenior apoya a Fofana después del abuso racial en línea",
        "summary": "El gerente del Chelsea, Liam Rosenior, respalda al defensa Wesley Fofana después de los abusos racistas en línea dirigidos a él después del empate del Chelsea con Burnley, instando a los jugadores a ignorar los comentarios en las redes sociales."
      }
    }
  },
  {
    "title": "Benni McCarthy: Man Utd ruled out signing Osimhen because of Afcon schedule",
    "slug": "benni-mccarthy-man-utd-ruled-out-signing-osimhen-afcon",
    "url": "https://www.bbc.co.uk/sounds/play/p0n3qkgx?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T16:00:00.000Z",
    "summary": "Former South Africa striker Benni McCarthy explains how the Africa Cup of Nations schedule affected Manchester United's decision to avoid signing Victor Osimhen.",
    "content": "The former South Africa striker on how Afcon's timing can affect the continent's stars",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "本尼·麦卡锡:曼联因非洲杯赛程排除签下奥西梅恩",
        "summary": "前南非前锋本尼·麦卡锡解释了非洲杯赛程如何影响曼联避免签下维克托·奥西梅恩的决定。"
      },
      "fr": {
        "title": "Benni McCarthy: Man Utd a exclu la signature d'Osimhen en raison du calendrier de la Coupe d'Afrique des Nations",
        "summary": "L'ancien attaquant sud-africain Benni McCarthy explique comment le calendrier de la Coupe d'Afrique des Nations a affecté la décision de Manchester United d'éviter de signer Victor Osimhen."
      },
      "de": {
        "title": "Benni McCarthy: Man Utd schloss die Verpflichtung von Osimhen wegen des Afrika-Cup-Zeitplans aus",
        "summary": "Der ehemalige südafrikanische Stürmer Benni McCarthy erklärt, wie der Zeitplan des Afrika-Cups die Entscheidung von Manchester United beeinflusst hat, Victor Osimhen nicht zu verpflichten."
      },
      "es": {
        "title": "Benni McCarthy: Man Utd descartó fichar a Osimhen por el calendario de la Copa de África",
        "summary": "El exdelantero sudafricano Benni McCarthy explica cómo el calendario de la Copa de África de Naciones afectó la decisión del Manchester United de evitar fichar a Victor Osimhen."
      }
    }
  },
  {
    "title": "Arrests after flares thrown in Forest's Europa League match",
    "slug": "arrests-after-flares-thrown-forest-europa-league-match",
    "url": "https://www.bbc.com/news/articles/ckg8kzde992o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T15:54:51.000Z",
    "summary": "Police arrested three individuals after flares were thrown from the away end during a Nottingham Forest Europa League match, highlighting ongoing security issues in European competition.",
    "content": "Police say they received reports of flares being thrown from the away end and arrested three people.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "林地队欧联杯比赛中投掷信号弹后发生逮捕",
        "summary": "警方在诺丁汉森林队欧洲联赛比赛期间从客队区域投掷信号弹后逮捕了三人，突显了欧洲赛事中的持续安全问题。"
      },
      "fr": {
        "title": "Arrestations après le lancement de fusées éclairantes lors du match de Ligue Europa de Forest",
        "summary": "La police a arrêté trois individus après le lancement de fusées éclairantes depuis le secteur visiteurs lors du match de Ligue Europa de Nottingham Forest, mettant en évidence des problèmes de sécurité persistants dans la compétition européenne."
      },
      "de": {
        "title": "Verhaftungen nach Bengalen bei Nottingham Forests Europa-League-Spiel",
        "summary": "Die Polizei verhaftete drei Personen, nachdem Bengale vom Gästebereich während eines Europa-League-Spiels von Nottingham Forest geworfen wurden, was auf anhaltende Sicherheitsprobleme im europäischen Wettbewerb hindeutet."
      },
      "es": {
        "title": "Detenciones tras lanzamiento de bengalas en el partido de Europa League del Forest",
        "summary": "La policía detuvo a tres individuos después de que se lanzaran bengalas desde la zona visitante durante un partido de Europa League del Nottingham Forest, destacando problemas de seguridad continuos en la competición europea."
      }
    }
  },
  {
    "title": "Corinthians in talks with ex-Man Utd midfielder Lingard",
    "slug": "corinthians-in-talks-ex-man-utd-midfielder-lingard",
    "url": "https://www.bbc.com/sport/football/articles/c70nj1992p9o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T15:42:44.000Z",
    "summary": "Former England and Manchester United midfielder Jesse Lingard is conducting positive negotiations with Brazilian club Corinthians regarding a potential move.",
    "content": "Former England and Man Utd midfielder Jesse Lingard holds positive talks with Brazilian club Corinthians.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "科林蒂安斯与前曼联中场球员林加德进行谈判",
        "summary": "前英格兰和曼彻斯特联队中场球员杰西·林加德正在与巴西俱乐部科林蒂安斯进行积极的转会谈判。"
      },
      "fr": {
        "title": "Corinthians en pourparlers avec l'ancien milieu de terrain de Man Utd Lingard",
        "summary": "L'ancien milieu de terrain de l'Angleterre et de Manchester United, Jesse Lingard, mène des négociations positives avec le club brésilien Corinthians en vue d'un transfert potentiel."
      },
      "de": {
        "title": "Corinthians verhandelt mit Ex-Man-Utd-Mittelfeldspieler Lingard",
        "summary": "Der ehemalige englische und Manchester-United-Mittelfeldspieler Jesse Lingard führt positive Verhandlungen mit dem brasilianischen Verein Corinthians über einen möglichen Wechsel."
      },
      "es": {
        "title": "Corinthians negocia con el centrocampista ex Man Utd Lingard",
        "summary": "El antiguo centrocampista de Inglaterra y Manchester United Jesse Lingard está en negociaciones positivas con el club brasileño Corinthians respecto a un posible fichaje."
      }
    }
  },
  {
    "title": "How do Man City's Muslim players adapt to Ramadan and what help do they get?",
    "slug": "how-do-man-city-muslim-players-adapt-ramadan",
    "url": "https://www.bbc.com/sport/football/articles/c20lzy1n59lo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T15:18:07.000Z",
    "summary": "During Ramadan, Manchester City's Muslim players modify their training and competition schedules, with the club providing specialized support to help them observe the Islamic holy month while maintaining performance.",
    "content": "Muslims around the world are currently observing the Islamic holy month of Ramadan, including professional footballers, so how do Manchester City help their players?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "曼城穆斯林球员如何适应斋月，他们获得什么帮助？",
        "summary": "在斋月期间，曼城的穆斯林球员调整他们的训练和比赛日程，俱乐部提供专门的支持，帮助他们在遵守伊斯兰教圣月的同时保持比赛状态。"
      },
      "fr": {
        "title": "Comment les joueurs musulmans de Man City s'adaptent au Ramadan et quel soutien reçoivent-ils ?",
        "summary": "Pendant le Ramadan, les joueurs musulmans de Manchester City modifient leurs horaires d'entraînement et de compétition, le club offrant un soutien spécialisé pour les aider à observer le mois sacré islamique tout en maintenant leurs performances."
      },
      "de": {
        "title": "Wie passen sich die muslimischen Spieler von Man City dem Ramadan an und welche Unterstützung erhalten sie?",
        "summary": "Während des Ramadans passen die muslimischen Spieler von Manchester City ihre Trainings- und Wettbewerbspläne an, wobei der Verein spezialisierte Unterstützung bietet, um ihnen bei der Einhaltung des islamischen Heiligen Monats zu helfen und gleichzeitig ihre Leistung zu bewahren."
      },
      "es": {
        "title": "¿Cómo se adaptan los jugadores musulmanes del Man City al Ramadán y qué ayuda reciben?",
        "summary": "Durante el Ramadán, los jugadores musulmanes del Manchester City modifican sus horarios de entrenamiento y competición, y el club proporciona apoyo especializado para ayudarles a observar el mes sagrado islámico mientras mantienen su rendimiento."
      }
    }
  },
  {
    "title": "Norwich's Sargent completes £20m move to Toronto",
    "slug": "norwich-sargent-completes-20m-move-toronto",
    "url": "https://www.bbc.com/sport/football/articles/c93jk35nzz0o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T15:10:20.000Z",
    "summary": "Norwich City striker Josh Sargent has completed his transfer to MLS side Toronto FC in a deal valued at over £20 million.",
    "content": "Norwich City striker Josh Sargent completes his move to MLS side Toronto FC in a deal worth more than £20m.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "诺维奇萨金特完成2000万英镑转会到多伦多",
        "summary": "诺维奇城前锋乔什·萨金特完成了向美职联球队多伦多FC的转会,交易金额超过2000万英镑。"
      },
      "fr": {
        "title": "Sargent de Norwich complète un transfert de 20 millions de livres à Toronto",
        "summary": "L'attaquant de Norwich City Josh Sargent a complété son transfert vers le club de la MLS Toronto FC dans un accord évalué à plus de 20 millions de livres."
      },
      "de": {
        "title": "Norwichs Sargent vervollständigt 20-Millionen-Pfund-Wechsel zu Toronto",
        "summary": "Stürmer Josh Sargent vom Norwich City hat seinen Wechsel zur MLS-Mannschaft Toronto FC in einem Deal im Wert von über 20 Millionen Pfund abgeschlossen."
      },
      "es": {
        "title": "Sargent de Norwich completa su traspaso de £20 millones a Toronto",
        "summary": "El delantero de Norwich City Josh Sargent ha completado su traspaso al equipo de la MLS Toronto FC en un acuerdo valorado en más de £20 millones."
      }
    }
  },
  {
    "title": "Firhill to host final between Caley Thistle & Rovers live on BBC",
    "slug": "firhill-to-host-final-caley-thistle-rovers-bbc",
    "url": "https://www.bbc.com/sport/football/articles/c75e1q69rkeo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T14:41:48.000Z",
    "summary": "Partick Thistle's Firhill stadium will host the KDM Evolution Trophy final between Inverness Caledonian Thistle and Raith Rovers, to be broadcast live on BBC Alba.",
    "content": "Partick Thistle's Wyre Stadium at Firhill is chosen to host the KDM Evolution Trophy final between Inverness Caledonian Thistle and Raith Rovers live on BBC Alba.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "法瑟尔球场将在BBC直播主办凯利蒙克与流浪者的决赛",
        "summary": "帕特里克蒂斯尔的法瑟尔球场将主办KDM进化杯决赛,对阵球队为因弗内斯凯利蒙克和雷斯流浪者,并将在BBC Alba上直播。"
      },
      "fr": {
        "title": "Firhill accueillera la finale entre Caley Thistle & Rovers en direct sur BBC",
        "summary": "Le stade Firhill de Partick Thistle accueillera la finale de la Coupe KDM Evolution entre Inverness Caledonian Thistle et Raith Rovers, retransmise en direct sur BBC Alba."
      },
      "de": {
        "title": "Firhill wird das Finale zwischen Caley Thistle & Rovers live auf BBC zeigen",
        "summary": "Das Stadion Firhill von Partick Thistle wird das KDM Evolution Trophy-Finale zwischen Inverness Caledonian Thistle und Raith Rovers ausrichten und live auf BBC Alba übertragen."
      },
      "es": {
        "title": "Firhill albergará la final entre Caley Thistle & Rovers en directo en BBC",
        "summary": "El estadio Firhill del Partick Thistle albergará la final de la Copa KDM Evolution entre Inverness Caledonian Thistle y Raith Rovers, que se transmitirá en vivo en BBC Alba."
      }
    }
  },
  {
    "title": "You don't know what people are going through - Coady",
    "slug": "you-dont-know-what-people-going-through-coady",
    "url": "https://www.bbc.com/sport/football/articles/c5ygl7n584xo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T13:04:51.000Z",
    "summary": "Former England international Conor Coady emphasizes his commitment to helping people from all walks of life, highlighting the importance of compassion and understanding.",
    "content": "Former England international Conor Coady says he tries to help people in \"any walk of life\".",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "你不知道人们经历了什么 - 科迪",
        "summary": "前英格兰国际球员康纳·科迪强调了他致力于帮助来自各行各业人们的承诺,强调了同情心和理解的重要性。"
      },
      "fr": {
        "title": "Tu ne sais pas ce que les gens traversent - Coady",
        "summary": "L'ancien international anglais Conor Coady souligne son engagement à aider les gens de tous horizons, en mettant l'accent sur l'importance de la compassion et de la compréhension."
      },
      "de": {
        "title": "Du weißt nicht, was die Menschen durchmachen - Coady",
        "summary": "Der ehemalige englische Nationalspieler Conor Coady betont sein Engagement, Menschen aus allen Bereichen des Lebens zu helfen und unterstreicht die Bedeutung von Mitgefühl und Verständnis."
      },
      "es": {
        "title": "No sabes por lo que están pasando las personas - Coady",
        "summary": "El ex internacional inglés Conor Coady enfatiza su compromiso de ayudar a personas de todos los ámbitos de la vida, destacando la importancia de la compasión y la comprensión."
      }
    }
  },
  {
    "title": "VAR to be used for first time in Northern Ireland",
    "slug": "var-used-first-time-northern-ireland",
    "url": "https://www.bbc.com/sport/articles/cdjmrxzr942o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T12:04:59.000Z",
    "summary": "VAR technology will be introduced for the first time in Northern Ireland domestic football during the BetMcLean Cup final between Linfield and Glentoran at Windsor Park next month.",
    "content": "Video Assistant Referee (VAR) technology is to be used in Northern Ireland domestic football for the first time in next month's BetMcLean Cup final between Linfield and Glentoran at Windsor Park.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "VAR技术首次在北爱尔兰使用",
        "summary": "VAR技术将在下个月温莎公园举行的林菲尔德对阵格伦托兰的BetMcLean杯决赛中首次在北爱尔兰国内足球中引入。"
      },
      "fr": {
        "title": "La VAR sera utilisée pour la première fois en Irlande du Nord",
        "summary": "La technologie VAR sera introduite pour la première fois dans le football domestique d'Irlande du Nord lors de la finale de la Coupe BetMcLean entre Linfield et Glentoran à Windsor Park le mois prochain."
      },
      "de": {
        "title": "VAR wird zum ersten Mal in Nordirland eingesetzt",
        "summary": "Die VAR-Technologie wird zum ersten Mal im nordirischen Fußball während des BetMcLean-Cup-Finales zwischen Linfield und Glentoran im Windsor Park nächsten Monat eingeführt."
      },
      "es": {
        "title": "El VAR se utilizará por primera vez en Irlanda del Norte",
        "summary": "La tecnología VAR se introducirá por primera vez en el fútbol doméstico de Irlanda del Norte durante la final de la Copa BetMcLean entre Linfield y Glentoran en Windsor Park el próximo mes."
      }
    }
  },
  {
    "title": "Madrid vs City again in UCL draw, Chelsea get PSG",
    "slug": "madrid-vs-city-again-in-ucl-draw-chelsea-get-psg",
    "url": "https://www.espn.com/soccer/story/_/id/48052479/champions-league-draw-real-madrid-man-city-round-16-chelsea-get-psg",
    "source": "ESPN Soccer",
    "date": "2026-02-27T11:44:37.000Z",
    "summary": "Real Madrid and Manchester City have been paired for a fifth consecutive season in the Champions League round of 16. Holders Paris Saint-Germain will face Chelsea in another heavyweight matchup. These draws set up compelling knockout-stage encounters between Europe's elite clubs.",
    "content": "Real Madrid have been handed another mouthwatering clash with Manchester City in the round-of-16 draw for the Champions League, while holders Paris Saint-Germain face Chelsea.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "皇马对曼城再续欧冠之缘，切尔西抽签遇巴黎",
        "summary": "皇家马德里和曼彻斯特城连续第五个赛季在欧冠16强中配对。卫冕冠军巴黎圣日耳曼将在另一场顶级对决中面对切尔西。这些抽签为欧洲顶级俱乐部间设置了精彩的淘汰赛阶段对阵。"
      },
      "fr": {
        "title": "Madrid contre City à nouveau au tirage au sort de la Ligue des Champions, Chelsea face le PSG",
        "summary": "Le Real Madrid et Manchester City ont été appairés pour une cinquième saison consécutive en huitième de finale de la Ligue des Champions. Les tenants du titre Paris Saint-Germain affronteront Chelsea dans un autre choc de haut niveau. Ces tirages mettent en place des rencontres de phases éliminatoires captivantes entre les plus grands clubs d'Europe."
      },
      "de": {
        "title": "Madrid gegen City erneut im Champions-League-Losglück, Chelsea trifft PSG",
        "summary": "Real Madrid und Manchester City wurden zum fünften Mal in Folge im Achtelfinale der Champions League gepaart. Die Titelverteidiger Paris Saint-Germain werden Chelsea in einem weiteren Spitzenspiel treffen. Diese Auslosungen führen zu spannenden K.o.-Phasen-Begegnungen zwischen Europas Top-Clubs."
      },
      "es": {
        "title": "Madrid contra City nuevamente en el sorteo de Champions League, Chelsea se enfrenta al PSG",
        "summary": "Real Madrid y Manchester City han sido emparejados por quinto año consecutivo en los dieciséisavos de final de la Champions League. Los campeones defensores París Saint-Germain se enfrentarán a Chelsea en otro enfrentamiento de peso pesado. Estos sorteos establecen emocionantes encuentros de fase de eliminación entre los mejores clubes de Europa."
      }
    }
  },
  {
    "title": "Rohl wants 'hot heart and smart mind' from Rangers",
    "slug": "rohl-wants-hot-heart-and-smart-mind-from-rangers",
    "url": "https://www.bbc.com/sport/football/articles/cgrz4x2lj92o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T11:44:12.000Z",
    "summary": "Rangers manager Danny Rohl has emphasized the need for both emotional intensity and tactical intelligence ahead of Sunday's crucial Scottish Premiership clash against Celtic. The match represents a pivotal moment in the title race.",
    "content": "Danny Rohl has urges Rangers to approach Sunday's \"crucial\" Scottish Premiership meeting with Celtic \"with a hot heart and a smart mind\".",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "罗尔要求兰杰斯\"热情和智慧\"",
        "summary": "流浪者队主教练丹尼·罗尔强调在周日对阵凯尔特人的关键苏超比赛前需要情感强度和战术智慧。这场比赛代表了锦标赛竞争中的关键时刻。"
      },
      "fr": {
        "title": "Rohl veut du \"cœur brûlant et l'esprit intelligent\" de Rangers",
        "summary": "Le manager des Rangers Danny Rohl a souligné le besoin d'intensité émotionnelle et d'intelligence tactique avant le choc crucial du Championnat d'Écosse de dimanche contre le Celtic. Le match représente un moment charnière de la course au titre."
      },
      "de": {
        "title": "Rohl möchte \"heißes Herz und intelligenten Verstand\" von Rangers",
        "summary": "Rangers-Manager Danny Rohl hat die Notwendigkeit von emotionaler Intensität und taktischem Verstand vor dem entscheidenden schottischen Premiership-Spiel gegen Celtic am Sonntag betont. Das Spiel stellt einen entscheidenden Moment im Titelrennen dar."
      },
      "es": {
        "title": "Rohl quiere un \"corazón ardiente e inteligencia táctica\" en Rangers",
        "summary": "El entrenador de Rangers Danny Rohl ha enfatizado la necesidad de intensidad emocional e inteligencia táctica antes del crucial enfrentamiento de la Premier League escocesa contra el Celtic el domingo. El partido representa un momento crucial en la carrera por el título."
      }
    }
  },
  {
    "title": "Chelsea to face holders PSG in Champions League's last 16",
    "slug": "chelsea-to-face-holders-psg-in-champions-leagues-last-16",
    "url": "https://www.bbc.com/sport/football/articles/c70njrx7enwo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T11:34:40.000Z",
    "summary": "Chelsea will face defending champions Paris Saint-Germain in the Champions League round of 16. Manchester City will meet Real Madrid for the fifth consecutive season in the knockout stage.",
    "content": "Chelsea will play holders Paris St-Germain in the Champions League round of 16 while Manchester City will face Real Madrid in the knockout stages for a fifth straight season.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "切尔西在欧冠16强中面对卫冕冠军巴黎",
        "summary": "切尔西将在欧冠16强中面对卫冕冠军巴黎圣日耳曼。曼彻斯特城将连续第五年在淘汰赛阶段对阵皇家马德里。"
      },
      "fr": {
        "title": "Chelsea affrontera les tenants du titre au PSG en huitième de finale de la Ligue des Champions",
        "summary": "Chelsea affrontera le Paris Saint-Germain, tenants du titre, en huitième de finale de la Ligue des Champions. Manchester City rencontrera le Real Madrid pour la cinquième saison consécutive en phase éliminatoire."
      },
      "de": {
        "title": "Chelsea trifft im Champions-League-Achtelfinale auf Titelverteidiger PSG",
        "summary": "Chelsea wird im Achtelfinale der Champions League auf die Titelverteidiger Paris Saint-Germain treffen. Manchester City wird Real Madrid zum fünften Mal in Folge in der K.o.-Phase treffen."
      },
      "es": {
        "title": "Chelsea se enfrenta a los campeones defensores PSG en los dieciséisavos de final de la Champions League",
        "summary": "Chelsea se enfrentará a los campeones defensores París Saint-Germain en los dieciséisavos de final de la Champions League. Manchester City se encontrará con el Real Madrid por quinta temporada consecutiva en la fase de eliminación."
      }
    }
  },
  {
    "title": "Liverpool back in profit, but wages highest in PL",
    "slug": "liverpool-back-in-profit-but-wages-highest-in-pl",
    "url": "https://www.espn.com/soccer/story/_/id/48052260/liverpool-back-profit-wage-bill-was-highest-premier-league",
    "source": "ESPN Soccer",
    "date": "2026-02-27T11:05:18.000Z",
    "summary": "Liverpool posted a pre-tax profit of £15.2 million following their Premier League title-winning season. However, the club reported the highest wage bill in the Premier League, reflecting the financial cost of maintaining a competitive squad.",
    "content": "Liverpool returned to profit after their Premier League-winning season with a pre-tax surplus of £15.2million ($20.5) but had the highest wage bill.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "利物浦重回盈利，但英超工资最高",
        "summary": "利物浦在赢得英超冠军赛季后报告了1520万英镑的税前利润。然而，该俱乐部报告了英超联赛最高的工资账单，反映了保持具竞争力阵容的财务成本。"
      },
      "fr": {
        "title": "Liverpool redevient rentable, mais les salaires les plus élevés de la Premier League",
        "summary": "Liverpool a enregistré un bénéfice avant impôts de 15,2 millions de livres sterling suite à leur saison championne de Premier League. Cependant, le club a rapporté la masse salariale la plus élevée de la Premier League, reflétant le coût financier du maintien d'un effectif compétitif."
      },
      "de": {
        "title": "Liverpool wieder profitabel, aber höchste Löhne in der Premier League",
        "summary": "Liverpool verbuchte einen Gewinn vor Steuern von 15,2 Millionen Pfund nach ihrer Meistersaison der Premier League. Der Klub verzeichnete jedoch die höchste Gehaltssumme in der Premier League, was die Finanzkosten für den Erhalt eines wettbewerbsfähigen Kaders widerspiegelt."
      },
      "es": {
        "title": "Liverpool vuelve a las ganancias, pero con los salarios más altos de la Premier League",
        "summary": "Liverpool registró una ganancia antes de impuestos de £15,2 millones después de su temporada ganadora de la Premier League. Sin embargo, el club reportó la masa salarial más alta de la Premier League, reflejando el costo financiero de mantener una plantilla competitiva."
      }
    }
  },
  {
    "title": "Gordon told: Get Arsenal link 'out of your brain'",
    "slug": "gordon-told-get-arsenal-link-out-of-your-brain",
    "url": "https://www.espn.com/soccer/story/_/id/48052313/anthony-gordon-told-put-arsenal-transfer-rumour-your-brain",
    "source": "ESPN Soccer",
    "date": "2026-02-27T11:05:17.000Z",
    "summary": "Newcastle manager Eddie Howe has urged forward Anthony Gordon to dismiss speculation about a potential transfer to Arsenal. Howe emphasized the importance of maintaining focus during the current season amid transfer rumors.",
    "content": "Newcastle boss Eddie Howe has urged striker Anthony Gordon not to be distracted by speculation linking him with a summer move to Arsenal.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "戈登被告知：把阿森纳的传言\"从脑子里赶出去\"",
        "summary": "纽卡斯尔主教练埃迪·豪敦促前锋安东尼·戈登打消关于可能转会阿森纳的猜测。豪强调了在转会谣言中保持专注本赛季的重要性。"
      },
      "fr": {
        "title": "Gordon prié d'oublier le lien Arsenal",
        "summary": "Le manager de Newcastle, Eddie Howe, a exhorté l'attaquant Anthony Gordon à rejeter la spéculation sur un transfert potentiel à Arsenal. Howe a souligné l'importance de maintenir la concentration pendant la saison actuelle au milieu des rumeurs de transfert."
      },
      "de": {
        "title": "Gordon aufgefordert: Arsenal-Link \"aus dem Kopf werfen\"",
        "summary": "Newcastles Manager Eddie Howe hat Stürmer Anthony Gordon aufgefordert, Spekulationen über einen möglichen Transfer zu Arsenal zu ignorieren. Howe betonte die Wichtigkeit, sich während der laufenden Saison inmitten von Transfergerüchten konzentriert zu halten."
      },
      "es": {
        "title": "Gordon advertido: Sácate el vínculo con Arsenal \"de la cabeza\"",
        "summary": "El manager de Newcastle, Eddie Howe, ha instado al delantero Anthony Gordon a descartar la especulación sobre un posible traspaso al Arsenal. Howe enfatizó la importancia de mantener el enfoque durante la temporada actual en medio de rumores de transferencia."
      }
    }
  },
  {
    "title": "When could Wolves be relegated?",
    "slug": "when-could-wolves-be-relegated",
    "url": "https://www.bbc.com/sport/football/articles/clyg15yledeo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T10:52:41.000Z",
    "summary": "BBC Sport examines the mathematical scenarios and timeline for Wolverhampton's potential relegation from the Premier League. The analysis explores how soon the club could officially drop from the top flight.",
    "content": "BBC Sport's Ask Me Anything team looks at how soon Wolves can officially be relegated from the Premier League.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "狼队何时可能被降级？",
        "summary": "BBC体育频道检查了沃尔夫汉普顿从英超可能被降级的数学情景和时间表。该分析探讨了俱乐部可能何时正式从英超下降。"
      },
      "fr": {
        "title": "Quand les Wolves pourraient-ils être relégués?",
        "summary": "BBC Sport examine les scénarios mathématiques et le calendrier de la relégation potentielle de Wolverhampton de la Premier League. L'analyse explore dans combien de temps le club pourrait officiellement descendre de l'élite."
      },
      "de": {
        "title": "Wann könnten Wolves absteigen?",
        "summary": "BBC Sport untersucht die mathematischen Szenarien und den Zeitplan für Wolverhamptons möglichen Abstieg aus der Premier League. Die Analyse untersucht, wie bald der Club offiziell vom höchsten Niveau absteigen könnte."
      },
      "es": {
        "title": "¿Cuándo podrían los Wolves ser descendidos?",
        "summary": "BBC Sport examina los escenarios matemáticos y el cronograma de la posible relegación de Wolverhampton de la Premier League. El análisis explora cuándo el club podría oficialmente descender de la máxima categoría."
      }
    }
  },
  {
    "title": "Weekend predictions: Arsenal, Bayern title bids on the line?",
    "slug": "weekend-predictions-arsenal-bayern-title-bids-on-the-line",
    "url": "https://www.espn.com/soccer/story/_/id/48046810/arsenal-chelsea-orlando-city-inter-miamijulien-laurens-weekend-preview",
    "source": "ESPN Soccer",
    "date": "2026-02-27T10:42:35.000Z",
    "summary": "Sports analyst Julien Laurens highlights the key European football matches to watch this weekend, focusing on crucial title races involving Arsenal and Bayern Munich. Multiple league leaders will test their championship credentials.",
    "content": "It's Friday and another full weekend of action awaits across the soccer calendar as Julien Laurens picks out the best games to watch in Europe.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "周末预测:阿森纳、拜仁的冠军梦还能延续吗?",
        "summary": "体育分析师朱利安·劳伦斯强调了本周末值得关注的欧洲足球关键比赛，重点关注阿森纳和拜仁慕尼黑的重要冠军争夺战。多支联赛领头羊将测试其冠军实力。"
      },
      "fr": {
        "title": "Prédictions du week-end: les candidatures au titre d'Arsenal et du Bayern en jeu?",
        "summary": "L'analyste sportif Julien Laurens met en lumière les matchs clés de football européen à suivre ce week-end, en se concentrant sur les courses au titre cruciales impliquant Arsenal et le Bayern Munich. Plusieurs leaders de ligue testeront leurs titres de favori pour le championnat."
      },
      "de": {
        "title": "Wochenend-Vorhersagen: Stehen Arsenals und Bayerns Titelchancen auf dem Spiel?",
        "summary": "Sportanalyst Julien Laurens hebt die wichtigsten europäischen Fußballspiele hervor, die an diesem Wochenende zu beobachten sind, und konzentriert sich auf entscheidende Titelrennen zwischen Arsenal und dem FC Bayern München. Mehrere Ligaführer werden ihre Meisterschaftsambitionen testen."
      },
      "es": {
        "title": "Predicciones del fin de semana: ¿están en juego los títulos de Arsenal y Bayern?",
        "summary": "El analista deportivo Julien Laurens destaca los partidos de fútbol europeo clave para observar este fin de semana, enfocándose en las carreras por el título cruciales que involucran a Arsenal y el Bayern Munich. Múltiples líderes de liga pondrán a prueba sus credenciales de campeonato."
      }
    }
  },
  {
    "title": "Gordon needs to stay 'fully focused' after Arsenal talk - Howe",
    "slug": "gordon-needs-to-stay-fully-focused-after-arsenal-talk-howe",
    "url": "https://www.bbc.com/sport/football/articles/cnv6e1ggy77o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T10:42:13.000Z",
    "summary": "Eddie Howe has called for Anthony Gordon to maintain full focus following reports linking the Newcastle forward to Arsenal. The manager stressed the importance of concentration as transfer rumors continue to circulate.",
    "content": "Head coach Eddie Howe has urged Anthony Gordon to stay \"fully focused\" after the Newcastle United forward was linked with a move to Arsenal.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "戈登需要在阿森纳传言后保持\"完全专注\" - 豪",
        "summary": "埃迪·豪呼吁安东尼·戈登在与阿森纳传闻后保持完全专注。这位经理强调了专注的重要性，因为转会谣言继续流传。"
      },
      "fr": {
        "title": "Gordon doit rester 'pleinement concentré' après les rumeurs d'Arsenal - Howe",
        "summary": "Eddie Howe a appelé Anthony Gordon à maintenir une concentration totale suite aux rapports le liant à Arsenal. Le manager a souligné l'importance de la concentration alors que les rumeurs de transfert continuent à circuler."
      },
      "de": {
        "title": "Gordon muss nach Arsenal-Gerüchten 'vollständig konzentriert' bleiben - Howe",
        "summary": "Eddie Howe hat Anthony Gordon aufgefordert, sich vollständig zu konzentrieren, nachdem Berichte ihn mit Arsenal verbunden haben. Der Manager betonte die Wichtigkeit der Konzentration, da Transfergerüchte weiterhin im Umlauf sind."
      },
      "es": {
        "title": "Gordon necesita mantenerse 'totalmente enfocado' después del asunto Arsenal - Howe",
        "summary": "Eddie Howe ha pedido a Anthony Gordon que mantenga su enfoque total después de los reportes que lo vinculan con Arsenal. El gerente enfatizó la importancia de la concentración mientras continúan circulando rumores de transferencia."
      }
    }
  },
  {
    "title": "Who wins People's Puskás Award for world's best amateur goal of the year?",
    "slug": "peoples-puskas-award-best-amateur-goal-of-the-year",
    "url": "https://www.espn.com/soccer/story/_/id/47952091/peoples-puskas-award-wins-best-amateur-goal-year",
    "source": "ESPN Soccer",
    "date": "2026-02-27T10:35:30.000Z",
    "summary": "The People's Puskás Award recognizes the world's best amateur goal of the year, with contenders including an overhead kick, a long-range half-volley, and a rabona. The award celebrates exceptional individual skill from non-professional footballers.",
    "content": "A sublime overhead kick, a long-range half-volley, and some exquisite control followed by a rabona. But which goal wins the People's Puskás Award?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "谁赢得人民普斯卡什奖——年度最佳业余进球?",
        "summary": "人民普斯卡什奖表彰年度世界最佳业余进球，参赛者包括一脚倒钩、远距离半凌空抽射和彩虹过人进球。该奖项表彰非职业足球运动员的卓越个人技能。"
      },
      "fr": {
        "title": "Qui remporte le Prix Puskás du Peuple pour le meilleur but amateur de l'année?",
        "summary": "Le Prix Puskás du Peuple récompense le meilleur but amateur au monde de l'année, avec des candidats incluant un coup de talon, une demi-volée longue distance, et une rabona. Le prix célèbre les compétences individuelles exceptionnelles des footballeurs non-professionnels."
      },
      "de": {
        "title": "Wer gewinnt den People's Puskás Award für das beste Amateurtor des Jahres?",
        "summary": "Der People's Puskás Award würdigt das beste Amateurtor der Welt des Jahres, mit Kandidaten, darunter einen Hackenpass, einen Halbvolley aus der Ferne und eine Rabona. Der Preis würdigt außergewöhnliche individuelle Fähigkeiten von nicht-professionellen Fußballern."
      },
      "es": {
        "title": "¿Quién gana el Premio Puskás del Pueblo por el mejor gol amateur del año?",
        "summary": "El Premio Puskás del Pueblo reconoce el mejor gol amateur del mundo del año, con candidatos que incluyen un tiro de tacón, una media voleas de larga distancia, y una rabona. El premio celebra las habilidades individuales excepcionales de futbolistas no profesionales."
      }
    }
  },
  {
    "title": "Nuno helps me improve everyday - Summerville",
    "slug": "nuno-helps-me-improve-everyday-summerville",
    "url": "https://www.bbc.com/sport/football/videos/ckg1377xy4zo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T10:10:19.000Z",
    "summary": "West Ham forward Crysencio Summerville credits manager Nuno Espírito Santo with his improvement this season. The player highlighted the positive impact of the manager's coaching on his development.",
    "content": "West Ham's Crysencio Summeville shares how Nuno Espirito Santo has helped him improve this season.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "努诺帮助我每天进步 - 桑默维尔",
        "summary": "西汉姆联前锋克赖森西奥·桑默维尔将本赛季的进步归功于主教练努诺·埃斯皮里图·桑托。这名球员强调了主教练的执教对他发展的积极影响。"
      },
      "fr": {
        "title": "Nuno m'aide à m'améliorer chaque jour - Summerville",
        "summary": "L'attaquant de West Ham Crysencio Summerville attribue son amélioration cette saison au manager Nuno Espírito Santo. Le joueur a souligné l'impact positif de l'entraînement du manager sur son développement."
      },
      "de": {
        "title": "Nuno hilft mir, mich jeden Tag zu verbessern - Summerville",
        "summary": "West Hams Stürmer Crysencio Summerville schreibt seine Verbesserung in dieser Saison Manager Nuno Espírito Santo zu. Der Spieler hob die positive Auswirkung des Trainings des Managers auf seine Entwicklung hervor."
      },
      "es": {
        "title": "Nuno me ayuda a mejorar cada día - Summerville",
        "summary": "El delantero de West Ham Crysencio Summerville atribuye su mejora esta temporada al manager Nuno Espírito Santo. El jugador destacó el impacto positivo del entrenamiento del manager en su desarrollo."
      }
    }
  },
  {
    "title": "Cardiff City post £35m loss for last financial year",
    "slug": "cardiff-city-post-35m-loss-for-last-financial-year",
    "url": "https://www.bbc.com/sport/football/articles/crrxezv4wg4o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T09:59:10.000Z",
    "summary": "Cardiff City reported a £35 million loss for the last financial year, remaining dependent on majority owner Vincent Tan's financial support. The club's accumulated loans from Tan reached approximately £90 million by season's end.",
    "content": "Bluebirds accounts state they remain reliant on the financial support of majority shareholder Vincent Tan, whose loans to the club totalled almost £90m by the end of last season.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "卡迪夫城队上一财年亏损3500万英镑",
        "summary": "卡迪夫城队报告上一财年亏损3500万英镑，继续依赖大股东文森特·谭的财务支持。到赛季末，该俱乐部从谭处累积获得的贷款达到约9000万英镑。"
      },
      "fr": {
        "title": "Cardiff City affiche une perte de 35 millions de livres pour le dernier exercice financier",
        "summary": "Cardiff City a enregistré une perte de 35 millions de livres pour le dernier exercice financier, restant dépendante du soutien financier du propriétaire majoritaire Vincent Tan. Les prêts accumulés de Tan ont atteint environ 90 millions de livres à la fin de la saison."
      },
      "de": {
        "title": "Cardiff City verbucht Verlust von 35 Millionen Pfund im letzten Geschäftsjahr",
        "summary": "Cardiff City meldete einen Verlust von 35 Millionen Pfund für das letzte Geschäftsjahr und bleibt auf die finanzielle Unterstützung des Mehrheitseigners Vincent Tan angewiesen. Die kumulierten Darlehen von Tan erreichten bis zum Ende der Saison ungefähr 90 Millionen Pfund."
      },
      "es": {
        "title": "Cardiff City registra una pérdida de £35 millones para el último año fiscal",
        "summary": "Cardiff City reportó una pérdida de 35 millones de libras para el último año fiscal, siguiendo siendo dependiente del apoyo financiero del accionista mayoritario Vincent Tan. Los préstamos acumulados de Tan alcanzaron aproximadamente 90 millones de libras al final de la temporada."
      }
    }
  },
  {
    "title": "So much for three-year plan - what is the secret to manager longevity?",
    "slug": "so-much-for-three-year-plan-what-is-the-secret-to-manager-longevity",
    "url": "https://www.bbc.com/sport/football/articles/ckg1lzwegpgo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T09:48:45.000Z",
    "summary": "Former Premier League manager Tony Pulis examines the challenges facing football managers in modern sport and the difficulty of maintaining job security. The analysis explores the pressures and expectations that make managerial positions increasingly precarious.",
    "content": "In his BBC Sport column, ex-Premier League boss Tony Pulis explains why it is so hard for football managers to keep their jobs in the modern game.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "三年计划泡汤——管理者长期任职的秘诀是什么？",
        "summary": "英超前主教练托尼·普利斯审视了现代足球运动中足球主教练面临的挑战以及保持工作保障的困难。该分析探讨了使管理职位越来越不稳定的压力和期望。"
      },
      "fr": {
        "title": "Adieu le plan de trois ans - quel est le secret de la longévité des managers ?",
        "summary": "L'ancien manager de la Premier League Tony Pulis examine les défis auxquels font face les managers de football dans le sport moderne et la difficulté à maintenir la sécurité de l'emploi. L'analyse explore les pressions et les attentes qui rendent les positions de manager de plus en plus précaires."
      },
      "de": {
        "title": "Weg mit dem Dreijahresplan - was ist das Geheimnis der Langlebigkeit von Managern?",
        "summary": "Der ehemalige Premier-League-Manager Tony Pulis untersucht die Herausforderungen, denen Fußballmanager im modernen Sport gegenüberstehen, und die Schwierigkeit, die Jobsicherheit zu bewahren. Die Analyse untersucht die Druck- und Erwartungsfaktoren, die Managerpositionen zunehmend prekär machen."
      },
      "es": {
        "title": "Adiós al plan de tres años - ¿cuál es el secreto de la longevidad del manager?",
        "summary": "El exmanager de la Premier League Tony Pulis examina los desafíos que enfrentan los managers de fútbol en el deporte moderno y la dificultad de mantener la seguridad laboral. El análisis explora las presiones y expectativas que hacen que las posiciones de manager sean cada vez más precarias."
      }
    }
  },
  {
    "title": "Power Rankings: Chelsea up, Liverpool down in ratings of all 20 teams",
    "slug": "power-rankings-chelsea-up-liverpool-down-in-ratings-of-all-20-teams",
    "url": "https://www.espn.com/soccer/story/_/id/48038107/premier-league-power-rankings-rating-all-20-teams-february-2026",
    "source": "ESPN Soccer",
    "date": "2026-02-27T09:19:39.000Z",
    "summary": "ESPN's Premier League Power Rankings show Chelsea rising while Liverpool falls in the latest team ratings. Crystal Palace continues an impressive run, with rankings reflecting recent form across all 20 top-flight sides.",
    "content": "ESPN's Premier League Power Rankings return to look at all 20 teams: Chelsea are up, Liverpool are down, and Crystal Palace are on fire.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "实力排名：切尔西上升，利物浦下跌在20支球队评分中",
        "summary": "ESPN英超实力排名显示切尔西上升，利物浦在最新球队评分中下跌。水晶宫继续保持强劲势头，排名反映了所有20支顶级联赛球队的最近成绩。"
      },
      "fr": {
        "title": "Classement de puissance : Chelsea monte, Liverpool descend dans les évaluations des 20 équipes",
        "summary": "Les classements de puissance de la Premier League d'ESPN montrent Chelsea en hausse tandis que Liverpool baisse dans les dernières évaluations des équipes. Crystal Palace poursuit une belle course, avec les classements reflétant la forme récente de tous les 20 meilleurs clubs."
      },
      "de": {
        "title": "Power-Rankings: Chelsea steigt, Liverpool fällt in den Bewertungen aller 20 Mannschaften",
        "summary": "ESPNs Premier League Power Rankings zeigen Chelsea im Aufstieg, während Liverpool in den neuesten Team-Bewertungen fällt. Crystal Palace setzt seinen beeindruckenden Lauf fort, wobei die Rankings die jüngste Form aller 20 Top-Flight-Mannschaften widerspiegeln."
      },
      "es": {
        "title": "Ranking de poder: Chelsea sube, Liverpool baja en las clasificaciones de los 20 equipos",
        "summary": "Las clasificaciones de poder de la Premier League de ESPN muestran que Chelsea sube mientras que Liverpool baja en las últimas clasificaciones de equipos. Crystal Palace continúa una racha impresionante, con clasificaciones que reflejan el desempeño reciente en los 20 clubes de primera categoría."
      }
    }
  },
  {
    "title": "Transfer rumors, news: Man United, Chelsea, PSG watch Genk trio",
    "slug": "transfer-rumors-news-man-united-chelsea-psg-watch-genk-trio",
    "url": "https://www.espn.com/soccer/story/_/id/48051584/transfer-rumors-news-man-united-chelsea-psg-watch-genk-trio",
    "source": "ESPN Soccer",
    "date": "2026-02-27T09:07:07.000Z",
    "summary": "Scouts from elite European clubs including Manchester City, Chelsea, Manchester United, and Paris Saint-Germain have observed three Racing Genk players. The widespread interest suggests potential transfer moves involving the Belgian club's emerging talent.",
    "content": "Scouts from clubs including Chelsea, Manchester City, Man United and Paris Saint-Germain watched three Racing Genk stars play. Transfer Talk has the latest.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "转会传闻、新闻：曼联、切尔西、巴黎圣日耳曼关注根克三人组",
        "summary": "包括曼城、切尔西、曼联和巴黎圣日耳曼在内的欧洲精英俱乐部的球探已观察了根克赛车队的三名球员。广泛的关注表明涉及比利时俱乐部新兴人才的潜在转会动向。"
      },
      "fr": {
        "title": "Rumeurs de transfert, actualités : Manchester United, Chelsea, PSG observent le trio de Genk",
        "summary": "Les éclaireurs des clubs européens d'élite, notamment Manchester City, Chelsea, Manchester United et Paris Saint-Germain, ont observé trois joueurs de Racing Genk. L'intérêt généralisé suggère des mouvements de transfert potentiels impliquant les talents émergents du club belge."
      },
      "de": {
        "title": "Transfergerüchte, Nachrichten: Manchester United, Chelsea, PSG beobachten Genk-Trio",
        "summary": "Scouts von Elite-Clubs aus ganz Europa, darunter Manchester City, Chelsea, Manchester United und Paris Saint-Germain, haben drei Spieler von Racing Genk beobachtet. Das weit verbreitete Interesse deutet auf mögliche Transferbewegungen mit aufstrebenden Talenten des belgischen Clubs hin."
      },
      "es": {
        "title": "Rumores de transferencia, noticias: Manchester United, Chelsea, PSG observan trío de Genk",
        "summary": "Los cazatalentos de los principales clubes europeos, incluyendo Manchester City, Chelsea, Manchester United y París Saint-Germain, han observado a tres jugadores de Racing Genk. El amplio interés sugiere posibles movimientos de transferencia que implican el talento emergente del club belga."
      }
    }
  },
  {
    "title": "All your FPL stats and Premier League team news in one place",
    "slug": "all-your-fpl-stats-and-premier-league-team-news-in-one-place",
    "url": "https://www.bbc.com/sport/articles/c8r1v87n62xo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T08:50:19.000Z",
    "summary": "A comprehensive resource consolidates all Premier League team news and crucial Fantasy Premier League statistics in one location. The guide provides fans with essential information for following the season and making informed FPL decisions.",
    "content": "Every key bit of Premier League team news and the most important Fantasy Premier League statistics - all in one place.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "你的FPL统计数据和英超球队新闻一应俱全",
        "summary": "一份综合资源将所有英超球队新闻和关键梦幻英超统计数据汇聚在一个位置。该指南为粉丝提供了追踪本赛季和做出明智FPL决策所需的基本信息。"
      },
      "fr": {
        "title": "Toutes vos statistiques FPL et actualités des équipes de la Premier League au même endroit",
        "summary": "Une ressource complète consolide toutes les actualités des équipes de la Premier League et les statistiques essentielles de la Fantasy Premier League en un seul endroit. Le guide fournit aux fans les informations essentielles pour suivre la saison et prendre des décisions éclairées en matière de FPL."
      },
      "de": {
        "title": "Alle deine FPL-Statistiken und Premier League Team-Nachrichten an einem Ort",
        "summary": "Eine umfassende Ressource konsolidiert alle Premier League Team-Nachrichten und entscheidende Fantasy Premier League-Statistiken an einem Ort. Der Leitfaden bietet Fans wichtige Informationen zum Verfolgen der Saison und zum Treffen fundierter FPL-Entscheidungen."
      },
      "es": {
        "title": "Todas tus estadísticas de FPL y noticias del equipo de la Premier League en un lugar",
        "summary": "Un recurso completo consolida todas las noticias de equipos de la Premier League y estadísticas cruciales de la Fantasy Premier League en una ubicación. La guía proporciona a los aficionados información esencial para seguir la temporada y tomar decisiones informadas sobre FPL."
      }
    }
  },
  {
    "title": "Exits & borrowed time - things to watch in the EFL",
    "slug": "exits-borrowed-time-things-watch-efl",
    "url": "https://www.bbc.com/sport/football/articles/clyvdpy5zm5o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T08:49:42.000Z",
    "summary": "BBC Sport highlights five key storylines to watch across the English Football League this weekend.",
    "content": "Here are five things to look out for across the English Football League this weekend.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "离开与借用时间——英冠联赛值得关注的事",
        "summary": "BBC体育强调了本周末英冠联赛中需要关注的五条关键故事线。"
      },
      "fr": {
        "title": "Départs et sursis - choses à surveiller dans l'EFL",
        "summary": "BBC Sport met en évidence cinq intrigues clés à suivre dans la Ligue de football anglaise ce week-end."
      },
      "de": {
        "title": "Abgänge und Gnadenfrist - Dinge zu beachten in der EFL",
        "summary": "BBC Sport hebt fünf wichtige Geschichten hervor, die man sich in dieser Woche in der English Football League ansehen sollte."
      },
      "es": {
        "title": "Salidas y tiempo prestado - cosas a observar en la EFL",
        "summary": "BBC Sport destaca cinco tramas clave a seguir en la Liga de Fútbol Inglés este fin de semana."
      }
    }
  },
  {
    "title": "How to follow the Premier League on the BBC this week",
    "slug": "how-follow-premier-league-bbc-week",
    "url": "https://www.bbc.com/sport/football/articles/c0kpzljpz6lo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T08:39:47.000Z",
    "summary": "BBC Sport provides a guide on how to watch Premier League matches on the BBC this weekend.",
    "content": "BBC Sport Ask Me Anything explains how to follow the Premier League on the BBC this weekend.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "本周如何在BBC上关注英超",
        "summary": "BBC体育提供了本周末在BBC上观看英超比赛的指南。"
      },
      "fr": {
        "title": "Comment suivre la Premier League sur la BBC cette semaine",
        "summary": "BBC Sport fournit un guide sur la façon de regarder les matchs de la Premier League sur la BBC ce week-end."
      },
      "de": {
        "title": "Wie man diese Woche die Premier League auf der BBC verfolgt",
        "summary": "BBC Sport bietet einen Leitfaden, wie man sich Premier-League-Spiele auf der BBC in diesem Wochenende ansehen kann."
      },
      "es": {
        "title": "Cómo seguir la Premier League en la BBC esta semana",
        "summary": "BBC Sport proporciona una guía sobre cómo ver los partidos de la Premier League en la BBC este fin de semana."
      }
    }
  },
  {
    "title": "Podcast: It’s the SPFL weekend preview",
    "slug": "podcast-spfl-weekend-preview",
    "url": "https://www.bbc.co.uk/sounds/play/p0n3mc67?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T08:00:00.000Z",
    "summary": "An SPFL weekend preview podcast featuring Charlotte Cohen, Cammy Bell, and Moira Gordon looks ahead to the weekend Scottish fixtures.",
    "content": "Looking ahead to the weekend fixtures. With Charlotte Cohen, Cammy Bell and Moira Gordon.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "播客：SPFL周末预览",
        "summary": "由夏洛特·科恩、卡米·贝尔和莫伊拉·戈登主演的SPFL周末预览播客预展周末苏格兰比赛。"
      },
      "fr": {
        "title": "Podcast : L'aperçu du week-end de la SPFL",
        "summary": "Un podcast d'aperçu du week-end de la SPFL présenté par Charlotte Cohen, Cammy Bell et Moira Gordon, jetant un coup d'œil aux matchs écossais du week-end."
      },
      "de": {
        "title": "Podcast: SPFL-Wochenendvorschau",
        "summary": "Ein SPFL-Wochenendvorschau-Podcast mit Charlotte Cohen, Cammy Bell und Moira Gordon blickt auf die schottischen Spiele des Wochenendes voraus."
      },
      "es": {
        "title": "Podcast: Vista previa del fin de semana de la SPFL",
        "summary": "Un podcast de vista previa del fin de semana de la SPFL con Charlotte Cohen, Cammy Bell y Moira Gordon que anticipa los enfrentamientos escoceses del fin de semana."
      }
    }
  },
  {
    "title": "From Hearts failure to Estoril excitement - the 'most Portuguese Scot there is'",
    "slug": "from-hearts-failure-estoril-excitement-portuguese-scot",
    "url": "https://www.bbc.com/sport/football/articles/ce94r0x3v55o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T07:53:35.000Z",
    "summary": "Scottish manager Ian Cathro is rebuilding his reputation at Portuguese club Estoril after a forgettable seven-month stint in charge at Hearts in 2017.",
    "content": "After a forgettable seven months in charge at Hearts in 2017, Scottish manager Ian Cathro is rebuilding his reputation at Estoril.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "从哈茨失败到埃什托里尔兴奋——\"最葡萄牙的苏格兰人\"",
        "summary": "苏格兰经理伊恩·卡斯罗在2017年在哈茨短暂任职七个月后，正在葡萄牙俱乐部埃什托里尔重建自己的声誉。"
      },
      "fr": {
        "title": "De l'échec de Hearts à l'excitation d'Estoril - le « plus portugais des Écossais »",
        "summary": "Le manager écossais Ian Cathro reconstruit sa réputation au club portugais Estoril après un passage de sept mois inoubliable à la tête de Hearts en 2017."
      },
      "de": {
        "title": "Vom Hearts-Scheitern zur Estoril-Aufregung – der „portugiesischste Schotte\"",
        "summary": "Der schottische Manager Ian Cathro baut seinen Ruf beim portugiesischen Club Estoril nach einem unvergesslichen siebenmonatigen Einsatz bei Hearts im Jahr 2017 wieder auf."
      },
      "es": {
        "title": "Del fracaso del Hearts a la emoción de Estoril - el 'escocés más portugués que existe'",
        "summary": "El entrenador escocés Ian Cathro está reconstruyendo su reputación en el club portugués Estoril después de un breve paso de siete meses al mando del Hearts en 2017."
      }
    }
  },
  {
    "title": "Spurs in their Tudor era? Try our football history quiz",
    "slug": "spurs-tudor-era-football-history-quiz",
    "url": "https://www.bbc.com/sport/football/articles/c5ykql3krk4o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T07:51:16.000Z",
    "summary": "BBC Sport presents a playful history quiz about Tottenham's new manager Igor, humorously suggesting he could become one of the most famous Tudors if he keeps the struggling club in the Premier League.",
    "content": "If new boss Igor can keep struggling Tottenham in the Premier League, he could become one of the most popular Tudors since the 1500s.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "热刺的都铎时代？尝试我们的足球历史测验",
        "summary": "BBC体育提供了一份关于托特纳姆热刺新经理伊戈尔的有趣历史测验，幽默地暗示如果他能让陷入困境的俱乐部保留在英超联赛中，他可能会成为最著名的都铎人之一。"
      },
      "fr": {
        "title": "Les Spurs dans leur ère Tudor ? Essayez notre quiz d'histoire du football",
        "summary": "BBC Sport présente un quiz historique ludique sur le nouveau manager de Tottenham, Igor, suggérant humoristiquement qu'il pourrait devenir l'un des Tudors les plus célèbres s'il maintient le club en difficulté en Premier League."
      },
      "de": {
        "title": "Spurs in ihrer Tudor-Ära? Probieren Sie unser Fußball-Geschichte-Quiz",
        "summary": "BBC Sport präsentiert ein verspieltes Geschichtsquiz über Tottenhams neuen Manager Igor und deutet humorvoll an, dass er einer der berühmtesten Tudors werden könnte, wenn er den angeschlagenen Club in der Premier League hält."
      },
      "es": {
        "title": "¿Spurs en su era Tudor? Prueba nuestro quiz de historia del fútbol",
        "summary": "BBC Sport presenta un cuestionario histórico lúdico sobre el nuevo entrenador del Tottenham, Igor, sugiriendo humorísticamente que podría convertirse en uno de los Tudors más famosos si mantiene al club en dificultades en la Premier League."
      }
    }
  },
  {
    "title": "McCowan backs Celtic as Askou addresses speculation - gossip",
    "slug": "mccowan-backs-celtic-askou-speculation-gossip",
    "url": "https://www.bbc.com/sport/football/articles/c363jrzw0kno?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T07:40:20.000Z",
    "summary": "Football gossip roundup covering Luke McCowan's endorsement of Celtic's quality, a Motherwell boss addressing speculation, and news of Hearts manager's Dubai trip.",
    "content": "Luke McCowan backs Celtic quality, Mothewell boss addresses speculation and Hearts manager on Dubai trip.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "麦考恩支持凯尔特人，阿斯库回应传言 - 八卦",
        "summary": "足球八卦综合报道，涵盖卢克·麦考恩对凯尔特人实力的认可、莫瑟韦尔主帅回应传言，以及心脏队经理迪拜之旅的新闻。"
      },
      "fr": {
        "title": "McCowan soutient Celtic alors qu'Asku répond aux spéculations - commérages",
        "summary": "Tour d'horizon des commérages du football couvrant l'approbation de Luke McCowan de la qualité de Celtic, un patron de Motherwell répondant aux spéculations, et les nouvelles du voyage à Dubaï du manager de Hearts."
      },
      "de": {
        "title": "McCowan unterstützt Celtic, während Asku Spekulationen anspricht - Klatsch",
        "summary": "Fußball-Klatsch-Rundschau, die Luke McCowans Unterstützung der Qualität von Celtic, einen Motherwell-Boss, der Spekulationen anspricht, und Nachrichten über die Dubaireise des Hearts-Managers abdeckt."
      },
      "es": {
        "title": "McCowan respalda al Celtic mientras Asku aborda especulaciones - chismes",
        "summary": "Resumen de chismes del fútbol que cubre el respaldo de Luke McCowan a la calidad del Celtic, un jefe de Motherwell abordando especulaciones, y noticias del viaje a Dubai del gerente de Hearts."
      }
    }
  },
  {
    "title": "Neymar shushes critics after first goals in return",
    "slug": "neymar-shushes-critics-after-first-goals-in-return",
    "url": "https://www.espn.com/soccer/story/_/id/48048301/neymar-shushes-critics-first-goals-santos-return",
    "source": "ESPN Soccer",
    "date": "2026-02-27T06:17:20.000Z",
    "summary": "Neymar broke his 2026 goal drought in spectacular fashion Thursday, leading Santos to a 2-1 victory over Vasco da Gama in the fourth round of the Brasileirão.",
    "content": "Neymar broke his 2026 goal drought in spectacular fashion Thursday, leading Santos to a 2-1 victory over Vasco da Gama in the fourth round of the Brasileirão.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "内马尔首次复出进球后沉默批评者",
        "summary": "内马尔周四以壮观的方式打破2026年的进球荒，带领桑托斯在巴甲第四轮中以2-1击败瓦斯科·达·伽马。"
      },
      "fr": {
        "title": "Neymar fait taire les critiques après ses premiers buts de retour",
        "summary": "Neymar a rompu sa sécheresse de buts en 2026 de manière spectaculaire jeudi, menant Santos à une victoire 2-1 contre Vasco da Gama au quatrième tour du Brasileirão."
      },
      "de": {
        "title": "Neymar zum Schweigen bringt Kritiker nach Rückkehr mit Toren",
        "summary": "Neymar beendete seinen Tordrought von 2026 auf spektakuläre Weise am Donnerstag und führte Santos zu einem 2:1-Sieg über Vasco da Gama in der vierten Runde der Brasileirão."
      },
      "es": {
        "title": "Neymar calla a los críticos tras sus primeros goles de regreso",
        "summary": "Neymar rompió su sequía de goles de 2026 de manera espectacular el jueves, llevando a Santos a una victoria de 2-1 sobre Vasco da Gama en la cuarta ronda del Brasileirão."
      }
    }
  },
  {
    "title": "Messi scores as Miami wins rescheduled friendly",
    "slug": "messi-scores-as-miami-wins-rescheduled-friendly",
    "url": "https://www.espn.com/soccer/story/_/id/48049042/lionel-messi-scores-inter-miami-wins-rescheduled-friendly",
    "source": "ESPN Soccer",
    "date": "2026-02-27T06:17:20.000Z",
    "summary": "Inter Miami CF beat Independiente del Valle 2-1 on Thursday night in Puerto Rico with goals from Santiago Morales and Lionel Messi to conclude the team's preseason friendly tour.",
    "content": "Inter Miami CF beat Independiente del Valle 2-1 on Thursday night in Puerto Rico with goals from Santiago Morales and Lionel Messi to conclude the team's preseason friendly tour.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "梅西进球，迈阿密赢得重新安排的友谊赛",
        "summary": "国际迈阿密队周四晚在波多黎各以2-1战胜山谷独立队，桑地亚哥·莫拉莱斯和莱昂内尔·梅西进球，完成球队季前友谊赛。"
      },
      "fr": {
        "title": "Messi marque alors que Miami remporte le match amical reprogrammé",
        "summary": "L'Inter Miami CF a battu l'Independiente del Valle 2-1 jeudi soir à Porto Rico avec des buts de Santiago Morales et Lionel Messi pour conclure le tour des matchs amicaux de présaison de l'équipe."
      },
      "de": {
        "title": "Messi trifft, während Miami das verschobene Freundschaftsspiel gewinnt",
        "summary": "Inter Miami CF besiegte Independiente del Valle am Donnerstagabend in Puerto Rico 2:1 mit Toren von Santiago Morales und Lionel Messi und beendete damit die Freundschaftsspiele der Vorsaison der Mannschaft."
      },
      "es": {
        "title": "Messi anota mientras Miami gana el amistoso reprogramado",
        "summary": "Inter Miami CF venció 2-1 a Independiente del Valle el jueves por la noche en Puerto Rico con goles de Santiago Morales y Lionel Messi para concluir la gira de amistosos de pretemporada del equipo."
      }
    }
  },
  {
    "title": "USLPA clears path for strike as CBA talks stall",
    "slug": "uslpa-clears-path-for-strike-as-cba-talks-stall",
    "url": "https://www.espn.com/soccer/story/_/id/48050987/uslpa-authorizes-strike-season-kickoff-looming",
    "source": "ESPN Soccer",
    "date": "2026-02-27T06:17:20.000Z",
    "summary": "null",
    "content": "null",
    "category": "sports"
  },
  {
    "title": "Sources: Jesse Lingard in talks to join Corinthians",
    "slug": "sources-jesse-lingard-in-talks-to-join-corinthians",
    "url": "https://www.espn.com/soccer/story/_/id/48047682/jesse-lingard-corinthians-transfer-man-united",
    "source": "ESPN Soccer",
    "date": "2026-02-27T06:17:20.000Z",
    "summary": "Former England and Manchester United midfielder Jesse Lingard is in advanced talks to join Brazilian top-tier club Corinthians, sources told ESPN.",
    "content": "Former England and Manchester United midfielder Jesse Lingard is in advanced talks to join Brazilian top-tier club Corinthians, sources told ESPN.",
    "category": "sports"
  },
  {
    "title": "Football Daily",
    "slug": "football-daily",
    "url": "https://www.bbc.co.uk/sounds/play/p0n3gnf0?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T06:00:00.000Z",
    "summary": "Kelly Somers speaks to England captain Leah Williamson.",
    "content": "Kelly Somers speaks to England captain Leah Williamson.",
    "category": "sports"
  },
  {
    "title": "The Wayne Rooney Show",
    "slug": "wayne-rooney-show",
    "url": "https://www.bbc.co.uk/sounds/play/p0n01nzh?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T06:00:00.000Z",
    "summary": "Wayne Rooney reflects on hostile European away fixtures and a remarkable encounter with Diego Maradona during his illustrious career.",
    "content": "Wayne looks back at hostile European away games and a surreal meeting with Maradona.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "韦恩·鲁尼秀",
        "summary": "韦恩·鲁尼回顾了他职业生涯中充满敌意的欧洲客场比赛和与迭戈·马拉多纳的一次非凡相遇。"
      },
      "fr": {
        "title": "Le Wayne Rooney Show",
        "summary": "Wayne Rooney réfléchit aux rencontres hostiles en déplacement en Europe et à une remarquable rencontre avec Diego Maradona au cours de sa brillante carrière."
      },
      "de": {
        "title": "Die Wayne Rooney Show",
        "summary": "Wayne Rooney reflektiert über feindselige europäische Auswärtsspiele und eine bemerkenswerte Begegnung mit Diego Maradona während seiner glorreichen Karriere."
      },
      "es": {
        "title": "El Wayne Rooney Show",
        "summary": "Wayne Rooney reflexiona sobre los encuentros hostiles en Europa y un notable encuentro con Diego Maradona durante su ilustre carrera."
      }
    }
  },
  {
    "title": "Football Daily",
    "slug": "football-daily",
    "url": "https://www.bbc.co.uk/sounds/play/m002sgk6?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T00:00:00.000Z",
    "summary": "Hosts John Murray, Ian Dennis, and Ali Bruce-Ball discuss Premier League football, travel, and language in this daily show.",
    "content": "John Murray, Ian Dennis & Ali Bruce-Ball talk Premier League football, travel & language.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "每日足球",
        "summary": "主持人约翰·默里、伊恩·丹尼斯和阿里·布鲁斯-鲍尔在这档日常节目中讨论英超足球、旅行和语言。"
      },
      "fr": {
        "title": "Football Quotidien",
        "summary": "Les animateurs John Murray, Ian Dennis et Ali Bruce-Ball discutent du football de la Premier League, des voyages et de la langue dans ce spectacle quotidien."
      },
      "de": {
        "title": "Fußball täglich",
        "summary": "Die Moderatoren John Murray, Ian Dennis und Ali Bruce-Ball diskutieren Premier League-Fußball, Reisen und Sprache in dieser täglichen Show."
      },
      "es": {
        "title": "Fútbol Diario",
        "summary": "Los anfitriones John Murray, Ian Dennis y Ali Bruce-Ball discuten fútbol de la Premier League, viajes e idioma en este programa diario."
      }
    }
  }
]