[
  {
    "title": "How Fernandes 'coached' Man Utd to victory over Palace",
    "slug": "bruno-fernandes-coach-manchester-united",
    "url": "https://www.bbc.com/sport/football/videos/cn0zk7d9ndjo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T23:54:28.000Z",
    "summary": "Match of the Day pundit Joe Hart highlights Bruno Fernandes' on-field leadership and tactical influence in Manchester United's victory over Crystal Palace.",
    "content": "Match of the Day pundit Joe Hart analyses how Bruno Fernandes was a \"coach on the pitch\" to \"get the best\" out of his Manchester United team-mates in their victory over Crystal Palace.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "费尔南德斯如何\"教练\"曼联战胜水晶宫",
        "summary": "每日赛事评论员乔·哈特强调了布鲁诺·费尔南德斯在曼联战胜水晶宫中的场上领导力和战术影响。"
      },
      "fr": {
        "title": "Comment Fernandes a \"entraîné\" Man Utd à la victoire contre Palace",
        "summary": "Le commentateur de Match of the Day Joe Hart met en lumière le leadership sur le terrain et l'influence tactique de Bruno Fernandes dans la victoire de Manchester United contre Crystal Palace."
      },
      "de": {
        "title": "Wie Fernandes Man Utd zum Sieg gegen Palace \"trainiert\" hat",
        "summary": "Match-of-the-Day-Experte Joe Hart hebt die Feldführung und den taktischen Einfluss von Bruno Fernandes bei Manchesters United-Sieg gegen Crystal Palace hervor."
      },
      "es": {
        "title": "Cómo Fernandes \"entrenó\" al Man Utd hacia la victoria contra Palace",
        "summary": "El comentarista de Match of the Day Joe Hart destaca el liderazgo en el campo e influencia táctica de Bruno Fernandes en la victoria del Manchester United contra el Crystal Palace."
      }
    }
  },
  {
    "title": "Hart breaks down why 'disciplined' Raya is so good",
    "slug": "david-raya-premier-league-goalkeeper",
    "url": "https://www.bbc.com/sport/football/videos/crm8drp9pjlo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T23:53:37.000Z",
    "summary": "Match of the Day pundit Joe Hart explains how David Raya's discipline and composure have established him as one of the Premier League's elite goalkeepers.",
    "content": "Match of the Day pundit Joe Hart breaks down how David Raya has cemented himself as one of the best goalkeepers in the Premier League.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "哈特解释为何\"自律的\"拉亚表现如此出色",
        "summary": "《今日比赛》评论员乔·哈特解释了大卫·拉亚的纪律性和沉着如何使他成为英超联赛最顶级门神之一。"
      },
      "fr": {
        "title": "Hart explique pourquoi Raya « discipliné » est si bon",
        "summary": "Le commentateur de Match of the Day, Joe Hart, explique comment la discipline et le sang-froid de David Raya l'ont établi comme l'un des meilleurs gardiens de la Premier League."
      },
      "de": {
        "title": "Hart erklärt, warum der \"disziplinierten\" Raya so gut ist",
        "summary": "Der Match-of-the-Day-Experte Joe Hart erklärt, wie David Rayas Disziplin und Gelassenheit ihn als einen der Elite-Torhüter der Premier League etabliert haben."
      },
      "es": {
        "title": "Hart explica por qué Raya \"disciplinado\" es tan bueno",
        "summary": "El comentarista de Match of the Day, Joe Hart, explica cómo la disciplina y la serenidad de David Raya lo han establecido como uno de los arqueros de élite de la Premier League."
      }
    }
  },
  {
    "title": "Referee halts La Liga game under racism protocol",
    "slug": "la-liga-racism-protocol-elche-espanyol",
    "url": "https://www.bbc.com/sport/football/articles/cvg3q7yvvkxo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T22:40:18.000Z",
    "summary": "A LaLiga match between Elche and Espanyol was paused for three minutes when the referee invoked UEFA's racism protocol during the game.",
    "content": "Sunday's La Liga match between Elche and Espanyol is paused for three minutes after the referee instigates Uefa's racism protocol.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "裁判以反种族歧视协议暂停西甲比赛",
        "summary": "当裁判在比赛中援引欧足联反种族歧视协议时，埃尔切与西班牙人之间的西甲比赛被暂停了三分钟。"
      },
      "fr": {
        "title": "L'arbitre arrête un match de La Liga en vertu du protocole contre le racisme",
        "summary": "Un match de LaLiga entre Elche et Espanyol a été interrompu pendant trois minutes lorsque l'arbitre a invoqué le protocole de lutte contre le racisme de l'UEFA pendant le match."
      },
      "de": {
        "title": "Schiedsrichter stoppt La-Liga-Spiel unter Rassismus-Protokoll",
        "summary": "Ein La-Liga-Spiel zwischen Elche und Espanyol wurde für drei Minuten unterbrochen, als der Schiedsrichter während des Spiels das Rassismus-Protokoll der UEFA anwendete."
      },
      "es": {
        "title": "Árbitro detiene partido de La Liga bajo protocolo antirracismo",
        "summary": "Un partido de LaLiga entre Elche y Espanyol fue interrumpido durante tres minutos cuando el árbitro invocó el protocolo antirracismo de la UEFA durante el partido."
      }
    }
  },
  {
    "title": "Chelsea could rival Newcastle for Nunez - Monday's gossip",
    "slug": "chelsea-nunez-transfer-gossip",
    "url": "https://www.bbc.com/sport/football/articles/c5yj93y4pk3o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T22:37:27.000Z",
    "summary": "Chelsea is reportedly interested in signing Al-Hilal striker Darwin Nunez, while Manchester City pursues Newcastle's Tino Livramento and other transfer market moves.",
    "content": "Chelsea could join the race for Al-Hilal striker Darwin Nunez, Manchester City looking to make a big move for Newcastle United defender Tino Livramento, Crystal Palace determined to hold on to keeper Dean Henderson, plus more.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "切尔西可能与纽卡斯尔竞争努涅斯 - 周一转会传闻",
        "summary": "据报道切尔西有意签署阿尔希拉尔前锋达尔文·努涅斯，而曼彻斯特城追逐纽卡斯尔的蒂诺·利瓦门托和其他转会市场动向。"
      },
      "fr": {
        "title": "Chelsea pourrait rivaliser avec Newcastle pour Nunez - Commérages du lundi",
        "summary": "Chelsea serait intéressée par la signature du buteur d'Al-Hilal Darwin Nunez, tandis que Manchester City poursuit le défenseur de Newcastle Tino Livramento et d'autres mouvements du marché des transferts."
      },
      "de": {
        "title": "Chelsea könnte Newcastle um Nunez übertrumpfen - Montags-Gerüchte",
        "summary": "Chelsea soll sich angeblich für die Verpflichtung des Al-Hilal-Stürmer Darwin Nunez interessieren, während Manchester City Newcastles Tino Livramento und andere Transfermarktbewegungen verfolgt."
      },
      "es": {
        "title": "Chelsea podría rivalizar con Newcastle por Núñez - Chismes del lunes",
        "summary": "Se informa que Chelsea está interesada en fichar al delantero de Al-Hilal Darwin Núñez, mientras que Manchester City persigue al defensa de Newcastle Tino Livramento y otros movimientos del mercado de transferencias."
      }
    }
  },
  {
    "title": "'Ugly' or 'beautiful'? Set-pieces prove decisive for Arsenal again",
    "slug": "ugly-or-beautiful-set-pieces-prove-decisive-for-arsenal-again",
    "url": "https://www.bbc.com/sport/football/articles/c3v71ykvxwpo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T22:08:02.000Z",
    "summary": "Arsenal extended their Premier League title lead to five points, but their reliance on set-pieces as a scoring method is drawing scrutiny. The tactic's effectiveness raises questions about the sustainability of their approach.",
    "content": "Arsenal move five points clear in the Premier League title race but is their reliance on set-pieces an issue?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"丑陋\"还是\"美妙\"？定位球再次成为阿森纳的决定因素",
        "summary": "阿森纳将英超联赛冠军领先优势扩大到五分，但他们对定位球作为得分手段的依赖引起了审视。这种战术的有效性引发了对他们方法可持续性的质疑。"
      },
      "fr": {
        "title": "« Moche » ou « beau » ? Les coups de pied arrêtés s'avèrent décisifs pour Arsenal une fois de plus",
        "summary": "Arsenal a étendu son avance au classement de la Premier League à cinq points, mais sa dépendance aux coups de pied arrêtés comme méthode de marquage suscite une critique. L'efficacité de cette tactique soulève des questions sur la durabilité de leur approche."
      },
      "de": {
        "title": "\"Hässlich\" oder \"schön\"? Standardsituationen erweisen sich für Arsenal erneut als entscheidend",
        "summary": "Arsenal verlängerte seinen Premier-League-Führung auf fünf Punkte, aber ihre Abhängigkeit von Standardsituationen als Torschussmethode zieht Kritik auf sich. Die Wirksamkeit dieser Taktik wirft Fragen zur Nachhaltigkeit ihres Ansatzes auf."
      },
      "es": {
        "title": "¿\"Feo\" o \"hermoso\"? Los saques fijos resultan decisivos para el Arsenal una vez más",
        "summary": "Arsenal extendió su ventaja en la clasificación de la Premier League a cinco puntos, pero su dependencia de los saques fijos como método de puntuación está siendo cuestionada. La efectividad de esta táctica plantea preguntas sobre la sostenibilidad de su enfoque."
      }
    }
  },
  {
    "title": "Who will win race for the Champions League?",
    "slug": "who-will-win-race-for-the-champions-league",
    "url": "https://www.bbc.com/sport/football/articles/cp9mkm1pm50o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T21:20:25.000Z",
    "summary": "England is expected to secure five Champions League spots for next season, with Arsenal and Manchester City likely to occupy two of them. The competition for the remaining three spots remains wide open among top teams.",
    "content": "England are likely to have five spots in next season's Champions League. With Arsenal and Manchester City set to take two of them, who will claim the others?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "谁将赢得欧冠争夺战？",
        "summary": "英格兰预计将为下赛季获得五个欧冠席位，阿森纳和曼城可能占据其中两个。剩余三个席位的争夺在顶级球队之间仍然悬而未决。"
      },
      "fr": {
        "title": "Qui remportera la course pour la Ligue des Champions ?",
        "summary": "L'Angleterre devrait obtenir cinq places de Ligue des Champions pour la saison prochaine, Arsenal et Manchester City devant probablement en occuper deux. La concurrence pour les trois places restantes reste largement ouverte parmi les meilleures équipes."
      },
      "de": {
        "title": "Wer gewinnt das Rennen um die Champions League?",
        "summary": "England wird voraussichtlich fünf Champions-League-Plätze für die nächste Saison erhalten, wobei Arsenal und Manchester City wahrscheinlich zwei davon belegen werden. Der Wettbewerb um die restlichen drei Plätze bleibt unter den Top-Teams völlig offen."
      },
      "es": {
        "title": "¿Quién ganará la carrera por la Liga de Campeones?",
        "summary": "Se espera que Inglaterra asegure cinco lugares de la Liga de Campeones para la próxima temporada, con Arsenal y Manchester City probablemente ocupando dos de ellos. La competencia por los tres lugares restantes sigue siendo muy abierta entre los equipos de élite."
      }
    }
  },
  {
    "title": "Who has made Troy's Premier League team of the week?",
    "slug": "who-has-made-troy-premier-league-team-of-the-week",
    "url": "https://www.bbc.com/sport/football/articles/cr73ljr0xe0o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T21:06:40.000Z",
    "summary": "Troy Deeney has selected his Premier League team of the week following the latest round of matches. The selections reflect standout individual performances across the week's fixtures.",
    "content": "After every round of Premier League matches this season, Troy Deeney gives us his team of the week. Do you agree with his choices?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "谁入选了特洛伊的英超本周最佳阵容?",
        "summary": "特洛伊·迪尼在最近一轮比赛后选出了他的英超本周最佳阵容。这些选择反映了本周赛事中杰出的个人表现。"
      },
      "fr": {
        "title": "Qui a été sélectionné dans l'équipe de la semaine de Premier League de Troy?",
        "summary": "Troy Deeney a sélectionné son équipe de la semaine de Premier League suite au dernier tour de matchs. Les sélections reflètent les performances individuelles remarquables des matchs de la semaine."
      },
      "de": {
        "title": "Wer wurde in Troys Premier-League-Team der Woche aufgenommen?",
        "summary": "Troy Deeney hat sein Premier-League-Team der Woche nach der letzten Spielrunde ausgewählt. Die Auswahl spiegelt hervorragende Einzelleistungen in den Spielen der Woche wider."
      },
      "es": {
        "title": "¿Quién ha sido seleccionado para el equipo de la semana de Premier League de Troy?",
        "summary": "Troy Deeney seleccionó su equipo de la semana de Premier League después de la última ronda de partidos. Las selecciones reflejan actuaciones individuales destacadas en los partidos de la semana."
      }
    }
  },
  {
    "title": "Football Daily",
    "slug": "football-daily",
    "url": "https://www.bbc.co.uk/sounds/play/m002sc75?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T20:50:00.000Z",
    "summary": "A roundup covering key questions in football this week, including concerns about Spurs' relegation form, discussion of Arsenal's playing style, and Everton's European qualification hopes. The segment addresses multiple storylines across English football.",
    "content": "Will Spurs get relegated? Does Arsenal's 'boring' tag matter? Everton to get Europe?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "足球每日",
        "summary": "本周足球要闻回顾，包括对热刺降级形势的担忧、阿森纳比赛风格的讨论以及埃弗顿的欧洲资格前景。该部分涵盖了英超足球的多个故事线。"
      },
      "fr": {
        "title": "Football Quotidien",
        "summary": "Un résumé couvrant les questions clés du football cette semaine, notamment les inquiétudes concernant la forme de relégation des Spurs, la discussion du style de jeu d'Arsenal et les espoirs de qualification européenne d'Everton. Le segment aborde plusieurs récits dans le football anglais."
      },
      "de": {
        "title": "Fußball täglich",
        "summary": "Eine Zusammenfassung der wichtigsten Fußballthemen dieser Woche, einschließlich Bedenken bezüglich der Abstiegsform der Spurs, Diskussionen über Arsenals Spielweise und Evertons Hoffnungen auf europäische Teilnahme. Das Segment behandelt mehrere Handlungsstränge im englischen Fußball."
      },
      "es": {
        "title": "Fútbol Diario",
        "summary": "Un resumen que cubre las preguntas clave del fútbol esta semana, incluidas las preocupaciones sobre el formulario de descenso de Spurs, la discusión del estilo de juego de Arsenal y las esperanzas de clasificación europea de Everton. El segmento aborda múltiples historias en el fútbol inglés."
      }
    }
  },
  {
    "title": "Prestianni's Benfica career 'over' if abuse proven - Mourinho",
    "slug": "prestianni-benfica-career-over-if-abuse-proven-mourinho",
    "url": "https://www.bbc.com/sport/football/articles/c99j75gzv43o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T20:48:35.000Z",
    "summary": "Benfica manager Jose Mourinho stated that midfielder Gianluca Prestianni's time at the club would end if he is found to have racially abused Real Madrid's Vinicius Jr. The statement underscores the club's commitment to addressing misconduct.",
    "content": "Benfica boss Jose Mourinho says Gianluca Prestianni's career under him will be \"over\" if it is found he racially abused Vinicius Jr.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "普雷斯蒂亚尼在贝恩菲卡的职业生涯如果虐待被证实将\"结束\"——穆里尼奥",
        "summary": "贝恩菲卡主教练何塞·穆里尼奥表示，如果中场球员吉安卢卡·普雷斯蒂亚尼被发现对皇马的维尼修斯小姐进行种族虐待，他在俱乐部的职业生涯将结束。该声明强调了俱乐部对解决不当行为的承诺。"
      },
      "fr": {
        "title": "La carrière de Prestianni à Benfica « terminée » si l'abus est prouvé - Mourinho",
        "summary": "Le manager de Benfica Jose Mourinho a déclaré que la carrière du milieu de terrain Gianluca Prestianni au club prendrait fin s'il était reconnu avoir maltraité racialement Vinicius Jr du Real Madrid. La déclaration souligne l'engagement du club à remédier aux manquements."
      },
      "de": {
        "title": "Prestinannis Benfica-Karriere „vorbei\", wenn Missbrauch bewiesen wird - Mourinho",
        "summary": "Der Benfica-Manager Jose Mourinho erklärte, dass die Zeit des Mittelfeldspielers Gianluca Prestianni im Klub enden würde, wenn sich herausstellt, dass er Vinicius Jr. von Real Madrid rassistisch missbraucht hat. Die Aussage unterstreicht das Engagement des Clubs, Fehlverhalten zu beheben."
      },
      "es": {
        "title": "La carrera de Prestianni en el Benfica 'terminada' si se prueba el abuso - Mourinho",
        "summary": "El gerente del Benfica Jose Mourinho afirmó que la carrera del centrocampista Gianluca Prestianni en el club terminaría si se comprueba que abusó racialmente de Vinicius Jr del Real Madrid. La declaración subraya el compromiso del club de abordar la mala conducta."
      }
    }
  },
  {
    "title": "'It's cultural' - red cards and set-pieces wrecking Chelsea's season",
    "slug": "its-cultural-red-cards-and-set-pieces-wrecking-chelseas-season",
    "url": "https://www.bbc.com/sport/football/articles/crm8dx74jneo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T20:45:56.000Z",
    "summary": "Chelsea fell to a 2-1 defeat at Arsenal, dropping to sixth place six points off the top four, with set-piece goals and a red card continuing their struggles this season. The recurring losses highlight systemic discipline and defensive issues undermining their campaign.",
    "content": "Two set‑piece goals and a red card tell a familiar story for Chelsea, now six points adrift of the Premier League's top four and down to sixth in the table.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"这是文化问题\"——红牌和定位球毁掉切尔西赛季",
        "summary": "切尔西在阿森纳以2-1不敌，跌至第六位，积分落后前四名6分。定位球进球和红牌继续困扰他们的赛季表现。反复的失利凸显了系统性的纪律和防线问题，正在破坏他们的赛季。"
      },
      "fr": {
        "title": "\"C'est culturel\" - les cartons rouges et les coups de pied arrêtés dévastent la saison de Chelsea",
        "summary": "Chelsea a subi une défaite 2-1 à Arsenal, tombant à la sixième place à six points des quatre premiers. Les buts sur coups de pied arrêtés et un carton rouge continuent à perturber leur saison. Les pertes récurrentes mettent en évidence les problèmes systématiques de discipline et de défense qui sapent leur campagne."
      },
      "de": {
        "title": "\"Es ist kulturell\" - Rote Karten und Standardspiele zerstören Chelseas Saison",
        "summary": "Chelsea erlitt eine 2-1-Niederlage gegen Arsenal und fiel auf den sechsten Platz, sechs Punkte hinter den Top Four. Standardspiele und eine rote Karte belasten weiterhin ihre Saison. Die wiederkehrenden Niederlagen verdeutlichen systemische Disziplin- und Abwehrprobleme, die ihre Kampagne untergraben."
      },
      "es": {
        "title": "\"Es cultural\" - tarjetas rojas y saques de esquina destrozando la temporada de Chelsea",
        "summary": "Chelsea cayó derrotado 2-1 en Arsenal, cayendo al sexto lugar a seis puntos de los cuatro primeros. Los goles de saques de esquina y una tarjeta roja continúan afectando su temporada. Las derrotas recurrentes resaltan problemas sistémicos de disciplina y defensa que socavan su campaña."
      }
    }
  },
  {
    "title": "Would it be bigger gamble not to give Carrick Man Utd job?",
    "slug": "would-it-be-bigger-gamble-not-to-give-carrick-man-utd-job",
    "url": "https://www.bbc.com/sport/football/articles/cy0dp14k40lo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T20:40:46.000Z",
    "summary": "With Michael Carrick boasting six wins and a draw in seven games as Manchester United's interim manager, the question arises whether failing to offer him the permanent position would be an even greater risk. His strong early record suggests promotion could be warranted.",
    "content": "With six wins and a draw from seven games in charge of Manchester United, would it prove more of a gamble not to give Michael Carrick the head coach position full-time?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "不给卡里克曼联职位会是更大的赌注吗?",
        "summary": "迈克尔·卡里克作为曼联临时主教练，在七场比赛中赢得六场胜利和一场平局，这引发了一个问题：不给他永久职位是否会是一个更大的风险。他强劲的初期表现表明晋升可能是合理的。"
      },
      "fr": {
        "title": "Serait-ce un plus grand risque de ne pas donner le poste à Carrick à Man Utd?",
        "summary": "Avec Michael Carrick affichant six victoires et un match nul en sept matchs en tant que manager intérimaire de Manchester United, se pose la question de savoir si ne pas lui offrir le poste permanent serait un risque encore plus grand. Son excellent dossier initial suggère que sa promotion pourrait être justifiée."
      },
      "de": {
        "title": "Wäre es ein größeres Risiko, Carrick den Job bei Man Utd nicht zu geben?",
        "summary": "Mit Michael Carrick, der in sieben Spielen als Interimtrainer von Manchester United sechs Siege und ein Unentschieden vorzuweisen hat, stellt sich die Frage, ob es ein noch größeres Risiko wäre, ihm die permanente Position nicht anzubieten. Seine starke vorläufige Bilanz deutet darauf hin, dass eine Beförderung gerechtfertigt sein könnte."
      },
      "es": {
        "title": "¿Sería un riesgo mayor no darle el puesto a Carrick en Man Utd?",
        "summary": "Con Michael Carrick vanagloriándose de seis victorias y un empate en siete partidos como gerente interino del Manchester United, surge la pregunta de si no ofrecerle la posición permanente sería un riesgo aún mayor. Su fuerte desempeño inicial sugiere que una promoción podría estar justificada."
      }
    }
  },
  {
    "title": "Watch: Rangers v Celtic - Sportscene highlights",
    "slug": "watch-rangers-v-celtic-sportscene-highlights",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002s8vw?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T20:15:25.000Z",
    "summary": "Extended highlights from the Rangers versus Celtic match provide comprehensive coverage of this Scottish football rivalry clash. The highlights capture the key moments from the fixture.",
    "content": "Extended highlights of Rangers v Celtic.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "观看：流浪者对凯尔特人 - 运动场景精彩集锦",
        "summary": "流浪者对凯尔特人比赛的延伸集锦提供了这场苏格兰足球对阵的全面覆盖。集锦捕捉了本场比赛的关键时刻。"
      },
      "fr": {
        "title": "Regarder : Rangers contre Celtic - Moments forts de Sportscene",
        "summary": "Les faits saillants étendus du match Rangers contre Celtic fournissent une couverture complète de ce choc de la rivalité du football écossais. Les moments forts capturent les moments clés de la rencontre."
      },
      "de": {
        "title": "Ansehen: Rangers gegen Celtic - Sportscene-Highlights",
        "summary": "Erweiterte Highlights des Spiels Rangers gegen Celtic bieten eine umfassende Abdeckung dieser schottischen Fußball-Rivalität. Die Highlights erfassen die wichtigsten Momente des Spiels."
      },
      "es": {
        "title": "Ver: Rangers vs Celtic - Lo mejor de Sportscene",
        "summary": "Los highlights extendidos del partido Rangers contra Celtic proporcionan una cobertura completa de este choque de rivalidad del fútbol escocés. Los highlights capturan los momentos clave del partido."
      }
    }
  },
  {
    "title": "Arsenal beat 10-man Chelsea to extend lead",
    "slug": "arsenal-beat-10-man-chelsea-to-extend-lead",
    "url": "https://www.bbc.com/sport/football/videos/cge85r8xl0go?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T20:11:59.000Z",
    "summary": "Arsenal defeated Chelsea 2-1 in a match where Chelsea was reduced to 10 men following Pedro Neto's second yellow card, with three goals stemming from corner kicks. The victory extends Arsenal's lead in the Premier League title race.",
    "content": "Arsenal get an important win in the title race against Chelsea, who had Pedro Neto sent off for a second yellow in a game with three goals scored from corners.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "阿森纳击败10人切尔西扩大领先优势",
        "summary": "阿森纳在一场比赛中以2-1击败切尔西，切尔西在佩德罗·内托第二张黄牌后被罚下一人，三粒进球都来自角球。这场胜利扩大了阿森纳在英超联赛争冠竞争中的领先优势。"
      },
      "fr": {
        "title": "Arsenal bat Chelsea en infériorité numérique pour augmenter son avance",
        "summary": "Arsenal a remporté une victoire 2-1 contre Chelsea dans un match où Chelsea a été réduite à 10 joueurs suite au carton jaune second de Pedro Neto, avec trois buts résultant de corners. La victoire élargit l'avance d'Arsenal dans la course au titre de la Premier League."
      },
      "de": {
        "title": "Arsenal schlägt Chelsea mit zehn Spielern und vergrößert seinen Vorsprung",
        "summary": "Arsenal besiegte Chelsea 2-1 in einem Spiel, in dem Chelsea nach Pedros zweiter Gelber Karte auf zehn Mann reduziert wurde, wobei drei Tore aus Ecken stammen. Der Sieg vergrößert Arsenals Vorsprung im Kampf um die Premier-League-Meisterschaft."
      },
      "es": {
        "title": "Arsenal derrota a Chelsea con 10 hombres para ampliar su ventaja",
        "summary": "Arsenal derrotó 2-1 a Chelsea en un partido donde Chelsea se vio reducido a 10 hombres tras la segunda tarjeta amarilla de Pedro Neto, con tres goles provenientes de corners. La victoria amplía la ventaja del Arsenal en la carrera por el título de la Premier League."
      }
    }
  },
  {
    "title": "Arteta delighted with win over 'top side' Chelsea",
    "slug": "arteta-delighted-with-win-over-top-side-chelsea",
    "url": "https://www.bbc.com/sport/football/videos/cg7evp2egxmo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T20:05:43.000Z",
    "summary": "Arsenal manager Mikel Arteta expressed satisfaction with his team's 2-1 victory over Chelsea at the Emirates, viewing it as a significant result against a top-tier opponent. The win highlights Arsenal's growing momentum in the title race.",
    "content": "Arsenal manager Mikel Arteta is delighted with the win against \"top side\" Chelsea which as his side came out 2-1 winners at the Emirates.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "阿尔特塔为战胜\"顶级球队\"切尔西而欣喜",
        "summary": "阿森纳主教练米克尔·阿尔特塔对球队在酋长球场以2-1击败切尔西的胜利感到满意，认为这是对顶级对手的重要胜利。这场胜利凸显了阿森纳在争冠竞争中势头不断增强。"
      },
      "fr": {
        "title": "Arteta ravi de la victoire contre Chelsea, un \"grand rival\"",
        "summary": "L'entraîneur d'Arsenal, Mikel Arteta, a exprimé sa satisfaction après la victoire 2-1 de son équipe contre Chelsea aux Emirates, la considérant comme un résultat significatif contre un adversaire de haut niveau. La victoire met en évidence l'élan croissant d'Arsenal dans la course au titre."
      },
      "de": {
        "title": "Arteta erfreut über Sieg gegen das \"Top-Team\" Chelsea",
        "summary": "Arsenals Trainer Mikel Arteta äußerte Zufriedenheit über den 2-1-Sieg seines Teams gegen Chelsea im Emirates, da er es als bedeutendes Ergebnis gegen einen erstklassigen Gegner ansieht. Der Sieg unterstreicht Arsenals wachsendes Momentum im Kampf um die Meisterschaft."
      },
      "es": {
        "title": "Arteta encantado con la victoria sobre el \"equipo de élite\" Chelsea",
        "summary": "El entrenador del Arsenal, Mikel Arteta, expresó satisfacción por la victoria 2-1 de su equipo sobre Chelsea en el Emirates, considerándola un resultado significativo contra un rival de alto nivel. La victoria destaca el impulso creciente del Arsenal en la carrera por el título."
      }
    }
  },
  {
    "title": "Chelsea won't achieve anything with  disciplinary issues - Rosenior",
    "slug": "chelsea-wont-achieve-anything-with-disciplinary-issues-rosenior",
    "url": "https://www.bbc.com/sport/football/videos/c8d5y80m083o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T20:05:32.000Z",
    "summary": "Chelsea manager Liam Rosenior acknowledged his team's strong performance but attributed the 2-1 defeat at Arsenal to lapses in discipline and moment management, with the team recording a ninth red card of the season. The recurring disciplinary problems threaten Chelsea's season prospects.",
    "content": "Chelsea manager Liam Rosenior says his side's \"very good team performance\" was let down by \"not managing moments\" as they received a ninth red card in all competitions this season in a 2-1 defeat at Arsenal.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "切尔西因纪律问题无法取得成就 - 罗森尼奥尔",
        "summary": "切尔西主教练利亚姆·罗森尼奥尔承认球队表现出色，但将2-1的失利归咎于纪律和时刻管理的失误，球队本赛季已经收到9张红牌。这些反复出现的纪律问题威胁到切尔西的赛季前景。"
      },
      "fr": {
        "title": "Chelsea n'obtiendra rien avec des problèmes disciplinaires - Rosenior",
        "summary": "L'entraîneur de Chelsea, Liam Rosenior, a reconnu la bonne performance de son équipe mais a attribué la défaite 2-1 face à Arsenal à des failles disciplinaires et de gestion des moments, l'équipe enregistrant un neuvième carton rouge de la saison. Les problèmes disciplinaires récurrents menacent les perspectives de saison de Chelsea."
      },
      "de": {
        "title": "Chelsea wird mit disziplinarischen Problemen nichts erreichen - Rosenior",
        "summary": "Chelseas Trainer Liam Rosenior räumte eine starke Leistung seines Teams ein, führte die 2-1-Niederlage gegen Arsenal jedoch auf disziplinarische Mängel und Momentenmanagement zurück, wobei das Team bereits die neunte rote Karte der Saison erhielt. Die wiederkehrenden disziplinarischen Probleme gefährden Chelseas Saisonaussichten."
      },
      "es": {
        "title": "Chelsea no logará nada con problemas disciplinarios - Rosenior",
        "summary": "El entrenador del Chelsea, Liam Rosenior, reconoció el fuerte desempeño de su equipo pero atribuyó la derrota 2-1 ante el Arsenal a deficiencias disciplinarias y de gestión de momentos, con el equipo registrando una novena tarjeta roja de la temporada. Los problemas disciplinarios recurrentes amenazan las perspectivas de temporada del Chelsea."
      }
    }
  },
  {
    "title": "Man United up to third as Sesko's hot streak of crucial goals continues with winner vs. Palace",
    "slug": "man-united-third-sesko-goals-palace",
    "url": "https://www.espn.com/soccer/story/_/id/48071280/manchester-united-third-benjamin-sesko-hot-streak-crucial-goals-continues",
    "source": "ESPN Soccer",
    "date": "2026-03-01T18:00:54.000Z",
    "summary": "Benjamin Sesko scored the winning goal as Manchester United defeated Crystal Palace, extending his recent impressive run of crucial goals and moving the team up to third place.",
    "content": "Man United are flying and so is Benjamin Sesko, whose match-winning strike against Crystal Palace is just the latest in a run of important goals.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "塞斯科进球继续火热状态，曼联击败水晶宫升至第三",
        "summary": "本杰明·塞斯科打进制胜球，帮助曼联击败水晶宫，延续了他最近在关键时刻进球的出色表现，球队排名上升至第三位。"
      },
      "fr": {
        "title": "Manchester United monte à la troisième place tandis que la série de buts décisifs de Sesko se poursuit face à Crystal Palace",
        "summary": "Benjamin Sesko a marqué le but vainqueur alors que Manchester United a vaincu Crystal Palace, prolongeant sa récente série impressionnante de buts décisifs et permettant à l'équipe de monter à la troisième place."
      },
      "de": {
        "title": "Manchester United steigt auf Platz drei auf, während Seskos Serie entscheidender Tore mit Sieg gegen Palace fortgesetzt wird",
        "summary": "Benjamin Sesko erzielte das Siegtor, als Manchester United Crystal Palace besiegte und seine beeindruckende Serie entscheidender Tore fortsetzte, während das Team auf Platz drei aufstieg."
      },
      "es": {
        "title": "Manchester United sube al tercero mientras la racha de goles cruciales de Sesko continúa con victoria contra Palace",
        "summary": "Benjamin Sesko anotó el gol ganador cuando Manchester United derrotó a Crystal Palace, extendiendo su reciente impresionante racha de goles decisivos y llevando al equipo al tercer lugar."
      }
    }
  },
  {
    "title": "VAR review: Was penalty, red-card call that sparked Man United comeback correct?",
    "slug": "var-review-penalty-red-card-man-united",
    "url": "https://www.espn.com/soccer/story/_/id/48072822/var-review-man-united-crystal-palace-pivotal-penalty-red-card-call",
    "source": "ESPN Soccer",
    "date": "2026-03-01T18:00:54.000Z",
    "summary": "A review of the penalty and red card decision awarded to Manchester United against Crystal Palace examines whether officials correctly adjudged Maxence Lacroix's foul and the subsequent dismissal.",
    "content": "Crystal Palace's Maxence Lacroix conceded a penalty and was sent off for a foul. Was it the correct decision?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "VAR审查：曼联复出所引发的点球和红牌判罚是否正确？",
        "summary": "对曼联对阵水晶宫比赛中判罚的点球和红牌决定的审查，检查裁判是否正确判罚了马克西恩斯·拉克鲁瓦的犯规和随后的罚下。"
      },
      "fr": {
        "title": "Examen VAR : La décision de pénalité et de carton rouge qui a déclenché le retour de Manchester United était-elle correcte ?",
        "summary": "Un examen de la décision de pénalité et de carton rouge accordée à Manchester United contre Crystal Palace examine si les arbitres ont correctement jugé la faute de Maxence Lacroix et l'expulsion ultérieure."
      },
      "de": {
        "title": "VAR-Überprüfung: War die Elfmeter- und Rotkartenentscheidung, die Uniteds Comeback auslöste, korrekt?",
        "summary": "Eine Überprüfung der Elfmeter- und Rotkartenentscheidung, die Manchester United gegen Crystal Palace gewährt wurde, untersucht, ob die Schiedsrichter Maxence Lacroix's Foul und die anschließende Rotkartenentscheidung korrekt bewertet haben."
      },
      "es": {
        "title": "Revisión del VAR: ¿Fue correcta la decisión de penalti y tarjeta roja que desencadenó el regreso de Manchester United?",
        "summary": "Una revisión de la decisión de penalti y tarjeta roja otorgada a Manchester United contra Crystal Palace examina si los árbitros juzgaron correctamente la falta de Maxence Lacroix y la posterior expulsión."
      }
    }
  },
  {
    "title": "What now for 'epic' Scottish title race after Old Firm draw?",
    "slug": "scottish-title-race-old-firm-draw",
    "url": "https://www.bbc.com/sport/football/articles/c70n9nr3dx6o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T17:48:19.000Z",
    "summary": "BBC Scotland analyzes the state of Scotland's title race following an Old Firm draw at Ibrox, examining implications for the four competing clubs in one of the most captivating title fights in the country's history.",
    "content": "Amid one of the most captivating title fights in the history Scotland's top flight, BBC Scotland looks at the state of play for each of the four clubs involved.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "老字号德比战打成平手后，苏格兰足坛\"史诗级\"争冠战还会如何发展？",
        "summary": "BBC苏格兰电视台在老字号德比战在埃布罗克斯打成平手后，分析了苏格兰足坛争冠形势，探讨了这对四支参赛球队的影响，这是苏格兰历史上最引人入胜的争冠战之一。"
      },
      "fr": {
        "title": "Où en est la course au titre 'épique' écossaise après le match nul Old Firm ?",
        "summary": "BBC Écosse analyse l'état de la course au titre écossais suite à un match nul Old Firm à Ibrox, examinant les implications pour les quatre clubs en compétition dans l'une des luttes pour le titre les plus captivantes de l'histoire du pays."
      },
      "de": {
        "title": "Wie geht es weiter im 'epischen' schottischen Titelrennen nach Old-Firm-Unentschieden?",
        "summary": "BBC Scotland analysiert den Stand des schottischen Titelrennens nach einem Old-Firm-Unentschieden in Ibrox und untersucht die Auswirkungen auf die vier konkurrierenden Clubs in einem der fesselndsten Titelkämpfe der Geschichte des Landes."
      },
      "es": {
        "title": "¿Qué pasa ahora en la 'épica' carrera del título escocés después del empate Old Firm?",
        "summary": "BBC Escocia analiza el estado de la carrera por el título escocés tras un empate Old Firm en Ibrox, examinando las implicaciones para los cuatro clubes en competencia en una de las luchas por el título más cautivadoras de la historia del país."
      }
    }
  },
  {
    "title": "Iran, the US, and a World Cup that starts in three months",
    "slug": "iran-us-world-cup-tensions",
    "url": "https://www.bbc.com/sport/football/articles/c20j8jnezl8o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T17:44:25.000Z",
    "summary": "The article examines how the U.S.-Iran geopolitical tensions impact the World Cup beginning in three months, adding another layer of controversy to what was already expected to be a highly politicized tournament.",
    "content": "What does the US conflict with Iran mean for what was already set to be a highly politicised World Cup this summer?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "伊朗、美国与三个月后开始的世界杯",
        "summary": "该文章探讨美国-伊朗地缘政治紧张局势如何影响三个月后开始的世界杯，为原本预期就会被高度政治化的赛事增添了另一层争议。"
      },
      "fr": {
        "title": "L'Iran, les États-Unis et une Coupe du monde qui commence dans trois mois",
        "summary": "L'article examine comment les tensions géopolitiques entre les États-Unis et l'Iran impactent la Coupe du monde commençant dans trois mois, ajoutant une autre couche de controverse à ce qui était déjà un tournoi hautement politisé."
      },
      "de": {
        "title": "Der Iran, die USA und eine Weltmeisterschaft, die in drei Monaten beginnt",
        "summary": "Der Artikel untersucht, wie die geopolitischen Spannungen zwischen den USA und dem Iran die in drei Monaten beginnende Weltmeisterschaft beeinflussen und eine weitere Ebene der Kontroverse zu einem ohnehin hochgradig politisierten Turnier hinzufügen."
      },
      "es": {
        "title": "Irán, Estados Unidos y un Mundial que comienza en tres meses",
        "summary": "El artículo examina cómo las tensiones geopolíticas entre Estados Unidos e Irán impactan la Copa del Mundo que comienza en tres meses, añadiendo otra capa de controversia a lo que ya se esperaba fuera un torneo altamente politizado."
      }
    }
  },
  {
    "title": "Belief key to turning around poor form - Hurzeler",
    "slug": "hurzeler-belief-brighton-form",
    "url": "https://www.bbc.com/sport/football/videos/cg5n15pp17yo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Premier League",
    "date": "2026-03-01T17:27:20.000Z",
    "summary": "Brighton manager Fabian Hurzeler credits his team's unwavering belief and commitment to their playing style as they secure back-to-back league wins following three consecutive defeats.",
    "content": "Fabian Hurzeler says his side never strayed for their belief in their quality and style of football, as Brighton beat Nottingham Forest for back-to-back league wins after losing three in a row.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "信念是扭转糟糕状态的关键 - 胡尔泽勒",
        "summary": "布莱顿主教练法比安·胡尔泽勒将球队在连续三场失利后取得背靠背联赛胜利的成功归功于球队坚定的信念和对其比赛风格的承诺。"
      },
      "fr": {
        "title": "La croyance est la clé pour redresser la mauvaise forme - Hurzeler",
        "summary": "L'entraîneur de Brighton, Fabian Hurzeler, attribue les succès consécutifs de son équipe en ligue à leur croyance inébranlable et à leur engagement envers leur style de jeu, après trois défaites consécutives."
      },
      "de": {
        "title": "Glaube ist der Schlüssel zur Überwindung der schlechten Form - Hurzeler",
        "summary": "Brightons Trainer Fabian Hurzeler schreibt die aufeinanderfolgenden Ligasiege seines Teams nach drei aufeinanderfolgenden Niederlagen dem unerschütterlichen Glauben und dem Engagement seines Teams für ihren Spielstil zu."
      },
      "es": {
        "title": "La fe es clave para cambiar la mala forma - Hurzeler",
        "summary": "El entrenador de Brighton, Fabian Hurzeler, atribuye los triunfos consecutivos de su equipo en la liga a la fe inquebrantable del equipo y su compromiso con su estilo de juego después de tres derrotas consecutivas."
      }
    }
  },
  {
    "title": "Forest must focus on one game at a time - Pereira",
    "slug": "pereira-forest-focus-present",
    "url": "https://www.bbc.com/sport/football/videos/c4g5wgjp9x8o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T17:13:58.000Z",
    "summary": "Nottingham Forest manager Vitor Pereira emphasizes the importance of focusing on immediate challenges rather than looking ahead, as the team fights to avoid relegation.",
    "content": "Nottingham Forest manager Vitor Pereira wants his side to \"focus on the present,\" and take one game at a time in their relegation fight.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "森林队必须专注于一场比赛 - 佩雷拉",
        "summary": "诺丁汉森林主教练维托·佩雷拉强调专注于眼前挑战而不是展望未来的重要性，因为球队正在努力避免降级。"
      },
      "fr": {
        "title": "Forest doit se concentrer sur un match à la fois - Pereira",
        "summary": "L'entraîneur de Nottingham Forest, Vitor Pereira, souligne l'importance de se concentrer sur les défis immédiats plutôt que de regarder vers l'avant, alors que l'équipe se bat pour éviter la relégation."
      },
      "de": {
        "title": "Forest muss sich auf ein Spiel nach dem anderen konzentrieren - Pereira",
        "summary": "Nottingham-Trainers Vitor Pereira betont die Bedeutung, sich auf unmittelbare Herausforderungen zu konzentrieren, statt in die Zukunft zu schauen, während das Team um die Vermeidung des Abstiegs kämpft."
      },
      "es": {
        "title": "Forest debe enfocarse en un partido a la vez - Pereira",
        "summary": "El entrenador de Nottingham Forest, Vitor Pereira, enfatiza la importancia de enfocarse en los desafíos inmediatos en lugar de mirar hacia adelante, mientras el equipo lucha por evitar el descenso."
      }
    }
  },
  {
    "title": "I don't like 'home team referee' Bramall - Tudor",
    "slug": "tudor-criticizes-bramall-tottenham",
    "url": "https://www.bbc.com/sport/football/videos/c78x1887nd9o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T17:11:38.000Z",
    "summary": "Tottenham manager Igor Tudor questions referee Thomas Bramall's decision-making after allowing Fulham's opening goal, calling for greater consistency in fouls and pushing decisions.",
    "content": "Tottenham Hotspur manager Igor Tudor call into doubt the decision-making of referee Thomas Bramall, after the official allowed Fulham's opening goal to stand, and demands greater consistency on fouls given for pushing.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "我不喜欢\"主队裁判\"布拉马尔 - 图多尔",
        "summary": "热刺主帅伊戈尔·图多尔对裁判托马斯·布拉马尔允许富勒姆先进球后的判罚能力表示质疑，呼吁在犯规和推人判罚上保持一致性。"
      },
      "fr": {
        "title": "Je n'aime pas l'arbitre de l'équipe à domicile - Bramall - Tudor",
        "summary": "Le manager de Tottenham, Igor Tudor, remet en question les décisions de l'arbitre Thomas Bramall après avoir autorisé le but d'ouverture de Fulham, appelant à une plus grande cohérence dans les décisions de fautes et de poussées."
      },
      "de": {
        "title": "Ich mag den \"Heimteam-Schiedsrichter\" Bramall nicht - Tudor",
        "summary": "Tottenham-Manager Igor Tudor stellt die Schiedsrichtungsfähigkeiten von Thomas Bramall in Frage, nachdem er Fulhams Führungstor zugelassen hat, und fordert mehr Konsistenz bei Regelentscheidungen und Fouls."
      },
      "es": {
        "title": "No me gusta el árbitro del equipo local Bramall - Tudor",
        "summary": "El manager del Tottenham, Igor Tudor, cuestiona las decisiones del árbitro Thomas Bramall después de permitir el gol de apertura del Fulham, pidiendo mayor consistencia en las decisiones de faltas e impulsiones."
      }
    }
  },
  {
    "title": "Starting Sesko is not a gamble - Carrick",
    "slug": "carrick-sesko-manchester-united",
    "url": "https://www.bbc.com/sport/football/videos/c4g04dvlv5xo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T17:08:23.000Z",
    "summary": "Manchester United manager Michael Carrick defends his decision to start striker Benjamin Sesko in the team's XI, citing the Slovenian's impressive recent form with six goals in eight games.",
    "content": "Manchester United manager Michael Carrick says it is \"not a gamble\" to change his preferred XI to start striker Benjamin Sesko, after the Slovenian scored the winner against Crystal Palace for his sixth goal in eight games.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "首发塞斯科不是赌博 - 卡里克",
        "summary": "曼联主帅迈克尔·卡里克为首发锋线球员本杰明·塞斯科的决定进行了辩护，理由是这位斯洛文尼亚前锋最近状态出色，在八场比赛中打入六球。"
      },
      "fr": {
        "title": "Titulariser Sesko n'est pas un gamble - Carrick",
        "summary": "Le manager de Manchester United, Michael Carrick, défend sa décision d'aligner l'attaquant Benjamin Sesko dans le onze de départ, citant la forme exceptionnelle récente du Slovène avec six buts en huit matches."
      },
      "de": {
        "title": "Sesko von Anfang an einzusetzen ist kein Risiko - Carrick",
        "summary": "Manchester Uniteds Manager Michael Carrick verteidigt seine Entscheidung, den Stürmer Benjamin Sesko in der Startelf einzusetzen, und verweist auf die beeindruckende aktuelle Form des Slowenen mit sechs Toren in acht Spielen."
      },
      "es": {
        "title": "Alinear a Sesko de entrada no es un riesgo - Carrick",
        "summary": "El manager del Manchester United, Michael Carrick, defiende su decisión de alinear al delantero Benjamin Sesko en el once inicial, citando la impresionante forma reciente del esloveno con seis goles en ocho partidos."
      }
    }
  },
  {
    "title": "'Foul starts outside the box' - Glasner disputes Man Utd penalty",
    "slug": "glasner-disputes-penalty-man-utd",
    "url": "https://www.bbc.com/sport/football/videos/cp324ld3zr2o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T16:52:00.000Z",
    "summary": "Crystal Palace manager Oliver Glasner disputes the penalty awarded against his team, arguing that Maxence Lacroix's foul originated outside the penalty area and should not have been awarded.",
    "content": "Crystal Palace manager Oliver Glasner says he does not believe the penalty awarded to Manchester United for a foul by Maxence Lacroix, who was shown a red card, should have been awarded.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"犯规始于禁区外\" - 格拉斯纳争议曼联点球",
        "summary": "水晶宫主帅奥利弗·格拉斯纳对判罚给曼联的点球提出异议，辩称马克桑斯·拉克鲁瓦的犯规发生在禁区外，不应该被判罚。"
      },
      "fr": {
        "title": "\"La faute commence en dehors de la surface\" - Glasner conteste le penalty accordé à Man Utd",
        "summary": "Le manager de Crystal Palace, Oliver Glasner, conteste le penalty accordé contre son équipe, arguant que la faute de Maxence Lacroix a commencé en dehors de la surface de réparation et ne devrait pas être accordée."
      },
      "de": {
        "title": "\"Das Foul beginnt außerhalb des Strafraums\" - Glasner bestreitet den Elfmeter für Man Utd",
        "summary": "Crystal Palaces Manager Oliver Glasner bestreitet den Elfmeter, der gegen sein Team vergeben wurde, und argumentiert, dass Maxence Lacroixs Foul außerhalb des Strafraums begann und nicht hätte vergeben werden dürfen."
      },
      "es": {
        "title": "\"La falta comienza fuera del área\" - Glasner cuestiona el penalti a Man Utd",
        "summary": "El manager del Crystal Palace, Oliver Glasner, cuestiona el penalti concedido en contra de su equipo, argumentando que la falta de Maxence Lacroix se originó fuera del área de penalti y no debería haber sido concedida."
      }
    }
  },
  {
    "title": "Silva praises 'fantastic' Iwobi in different role",
    "slug": "silva-praises-iwobi-fulham",
    "url": "https://www.bbc.com/sport/football/videos/cx2gp2qe9rro?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T16:46:51.000Z",
    "summary": "Fulham manager Marco Silva praises midfielder Alex Iwobi's performance in a deeper midfield role, where he scored a superb goal in their 2-1 victory against Tottenham Hotspur.",
    "content": "Fulham manager Marco Silva is full of praise for midfielder Alex Iwobi, who scored a superb goal while playing a deeper role in their 2-1 win against Tottenham Hotsur.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "席尔瓦称赞伊沃比在新位置的表现\"非常出色\"",
        "summary": "富勒姆主教练马尔科·席尔瓦称赞中场球员亚历克斯·伊沃比在更靠后的中场位置上的表现，他在球队2-1击败热刺的比赛中打进了一粒精彩的进球。"
      },
      "fr": {
        "title": "Silva fait l'éloge d'Iwobi 'fantastique' dans un rôle différent",
        "summary": "Le manager de Fulham Marco Silva fait l'éloge de la performance du milieu de terrain Alex Iwobi dans un rôle de milieu de terrain plus profond, où il a marqué un but superbe dans leur victoire 2-1 contre Tottenham Hotspur."
      },
      "de": {
        "title": "Silva lobt Iwobi in neuer Rolle als \"fantastisch\"",
        "summary": "Fulhams Manager Marco Silva lobt die Leistung von Mittelfeldspieler Alex Iwobi in einer tieferen Mittelfeld-Position, in der er ein überragendes Tor in ihrem 2-1-Sieg gegen Tottenham Hotspur erzielte."
      },
      "es": {
        "title": "Silva elogia a Iwobi como 'fantástico' en un rol diferente",
        "summary": "El manager del Fulham Marco Silva elogia el desempeño del centrocampista Alex Iwobi en un rol de mediocampo más profundo, donde anotó un gol espléndido en su victoria 2-1 contra el Tottenham Hotspur."
      }
    }
  },
  {
    "title": "'Hearts & Motherwell the winners after damaging Old Firm stalemate'",
    "slug": "hearts-motherwell-old-firm-draw",
    "url": "https://www.bbc.com/sport/football/articles/cgqgzgqweklo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T16:38:19.000Z",
    "summary": "BBC Scotland's chief sportswriter Tom English analyzes how the Old Firm draw at Ibrox benefits competing clubs Hearts and Motherwell in Scotland's ongoing title race.",
    "content": "BBC Scotland's chief sportswriter Tom English evaluates the impact of Sunday's draw at Ibrox.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"Hearts & Motherwell赢家在破坏性的老牌同城德比平局后\"",
        "summary": "BBC苏格兰首席体育评论员汤姆·英格利什分析了在埃布罗克斯球场进行的老牌同城德比平局如何有利于苏格兰争夺联赛冠军的竞争对手Hearts和Motherwell。"
      },
      "fr": {
        "title": "\"Hearts & Motherwell les gagnants après un match nul dommageable du Old Firm\"",
        "summary": "Le chef des rédacteurs sportifs de la BBC Écosse, Tom English, analyse comment le match nul du Old Firm à Ibrox profite aux clubs concurrents Hearts et Motherwell dans la course au titre en cours en Écosse."
      },
      "de": {
        "title": "\"Hearts & Motherwell die Gewinner nach schädlichem Old-Firm-Unentschieden\"",
        "summary": "BBC Schottlands Chief Sportschreiber Tom English analysiert, wie das Unentschieden des Old Firm in Ibrox den konkurrierenden Clubs Hearts und Motherwell in Schottlands laufendem Titelkampf zugute kommt."
      },
      "es": {
        "title": "\"Hearts & Motherwell los ganadores después del empate perjudicial del Old Firm\"",
        "summary": "El principal redactor de deportes de BBC Escocia, Tom English, analiza cómo el empate del Old Firm en Ibrox beneficia a los clubes rivales Hearts y Motherwell en la carrera por el título en curso de Escocia."
      }
    }
  },
  {
    "title": "Amorim assistant: United ideas 'not implemented'",
    "slug": "amorim-assistant-ideas-united",
    "url": "https://www.espn.com/soccer/story/_/id/48072166/ruben-amorim-assistant-man-united-ideas-not-implemented",
    "source": "ESPN Soccer",
    "date": "2026-03-01T16:07:38.000Z",
    "summary": "An assistant to Ruben Amorim suggests the former Manchester United manager required more time to implement his tactical ideas and vision for the club.",
    "content": "Ruben Amorim needed more time at Manchester United to \"implement his ideas,\" according to one of his assistants at Old Trafford.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "阿莫里姆助手：曼联的想法\"未得到执行\"",
        "summary": "鲁本·阿莫里姆的一名助手表示，这位前曼联主教练需要更多时间来实施他对俱乐部的战术理念和愿景。"
      },
      "fr": {
        "title": "Assistant d'Amorim : les idées d'United 'non implémentées'",
        "summary": "Un assistant de Ruben Amorim suggère que l'ancien manager de Manchester United aurait eu besoin de plus de temps pour mettre en œuvre ses idées tactiques et sa vision pour le club."
      },
      "de": {
        "title": "Amorims Assistent: Uniteds Ideen 'nicht umgesetzt'",
        "summary": "Ein Assistent von Ruben Amorim deutet darauf hin, dass der ehemalige Manchester-United-Manager mehr Zeit benötigte, um seine taktischen Ideen und Vision für den Verein umzusetzen."
      },
      "es": {
        "title": "Asistente de Amorim: las ideas de United 'no implementadas'",
        "summary": "Un asistente de Ruben Amorim sugiere que el exmanager del Manchester United requería más tiempo para implementar sus ideas tácticas y visión para el club."
      }
    }
  },
  {
    "title": "Sesko nets another winner in Man United comeback",
    "slug": "sesko-winner-man-united-palace",
    "url": "https://www.espn.com/soccer/report/_/gameId/740875",
    "source": "ESPN Soccer",
    "date": "2026-03-01T16:07:37.000Z",
    "summary": "Benjamin Sesko scored the winning goal as Manchester United mounted a comeback victory over Crystal Palace on Sunday, securing their latest important three points.",
    "content": "Manchester United came from a goal down to claim another morale-boosting victory over Crystal Palace on Sunday.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "塞斯科再进一球，曼联上演逆转胜",
        "summary": "本杰明·塞斯科打入制胜球，曼联在周日对阵水晶宫的比赛中完成逆转胜利，获得了最新的三分。"
      },
      "fr": {
        "title": "Sesko marque un nouveau but dans la remontada de Man United",
        "summary": "Benjamin Sesko a marqué le but décisif alors que Manchester United a réalisé une victoire de remontada contre Crystal Palace dimanche, assurant ses trois points importants."
      },
      "de": {
        "title": "Sesko erzielt erneut Siegtor bei Man Uniteds Comeback",
        "summary": "Benjamin Sesko schoss das Siegtor, als Manchester United am Sonntag einen Comeback-Sieg gegen Crystal Palace erkämpfte und sich wichtige drei Punkte sicherte."
      },
      "es": {
        "title": "Sesko marca otro gol ganador en la remontada del Manchester United",
        "summary": "Benjamin Sesko marcó el gol ganador cuando el Manchester United realizó una remontada victoriosa contra el Crystal Palace el domingo, asegurando sus tres puntos importantes."
      }
    }
  },
  {
    "title": "Pulisic's Milan score late double, 10 pts off Inter",
    "slug": "pulisic-milan-late-goals-cremonese",
    "url": "https://www.espn.com/soccer/report/_/gameId/737051",
    "source": "ESPN Soccer",
    "date": "2026-03-01T16:07:37.000Z",
    "summary": "AC Milan scored two late goals to secure a 2-0 victory at Cremonese and bounce back from their second loss of the season, sitting 10 points behind league leaders Inter Milan.",
    "content": "AC Milan needed two late goals to secure a 2-0 win at Cremonese in Serie A on Sunday and bounce back from its second loss of the season.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "普利西奇领导米兰后期进两球，领先国际米兰10分",
        "summary": "AC米兰在对克雷莫内塞的比赛中打进两个后期进球，以2:0获胜，从本赛季第二场失利中反弹，落后领头羊国际米兰10分。"
      },
      "fr": {
        "title": "Le Milan de Pulisic marque deux buts en fin de match, à 10 points de l'Inter",
        "summary": "L'AC Milan a marqué deux buts en fin de match pour obtenir une victoire 2-0 à Cremonese et se rétablir après leur deuxième défaite de la saison, se classant 10 points derrière les leaders de la Ligue Inter Milan."
      },
      "de": {
        "title": "Milans späte Doppeltreffer von Pulisic, 10 Punkte hinter Inter",
        "summary": "Der AC Mailand erzielte zwei späte Tore, um einen 2:0-Sieg gegen Cremonese zu sichern, und erholte sich von ihrer zweiten Niederlage der Saison, mit 10 Punkten Rückstand auf Tabellenführer Inter Mailand."
      },
      "es": {
        "title": "El Milan de Pulisic anota un doble al final, 10 puntos por debajo del Inter",
        "summary": "El AC Milan anotó dos goles en el final para asegurar una victoria 2-0 en Cremonese y rebotar de su segunda derrota de la temporada, quedando 10 puntos por debajo del líder de la liga Inter Milan."
      }
    }
  },
  {
    "title": "Qatar postpones all games; no news on Finalissima",
    "slug": "qatar-postpones-games-iran-tensions",
    "url": "https://www.espn.com/soccer/story/_/id/48072368/qatar-postpones-all-football-games-amid-argentina-vs-spain-uncertainty",
    "source": "ESPN Soccer",
    "date": "2026-03-01T16:07:37.000Z",
    "summary": "Qatar's football federation postponed all tournaments and matches indefinitely following geopolitical tensions resulting from U.S.-Israel military strikes on Iran, with no update on the Finalissima.",
    "content": "The Qatar football federation postponed all tournaments and matches until further notice on Sunday amid global tensions following the U.S.-Israel strikes on Iran.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "卡塔尔推迟所有比赛；关于菲纳利西玛杯无新闻",
        "summary": "卡塔尔足球联合会因美国-以色列对伊朗的军事打击引发的地缘政治紧张局势，无限期推迟了所有赛事和比赛，没有关于菲纳利西玛杯的更新。"
      },
      "fr": {
        "title": "Le Qatar reporte tous les matches; aucune nouvelle sur la Finalissima",
        "summary": "La fédération de football du Qatar a reporté tous les tournois et matchs indéfiniment suite aux tensions géopolitiques résultant des frappes militaires américano-israéliennes contre l'Iran, sans mise à jour sur la Finalissima."
      },
      "de": {
        "title": "Katar verschiebt alle Spiele; keine Neuigkeiten zur Finalissima",
        "summary": "Der katarische Fußballverband verschob alle Turniere und Spiele auf unbestimmte Zeit aufgrund geopolitischer Spannungen, die sich aus US-israelischen Luftangriffen auf den Iran ergaben, ohne Update zur Finalissima."
      },
      "es": {
        "title": "Qatar pospone todos los partidos; sin noticias sobre la Finalissima",
        "summary": "La federación de fútbol de Qatar pospuso indefinidamente todos los torneos y partidos tras las tensiones geopolíticas resultantes de los ataques militares estadounidenses-israelíes a Irán, sin actualización sobre la Finalissima."
      }
    }
  },
  {
    "title": "Transfer rumors, news: MLS an option as Salah 'increasingly likely' to leave Liverpool",
    "slug": "salah-mls-option-leave-liverpool",
    "url": "https://www.espn.com/soccer/story/_/id/48070919/transfer-rumors-news-mls-summer-transfer-options-liverpool-salah",
    "source": "ESPN Soccer",
    "date": "2026-03-01T11:10:36.000Z",
    "summary": "Mohamed Salah may leave Liverpool this summer with the MLS and Saudi Pro League as potential destinations. This represents a significant transfer possibility for the English club.",
    "content": "MLS and the Saudi Pro League are both \"possible options\" for Liverpool's Mohamed Salah this summer. Transfer Talk has the latest.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "转会传言、新闻：美国职业大联盟可能选择，萨拉赫\"越来越可能\"离开利物浦",
        "summary": "穆罕默德·萨拉赫可能在今年夏天离开利物浦，美国职业大联盟和沙特职业联赛是潜在目的地。这代表了英超球队的一个重大转会可能性。"
      },
      "fr": {
        "title": "Rumeurs de transfert, actualités : la MLS est une option car Salah est \"de plus en plus susceptible\" de quitter Liverpool",
        "summary": "Mohamed Salah pourrait quitter Liverpool cet été, la MLS et la Pro League saoudienne étant des destinations potentielles. Cela représente une possibilité de transfert importante pour le club anglais."
      },
      "de": {
        "title": "Transfergerüchte, Nachrichten: MLS ist eine Option, da Salah \"immer wahrscheinlicher\" Liverpool verlässt",
        "summary": "Mohamed Salah könnte den FC Liverpool in diesem Sommer verlassen, wobei die MLS und die saudi-arabische Pro League potenzielle Ziele sind. Dies stellt eine bedeutende Transfermöglichkeit für den englischen Club dar."
      },
      "es": {
        "title": "Rumores de transferencia, noticias: MLS es una opción ya que Salah es \"cada vez más probable\" que abandone Liverpool",
        "summary": "Mohamed Salah podría dejar Liverpool este verano con la MLS y la Liga Pro de Arabia Saudita como posibles destinos. Esto representa una importante posibilidad de transferencia para el club inglés."
      }
    }
  },
  {
    "title": "Old Firm build-up dominates Sunday's gossip",
    "slug": "old-firm-buildup-dominates-sunday-gossip",
    "url": "https://www.bbc.com/sport/football/articles/cp324q7675eo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T08:52:19.000Z",
    "summary": "The Old Firm derby dominates Scottish football transfer gossip ahead of Sunday's match.",
    "content": "Old Firm build-up dominates Sunday's Scottish football gossip.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "老字号对阵成为星期天八卦的焦点",
        "summary": "老字号德比在星期天比赛前主导了苏格兰足球转会八卦。"
      },
      "fr": {
        "title": "L'Old Firm build-up domine les commérages du dimanche",
        "summary": "Le derby de l'Old Firm domine les commérages des transferts du football écossais avant le match de dimanche."
      },
      "de": {
        "title": "Old Firm Build-up dominiert die Sonntagsklatsch",
        "summary": "Das Old-Firm-Derby dominiert vor dem Spiel am Sonntag die schottischen Fußball-Transfergerüchte."
      },
      "es": {
        "title": "El enfrentamiento del Old Firm domina los cotilleos del domingo",
        "summary": "El derbi del Old Firm domina los cotilleos de transferencias del fútbol escocés antes del partido del domingo."
      }
    }
  },
  {
    "title": "How do Lionesses solve full-back succession problem?",
    "slug": "lionesses-full-back-succession-problem",
    "url": "https://www.bbc.com/sport/football/articles/c0rjg4gqdkjo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T08:52:18.000Z",
    "summary": "The England women's team faces a full-back succession challenge ahead of the 2027 Women's World Cup. The article explores potential solutions to this defensive positional issue.",
    "content": "Will the Lionesses find a solution for their full-back problem in time for the 2027 Women's World Cup?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "英国女性队如何解决后卫接班问题？",
        "summary": "英国女足队在2027年女足世界杯前面临后卫接班挑战。该文章探讨了这个防线位置问题的潜在解决方案。"
      },
      "fr": {
        "title": "Comment les Lionesses résolvent-elles le problème de succession des arrières ?",
        "summary": "L'équipe féminine d'Angleterre fait face à un défi de succession aux arrières avant la Coupe du monde féminine 2027. L'article explore les solutions potentielles à ce problème de position défensive."
      },
      "de": {
        "title": "Wie lösen die Lionesses das Problem der Außenverteidiger-Nachfolge?",
        "summary": "Das englische Frauenfußballteam steht vor einer Herausforderung bei der Nachfolge der Außenverteidiger vor der Frauen-Weltmeisterschaft 2027. Der Artikel untersucht mögliche Lösungen für dieses defensive Positionsproblem."
      },
      "es": {
        "title": "¿Cómo resuelven las Lionesses el problema de sucesión de laterales?",
        "summary": "El equipo femenino de Inglaterra enfrenta un desafío de sucesión de laterales antes de la Copa Mundial Femenina 2027. El artículo explora posibles soluciones a este problema de posición defensiva."
      }
    }
  },
  {
    "title": "Fishlock ambassadorial role 'important for visibility'",
    "slug": "fishlock-ambassadorial-role-visibility",
    "url": "https://www.bbc.com/sport/football/articles/c6200gylppzo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T07:31:17.000Z",
    "summary": "Jess Fishlock, Wales' greatest female footballer, has taken on an ambassadorial role for the 2027 EuroGames in Cardiff. She emphasized the importance of this position for LGBTQ+ visibility during the current political climate.",
    "content": "Jess Fishlock, generally regarded as Wales' greatest ever female footballer, says she felt compelled to become an ambassador for the 2027 EuroGames in Cardiff due to the \"political climate right now\" for LGBTQ+ people.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "菲什洛克大使角色'对能见度很重要'",
        "summary": "杰丝·菲什洛克是威尔士最伟大的女性足球运动员，已担任2027年卡迪夫欧游会的大使。她强调在当前政治气候下，这个职位对LGBTQ+能见度的重要性。"
      },
      "fr": {
        "title": "Le rôle ambassadorial de Fishlock 'important pour la visibilité'",
        "summary": "Jess Fishlock, la plus grande joueuse de football féminin du Pays de Galles, a accepté un rôle d'ambassadrice pour les EuroGames 2027 à Cardiff. Elle a souligné l'importance de cette position pour la visibilité des LGBTQ+ dans le climat politique actuel."
      },
      "de": {
        "title": "Fischlocks Botschafterrolle 'wichtig für die Sichtbarkeit'",
        "summary": "Jess Fishlock, Walisens größte weibliche Fußballerin, hat eine Botschafterrolle für die EuroGames 2027 in Cardiff übernommen. Sie betonte die Bedeutung dieser Position für die Sichtbarkeit von LGBTQ+ im aktuellen politischen Klima."
      },
      "es": {
        "title": "El papel de embajadora de Fishlock 'importante para la visibilidad'",
        "summary": "Jess Fishlock, la mejor futbolista femenina de Gales, ha asumido un papel de embajadora para los EuroGames 2027 en Cardiff. Enfatizó la importancia de esta posición para la visibilidad de LGBTQ+ durante el clima político actual."
      }
    }
  },
  {
    "title": "'Rules are there to be broken': The women's team who defied football ban",
    "slug": "women-team-defied-football-ban-corinthians",
    "url": "https://www.bbc.com/news/articles/c9wndrz1j9qo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T07:01:06.000Z",
    "summary": "The Corinthians, a Manchester-formed women's football team, defied a football ban to play the sport they loved. The team demonstrated determination in pursuing their passion for the game.",
    "content": "The Manchester-formed team, known as The Corinthians, were determined to play the game they loved.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "'规则是用来打破的'：挑战足球禁令的女队",
        "summary": "科林蒂安队是一支在曼彻斯特成立的女子足球队，他们违反足球禁令去进行自己热爱的运动。这个团队在追求对足球的热情中展现了决心。"
      },
      "fr": {
        "title": "'Les règles sont faites pour être brisées' : L'équipe féminine qui a défié l'interdiction du football",
        "summary": "Les Corinthians, une équipe de football féminin formée à Manchester, ont défié une interdiction du football pour jouer le sport qu'elles aimaient. L'équipe a démontré de la détermination dans la poursuite de leur passion pour le jeu."
      },
      "de": {
        "title": "'Regeln sind dazu da, um gebrochen zu werden': Das Frauenteam, das das Fußballverbot trotzte",
        "summary": "Die Corinthians, ein in Manchester gegründetes Frauenfußballteam, trotzten einem Fußballverbot, um den Sport zu spielen, den sie liebten. Das Team zeigte Entschlossenheit bei der Verfolgung ihrer Leidenschaft für das Spiel."
      },
      "es": {
        "title": "'Las reglas están hechas para romperse': El equipo femenino que desafió la prohibición del fútbol",
        "summary": "Las Corinthians, un equipo de fútbol femenino formado en Manchester, desafiaron una prohibición del fútbol para jugar el deporte que amaban. El equipo demostró determinación en la persecución de su pasión por el juego."
      }
    }
  },
  {
    "title": "Arsenal set to celebrate St Totteringham's Day earlier than ever",
    "slug": "arsenal-st-totteringham-day-earlier-ever",
    "url": "https://www.bbc.com/sport/football/articles/cwygre5geq2o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T06:27:32.000Z",
    "summary": "St Totteringham's Day—when it becomes mathematically impossible for Spurs to finish above Arsenal in the Premier League—is set to arrive earlier than ever. This indicates Arsenal's strong position in the league standings.",
    "content": "The day it becomes impossible for Spurs to finish above Arsenal in the Premier League, St Totteringham's Day is set to arrive earlier than ever.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "阿森纳有望比以往更早庆祝圣托特汉姆日",
        "summary": "圣托特汉姆日——当托特纳姆热刺队在英超联赛中不可能超过阿森纳时——将比以往更早到来。这表明阿森纳在联赛中处于强势地位。"
      },
      "fr": {
        "title": "Arsenal s'apprête à célébrer la Journée de Saint Totteringham plus tôt que jamais",
        "summary": "La Journée de Saint Totteringham — lorsqu'il devient mathématiquement impossible que Spurs termine au-dessus d'Arsenal en Premier League — est sur le point d'arriver plus tôt que jamais. Cela indique la position forte d'Arsenal dans le classement de la ligue."
      },
      "de": {
        "title": "Arsenal wird St. Totteringhams Tag früher als je zuvor feiern",
        "summary": "St. Totteringhams Tag — wenn es mathematisch unmöglich wird, dass Spurs Arsenal in der Premier League überholt — soll früher als je zuvor eintreten. Dies deutet auf Arsenals starke Position in der Ligatabelle hin."
      },
      "es": {
        "title": "Arsenal celebrará el Día de San Totteringham más temprano que nunca",
        "summary": "El Día de San Totteringham — cuando se vuelve matemáticamente imposible que Spurs termine por encima de Arsenal en la Premier League — está listo para llegar más temprano que nunca. Esto indica la fuerte posición de Arsenal en la clasificación de la liga."
      }
    }
  },
  {
    "title": "USMNT starlet Banks considering Germany switch",
    "slug": "usmnt-starlet-banks-considering-germany-switch",
    "url": "https://www.espn.com/soccer/story/_/id/48066548/usmnt-noahkai-banks-germany-switch-augsburg",
    "source": "ESPN Soccer",
    "date": "2026-03-01T05:33:17.000Z",
    "summary": "U.S. youth national team starlet Noahkai Banks is weighing his international future between the U.S. and Germany, with a potential spot on this summer's senior World Cup squad at stake. This decision could impact USMNT's squad composition for a major tournament.",
    "content": "U.S. youth national team starlet Noahkai Banks, a potential pick for this summer's senior World Cup squad, has said he is still considering whether his international future lies with the U.S. or Germany.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "USMNT新星班克斯考虑转向德国",
        "summary": "美国青年国家队新星诺亚凯·班克斯在美国和德国之间权衡自己的国际足球生涯，争取在今年夏天的成年世界杯球队中获得一席之地。这个决定可能会影响USMNT在重大赛事中的阵容组成。"
      },
      "fr": {
        "title": "La jeune star de l'USMNT Banks envisage un changement vers l'Allemagne",
        "summary": "La jeune star de l'équipe nationale des jeunes américains Noahkai Banks pèse son avenir international entre les États-Unis et l'Allemagne, avec un spot potentiel sur l'équipe de la Coupe du monde senior de cet été en jeu. Cette décision pourrait avoir un impact sur la composition de l'équipe de l'USMNT pour un tournoi majeur."
      },
      "de": {
        "title": "USMNT-Talent Banks erwägt Wechsel nach Deutschland",
        "summary": "Das US-amerikanische Nachwuchsnational-Talent Noahkai Banks wägt seine internationale Zukunft zwischen den USA und Deutschland ab, mit einem möglichen Platz in der Senior-Weltcup-Mannschaft diesen Sommer auf dem Spiel. Diese Entscheidung könnte die Zusammensetzung des USMNT-Kaders für ein großes Turnier beeinflussen."
      },
      "es": {
        "title": "La joven estrella de USMNT Banks considerando un cambio a Alemania",
        "summary": "La joven estrella del equipo nacional juvenil estadounidense Noahkai Banks está sopesando su futuro internacional entre Estados Unidos y Alemania, con un posible lugar en el equipo senior de la Copa del Mundo de este verano en juego. Esta decisión podría impactar la composición del equipo de USMNT para un torneo importante."
      }
    }
  },
  {
    "title": "Iran women's NT: 'Let's just focus' on Asian Cup",
    "slug": "iran-womens-nt-focus-asian-cup",
    "url": "https://www.espn.com/soccer/story/_/id/48069381/iran-women-national-team-let-just-focus-asian-cup",
    "source": "ESPN Soccer",
    "date": "2026-03-01T05:33:17.000Z",
    "summary": "The Iran women's national football team coach and captain emphasized their focus on preparation for the Women's Asian Cup in Australia, deflecting questions about broader political issues. The team reported they have enjoyed good preparation ahead of the tournament.",
    "content": "A question regarding the killing of Ayatollah Ali Khamenei has been shut down as the Iran women's national football team coach and captain said they had enjoyed a \"good preparation\" for the Women's Asian Cup in Australia.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "伊朗女足：专注亚洲杯",
        "summary": "伊朗女足国家队主教练和队长强调专注于澳大利亚女性亚洲杯的准备工作，回避了关于更广泛政治问题的问题。该队报告称他们在比赛前做好了充分准备。"
      },
      "fr": {
        "title": "Équipe féminine de l'Iran : \"Concentrons-nous\" sur la Coupe d'Asie",
        "summary": "L'entraîneur et le capitaine de l'équipe nationale féminine de football iranienne ont souligné leur concentration sur la préparation de la Coupe d'Asie des femmes en Australie, éludant les questions sur les enjeux politiques plus larges. L'équipe a signalé qu'elle avait eu une bonne préparation avant le tournoi."
      },
      "de": {
        "title": "Irans Frauennationalmannschaft: \"Konzentrieren wir uns\" auf den Asienpokal",
        "summary": "Der Trainer und Kapitän der iranischen Frauenfußball-Nationalmannschaft betonten ihren Fokus auf die Vorbereitung auf den Frauenasienpokal in Australien und wichen Fragen zu breiteren politischen Problemen aus. Das Team berichtete, dass es sich gut auf das Turnier vorbereitet hat."
      },
      "es": {
        "title": "Selección femenina de Irán: \"Enfoquémonos\" en la Copa de Asia",
        "summary": "El entrenador y capitán del equipo nacional femenino de fútbol de Irán enfatizaron su enfoque en la preparación para la Copa de Asia Femenina en Australia, eludiendo preguntas sobre cuestiones políticas más amplias. El equipo informó que ha tenido una buena preparación antes del torneo."
      }
    }
  },
  {
    "title": "'World-class save' - How Pickford & Everton thwarted Newcastle",
    "slug": "pickford-everton-save-newcastle",
    "url": "https://www.bbc.com/sport/football/videos/cx2lgevrr67o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T00:04:22.000Z",
    "summary": "Jordan Pickford made a remarkable injury-time save for Everton against Newcastle, with Match of the Day pundits praising the goalkeeper's crucial performance in preserving the result.",
    "content": "Match of the Day pundits Alan Shearer and Ashley Williams react to Jordan Pickford's \"remarkable\" injury-time save against Newcastle.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"世界级扑救\" - 皮克福德和埃弗顿如何阻止了纽卡斯尔",
        "summary": "乔丹·皮克福德为埃弗顿对阵纽卡斯尔的比赛做出了一次非凡的伤停补时救球，《每日比赛》的专家称赞这位门将在保持比赛结果中的关键表现。"
      },
      "fr": {
        "title": "\"Un arrêt de classe mondiale\" - Comment Pickford et Everton ont arrêté Newcastle",
        "summary": "Jordan Pickford a effectué un arrêt remarquable en fin de match pour Everton contre Newcastle, les experts du Match of the Day félicitant la performance cruciale du gardien pour préserver le résultat."
      },
      "de": {
        "title": "\"Weltklasse-Rettung\" - Wie Pickford und Everton Newcastle stoppten",
        "summary": "Jordan Pickford machte eine bemerkenswerte Rettung in der Nachspielzeit für Everton gegen Newcastle, wobei Match of the Day-Experten die entscheidende Leistung des Torwarts zur Sicherung des Ergebnisses lobten."
      },
      "es": {
        "title": "\"Una atajada de clase mundial\" - Cómo Pickford y Everton frenaron al Newcastle",
        "summary": "Jordan Pickford realizó una atajada extraordinaria en tiempo de descuento para el Everton contra el Newcastle, con los expertos del Match of the Day elogiando la actuación crucial del portero al preservar el resultado."
      }
    }
  }
]