[
  {
    "title": "Madrid vs City again in UCL draw, Chelsea get PSG",
    "slug": "madrid-vs-city-again-in-ucl-draw-chelsea-get-psg",
    "url": "https://www.espn.com/soccer/story/_/id/48052479/champions-league-draw-real-madrid-man-city-round-16-chelsea-get-psg",
    "source": "ESPN Soccer",
    "date": "2026-02-27T11:44:37.000Z",
    "summary": "Real Madrid and Manchester City have been paired for a fifth consecutive season in the Champions League round of 16. Holders Paris Saint-Germain will face Chelsea in another heavyweight matchup. These draws set up compelling knockout-stage encounters between Europe's elite clubs.",
    "content": "Real Madrid have been handed another mouthwatering clash with Manchester City in the round-of-16 draw for the Champions League, while holders Paris Saint-Germain face Chelsea.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "皇马对曼城再续欧冠之缘，切尔西抽签遇巴黎",
        "summary": "皇家马德里和曼彻斯特城连续第五个赛季在欧冠16强中配对。卫冕冠军巴黎圣日耳曼将在另一场顶级对决中面对切尔西。这些抽签为欧洲顶级俱乐部间设置了精彩的淘汰赛阶段对阵。"
      },
      "fr": {
        "title": "Madrid contre City à nouveau au tirage au sort de la Ligue des Champions, Chelsea face le PSG",
        "summary": "Le Real Madrid et Manchester City ont été appairés pour une cinquième saison consécutive en huitième de finale de la Ligue des Champions. Les tenants du titre Paris Saint-Germain affronteront Chelsea dans un autre choc de haut niveau. Ces tirages mettent en place des rencontres de phases éliminatoires captivantes entre les plus grands clubs d'Europe."
      },
      "de": {
        "title": "Madrid gegen City erneut im Champions-League-Losglück, Chelsea trifft PSG",
        "summary": "Real Madrid und Manchester City wurden zum fünften Mal in Folge im Achtelfinale der Champions League gepaart. Die Titelverteidiger Paris Saint-Germain werden Chelsea in einem weiteren Spitzenspiel treffen. Diese Auslosungen führen zu spannenden K.o.-Phasen-Begegnungen zwischen Europas Top-Clubs."
      },
      "es": {
        "title": "Madrid contra City nuevamente en el sorteo de Champions League, Chelsea se enfrenta al PSG",
        "summary": "Real Madrid y Manchester City han sido emparejados por quinto año consecutivo en los dieciséisavos de final de la Champions League. Los campeones defensores París Saint-Germain se enfrentarán a Chelsea en otro enfrentamiento de peso pesado. Estos sorteos establecen emocionantes encuentros de fase de eliminación entre los mejores clubes de Europa."
      }
    }
  },
  {
    "title": "Rohl wants 'hot heart and smart mind' from Rangers",
    "slug": "rohl-wants-hot-heart-and-smart-mind-from-rangers",
    "url": "https://www.bbc.com/sport/football/articles/cgrz4x2lj92o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T11:44:12.000Z",
    "summary": "Rangers manager Danny Rohl has emphasized the need for both emotional intensity and tactical intelligence ahead of Sunday's crucial Scottish Premiership clash against Celtic. The match represents a pivotal moment in the title race.",
    "content": "Danny Rohl has urges Rangers to approach Sunday's \"crucial\" Scottish Premiership meeting with Celtic \"with a hot heart and a smart mind\".",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "罗尔要求兰杰斯\"热情和智慧\"",
        "summary": "流浪者队主教练丹尼·罗尔强调在周日对阵凯尔特人的关键苏超比赛前需要情感强度和战术智慧。这场比赛代表了锦标赛竞争中的关键时刻。"
      },
      "fr": {
        "title": "Rohl veut du \"cœur brûlant et l'esprit intelligent\" de Rangers",
        "summary": "Le manager des Rangers Danny Rohl a souligné le besoin d'intensité émotionnelle et d'intelligence tactique avant le choc crucial du Championnat d'Écosse de dimanche contre le Celtic. Le match représente un moment charnière de la course au titre."
      },
      "de": {
        "title": "Rohl möchte \"heißes Herz und intelligenten Verstand\" von Rangers",
        "summary": "Rangers-Manager Danny Rohl hat die Notwendigkeit von emotionaler Intensität und taktischem Verstand vor dem entscheidenden schottischen Premiership-Spiel gegen Celtic am Sonntag betont. Das Spiel stellt einen entscheidenden Moment im Titelrennen dar."
      },
      "es": {
        "title": "Rohl quiere un \"corazón ardiente e inteligencia táctica\" en Rangers",
        "summary": "El entrenador de Rangers Danny Rohl ha enfatizado la necesidad de intensidad emocional e inteligencia táctica antes del crucial enfrentamiento de la Premier League escocesa contra el Celtic el domingo. El partido representa un momento crucial en la carrera por el título."
      }
    }
  },
  {
    "title": "Chelsea to face holders PSG in Champions League's last 16",
    "slug": "chelsea-to-face-holders-psg-in-champions-leagues-last-16",
    "url": "https://www.bbc.com/sport/football/articles/c70njrx7enwo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T11:34:40.000Z",
    "summary": "Chelsea will face defending champions Paris Saint-Germain in the Champions League round of 16. Manchester City will meet Real Madrid for the fifth consecutive season in the knockout stage.",
    "content": "Chelsea will play holders Paris St-Germain in the Champions League round of 16 while Manchester City will face Real Madrid in the knockout stages for a fifth straight season.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "切尔西在欧冠16强中面对卫冕冠军巴黎",
        "summary": "切尔西将在欧冠16强中面对卫冕冠军巴黎圣日耳曼。曼彻斯特城将连续第五年在淘汰赛阶段对阵皇家马德里。"
      },
      "fr": {
        "title": "Chelsea affrontera les tenants du titre au PSG en huitième de finale de la Ligue des Champions",
        "summary": "Chelsea affrontera le Paris Saint-Germain, tenants du titre, en huitième de finale de la Ligue des Champions. Manchester City rencontrera le Real Madrid pour la cinquième saison consécutive en phase éliminatoire."
      },
      "de": {
        "title": "Chelsea trifft im Champions-League-Achtelfinale auf Titelverteidiger PSG",
        "summary": "Chelsea wird im Achtelfinale der Champions League auf die Titelverteidiger Paris Saint-Germain treffen. Manchester City wird Real Madrid zum fünften Mal in Folge in der K.o.-Phase treffen."
      },
      "es": {
        "title": "Chelsea se enfrenta a los campeones defensores PSG en los dieciséisavos de final de la Champions League",
        "summary": "Chelsea se enfrentará a los campeones defensores París Saint-Germain en los dieciséisavos de final de la Champions League. Manchester City se encontrará con el Real Madrid por quinta temporada consecutiva en la fase de eliminación."
      }
    }
  },
  {
    "title": "Liverpool back in profit, but wages highest in PL",
    "slug": "liverpool-back-in-profit-but-wages-highest-in-pl",
    "url": "https://www.espn.com/soccer/story/_/id/48052260/liverpool-back-profit-wage-bill-was-highest-premier-league",
    "source": "ESPN Soccer",
    "date": "2026-02-27T11:05:18.000Z",
    "summary": "Liverpool posted a pre-tax profit of £15.2 million following their Premier League title-winning season. However, the club reported the highest wage bill in the Premier League, reflecting the financial cost of maintaining a competitive squad.",
    "content": "Liverpool returned to profit after their Premier League-winning season with a pre-tax surplus of £15.2million ($20.5) but had the highest wage bill.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "利物浦重回盈利，但英超工资最高",
        "summary": "利物浦在赢得英超冠军赛季后报告了1520万英镑的税前利润。然而，该俱乐部报告了英超联赛最高的工资账单，反映了保持具竞争力阵容的财务成本。"
      },
      "fr": {
        "title": "Liverpool redevient rentable, mais les salaires les plus élevés de la Premier League",
        "summary": "Liverpool a enregistré un bénéfice avant impôts de 15,2 millions de livres sterling suite à leur saison championne de Premier League. Cependant, le club a rapporté la masse salariale la plus élevée de la Premier League, reflétant le coût financier du maintien d'un effectif compétitif."
      },
      "de": {
        "title": "Liverpool wieder profitabel, aber höchste Löhne in der Premier League",
        "summary": "Liverpool verbuchte einen Gewinn vor Steuern von 15,2 Millionen Pfund nach ihrer Meistersaison der Premier League. Der Klub verzeichnete jedoch die höchste Gehaltssumme in der Premier League, was die Finanzkosten für den Erhalt eines wettbewerbsfähigen Kaders widerspiegelt."
      },
      "es": {
        "title": "Liverpool vuelve a las ganancias, pero con los salarios más altos de la Premier League",
        "summary": "Liverpool registró una ganancia antes de impuestos de £15,2 millones después de su temporada ganadora de la Premier League. Sin embargo, el club reportó la masa salarial más alta de la Premier League, reflejando el costo financiero de mantener una plantilla competitiva."
      }
    }
  },
  {
    "title": "Gordon told: Get Arsenal link 'out of your brain'",
    "slug": "gordon-told-get-arsenal-link-out-of-your-brain",
    "url": "https://www.espn.com/soccer/story/_/id/48052313/anthony-gordon-told-put-arsenal-transfer-rumour-your-brain",
    "source": "ESPN Soccer",
    "date": "2026-02-27T11:05:17.000Z",
    "summary": "Newcastle manager Eddie Howe has urged forward Anthony Gordon to dismiss speculation about a potential transfer to Arsenal. Howe emphasized the importance of maintaining focus during the current season amid transfer rumors.",
    "content": "Newcastle boss Eddie Howe has urged striker Anthony Gordon not to be distracted by speculation linking him with a summer move to Arsenal.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "戈登被告知：把阿森纳的传言\"从脑子里赶出去\"",
        "summary": "纽卡斯尔主教练埃迪·豪敦促前锋安东尼·戈登打消关于可能转会阿森纳的猜测。豪强调了在转会谣言中保持专注本赛季的重要性。"
      },
      "fr": {
        "title": "Gordon prié d'oublier le lien Arsenal",
        "summary": "Le manager de Newcastle, Eddie Howe, a exhorté l'attaquant Anthony Gordon à rejeter la spéculation sur un transfert potentiel à Arsenal. Howe a souligné l'importance de maintenir la concentration pendant la saison actuelle au milieu des rumeurs de transfert."
      },
      "de": {
        "title": "Gordon aufgefordert: Arsenal-Link \"aus dem Kopf werfen\"",
        "summary": "Newcastles Manager Eddie Howe hat Stürmer Anthony Gordon aufgefordert, Spekulationen über einen möglichen Transfer zu Arsenal zu ignorieren. Howe betonte die Wichtigkeit, sich während der laufenden Saison inmitten von Transfergerüchten konzentriert zu halten."
      },
      "es": {
        "title": "Gordon advertido: Sácate el vínculo con Arsenal \"de la cabeza\"",
        "summary": "El manager de Newcastle, Eddie Howe, ha instado al delantero Anthony Gordon a descartar la especulación sobre un posible traspaso al Arsenal. Howe enfatizó la importancia de mantener el enfoque durante la temporada actual en medio de rumores de transferencia."
      }
    }
  },
  {
    "title": "When could Wolves be relegated?",
    "slug": "when-could-wolves-be-relegated",
    "url": "https://www.bbc.com/sport/football/articles/clyg15yledeo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T10:52:41.000Z",
    "summary": "BBC Sport examines the mathematical scenarios and timeline for Wolverhampton's potential relegation from the Premier League. The analysis explores how soon the club could officially drop from the top flight.",
    "content": "BBC Sport's Ask Me Anything team looks at how soon Wolves can officially be relegated from the Premier League.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "狼队何时可能被降级？",
        "summary": "BBC体育频道检查了沃尔夫汉普顿从英超可能被降级的数学情景和时间表。该分析探讨了俱乐部可能何时正式从英超下降。"
      },
      "fr": {
        "title": "Quand les Wolves pourraient-ils être relégués?",
        "summary": "BBC Sport examine les scénarios mathématiques et le calendrier de la relégation potentielle de Wolverhampton de la Premier League. L'analyse explore dans combien de temps le club pourrait officiellement descendre de l'élite."
      },
      "de": {
        "title": "Wann könnten Wolves absteigen?",
        "summary": "BBC Sport untersucht die mathematischen Szenarien und den Zeitplan für Wolverhamptons möglichen Abstieg aus der Premier League. Die Analyse untersucht, wie bald der Club offiziell vom höchsten Niveau absteigen könnte."
      },
      "es": {
        "title": "¿Cuándo podrían los Wolves ser descendidos?",
        "summary": "BBC Sport examina los escenarios matemáticos y el cronograma de la posible relegación de Wolverhampton de la Premier League. El análisis explora cuándo el club podría oficialmente descender de la máxima categoría."
      }
    }
  },
  {
    "title": "Weekend predictions: Arsenal, Bayern title bids on the line?",
    "slug": "weekend-predictions-arsenal-bayern-title-bids-on-the-line",
    "url": "https://www.espn.com/soccer/story/_/id/48046810/arsenal-chelsea-orlando-city-inter-miamijulien-laurens-weekend-preview",
    "source": "ESPN Soccer",
    "date": "2026-02-27T10:42:35.000Z",
    "summary": "Sports analyst Julien Laurens highlights the key European football matches to watch this weekend, focusing on crucial title races involving Arsenal and Bayern Munich. Multiple league leaders will test their championship credentials.",
    "content": "It's Friday and another full weekend of action awaits across the soccer calendar as Julien Laurens picks out the best games to watch in Europe.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "周末预测:阿森纳、拜仁的冠军梦还能延续吗?",
        "summary": "体育分析师朱利安·劳伦斯强调了本周末值得关注的欧洲足球关键比赛，重点关注阿森纳和拜仁慕尼黑的重要冠军争夺战。多支联赛领头羊将测试其冠军实力。"
      },
      "fr": {
        "title": "Prédictions du week-end: les candidatures au titre d'Arsenal et du Bayern en jeu?",
        "summary": "L'analyste sportif Julien Laurens met en lumière les matchs clés de football européen à suivre ce week-end, en se concentrant sur les courses au titre cruciales impliquant Arsenal et le Bayern Munich. Plusieurs leaders de ligue testeront leurs titres de favori pour le championnat."
      },
      "de": {
        "title": "Wochenend-Vorhersagen: Stehen Arsenals und Bayerns Titelchancen auf dem Spiel?",
        "summary": "Sportanalyst Julien Laurens hebt die wichtigsten europäischen Fußballspiele hervor, die an diesem Wochenende zu beobachten sind, und konzentriert sich auf entscheidende Titelrennen zwischen Arsenal und dem FC Bayern München. Mehrere Ligaführer werden ihre Meisterschaftsambitionen testen."
      },
      "es": {
        "title": "Predicciones del fin de semana: ¿están en juego los títulos de Arsenal y Bayern?",
        "summary": "El analista deportivo Julien Laurens destaca los partidos de fútbol europeo clave para observar este fin de semana, enfocándose en las carreras por el título cruciales que involucran a Arsenal y el Bayern Munich. Múltiples líderes de liga pondrán a prueba sus credenciales de campeonato."
      }
    }
  },
  {
    "title": "Gordon needs to stay 'fully focused' after Arsenal talk - Howe",
    "slug": "gordon-needs-to-stay-fully-focused-after-arsenal-talk-howe",
    "url": "https://www.bbc.com/sport/football/articles/cnv6e1ggy77o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T10:42:13.000Z",
    "summary": "Eddie Howe has called for Anthony Gordon to maintain full focus following reports linking the Newcastle forward to Arsenal. The manager stressed the importance of concentration as transfer rumors continue to circulate.",
    "content": "Head coach Eddie Howe has urged Anthony Gordon to stay \"fully focused\" after the Newcastle United forward was linked with a move to Arsenal.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "戈登需要在阿森纳传言后保持\"完全专注\" - 豪",
        "summary": "埃迪·豪呼吁安东尼·戈登在与阿森纳传闻后保持完全专注。这位经理强调了专注的重要性，因为转会谣言继续流传。"
      },
      "fr": {
        "title": "Gordon doit rester 'pleinement concentré' après les rumeurs d'Arsenal - Howe",
        "summary": "Eddie Howe a appelé Anthony Gordon à maintenir une concentration totale suite aux rapports le liant à Arsenal. Le manager a souligné l'importance de la concentration alors que les rumeurs de transfert continuent à circuler."
      },
      "de": {
        "title": "Gordon muss nach Arsenal-Gerüchten 'vollständig konzentriert' bleiben - Howe",
        "summary": "Eddie Howe hat Anthony Gordon aufgefordert, sich vollständig zu konzentrieren, nachdem Berichte ihn mit Arsenal verbunden haben. Der Manager betonte die Wichtigkeit der Konzentration, da Transfergerüchte weiterhin im Umlauf sind."
      },
      "es": {
        "title": "Gordon necesita mantenerse 'totalmente enfocado' después del asunto Arsenal - Howe",
        "summary": "Eddie Howe ha pedido a Anthony Gordon que mantenga su enfoque total después de los reportes que lo vinculan con Arsenal. El gerente enfatizó la importancia de la concentración mientras continúan circulando rumores de transferencia."
      }
    }
  },
  {
    "title": "Who wins People's Puskás Award for world's best amateur goal of the year?",
    "slug": "peoples-puskas-award-best-amateur-goal-of-the-year",
    "url": "https://www.espn.com/soccer/story/_/id/47952091/peoples-puskas-award-wins-best-amateur-goal-year",
    "source": "ESPN Soccer",
    "date": "2026-02-27T10:35:30.000Z",
    "summary": "The People's Puskás Award recognizes the world's best amateur goal of the year, with contenders including an overhead kick, a long-range half-volley, and a rabona. The award celebrates exceptional individual skill from non-professional footballers.",
    "content": "A sublime overhead kick, a long-range half-volley, and some exquisite control followed by a rabona. But which goal wins the People's Puskás Award?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "谁赢得人民普斯卡什奖——年度最佳业余进球?",
        "summary": "人民普斯卡什奖表彰年度世界最佳业余进球，参赛者包括一脚倒钩、远距离半凌空抽射和彩虹过人进球。该奖项表彰非职业足球运动员的卓越个人技能。"
      },
      "fr": {
        "title": "Qui remporte le Prix Puskás du Peuple pour le meilleur but amateur de l'année?",
        "summary": "Le Prix Puskás du Peuple récompense le meilleur but amateur au monde de l'année, avec des candidats incluant un coup de talon, une demi-volée longue distance, et une rabona. Le prix célèbre les compétences individuelles exceptionnelles des footballeurs non-professionnels."
      },
      "de": {
        "title": "Wer gewinnt den People's Puskás Award für das beste Amateurtor des Jahres?",
        "summary": "Der People's Puskás Award würdigt das beste Amateurtor der Welt des Jahres, mit Kandidaten, darunter einen Hackenpass, einen Halbvolley aus der Ferne und eine Rabona. Der Preis würdigt außergewöhnliche individuelle Fähigkeiten von nicht-professionellen Fußballern."
      },
      "es": {
        "title": "¿Quién gana el Premio Puskás del Pueblo por el mejor gol amateur del año?",
        "summary": "El Premio Puskás del Pueblo reconoce el mejor gol amateur del mundo del año, con candidatos que incluyen un tiro de tacón, una media voleas de larga distancia, y una rabona. El premio celebra las habilidades individuales excepcionales de futbolistas no profesionales."
      }
    }
  },
  {
    "title": "Nuno helps me improve everyday - Summerville",
    "slug": "nuno-helps-me-improve-everyday-summerville",
    "url": "https://www.bbc.com/sport/football/videos/ckg1377xy4zo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T10:10:19.000Z",
    "summary": "West Ham forward Crysencio Summerville credits manager Nuno Espírito Santo with his improvement this season. The player highlighted the positive impact of the manager's coaching on his development.",
    "content": "West Ham's Crysencio Summeville shares how Nuno Espirito Santo has helped him improve this season.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "努诺帮助我每天进步 - 桑默维尔",
        "summary": "西汉姆联前锋克赖森西奥·桑默维尔将本赛季的进步归功于主教练努诺·埃斯皮里图·桑托。这名球员强调了主教练的执教对他发展的积极影响。"
      },
      "fr": {
        "title": "Nuno m'aide à m'améliorer chaque jour - Summerville",
        "summary": "L'attaquant de West Ham Crysencio Summerville attribue son amélioration cette saison au manager Nuno Espírito Santo. Le joueur a souligné l'impact positif de l'entraînement du manager sur son développement."
      },
      "de": {
        "title": "Nuno hilft mir, mich jeden Tag zu verbessern - Summerville",
        "summary": "West Hams Stürmer Crysencio Summerville schreibt seine Verbesserung in dieser Saison Manager Nuno Espírito Santo zu. Der Spieler hob die positive Auswirkung des Trainings des Managers auf seine Entwicklung hervor."
      },
      "es": {
        "title": "Nuno me ayuda a mejorar cada día - Summerville",
        "summary": "El delantero de West Ham Crysencio Summerville atribuye su mejora esta temporada al manager Nuno Espírito Santo. El jugador destacó el impacto positivo del entrenamiento del manager en su desarrollo."
      }
    }
  },
  {
    "title": "Cardiff City post £35m loss for last financial year",
    "slug": "cardiff-city-post-35m-loss-for-last-financial-year",
    "url": "https://www.bbc.com/sport/football/articles/crrxezv4wg4o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T09:59:10.000Z",
    "summary": "Cardiff City reported a £35 million loss for the last financial year, remaining dependent on majority owner Vincent Tan's financial support. The club's accumulated loans from Tan reached approximately £90 million by season's end.",
    "content": "Bluebirds accounts state they remain reliant on the financial support of majority shareholder Vincent Tan, whose loans to the club totalled almost £90m by the end of last season.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "卡迪夫城队上一财年亏损3500万英镑",
        "summary": "卡迪夫城队报告上一财年亏损3500万英镑，继续依赖大股东文森特·谭的财务支持。到赛季末，该俱乐部从谭处累积获得的贷款达到约9000万英镑。"
      },
      "fr": {
        "title": "Cardiff City affiche une perte de 35 millions de livres pour le dernier exercice financier",
        "summary": "Cardiff City a enregistré une perte de 35 millions de livres pour le dernier exercice financier, restant dépendante du soutien financier du propriétaire majoritaire Vincent Tan. Les prêts accumulés de Tan ont atteint environ 90 millions de livres à la fin de la saison."
      },
      "de": {
        "title": "Cardiff City verbucht Verlust von 35 Millionen Pfund im letzten Geschäftsjahr",
        "summary": "Cardiff City meldete einen Verlust von 35 Millionen Pfund für das letzte Geschäftsjahr und bleibt auf die finanzielle Unterstützung des Mehrheitseigners Vincent Tan angewiesen. Die kumulierten Darlehen von Tan erreichten bis zum Ende der Saison ungefähr 90 Millionen Pfund."
      },
      "es": {
        "title": "Cardiff City registra una pérdida de £35 millones para el último año fiscal",
        "summary": "Cardiff City reportó una pérdida de 35 millones de libras para el último año fiscal, siguiendo siendo dependiente del apoyo financiero del accionista mayoritario Vincent Tan. Los préstamos acumulados de Tan alcanzaron aproximadamente 90 millones de libras al final de la temporada."
      }
    }
  },
  {
    "title": "So much for three-year plan - what is the secret to manager longevity?",
    "slug": "so-much-for-three-year-plan-what-is-the-secret-to-manager-longevity",
    "url": "https://www.bbc.com/sport/football/articles/ckg1lzwegpgo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T09:48:45.000Z",
    "summary": "Former Premier League manager Tony Pulis examines the challenges facing football managers in modern sport and the difficulty of maintaining job security. The analysis explores the pressures and expectations that make managerial positions increasingly precarious.",
    "content": "In his BBC Sport column, ex-Premier League boss Tony Pulis explains why it is so hard for football managers to keep their jobs in the modern game.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "三年计划泡汤——管理者长期任职的秘诀是什么？",
        "summary": "英超前主教练托尼·普利斯审视了现代足球运动中足球主教练面临的挑战以及保持工作保障的困难。该分析探讨了使管理职位越来越不稳定的压力和期望。"
      },
      "fr": {
        "title": "Adieu le plan de trois ans - quel est le secret de la longévité des managers ?",
        "summary": "L'ancien manager de la Premier League Tony Pulis examine les défis auxquels font face les managers de football dans le sport moderne et la difficulté à maintenir la sécurité de l'emploi. L'analyse explore les pressions et les attentes qui rendent les positions de manager de plus en plus précaires."
      },
      "de": {
        "title": "Weg mit dem Dreijahresplan - was ist das Geheimnis der Langlebigkeit von Managern?",
        "summary": "Der ehemalige Premier-League-Manager Tony Pulis untersucht die Herausforderungen, denen Fußballmanager im modernen Sport gegenüberstehen, und die Schwierigkeit, die Jobsicherheit zu bewahren. Die Analyse untersucht die Druck- und Erwartungsfaktoren, die Managerpositionen zunehmend prekär machen."
      },
      "es": {
        "title": "Adiós al plan de tres años - ¿cuál es el secreto de la longevidad del manager?",
        "summary": "El exmanager de la Premier League Tony Pulis examina los desafíos que enfrentan los managers de fútbol en el deporte moderno y la dificultad de mantener la seguridad laboral. El análisis explora las presiones y expectativas que hacen que las posiciones de manager sean cada vez más precarias."
      }
    }
  },
  {
    "title": "Power Rankings: Chelsea up, Liverpool down in ratings of all 20 teams",
    "slug": "power-rankings-chelsea-up-liverpool-down-in-ratings-of-all-20-teams",
    "url": "https://www.espn.com/soccer/story/_/id/48038107/premier-league-power-rankings-rating-all-20-teams-february-2026",
    "source": "ESPN Soccer",
    "date": "2026-02-27T09:19:39.000Z",
    "summary": "ESPN's Premier League Power Rankings show Chelsea rising while Liverpool falls in the latest team ratings. Crystal Palace continues an impressive run, with rankings reflecting recent form across all 20 top-flight sides.",
    "content": "ESPN's Premier League Power Rankings return to look at all 20 teams: Chelsea are up, Liverpool are down, and Crystal Palace are on fire.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "实力排名：切尔西上升，利物浦下跌在20支球队评分中",
        "summary": "ESPN英超实力排名显示切尔西上升，利物浦在最新球队评分中下跌。水晶宫继续保持强劲势头，排名反映了所有20支顶级联赛球队的最近成绩。"
      },
      "fr": {
        "title": "Classement de puissance : Chelsea monte, Liverpool descend dans les évaluations des 20 équipes",
        "summary": "Les classements de puissance de la Premier League d'ESPN montrent Chelsea en hausse tandis que Liverpool baisse dans les dernières évaluations des équipes. Crystal Palace poursuit une belle course, avec les classements reflétant la forme récente de tous les 20 meilleurs clubs."
      },
      "de": {
        "title": "Power-Rankings: Chelsea steigt, Liverpool fällt in den Bewertungen aller 20 Mannschaften",
        "summary": "ESPNs Premier League Power Rankings zeigen Chelsea im Aufstieg, während Liverpool in den neuesten Team-Bewertungen fällt. Crystal Palace setzt seinen beeindruckenden Lauf fort, wobei die Rankings die jüngste Form aller 20 Top-Flight-Mannschaften widerspiegeln."
      },
      "es": {
        "title": "Ranking de poder: Chelsea sube, Liverpool baja en las clasificaciones de los 20 equipos",
        "summary": "Las clasificaciones de poder de la Premier League de ESPN muestran que Chelsea sube mientras que Liverpool baja en las últimas clasificaciones de equipos. Crystal Palace continúa una racha impresionante, con clasificaciones que reflejan el desempeño reciente en los 20 clubes de primera categoría."
      }
    }
  },
  {
    "title": "Transfer rumors, news: Man United, Chelsea, PSG watch Genk trio",
    "slug": "transfer-rumors-news-man-united-chelsea-psg-watch-genk-trio",
    "url": "https://www.espn.com/soccer/story/_/id/48051584/transfer-rumors-news-man-united-chelsea-psg-watch-genk-trio",
    "source": "ESPN Soccer",
    "date": "2026-02-27T09:07:07.000Z",
    "summary": "Scouts from elite European clubs including Manchester City, Chelsea, Manchester United, and Paris Saint-Germain have observed three Racing Genk players. The widespread interest suggests potential transfer moves involving the Belgian club's emerging talent.",
    "content": "Scouts from clubs including Chelsea, Manchester City, Man United and Paris Saint-Germain watched three Racing Genk stars play. Transfer Talk has the latest.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "转会传闻、新闻：曼联、切尔西、巴黎圣日耳曼关注根克三人组",
        "summary": "包括曼城、切尔西、曼联和巴黎圣日耳曼在内的欧洲精英俱乐部的球探已观察了根克赛车队的三名球员。广泛的关注表明涉及比利时俱乐部新兴人才的潜在转会动向。"
      },
      "fr": {
        "title": "Rumeurs de transfert, actualités : Manchester United, Chelsea, PSG observent le trio de Genk",
        "summary": "Les éclaireurs des clubs européens d'élite, notamment Manchester City, Chelsea, Manchester United et Paris Saint-Germain, ont observé trois joueurs de Racing Genk. L'intérêt généralisé suggère des mouvements de transfert potentiels impliquant les talents émergents du club belge."
      },
      "de": {
        "title": "Transfergerüchte, Nachrichten: Manchester United, Chelsea, PSG beobachten Genk-Trio",
        "summary": "Scouts von Elite-Clubs aus ganz Europa, darunter Manchester City, Chelsea, Manchester United und Paris Saint-Germain, haben drei Spieler von Racing Genk beobachtet. Das weit verbreitete Interesse deutet auf mögliche Transferbewegungen mit aufstrebenden Talenten des belgischen Clubs hin."
      },
      "es": {
        "title": "Rumores de transferencia, noticias: Manchester United, Chelsea, PSG observan trío de Genk",
        "summary": "Los cazatalentos de los principales clubes europeos, incluyendo Manchester City, Chelsea, Manchester United y París Saint-Germain, han observado a tres jugadores de Racing Genk. El amplio interés sugiere posibles movimientos de transferencia que implican el talento emergente del club belga."
      }
    }
  },
  {
    "title": "All your FPL stats and Premier League team news in one place",
    "slug": "all-your-fpl-stats-and-premier-league-team-news-in-one-place",
    "url": "https://www.bbc.com/sport/articles/c8r1v87n62xo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T08:50:19.000Z",
    "summary": "A comprehensive resource consolidates all Premier League team news and crucial Fantasy Premier League statistics in one location. The guide provides fans with essential information for following the season and making informed FPL decisions.",
    "content": "Every key bit of Premier League team news and the most important Fantasy Premier League statistics - all in one place.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "你的FPL统计数据和英超球队新闻一应俱全",
        "summary": "一份综合资源将所有英超球队新闻和关键梦幻英超统计数据汇聚在一个位置。该指南为粉丝提供了追踪本赛季和做出明智FPL决策所需的基本信息。"
      },
      "fr": {
        "title": "Toutes vos statistiques FPL et actualités des équipes de la Premier League au même endroit",
        "summary": "Une ressource complète consolide toutes les actualités des équipes de la Premier League et les statistiques essentielles de la Fantasy Premier League en un seul endroit. Le guide fournit aux fans les informations essentielles pour suivre la saison et prendre des décisions éclairées en matière de FPL."
      },
      "de": {
        "title": "Alle deine FPL-Statistiken und Premier League Team-Nachrichten an einem Ort",
        "summary": "Eine umfassende Ressource konsolidiert alle Premier League Team-Nachrichten und entscheidende Fantasy Premier League-Statistiken an einem Ort. Der Leitfaden bietet Fans wichtige Informationen zum Verfolgen der Saison und zum Treffen fundierter FPL-Entscheidungen."
      },
      "es": {
        "title": "Todas tus estadísticas de FPL y noticias del equipo de la Premier League en un lugar",
        "summary": "Un recurso completo consolida todas las noticias de equipos de la Premier League y estadísticas cruciales de la Fantasy Premier League en una ubicación. La guía proporciona a los aficionados información esencial para seguir la temporada y tomar decisiones informadas sobre FPL."
      }
    }
  },
  {
    "title": "Neymar shushes critics after first goals in return",
    "slug": "neymar-shushes-critics-after-first-goals-in-return",
    "url": "https://www.espn.com/soccer/story/_/id/48048301/neymar-shushes-critics-first-goals-santos-return",
    "source": "ESPN Soccer",
    "date": "2026-02-27T06:17:20.000Z",
    "summary": "Neymar broke his 2026 goal drought in spectacular fashion Thursday, leading Santos to a 2-1 victory over Vasco da Gama in the fourth round of the Brasileirão.",
    "content": "Neymar broke his 2026 goal drought in spectacular fashion Thursday, leading Santos to a 2-1 victory over Vasco da Gama in the fourth round of the Brasileirão.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "内马尔首次复出进球后沉默批评者",
        "summary": "内马尔周四以壮观的方式打破2026年的进球荒，带领桑托斯在巴甲第四轮中以2-1击败瓦斯科·达·伽马。"
      },
      "fr": {
        "title": "Neymar fait taire les critiques après ses premiers buts de retour",
        "summary": "Neymar a rompu sa sécheresse de buts en 2026 de manière spectaculaire jeudi, menant Santos à une victoire 2-1 contre Vasco da Gama au quatrième tour du Brasileirão."
      },
      "de": {
        "title": "Neymar zum Schweigen bringt Kritiker nach Rückkehr mit Toren",
        "summary": "Neymar beendete seinen Tordrought von 2026 auf spektakuläre Weise am Donnerstag und führte Santos zu einem 2:1-Sieg über Vasco da Gama in der vierten Runde der Brasileirão."
      },
      "es": {
        "title": "Neymar calla a los críticos tras sus primeros goles de regreso",
        "summary": "Neymar rompió su sequía de goles de 2026 de manera espectacular el jueves, llevando a Santos a una victoria de 2-1 sobre Vasco da Gama en la cuarta ronda del Brasileirão."
      }
    }
  },
  {
    "title": "Messi scores as Miami wins rescheduled friendly",
    "slug": "messi-scores-as-miami-wins-rescheduled-friendly",
    "url": "https://www.espn.com/soccer/story/_/id/48049042/lionel-messi-scores-inter-miami-wins-rescheduled-friendly",
    "source": "ESPN Soccer",
    "date": "2026-02-27T06:17:20.000Z",
    "summary": "Inter Miami CF beat Independiente del Valle 2-1 on Thursday night in Puerto Rico with goals from Santiago Morales and Lionel Messi to conclude the team's preseason friendly tour.",
    "content": "Inter Miami CF beat Independiente del Valle 2-1 on Thursday night in Puerto Rico with goals from Santiago Morales and Lionel Messi to conclude the team's preseason friendly tour.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "梅西进球，迈阿密赢得重新安排的友谊赛",
        "summary": "国际迈阿密队周四晚在波多黎各以2-1战胜山谷独立队，桑地亚哥·莫拉莱斯和莱昂内尔·梅西进球，完成球队季前友谊赛。"
      },
      "fr": {
        "title": "Messi marque alors que Miami remporte le match amical reprogrammé",
        "summary": "L'Inter Miami CF a battu l'Independiente del Valle 2-1 jeudi soir à Porto Rico avec des buts de Santiago Morales et Lionel Messi pour conclure le tour des matchs amicaux de présaison de l'équipe."
      },
      "de": {
        "title": "Messi trifft, während Miami das verschobene Freundschaftsspiel gewinnt",
        "summary": "Inter Miami CF besiegte Independiente del Valle am Donnerstagabend in Puerto Rico 2:1 mit Toren von Santiago Morales und Lionel Messi und beendete damit die Freundschaftsspiele der Vorsaison der Mannschaft."
      },
      "es": {
        "title": "Messi anota mientras Miami gana el amistoso reprogramado",
        "summary": "Inter Miami CF venció 2-1 a Independiente del Valle el jueves por la noche en Puerto Rico con goles de Santiago Morales y Lionel Messi para concluir la gira de amistosos de pretemporada del equipo."
      }
    }
  },
  {
    "title": "USLPA clears path for strike as CBA talks stall",
    "slug": "uslpa-clears-path-for-strike-as-cba-talks-stall",
    "url": "https://www.espn.com/soccer/story/_/id/48050987/uslpa-authorizes-strike-season-kickoff-looming",
    "source": "ESPN Soccer",
    "date": "2026-02-27T06:17:20.000Z",
    "summary": "null",
    "content": "null",
    "category": "sports"
  },
  {
    "title": "Sources: Jesse Lingard in talks to join Corinthians",
    "slug": "sources-jesse-lingard-in-talks-to-join-corinthians",
    "url": "https://www.espn.com/soccer/story/_/id/48047682/jesse-lingard-corinthians-transfer-man-united",
    "source": "ESPN Soccer",
    "date": "2026-02-27T06:17:20.000Z",
    "summary": "Former England and Manchester United midfielder Jesse Lingard is in advanced talks to join Brazilian top-tier club Corinthians, sources told ESPN.",
    "content": "Former England and Manchester United midfielder Jesse Lingard is in advanced talks to join Brazilian top-tier club Corinthians, sources told ESPN.",
    "category": "sports"
  },
  {
    "title": "Football Daily",
    "slug": "football-daily",
    "url": "https://www.bbc.co.uk/sounds/play/p0n3gnf0?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-27T06:00:00.000Z",
    "summary": "Kelly Somers speaks to England captain Leah Williamson.",
    "content": "Kelly Somers speaks to England captain Leah Williamson.",
    "category": "sports"
  }
]