[
  {
    "title": "Transfer rumors, news: MLS an option as Salah 'increasingly likely' to leave Liverpool",
    "slug": "salah-mls-option-leave-liverpool",
    "url": "https://www.espn.com/soccer/story/_/id/48070919/transfer-rumors-news-mls-summer-transfer-options-liverpool-salah",
    "source": "ESPN Soccer",
    "date": "2026-03-01T11:10:36.000Z",
    "summary": "Mohamed Salah may leave Liverpool this summer with the MLS and Saudi Pro League as potential destinations. This represents a significant transfer possibility for the English club.",
    "content": "MLS and the Saudi Pro League are both \"possible options\" for Liverpool's Mohamed Salah this summer. Transfer Talk has the latest.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "转会传言、新闻：美国职业大联盟可能选择，萨拉赫\"越来越可能\"离开利物浦",
        "summary": "穆罕默德·萨拉赫可能在今年夏天离开利物浦，美国职业大联盟和沙特职业联赛是潜在目的地。这代表了英超球队的一个重大转会可能性。"
      },
      "fr": {
        "title": "Rumeurs de transfert, actualités : la MLS est une option car Salah est \"de plus en plus susceptible\" de quitter Liverpool",
        "summary": "Mohamed Salah pourrait quitter Liverpool cet été, la MLS et la Pro League saoudienne étant des destinations potentielles. Cela représente une possibilité de transfert importante pour le club anglais."
      },
      "de": {
        "title": "Transfergerüchte, Nachrichten: MLS ist eine Option, da Salah \"immer wahrscheinlicher\" Liverpool verlässt",
        "summary": "Mohamed Salah könnte den FC Liverpool in diesem Sommer verlassen, wobei die MLS und die saudi-arabische Pro League potenzielle Ziele sind. Dies stellt eine bedeutende Transfermöglichkeit für den englischen Club dar."
      },
      "es": {
        "title": "Rumores de transferencia, noticias: MLS es una opción ya que Salah es \"cada vez más probable\" que abandone Liverpool",
        "summary": "Mohamed Salah podría dejar Liverpool este verano con la MLS y la Liga Pro de Arabia Saudita como posibles destinos. Esto representa una importante posibilidad de transferencia para el club inglés."
      }
    }
  },
  {
    "title": "Old Firm build-up dominates Sunday's gossip",
    "slug": "old-firm-buildup-dominates-sunday-gossip",
    "url": "https://www.bbc.com/sport/football/articles/cp324q7675eo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T08:52:19.000Z",
    "summary": "The Old Firm derby dominates Scottish football transfer gossip ahead of Sunday's match.",
    "content": "Old Firm build-up dominates Sunday's Scottish football gossip.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "老字号对阵成为星期天八卦的焦点",
        "summary": "老字号德比在星期天比赛前主导了苏格兰足球转会八卦。"
      },
      "fr": {
        "title": "L'Old Firm build-up domine les commérages du dimanche",
        "summary": "Le derby de l'Old Firm domine les commérages des transferts du football écossais avant le match de dimanche."
      },
      "de": {
        "title": "Old Firm Build-up dominiert die Sonntagsklatsch",
        "summary": "Das Old-Firm-Derby dominiert vor dem Spiel am Sonntag die schottischen Fußball-Transfergerüchte."
      },
      "es": {
        "title": "El enfrentamiento del Old Firm domina los cotilleos del domingo",
        "summary": "El derbi del Old Firm domina los cotilleos de transferencias del fútbol escocés antes del partido del domingo."
      }
    }
  },
  {
    "title": "How do Lionesses solve full-back succession problem?",
    "slug": "lionesses-full-back-succession-problem",
    "url": "https://www.bbc.com/sport/football/articles/c0rjg4gqdkjo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T08:52:18.000Z",
    "summary": "The England women's team faces a full-back succession challenge ahead of the 2027 Women's World Cup. The article explores potential solutions to this defensive positional issue.",
    "content": "Will the Lionesses find a solution for their full-back problem in time for the 2027 Women's World Cup?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "英国女性队如何解决后卫接班问题？",
        "summary": "英国女足队在2027年女足世界杯前面临后卫接班挑战。该文章探讨了这个防线位置问题的潜在解决方案。"
      },
      "fr": {
        "title": "Comment les Lionesses résolvent-elles le problème de succession des arrières ?",
        "summary": "L'équipe féminine d'Angleterre fait face à un défi de succession aux arrières avant la Coupe du monde féminine 2027. L'article explore les solutions potentielles à ce problème de position défensive."
      },
      "de": {
        "title": "Wie lösen die Lionesses das Problem der Außenverteidiger-Nachfolge?",
        "summary": "Das englische Frauenfußballteam steht vor einer Herausforderung bei der Nachfolge der Außenverteidiger vor der Frauen-Weltmeisterschaft 2027. Der Artikel untersucht mögliche Lösungen für dieses defensive Positionsproblem."
      },
      "es": {
        "title": "¿Cómo resuelven las Lionesses el problema de sucesión de laterales?",
        "summary": "El equipo femenino de Inglaterra enfrenta un desafío de sucesión de laterales antes de la Copa Mundial Femenina 2027. El artículo explora posibles soluciones a este problema de posición defensiva."
      }
    }
  },
  {
    "title": "Fishlock ambassadorial role 'important for visibility'",
    "slug": "fishlock-ambassadorial-role-visibility",
    "url": "https://www.bbc.com/sport/football/articles/c6200gylppzo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T07:31:17.000Z",
    "summary": "Jess Fishlock, Wales' greatest female footballer, has taken on an ambassadorial role for the 2027 EuroGames in Cardiff. She emphasized the importance of this position for LGBTQ+ visibility during the current political climate.",
    "content": "Jess Fishlock, generally regarded as Wales' greatest ever female footballer, says she felt compelled to become an ambassador for the 2027 EuroGames in Cardiff due to the \"political climate right now\" for LGBTQ+ people.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "菲什洛克大使角色'对能见度很重要'",
        "summary": "杰丝·菲什洛克是威尔士最伟大的女性足球运动员，已担任2027年卡迪夫欧游会的大使。她强调在当前政治气候下，这个职位对LGBTQ+能见度的重要性。"
      },
      "fr": {
        "title": "Le rôle ambassadorial de Fishlock 'important pour la visibilité'",
        "summary": "Jess Fishlock, la plus grande joueuse de football féminin du Pays de Galles, a accepté un rôle d'ambassadrice pour les EuroGames 2027 à Cardiff. Elle a souligné l'importance de cette position pour la visibilité des LGBTQ+ dans le climat politique actuel."
      },
      "de": {
        "title": "Fischlocks Botschafterrolle 'wichtig für die Sichtbarkeit'",
        "summary": "Jess Fishlock, Walisens größte weibliche Fußballerin, hat eine Botschafterrolle für die EuroGames 2027 in Cardiff übernommen. Sie betonte die Bedeutung dieser Position für die Sichtbarkeit von LGBTQ+ im aktuellen politischen Klima."
      },
      "es": {
        "title": "El papel de embajadora de Fishlock 'importante para la visibilidad'",
        "summary": "Jess Fishlock, la mejor futbolista femenina de Gales, ha asumido un papel de embajadora para los EuroGames 2027 en Cardiff. Enfatizó la importancia de esta posición para la visibilidad de LGBTQ+ durante el clima político actual."
      }
    }
  },
  {
    "title": "'Rules are there to be broken': The women's team who defied football ban",
    "slug": "women-team-defied-football-ban-corinthians",
    "url": "https://www.bbc.com/news/articles/c9wndrz1j9qo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T07:01:06.000Z",
    "summary": "The Corinthians, a Manchester-formed women's football team, defied a football ban to play the sport they loved. The team demonstrated determination in pursuing their passion for the game.",
    "content": "The Manchester-formed team, known as The Corinthians, were determined to play the game they loved.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "'规则是用来打破的'：挑战足球禁令的女队",
        "summary": "科林蒂安队是一支在曼彻斯特成立的女子足球队，他们违反足球禁令去进行自己热爱的运动。这个团队在追求对足球的热情中展现了决心。"
      },
      "fr": {
        "title": "'Les règles sont faites pour être brisées' : L'équipe féminine qui a défié l'interdiction du football",
        "summary": "Les Corinthians, une équipe de football féminin formée à Manchester, ont défié une interdiction du football pour jouer le sport qu'elles aimaient. L'équipe a démontré de la détermination dans la poursuite de leur passion pour le jeu."
      },
      "de": {
        "title": "'Regeln sind dazu da, um gebrochen zu werden': Das Frauenteam, das das Fußballverbot trotzte",
        "summary": "Die Corinthians, ein in Manchester gegründetes Frauenfußballteam, trotzten einem Fußballverbot, um den Sport zu spielen, den sie liebten. Das Team zeigte Entschlossenheit bei der Verfolgung ihrer Leidenschaft für das Spiel."
      },
      "es": {
        "title": "'Las reglas están hechas para romperse': El equipo femenino que desafió la prohibición del fútbol",
        "summary": "Las Corinthians, un equipo de fútbol femenino formado en Manchester, desafiaron una prohibición del fútbol para jugar el deporte que amaban. El equipo demostró determinación en la persecución de su pasión por el juego."
      }
    }
  },
  {
    "title": "Arsenal set to celebrate St Totteringham's Day earlier than ever",
    "slug": "arsenal-st-totteringham-day-earlier-ever",
    "url": "https://www.bbc.com/sport/football/articles/cwygre5geq2o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T06:27:32.000Z",
    "summary": "St Totteringham's Day—when it becomes mathematically impossible for Spurs to finish above Arsenal in the Premier League—is set to arrive earlier than ever. This indicates Arsenal's strong position in the league standings.",
    "content": "The day it becomes impossible for Spurs to finish above Arsenal in the Premier League, St Totteringham's Day is set to arrive earlier than ever.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "阿森纳有望比以往更早庆祝圣托特汉姆日",
        "summary": "圣托特汉姆日——当托特纳姆热刺队在英超联赛中不可能超过阿森纳时——将比以往更早到来。这表明阿森纳在联赛中处于强势地位。"
      },
      "fr": {
        "title": "Arsenal s'apprête à célébrer la Journée de Saint Totteringham plus tôt que jamais",
        "summary": "La Journée de Saint Totteringham — lorsqu'il devient mathématiquement impossible que Spurs termine au-dessus d'Arsenal en Premier League — est sur le point d'arriver plus tôt que jamais. Cela indique la position forte d'Arsenal dans le classement de la ligue."
      },
      "de": {
        "title": "Arsenal wird St. Totteringhams Tag früher als je zuvor feiern",
        "summary": "St. Totteringhams Tag — wenn es mathematisch unmöglich wird, dass Spurs Arsenal in der Premier League überholt — soll früher als je zuvor eintreten. Dies deutet auf Arsenals starke Position in der Ligatabelle hin."
      },
      "es": {
        "title": "Arsenal celebrará el Día de San Totteringham más temprano que nunca",
        "summary": "El Día de San Totteringham — cuando se vuelve matemáticamente imposible que Spurs termine por encima de Arsenal en la Premier League — está listo para llegar más temprano que nunca. Esto indica la fuerte posición de Arsenal en la clasificación de la liga."
      }
    }
  },
  {
    "title": "USMNT starlet Banks considering Germany switch",
    "slug": "usmnt-starlet-banks-considering-germany-switch",
    "url": "https://www.espn.com/soccer/story/_/id/48066548/usmnt-noahkai-banks-germany-switch-augsburg",
    "source": "ESPN Soccer",
    "date": "2026-03-01T05:33:17.000Z",
    "summary": "U.S. youth national team starlet Noahkai Banks is weighing his international future between the U.S. and Germany, with a potential spot on this summer's senior World Cup squad at stake. This decision could impact USMNT's squad composition for a major tournament.",
    "content": "U.S. youth national team starlet Noahkai Banks, a potential pick for this summer's senior World Cup squad, has said he is still considering whether his international future lies with the U.S. or Germany.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "USMNT新星班克斯考虑转向德国",
        "summary": "美国青年国家队新星诺亚凯·班克斯在美国和德国之间权衡自己的国际足球生涯，争取在今年夏天的成年世界杯球队中获得一席之地。这个决定可能会影响USMNT在重大赛事中的阵容组成。"
      },
      "fr": {
        "title": "La jeune star de l'USMNT Banks envisage un changement vers l'Allemagne",
        "summary": "La jeune star de l'équipe nationale des jeunes américains Noahkai Banks pèse son avenir international entre les États-Unis et l'Allemagne, avec un spot potentiel sur l'équipe de la Coupe du monde senior de cet été en jeu. Cette décision pourrait avoir un impact sur la composition de l'équipe de l'USMNT pour un tournoi majeur."
      },
      "de": {
        "title": "USMNT-Talent Banks erwägt Wechsel nach Deutschland",
        "summary": "Das US-amerikanische Nachwuchsnational-Talent Noahkai Banks wägt seine internationale Zukunft zwischen den USA und Deutschland ab, mit einem möglichen Platz in der Senior-Weltcup-Mannschaft diesen Sommer auf dem Spiel. Diese Entscheidung könnte die Zusammensetzung des USMNT-Kaders für ein großes Turnier beeinflussen."
      },
      "es": {
        "title": "La joven estrella de USMNT Banks considerando un cambio a Alemania",
        "summary": "La joven estrella del equipo nacional juvenil estadounidense Noahkai Banks está sopesando su futuro internacional entre Estados Unidos y Alemania, con un posible lugar en el equipo senior de la Copa del Mundo de este verano en juego. Esta decisión podría impactar la composición del equipo de USMNT para un torneo importante."
      }
    }
  },
  {
    "title": "Iran women's NT: 'Let's just focus' on Asian Cup",
    "slug": "iran-womens-nt-focus-asian-cup",
    "url": "https://www.espn.com/soccer/story/_/id/48069381/iran-women-national-team-let-just-focus-asian-cup",
    "source": "ESPN Soccer",
    "date": "2026-03-01T05:33:17.000Z",
    "summary": "The Iran women's national football team coach and captain emphasized their focus on preparation for the Women's Asian Cup in Australia, deflecting questions about broader political issues. The team reported they have enjoyed good preparation ahead of the tournament.",
    "content": "A question regarding the killing of Ayatollah Ali Khamenei has been shut down as the Iran women's national football team coach and captain said they had enjoyed a \"good preparation\" for the Women's Asian Cup in Australia.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "伊朗女足：专注亚洲杯",
        "summary": "伊朗女足国家队主教练和队长强调专注于澳大利亚女性亚洲杯的准备工作，回避了关于更广泛政治问题的问题。该队报告称他们在比赛前做好了充分准备。"
      },
      "fr": {
        "title": "Équipe féminine de l'Iran : \"Concentrons-nous\" sur la Coupe d'Asie",
        "summary": "L'entraîneur et le capitaine de l'équipe nationale féminine de football iranienne ont souligné leur concentration sur la préparation de la Coupe d'Asie des femmes en Australie, éludant les questions sur les enjeux politiques plus larges. L'équipe a signalé qu'elle avait eu une bonne préparation avant le tournoi."
      },
      "de": {
        "title": "Irans Frauennationalmannschaft: \"Konzentrieren wir uns\" auf den Asienpokal",
        "summary": "Der Trainer und Kapitän der iranischen Frauenfußball-Nationalmannschaft betonten ihren Fokus auf die Vorbereitung auf den Frauenasienpokal in Australien und wichen Fragen zu breiteren politischen Problemen aus. Das Team berichtete, dass es sich gut auf das Turnier vorbereitet hat."
      },
      "es": {
        "title": "Selección femenina de Irán: \"Enfoquémonos\" en la Copa de Asia",
        "summary": "El entrenador y capitán del equipo nacional femenino de fútbol de Irán enfatizaron su enfoque en la preparación para la Copa de Asia Femenina en Australia, eludiendo preguntas sobre cuestiones políticas más amplias. El equipo informó que ha tenido una buena preparación antes del torneo."
      }
    }
  },
  {
    "title": "'World-class save' - How Pickford & Everton thwarted Newcastle",
    "slug": "pickford-everton-save-newcastle",
    "url": "https://www.bbc.com/sport/football/videos/cx2lgevrr67o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T00:04:22.000Z",
    "summary": "Jordan Pickford made a remarkable injury-time save for Everton against Newcastle, with Match of the Day pundits praising the goalkeeper's crucial performance in preserving the result.",
    "content": "Match of the Day pundits Alan Shearer and Ashley Williams react to Jordan Pickford's \"remarkable\" injury-time save against Newcastle.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"世界级扑救\" - 皮克福德和埃弗顿如何阻止了纽卡斯尔",
        "summary": "乔丹·皮克福德为埃弗顿对阵纽卡斯尔的比赛做出了一次非凡的伤停补时救球，《每日比赛》的专家称赞这位门将在保持比赛结果中的关键表现。"
      },
      "fr": {
        "title": "\"Un arrêt de classe mondiale\" - Comment Pickford et Everton ont arrêté Newcastle",
        "summary": "Jordan Pickford a effectué un arrêt remarquable en fin de match pour Everton contre Newcastle, les experts du Match of the Day félicitant la performance cruciale du gardien pour préserver le résultat."
      },
      "de": {
        "title": "\"Weltklasse-Rettung\" - Wie Pickford und Everton Newcastle stoppten",
        "summary": "Jordan Pickford machte eine bemerkenswerte Rettung in der Nachspielzeit für Everton gegen Newcastle, wobei Match of the Day-Experten die entscheidende Leistung des Torwarts zur Sicherung des Ergebnisses lobten."
      },
      "es": {
        "title": "\"Una atajada de clase mundial\" - Cómo Pickford y Everton frenaron al Newcastle",
        "summary": "Jordan Pickford realizó una atajada extraordinaria en tiempo de descuento para el Everton contra el Newcastle, con los expertos del Match of the Day elogiando la actuación crucial del portero al preservar el resultado."
      }
    }
  }
]