[
  {
    "title": "Heaps, Shaw lead USWNT to win over Argentina",
    "slug": "heaps-shaw-lead-uswnt-win-over-argentina",
    "url": "https://www.espn.com/soccer/report/_/gameId/401846987",
    "source": "ESPN Soccer",
    "date": "2026-03-02T05:17:17.000Z",
    "summary": "Lindsey Heaps and Jaedyn Shaw scored to give the USWNT a 2-0 win over Argentina in the SheBelieves Cup, extending their shutout streak to six games. This victory demonstrates the team's strong defensive form heading into international competition.",
    "content": "Lindsey Heaps had a goal and an assist, and Jaedyn Shaw also scored to propel the United States to a sixth straight shutout victory with a 2-0 win over Argentina in the SheBelieves Cup on Sunday.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "希普斯、肖领导美国女足击败阿根廷",
        "summary": "林赛·希普斯和贾埃丁·肖进球，使美国女足在她相信杯中以2-0击败阿根廷，将零封纪录延续至六场比赛。这场胜利展示了该队在国际比赛前的强大防线。"
      },
      "fr": {
        "title": "Heaps et Shaw menent l'USWNT à la victoire sur l'Argentine",
        "summary": "Lindsey Heaps et Jaedyn Shaw ont marqué pour donner à l'USWNT une victoire 2-0 sur l'Argentine lors du SheBelieves Cup, prolongeant leur série de buts blanchis à six matchs. Cette victoire démontre la forte forme défensive de l'équipe en préparation de la compétition internationale."
      },
      "de": {
        "title": "Heaps und Shaw führen USWNT zum Sieg über Argentinien",
        "summary": "Lindsey Heaps und Jaedyn Shaw erzielten Tore, um der USWNT einen 2-0-Sieg über Argentinien beim SheBelieves Cup zu sichern und ihre Serie ohne Gegentor auf sechs Spiele auszudehnen. Dieser Sieg zeigt die starke defensive Form des Teams vor dem internationalen Wettbewerb."
      },
      "es": {
        "title": "Heaps y Shaw lideran victoria de USWNT sobre Argentina",
        "summary": "Lindsey Heaps y Jaedyn Shaw anotaron para darle a USWNT una victoria de 2-0 sobre Argentina en la Copa SheBelieves, extendiendo su racha de portería en cero a seis juegos. Esta victoria demuestra la sólida forma defensiva del equipo en preparación para la competencia internacional."
      }
    }
  },
  {
    "title": "Mourinho: 'Over' for Prestianni if guilty of abuse",
    "slug": "mourinho-over-prestianni-if-guilty-of-abuse",
    "url": "https://www.espn.com/soccer/story/_/id/48077297/mourinho-prestianni-benfica-guilty",
    "source": "ESPN Soccer",
    "date": "2026-03-02T03:51:52.000Z",
    "summary": "Jose Mourinho stated that Gianluca Prestianni's future at Benfica would end if he is found guilty of racially abusing Real Madrid's Vinícius Júnior. The statement emphasizes the club's zero-tolerance policy on racial abuse.",
    "content": "Jose Mourinho said Gianluca Prestianni will have no future at Benfica if he is found guilty of racially abusing Real Madrid's Vinícius Júnior.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "穆里尼奥：普雷斯蒂亚尼若有罪将\"结束\"",
        "summary": "若瑞尼亚迪斯蒂亚尼被判对皇马维尼修斯·朱尼奥尔进行种族辱骂，何塞·穆里尼奥表示他在本菲卡的未来将结束。这一声明强调了俱乐部对种族辱骂的零容忍政策。"
      },
      "fr": {
        "title": "Mourinho : \"Fini\" pour Prestianni s'il est coupable d'abus",
        "summary": "Jose Mourinho a déclaré que l'avenir de Gianluca Prestianni à Benfica prendrait fin s'il était reconnu coupable d'abus racial envers Vinícius Júnior du Real Madrid. La déclaration souligne la politique de zéro tolérance du club envers les abus raciaux."
      },
      "de": {
        "title": "Mourinho: \"Vorbei\" für Prestianni bei Schuldspruch wegen Missbrauch",
        "summary": "Jose Mourinho erklärte, dass Gianluca Prestiannis Zukunft bei Benfica enden würde, falls er wegen rassistischer Beleidigung gegen Vinícius Júnior von Real Madrid schuldig befunden wird. Die Aussage unterstreicht die Null-Toleranz-Politik des Clubs gegenüber rassistischem Missbrauch."
      },
      "es": {
        "title": "Mourinho: \"Fin\" para Prestianni si es culpable de abuso",
        "summary": "Jose Mourinho afirmó que el futuro de Gianluca Prestianni en el Benfica terminaría si es declarado culpable de abusar racialmente a Vinícius Júnior del Real Madrid. La declaración enfatiza la política de cero tolerancia del club hacia el abuso racial."
      }
    }
  },
  {
    "title": "Messi's first goals of season inspire big Miami rally",
    "slug": "messi-first-goals-season-inspire-big-miami-rally",
    "url": "https://www.espn.com/soccer/report/_/gameId/761467",
    "source": "ESPN Soccer",
    "date": "2026-03-02T03:51:52.000Z",
    "summary": "Lionel Messi scored twice as Inter Miami CF rallied from behind to defeat Orlando City SC 4-2, with defender Telasco Segovia also contributing a goal and two assists. The victory showcases the defending champions' ability to mount comebacks with their star players in form.",
    "content": "Lionel Messi scored twice in a four-goal second half, defender Telasco Segovia added a goal and two assists and defending champion Inter Miami CF rallied to beat Orlando City SC 4-2 on Sunday night.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "梅西本赛季首球激励迈阿密大翻身",
        "summary": "莱昂内尔·梅西打进两球，国际迈阿密队反超战胜奥兰多城队4-2，后卫特拉斯科·塞戈维亚也贡献一球和两次助攻。这场胜利展示了卫冕冠军在明星球员发挥出色时的反扑能力。"
      },
      "fr": {
        "title": "Les premiers buts de la saison de Messi inspirent un grand retour de Miami",
        "summary": "Lionel Messi a marqué deux fois alors que l'Inter Miami CF a réussi un retour remarquable pour vaincre Orlando City SC 4-2, le défenseur Telasco Segovia contribuant également avec un but et deux passes décisives. La victoire montre la capacité des champions en titre à monter des remontadas avec leurs vedettes en forme."
      },
      "de": {
        "title": "Messis erste Saisontore inspirieren großes Miami-Comeback",
        "summary": "Lionel Messi erzielte zweimal, als Inter Miami CF von hinten aufholte und Orlando City SC 4-2 besiegte, wobei Abwehrspieler Telasco Segovia mit einem Tor und zwei Vorlagen beitrug. Der Sieg zeigt die Fähigkeit der Titelverteidiger, Comebacks mit ihren Topspielern in Form zu erreichen."
      },
      "es": {
        "title": "Los primeros goles de la temporada de Messi inspiran gran remontada de Miami",
        "summary": "Lionel Messi anotó dos goles mientras Inter Miami CF se recuperó de atrás para derrotar a Orlando City SC 4-2, y el defensa Telasco Segovia también contribuyó con un gol y dos asistencias. La victoria muestra la capacidad de los campeones defensores de hacer remontadas con sus jugadores estrella en forma."
      }
    }
  },
  {
    "title": "Hayes sees 'growth' in USWNT since Portugal loss",
    "slug": "hayes-sees-growth-uswnt-since-portugal-loss",
    "url": "https://www.espn.com/soccer/story/_/id/48077631/emma-hayes-sees-growth-uswnt-portugal-loss",
    "source": "ESPN Soccer",
    "date": "2026-03-02T03:51:51.000Z",
    "summary": "Coach Emma Hayes praised her team's emotional control in the USWNT's 2-0 victory over Argentina in the SheBelieves Cup, noting positive development since a previous loss to Portugal. The win demonstrates the team's resilience and tactical improvement.",
    "content": "United States coach Emma Hayes said she was pleased with her team's emotional control in a \"scrappy\" 2-0 victory over Argentina on Sunday to open the 2026 SheBelieves Cup in Nashville, Tennessee.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "海耶斯看到美国女足自葡萄牙失利后的\"成长\"",
        "summary": "埃玛·海耶斯教练在美国女足在谢信杯上以2-0战胜阿根廷的比赛中赞扬了她的球队的情绪控制，并指出自葡萄牙之前的失利以来取得了积极进展。这次胜利展示了球队的韧性和战术改进。"
      },
      "fr": {
        "title": "Hayes voit de la « croissance » chez l'USWNT depuis la défaite contre le Portugal",
        "summary": "L'entraîneuse Emma Hayes a félicité le contrôle émotionnel de son équipe dans la victoire 2-0 de l'USWNT contre l'Argentine à la Coupe SheBelieves, notant un développement positif depuis une défaite antérieure contre le Portugal. La victoire démontre la résilience de l'équipe et son amélioration tactique."
      },
      "de": {
        "title": "Hayes sieht \"Wachstum\" bei der USWNT seit der Niederlage gegen Portugal",
        "summary": "Trainerin Emma Hayes lobte die emotionale Kontrolle ihres Teams beim 2:0-Sieg der USWNT über Argentinien im SheBelieves Cup und vermerkte positive Entwicklungen seit einer vorherigen Niederlage gegen Portugal. Der Sieg zeigt die Widerstandsfähigkeit des Teams und ihre taktische Verbesserung."
      },
      "es": {
        "title": "Hayes ve \"crecimiento\" en la USWNT desde la derrota contra Portugal",
        "summary": "La entrenadora Emma Hayes elogió el control emocional de su equipo en la victoria 2-0 de la USWNT sobre Argentina en la Copa SheBelieves, señalando un desarrollo positivo desde una derrota anterior contra Portugal. La victoria demuestra la resiliencia del equipo y su mejora táctica."
      }
    }
  },
  {
    "title": "Follow live: Messi, Miami visit Orlando seeking first win of 2026",
    "slug": "messi-miami-orlando-first-win-2026",
    "url": "https://www.espn.com/soccer/match/_/gameId/761467/inter-miami-cf-orlando-city-sc",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:22:22.000Z",
    "summary": "Inter Miami seek their first win of 2026 as they visit Orlando in a live match featuring Lionel Messi. The team looks to improve their early season record.",
    "content": "null",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "现场直播：梅西、迈阿密客战奥兰多，力求2026赛季首胜",
        "summary": "迈阿密国际队在客场挑战奥兰多城队，力求取得2026赛季的首场胜利。这场直播比赛将有梅西的参加。球队希望改善赛季初期的战绩。"
      },
      "fr": {
        "title": "En direct : Messi et Miami visitent Orlando à la recherche de la première victoire de 2026",
        "summary": "L'Inter Miami cherche sa première victoire de 2026 en visitant Orlando dans un match en direct mettant en vedette Lionel Messi. L'équipe cherche à améliorer son bilan en début de saison."
      },
      "de": {
        "title": "Live: Messi und Miami besuchen Orlando auf der Suche nach dem ersten Sieg 2026",
        "summary": "Inter Miami sucht seinen ersten Sieg 2026, während sie Orlando in einem Liveübertragungs-Match mit Lionel Messi besuchen. Das Team möchte seine Bilanz in der frühen Saison verbessern."
      },
      "es": {
        "title": "En vivo: Messi y Miami visitan a Orlando buscando su primer triunfo de 2026",
        "summary": "Inter Miami busca su primer triunfo de 2026 mientras visita a Orlando en un partido en vivo que presenta a Lionel Messi. El equipo busca mejorar su récord de principios de temporada."
      }
    }
  },
  {
    "title": "Follow live: USWNT faces off against Argentina in SheBelieves Cup battle",
    "slug": "uswnt-argentina-shebelieves-cup",
    "url": "https://www.espn.com/soccer/match/_/gameId/401846987/argentina-united-states",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:20:32.000Z",
    "summary": "The USWNT plays Argentina in a SheBelieves Cup match, a key tournament for women's international soccer.",
    "content": "null",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "现场直播：美国女足对阵阿根廷，谢贝利夫杯激战",
        "summary": "美国女足在谢贝利夫杯中与阿根廷对战，这是女子国际足球的关键赛事。"
      },
      "fr": {
        "title": "En direct : L'USWNT affronte l'Argentine dans la bataille de la Coupe SheBelieves",
        "summary": "L'USWNT joue contre l'Argentine dans un match de la Coupe SheBelieves, un tournoi clé pour le soccer féminin international."
      },
      "de": {
        "title": "Live: USWNT trifft in der SheBelieves Cup auf Argentinien",
        "summary": "Die USWNT spielt gegen Argentinien in einem SheBelieves Cup-Spiel, einem wichtigen Turnier für internationalen Frauenfußball."
      },
      "es": {
        "title": "En vivo: USWNT se enfrenta a Argentina en la batalla de la Copa SheBelieves",
        "summary": "La USWNT juega contra Argentina en un partido de la Copa SheBelieves, un torneo clave para el fútbol femenino internacional."
      }
    }
  },
  {
    "title": "Arsenal riding corner kicks to Premier League title; Chelsea's red card problem continues",
    "slug": "arsenal-corner-kicks-chelsea-red-cards",
    "url": "https://www.espn.com/soccer/story/_/id/48073847/arsenal-riding-corner-kicks-premier-league-title-chelsea-red-cards-continue",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:12:47.000Z",
    "summary": "Arsenal is excelling through dominance on corner kicks and maintains the Premier League title lead, while Chelsea continues to struggle with disciplinary issues including multiple red cards.",
    "content": "Arsenal may be the most dominant corner kick team the Premier League has ever seen. Meanwhile, Chelsea keep hurting themselves with red cards.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "阿森纳借助角球优势领跑英超，切尔西红牌问题继续困扰",
        "summary": "阿森纳通过在角球上的主动性取得了英超冠军领先，同时切尔西继续为包括多张红牌在内的纪律问题所困扰。"
      },
      "fr": {
        "title": "Arsenal mène la Premier League grâce à sa domination sur les coups de coin ; le problème des cartons rouges de Chelsea persiste",
        "summary": "Arsenal excelle grâce à sa domination sur les coups de coin et maintient sa place de leader de la Premier League, tandis que Chelsea continue de lutter avec des problèmes de discipline incluant plusieurs cartons rouges."
      },
      "de": {
        "title": "Arsenal führt die Premier League an, dank Dominanz bei Ecken; Chelseas Problem mit roten Karten bleibt bestehen",
        "summary": "Arsenal zeichnet sich durch seine Dominanz bei Eckbällen aus und behält die Führung in der Premier League, während Chelsea weiterhin mit Disziplinarproblemen kämpft, einschließlich mehrerer roter Karten."
      },
      "es": {
        "title": "Arsenal lidera la Premier League gracias al dominio en tiros de esquina; el problema de tarjetas rojas de Chelsea continúa",
        "summary": "Arsenal destaca por su dominio en los saques de esquina y mantiene el liderato de la Premier League, mientras que Chelsea continúa luchando con problemas disciplinarios que incluyen múltiples tarjetas rojas."
      }
    }
  },
  {
    "title": "Iran federation says participation in WC in doubt",
    "slug": "iran-federation-world-cup-participation",
    "url": "https://www.espn.com/soccer/story/_/id/48074546/iran-soccer-federation-world-cup-participation-doubt",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:12:38.000Z",
    "summary": "Iran's soccer federation president questions whether the national team can participate in the World Cup in the United States following recent U.S. and Israeli military action against the country.",
    "content": "The president of Iran's soccer federation says he does not know if the national team can play World Cup matches in the United States following the surprise U.S. and Israeli bombardment of his country.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "伊朗足协表示世界杯参赛前景不明",
        "summary": "伊朗足协主席质疑，在美国和以色列最近对该国的军事行动后，伊朗国家队是否能够参加世界杯比赛。"
      },
      "fr": {
        "title": "La fédération iranienne doute de la participation à la Coupe du monde",
        "summary": "Le président de la fédération iranienne de football remet en question la capacité de l'équipe nationale à participer à la Coupe du monde aux États-Unis suite aux récentes actions militaires américaines et israéliennes contre le pays."
      },
      "de": {
        "title": "Iranischer Verband stellt WM-Teilnahme in Frage",
        "summary": "Der Präsident des iranischen Fußballverbandes zweifelt daran, ob die Nationalmannschaft nach den jüngsten militärischen Aktionen der USA und Israels gegen das Land an der Weltmeisterschaft in den USA teilnehmen kann."
      },
      "es": {
        "title": "Federación iraní cuestiona participación en Copa del Mundo",
        "summary": "El presidente de la federación de fútbol de Irán cuestiona si el equipo nacional puede participar en la Copa del Mundo en Estados Unidos después de las recientes acciones militares estadounidenses e israelíes contra el país."
      }
    }
  },
  {
    "title": "Arteta: 'Heart almost stopped' on late Raya save",
    "slug": "arteta-raya-save-arsenal-chelsea",
    "url": "https://www.espn.com/soccer/story/_/id/48074318/heart-almost-stopped-late-raya-save",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:12:38.000Z",
    "summary": "Arsenal manager Mikel Arteta praised goalkeeper David Raya's crucial late-game save in Arsenal's 2-1 victory over Chelsea, which keeps the team atop the Premier League standings.",
    "content": "Mikel Arteta hailed David Raya's performance in Arsenal's 2-1 win against Chelsea after saying his \"heart almost stopped\" before the goalkeeper made a crucial stoppage time save to keep the Gunners in pole position in the Premier League title race.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "阿尔特塔：\"心脏几乎停止\"拉亚关键扑救",
        "summary": "阿森纳主教练米克尔·阿尔特塔称赞门神大卫·拉亚在阿森纳2-1击败切尔西比赛中关键时刻的精彩扑救，这场胜利使球队保持英超领先位置。"
      },
      "fr": {
        "title": "Arteta : le cœur \"a presque arrêté\" sur l'arrêt décisif de Raya",
        "summary": "Le manager d'Arsenal Mikel Arteta a félicité le gardien David Raya pour son arrêt décisif en fin de match dans la victoire 2-1 d'Arsenal contre Chelsea, qui maintient l'équipe en tête de la Premier League."
      },
      "de": {
        "title": "Arteta: \"Das Herz blieb fast stehen\" bei Rayas entscheidendem Reflex",
        "summary": "Arsenal-Manager Mikel Arteta lobte Torwart David Rayas entscheidenden Reflex in der Schlussphase von Arsenals 2-1-Sieg über Chelsea, der das Team an der Spitze der Premier League hält."
      },
      "es": {
        "title": "Arteta: \"El corazón casi se detiene\" por la crucial parada de Raya",
        "summary": "El manager del Arsenal Mikel Arteta elogió la parada crucial del portero David Raya en los últimos minutos del partido en la victoria 2-1 del Arsenal sobre el Chelsea, que mantiene al equipo en la cima de la Premier League."
      }
    }
  },
  {
    "title": "Late Aubameyang goals lead Marseille past Lyon",
    "slug": "aubameyang-marseille-lyon-comeback",
    "url": "https://www.espn.com/soccer/report/_/gameId/746623",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:12:38.000Z",
    "summary": "Pierre-Emerick Aubameyang scored twice in the final nine minutes to lead Marseille to a dramatic 3-2 comeback victory over Lyon in Ligue 1.",
    "content": "Pierre-Emerick Aubameyang struck twice in the final nine minutes as Marseille came from behind to snatch a dramatic 3-2 win over Lyon in Ligue 1.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "阿布巴梅扬补时进球助马赛战胜里昂",
        "summary": "皮埃尔-埃梅里克·阿布巴梅扬在最后9分钟内连进两球，帮助马赛以3-2逆转战胜法甲对手里昂。"
      },
      "fr": {
        "title": "Les buts tardifs d'Aubameyang permettent à Marseille de battre Lyon",
        "summary": "Pierre-Emerick Aubameyang a marqué deux fois dans les neuf dernières minutes pour mener Marseille à une victoire remarquable 3-2 contre Lyon en Ligue 1."
      },
      "de": {
        "title": "Aubameyangus Spättore führen Marseille zum Sieg über Lyon",
        "summary": "Pierre-Emerick Aubameyang erzielte in den letzten neun Minuten zwei Tore und führte Marseille zu einem dramatischen 3-2-Comeback-Sieg gegen Lyon in der Ligue 1."
      },
      "es": {
        "title": "Goles tardíos de Aubameyang dan victoria a Marsella sobre Lyon",
        "summary": "Pierre-Emerick Aubameyang marcó dos goles en los últimos nueve minutos para llevar al Marsella a una dramática victoria de 3-2 sobre Lyon en la Ligue 1."
      }
    }
  },
  {
    "title": "LaLiga game stopped for anti-racism protocol",
    "slug": "laliga-anti-racism-espanyol-elche",
    "url": "https://www.espn.com/soccer/story/_/id/48076288/espanyol-elche-la-liga-game-stopped-referee-anti-racism-protocol",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:12:38.000Z",
    "summary": "An Espanyol versus Elche LaLiga match ended 2-2 after being briefly paused when the referee activated UEFA's anti-racism protocol.",
    "content": "Espanyol and Elche drew 2-2 on Sunday in a LaLiga match briefly interrupted toward the end after the referee activated the anti-racism protocol.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "西甲比赛因反种族歧视协议中止",
        "summary": "埃斯帕尼奥尔与埃尔切的西甲比赛在裁判启动欧足联反种族歧视协议后短暂暂停，最终以2-2平手结束。"
      },
      "fr": {
        "title": "Match de La Liga suspendu pour le protocole anti-racisme",
        "summary": "Un match de La Liga entre Espanyol et Elche s'est terminé 2-2 après une brève pause lorsque l'arbitre a activé le protocole anti-racisme de l'UEFA."
      },
      "de": {
        "title": "La Liga Spiel wegen Anti-Rassismus-Protokoll unterbrochen",
        "summary": "Ein La Liga Spiel zwischen Espanyol und Elche endete 2-2, nachdem es kurz unterbrochen wurde, als der Schiedsrichter das Anti-Rassismus-Protokoll der UEFA aktivierte."
      },
      "es": {
        "title": "Partido de La Liga detenido por protocolo antirracismo",
        "summary": "Un partido de La Liga entre Espanyol y Elche terminó 2-2 después de una breve pausa cuando el árbitro activó el protocolo antirracismo de la UEFA."
      }
    }
  },
  {
    "title": "Tudor slams 'cheating' Fulham after Spurs loss",
    "slug": "tudor-fulham-tottenham-loss",
    "url": "https://www.espn.com/soccer/story/_/id/48073570/igor-tudor-bemoans-tottenham-problems-says-fulham-cheated",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:12:38.000Z",
    "summary": "Tottenham interim manager Igor Tudor criticized Fulham for \"cheating\" and expressed frustration with his own players following another loss.",
    "content": "Tottenham interim head coach Igor Tudor took aim at his own players before he slammed \"cheating\" Fulham after another defeat.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "图德在热刺失利后抨击富勒姆\"作弊\"",
        "summary": "热刺临时主帅伊戈尔·图德在又一次失利后批评富勒姆\"作弊\"，并对自己的球员表示不满。"
      },
      "fr": {
        "title": "Tudor critique Fulham pour \"triche\" après la défaite de Tottenham",
        "summary": "Le manager intérimaire de Tottenham, Igor Tudor, a critiqué Fulham pour \"tricher\" et a exprimé sa frustration envers ses propres joueurs suite à une nouvelle défaite."
      },
      "de": {
        "title": "Tudor kritisiert Fulham wegen \"Betrug\" nach Spurs-Niederlage",
        "summary": "Tottenams Interimsmanager Igor Tudor kritisierte Fulham wegen \"Betrug\" und drückte seine Frustration über seine eigenen Spieler nach einer weiteren Niederlage aus."
      },
      "es": {
        "title": "Tudor critica a Fulham por \"trampa\" después de la derrota de Spurs",
        "summary": "El entrenador interino del Tottenham, Igor Tudor, criticó a Fulham por \"trampa\" y expresó su frustración con sus propios jugadores después de otra derrota."
      }
    }
  },
  {
    "title": "United got 'Old Trafford bonus' in win - Palace boss",
    "slug": "old-trafford-bonus-manchester-united",
    "url": "https://www.espn.com/soccer/story/_/id/48074032/man-united-got-old-trafford-bonus-win-crystal-palace-oliver-glasner",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:12:37.000Z",
    "summary": "Crystal Palace manager Oliver Glasner criticized the penalty decision that favored Manchester United in their 2-1 victory, claiming it reflects home advantage bias.",
    "content": "Crystal Palace manager Oliver Glasner has branded the decision to award Manchester United a penalty in their 2-1 defeat on Sunday an \"Old Trafford bonus.\"",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "水晶宫主帅：曼联在胜利中得到\"老特拉福德红利\"",
        "summary": "水晶宫主帅奥利弗·格拉斯纳批评了有利于曼联的点球判罚，声称这反映了主场优势偏见，曼联以2-1获胜。"
      },
      "fr": {
        "title": "Boss de Palace : United a bénéficié du \"bonus Old Trafford\" dans leur victoire",
        "summary": "Le manager de Crystal Palace, Oliver Glasner, a critiqué la décision de penalty en faveur de Manchester United dans leur victoire 2-1, affirmant qu'elle reflète un biais d'avantage à domicile."
      },
      "de": {
        "title": "Palace-Chef: United bekam \"Old Trafford Bonus\" im Sieg",
        "summary": "Cristal Palaces Manager Oliver Glasner kritisierte die Elfmeterentscheidung, die Manchester United in ihrem 2-1-Sieg begünstigte, und behauptete, dass dies einen Heimvorteilsbias widerspiegelt."
      },
      "es": {
        "title": "Jefe del Palace: United obtuvo el \"bono Old Trafford\" en la victoria",
        "summary": "El entrenador del Crystal Palace, Oliver Glasner, criticó la decisión de penalti que favoreció a Manchester United en su victoria 2-1, afirmando que refleja un sesgo de ventaja en casa."
      }
    }
  },
  {
    "title": "Infantino calls for red cards for covering mouths",
    "slug": "infantino-red-cards-covering-mouths",
    "url": "https://www.espn.com/soccer/story/_/id/48073911/fifa-boss-gianni-infantino-calls-red-cards-players-cover-mouths",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:12:37.000Z",
    "summary": "FIFA president Gianni Infantino proposes issuing red cards to players who cover their mouths during on-pitch confrontations, a controversial new disciplinary measure.",
    "content": "FIFA president Gianni Infantino has called for players who cover their mouth in on-pitch confrontations to be sent off.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "因凡蒂诺呼吁对遮住嘴巴的球员出示红牌",
        "summary": "FIFA主席詹尼·因凡蒂诺提议对在场上对峙中遮住嘴巴的球员出示红牌，这是一项有争议的新纪律措施。"
      },
      "fr": {
        "title": "Infantino demande des cartons rouges pour avoir couvert la bouche",
        "summary": "Le président de la FIFA, Gianni Infantino, propose d'adresser des cartons rouges aux joueurs qui se couvrent la bouche lors de confrontations sur le terrain, une nouvelle mesure disciplinaire controversée."
      },
      "de": {
        "title": "Infantino fordert Rote Karten für Mundbedeckung",
        "summary": "FIFA-Präsident Gianni Infantino schlägt vor, rote Karten für Spieler auszustellen, die während Konfrontationen auf dem Spielfeld ihre Münder bedecken, eine umstrittene neue Disziplinarmaßnahme."
      },
      "es": {
        "title": "Infantino pide tarjetas rojas por cubrirse la boca",
        "summary": "El presidente de la FIFA, Gianni Infantino, propone emitir tarjetas rojas a los jugadores que se cubran la boca durante enfrentamientos en el campo, una medida disciplinaria nueva y controvertida."
      }
    }
  },
  {
    "title": "'They look all over the shop' - Hart",
    "slug": "tottenham-disorganisation-fulham",
    "url": "https://www.bbc.com/sport/football/videos/c9v0j9kdg0go?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-02T00:11:40.000Z",
    "summary": "Match of the Day pundits analyze how Tottenham's disorganization and poor structure contributed significantly to their 2-1 loss to Fulham.",
    "content": "Match of the Day pundits Leon Osman and Joe Hart look at how Tottenham Hotspur's disorganisation played a big part in their 2-1 defeat against Fulham.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"他们看起来一片混乱\" - 哈特",
        "summary": "每日赛事评论员分析了托特纳姆热刺的混乱和糟糕的结构如何显著导致他们以1:2输给富勒姆。"
      },
      "fr": {
        "title": "\"Ils ont l'air complètement désorganisés\" - Hart",
        "summary": "Les commentateurs de Match of the Day analysent comment la désorganisation et la mauvaise structure de Tottenham ont considérablement contribué à leur défaite 2-1 contre Fulham."
      },
      "de": {
        "title": "\"Sie sehen völlig desorganisiert aus\" - Hart",
        "summary": "Match-of-the-Day-Experten analysieren, wie Tottenhams Desorganisation und schlechte Struktur wesentlich zu ihrer 2:1-Niederlage gegen Fulham beigetragen haben."
      },
      "es": {
        "title": "\"Se ven completamente desorganizados\" - Hart",
        "summary": "Los comentaristas de Match of the Day analizan cómo la desorganización y la mala estructura del Tottenham contribuyeron significativamente a su derrota 2-1 contra el Fulham."
      }
    }
  }
]