[
  {
    "title": "Stunned Inter say Bodo/Glimt 'proved' they belong",
    "slug": "stunned-inter-bodoglimt-proved-they-belong",
    "url": "https://www.espn.com/soccer/story/_/id/48026748/upset-inter-milan-bodo-glimt-proved-belong",
    "source": "ESPN Soccer",
    "date": "2026-02-25T01:50:51.000Z",
    "summary": "Inter Milan was eliminated from the Champions League in a shocking upset, losing 2-1 at home to Bodø/Glimt and 5-2 on aggregate in the playoff round. This is considered one of the biggest surprises in Champions League history, highlighting that smaller clubs can compete at the highest level.",
    "content": "Inter Milan limped out of the Champions League with a disappointing 2-1 loss at home to Bodø/Glimt -- knocked out in the playoff round 5-2 on aggregate -- in what is being labeled as one of the biggest upsets in competition history.",
    "category": "sports"
  },
  {
    "title": "Mexico's Aguirre: Everyone 'safe' for Iceland game",
    "slug": "mexicos-aguirre-everyone-safe-iceland-game",
    "url": "https://www.espn.com/soccer/story/_/id/48027164/mexico-coach-aguirre-everyone-safe-iceland-game",
    "source": "ESPN Soccer",
    "date": "2026-02-25T01:50:50.000Z",
    "summary": "Mexico's coach Javier Aguirre assured players and staff that security measures are in place for an upcoming friendly match against Iceland, following recent concerns stemming from cartel violence in the country. The match is scheduled for Queretaro amid heightened national security tensions.",
    "content": "Mexico coach Javier Aguirre said his federation promised everyone will be safe at a friendly against Iceland in Queretaro this Wednesday amid recent security concerns across the country that emerged after the killing of a powerful cartel leader.",
    "category": "sports"
  },
  {
    "title": "'Bring it on' – Newcastle's message to Chelsea and Barcelona",
    "slug": "bring-it-on-newcastle-s-message-to-chelsea-and-barcelona",
    "url": "https://www.bbc.com/sport/football/articles/cx2j9d6eqpyo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-25T00:12:54.000Z",
    "summary": "Jacob Murphy says Newcastle will relish whoever they face in the Champions League last 16 after progressing via the play-offs.",
    "content": "Jacob Murphy says Newcastle will relish whoever they face in the Champions League last 16 after progressing via the play-offs.",
    "category": "sports"
  }
]