[
  {
    "title": "Title talk 'irrelevant' for Motherwell's Askou",
    "slug": "title-talk-irrelevant-motherwells-askou",
    "url": "https://www.bbc.com/sport/football/articles/cvgj0y475n5o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T18:14:11.000Z",
    "summary": "Motherwell manager Jens Berthel Askou dismissed talk of his team competing for the Scottish Premiership title, calling such discussion \"irrelevant.\" Despite his dismissive comments, questions remain about whether his side has genuine championship aspirations.",
    "content": "Motherwell manager Jens Berthel Askou says talk of his side being in the race to win the Scottish Premiership is \"irrelevant\". But could his side win the league?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "阿斯库称关于母井队争冠的言论\"无关紧要\"",
        "summary": "母井队主教练延斯·贝特赫尔·阿斯库驳斥了关于他的球队争夺苏格兰超级联赛冠军的言论,称这样的讨论\"无关紧要\"。尽管他的驳斥言论,关于该队是否有真正冠军抱负的问题仍然存在。"
      },
      "fr": {
        "title": "Les propos sur le titre sont \"non pertinents\" pour Askou de Motherwell",
        "summary": "Le directeur technique de Motherwell, Jens Berthel Askou, a rejeté les discussions concernant son équipe en lice pour le titre de la Ligue écossaise de premier plan, qualifiant ces débats de \"non pertinents\". Malgré son rejet, il subsiste des questions quant à savoir si son équipe nourrit de véritables ambitions de championnat."
      },
      "de": {
        "title": "Titelgespräche \"irrelevant\" für Motherwells Askou",
        "summary": "Motherwell-Manager Jens Berthel Askou lehnte Diskussionen über sein Team ab, das um den schottischen Premiership-Titel konkurriert, und beschrieb solche Debatten als \"irrelevant\". Trotz seiner ablehnenden Äußerungen bleiben Fragen offen, ob sein Team echte Meisterschaftsambitionen hat."
      },
      "es": {
        "title": "Askou de Motherwell considera \"irrelevante\" hablar del título",
        "summary": "El gerente de Motherwell, Jens Berthel Askou, rechazó las discusiones sobre su equipo compitiendo por el título de la Liga Escocesa Premier, calificando tal debate como \"irrelevante\". A pesar de sus comentarios de rechazo, siguen existiendo preguntas sobre si su equipo tiene verdaderas ambiciones de campeonato."
      }
    }
  },
  {
    "title": "Arsenal's Smith out of Canada squad with concussion",
    "slug": "arsenals-smith-out-canada-squad-concussion",
    "url": "https://www.bbc.com/sport/football/articles/cddnm1ml6vvo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T17:56:26.000Z",
    "summary": "Arsenal forward Olivia Smith has withdrawn from Canada's SheBelieves Cup squad due to a concussion injury. The injury sidelines her from the upcoming international competition.",
    "content": "Arsenal forward Olivia Smith withdraws from the Canada squad for the SheBelieves Cup because of concussion.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "阿森纳前锋史密斯因脑震荡退出加拿大队",
        "summary": "阿森纳前锋奥莉维亚·史密斯因脑震荡伤势退出了加拿大SheBelieves杯球队。这次伤病使她无法参加即将举行的国际赛事。"
      },
      "fr": {
        "title": "Smith d'Arsenal se retire de l'équipe canadienne suite à une commotion cérébrale",
        "summary": "L'attaquante d'Arsenal Olivia Smith s'est retirée de l'équipe de la Coupe SheBelieves du Canada en raison d'une blessure de commotion cérébrale. Cette blessure l'écarte de la prochaine compétition internationale."
      },
      "de": {
        "title": "Arsenals Smith zieht sich aus kanadischem Kader wegen Gehirnerschütterung zurück",
        "summary": "Arsenals Stürmerin Olivia Smith hat sich aufgrund einer Gehirnerschütterungsverletzung aus dem kanadischen SheBelieves-Cup-Kader zurückgezogen. Die Verletzung hindert sie daran, am kommenden internationalen Wettbewerb teilzunehmen."
      },
      "es": {
        "title": "Smith del Arsenal se retira del equipo canadiense por conmoción cerebral",
        "summary": "La delantera del Arsenal Olivia Smith se ha retirado del equipo de la Copa SheBelieves de Canadá debido a una lesión de conmoción cerebral. La lesión la excluye de la próxima competencia internacional."
      }
    }
  },
  {
    "title": "Spurs relegation fight toughest of career - Tudor",
    "slug": "spurs-relegation-fight-toughest-career-tudor",
    "url": "https://www.bbc.com/sport/football/articles/cpw01482189o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T17:54:49.000Z",
    "summary": "Tottenham interim manager Igor Tudor has described the club's battle to avoid Premier League relegation as potentially the most challenging moment of his managerial career. The team faces a significant fight to secure top-flight survival.",
    "content": "Tottenham interim manager Igor Tudor says trying to save the club from Premier League relegation is \"probably\" the toughest challenge of his career.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "图多:热刺保级之战是职业生涯最艰难的时刻",
        "summary": "热刺临时主教练伊戈尔·图多表示,俱乐部为避免英超降级的斗争可能是他职业生涯中最具挑战性的时刻。球队面临着确保顶级联赛生存的重大斗争。"
      },
      "fr": {
        "title": "La lutte contre la relégation de Spurs est la plus difficile de ma carrière - Tudor",
        "summary": "L'entraîneur par intérim de Tottenham, Igor Tudor, a décrit la bataille du club pour éviter la relégation en Premier League comme étant potentiellement le moment le plus difficile de sa carrière d'entraîneur. L'équipe fait face à une lutte importante pour assurer la survie en première division."
      },
      "de": {
        "title": "Spurs' Abstiegskampf ist die schwierigste Zeit meiner Karriere - Tudor",
        "summary": "Tottenhams Interimsmanager Igor Tudor hat den Kampf des Clubs um die Vermeidung des Premier-League-Abstiegs als möglicherweise den schwierigsten Moment seiner Trainerlaufbahn beschrieben. Das Team steht vor einem wichtigen Kampf, um die Teilnahme an der höchsten Liga zu sichern."
      },
      "es": {
        "title": "La lucha del Tottenham por no descender es lo más difícil de mi carrera - Tudor",
        "summary": "El entrenador interino del Tottenham, Igor Tudor, ha descrito la batalla del club para evitar el descenso de la Premier League como posiblemente el momento más desafiante de su carrera como entrenador. El equipo enfrenta una lucha importante para asegurar la supervivencia en la primera división."
      }
    }
  },
  {
    "title": "Brentford boss Andrews signs new deal to 2032",
    "slug": "brentford-boss-andrews-signs-new-deal-2032",
    "url": "https://www.bbc.com/sport/football/articles/czx4097l7gxo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T17:53:56.000Z",
    "summary": "Brentford head coach Keith Andrews has signed a new contract extension with the club that runs through 2032. The deal represents a long-term commitment from both the club and manager.",
    "content": "Brentford head coach Keith Andrews signs a new contract with the club, running until 2032.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "布伦特福德主帅安德鲁斯签署新合约至2032年",
        "summary": "布伦特福德主教练基思·安德鲁斯与俱乐部签署了新的合同延期，合同期限至2032年。该协议代表了俱乐部和主教练双方的长期承诺。"
      },
      "fr": {
        "title": "Le patron de Brentford Andrews signe un nouveau contrat jusqu'en 2032",
        "summary": "L'entraîneur-chef de Brentford Keith Andrews a signé une nouvelle extension de contrat avec le club qui s'étend jusqu'en 2032. L'accord représente un engagement à long terme de la part du club et de l'entraîneur."
      },
      "de": {
        "title": "Brentfords Chef Andrews unterzeichnet neuen Vertrag bis 2032",
        "summary": "Der Cheftrainer von Brentford Keith Andrews hat eine neue Vertragsverlängerung mit dem Verein unterzeichnet, die bis 2032 läuft. Das Abkommen stellt ein langfristiges Engagement sowohl des Vereins als auch des Trainers dar."
      },
      "es": {
        "title": "El jefe de Brentford Andrews firma nuevo contrato hasta 2032",
        "summary": "El entrenador jefe de Brentford Keith Andrews ha firmado una nueva extensión de contrato con el club que se extiende hasta 2032. El acuerdo representa un compromiso a largo plazo tanto del club como del entrenador."
      }
    }
  },
  {
    "title": "How have Chelsea made biggest loss in English football history?",
    "slug": "chelsea-biggest-loss-english-football-history",
    "url": "https://www.bbc.com/sport/football/articles/crrxjyk54zpo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T17:36:38.000Z",
    "summary": "Chelsea recorded a pre-tax loss of £355 million for 2024-25, marking the largest loss ever recorded by an English football club according to UEFA financial figures. The massive financial setback raises questions about the club's recent investment and operational decisions.",
    "content": "Chelsea recorded a pre-tax loss of £355m for 2024-25 - the highest loss ever made by an English football club - according to financial figures released by Uefa. How did it happen?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "切尔西如何创造英格兰足球历史上最大亏损？",
        "summary": "切尔西在2024-25赛季税前亏损3.55亿英镑，创造了英格兰足球俱乐部有史以来最大亏损纪录（根据欧足联财务数据）。这一巨大的财务挫折引发了人们对该俱乐部近期投资和运营决策的质疑。"
      },
      "fr": {
        "title": "Comment Chelsea a-t-elle enregistré la plus grosse perte de l'histoire du football anglais ?",
        "summary": "Chelsea a enregistré une perte avant impôt de 355 millions de livres sterling pour 2024-25, marquant la plus grande perte jamais enregistrée par un club de football anglais selon les chiffres financiers de l'UEFA. Ce revers financier massif soulève des questions sur les investissements récents et les décisions opérationnelles du club."
      },
      "de": {
        "title": "Wie hat Chelsea den größten Verlust in der Geschichte des englischen Fußballs gemacht?",
        "summary": "Chelsea verzeichnete einen Vorsteuerverlust von 355 Millionen Pfund für 2024-25 und markiert damit den größten Verlust, der von einem englischen Fußballclub gemäß UEFA-Finanzzahlen verzeichnet wurde. Der massive finanzielle Rückschlag wirft Fragen zu den jüngsten Investitionen und Betriebsentscheidungen des Clubs auf."
      },
      "es": {
        "title": "¿Cómo ha hecho Chelsea la mayor pérdida en la historia del fútbol inglés?",
        "summary": "Chelsea registró una pérdida antes de impuestos de 355 millones de libras esterlinas para 2024-25, marcando la mayor pérdida jamás registrada por un club de fútbol inglés según las cifras financieras de la UEFA. Este revés financiero masivo plantea preguntas sobre las inversiones recientes y las decisiones operativas del club."
      }
    }
  },
  {
    "title": "Klopp's job at risk? 'Nonsense,' says Red Bull",
    "slug": "klopps-job-risk-nonsense-says-red-bull",
    "url": "https://www.espn.com/soccer/story/_/id/48044174/red-bull-jurgen-klopp-global-soccer-job",
    "source": "ESPN Soccer",
    "date": "2026-02-26T17:29:00.000Z",
    "summary": "Red Bull dismissed media reports suggesting Jürgen Klopp's position as the company's global soccer chief could be under threat, backing the former Liverpool manager to continue in his role. The drinks giant expressed confidence in Klopp despite speculation after less than a year on the job.",
    "content": "Red Bull backed former Liverpool manager Jürgen Klopp to remain the drinks giant's head of global soccer and dismissed a media report that his job could be under threat after barely a year.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "克洛普的工作有危险？红牛说\"这是胡说八道\"",
        "summary": "红牛否认了关于尤尔根·克洛普作为该公司全球足球主管职位可能受到威胁的媒体报道，支持这位前利物浦主教练继续担任该职务。尽管在该职位上不到一年后出现了猜测，但这家饮料巨头表示对克洛普充满信心。"
      },
      "fr": {
        "title": "L'emploi de Klopp est-il en danger ? « N'importe quoi », dit Red Bull",
        "summary": "Red Bull a rejeté les rapports médiatiques suggérant que la position de Jürgen Klopp en tant que chef du soccer mondial de l'entreprise pourrait être menacée, soutenant l'ancien entraîneur de Liverpool pour continuer dans son rôle. Le géant des boissons a exprimé sa confiance en Klopp malgré les spéculations après moins d'un an au poste."
      },
      "de": {
        "title": "Klupps Arbeitsplatz in Gefahr? „Unsinn\", sagt Red Bull",
        "summary": "Red Bull wies Medienberichte zurück, die darauf hindeuteten, dass Jürgen Klupps Position als globaler Fußballchef des Unternehmens gefährdet sein könnte, und unterstützte den ehemaligen Liverpool-Trainer bei der Fortsetzung seiner Rolle. Der Getränkeriese äußerte Vertrauen in Klupp trotz Spekulationen nach weniger als einem Jahr in der Position."
      },
      "es": {
        "title": "¿El trabajo de Klopp en peligro? 'Disparate', dice Red Bull",
        "summary": "Red Bull desestimó los reportes de medios que sugieren que la posición de Jürgen Klopp como jefe de fútbol global de la empresa podría estar en peligro, respaldando al ex entrenador del Liverpool para continuar en su rol. El gigante de las bebidas expresó confianza en Klopp a pesar de las especulaciones después de menos de un año en el cargo."
      }
    }
  },
  {
    "title": "Tudor: Spurs job biggest challenge of my career",
    "slug": "tudor-spurs-job-biggest-challenge-career",
    "url": "https://www.espn.com/soccer/story/_/id/48043859/igor-tudor-tottenham-job-biggest-challenge-career-premier-league",
    "source": "ESPN Soccer",
    "date": "2026-02-26T17:29:00.000Z",
    "summary": "Tottenham interim head coach Igor Tudor acknowledged that managing the club through its current struggles represents the biggest challenge of his career. The role tests his abilities as the team fights to avoid relegation.",
    "content": "Tottenham interim head coach Igor Tudor has acknowledged this current job is the biggest challenge of his career.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "图多：执教热刺是我职业生涯最大的挑战",
        "summary": "托特纳姆热刺临时主教练伊戈尔·图多承认，通过球队目前的困难时期管理俱乐部代表了他职业生涯中最大的挑战。这个角色考验了他的能力，因为球队正在努力避免降级。"
      },
      "fr": {
        "title": "Tudor : L'emploi à Spurs est le plus grand défi de ma carrière",
        "summary": "L'entraîneur intérimaire de Tottenham Igor Tudor a reconnu que diriger le club à travers ses difficultés actuelles représente le plus grand défi de sa carrière. Le rôle teste ses capacités alors que l'équipe lutte pour éviter la relégation."
      },
      "de": {
        "title": "Tudor: Spurs-Job ist die größte Herausforderung meiner Karriere",
        "summary": "Tottenhaums Interimstrainer Igor Tudor bestätigte, dass die Verwaltung des Clubs während seiner derzeitigen Schwierigkeiten die größte Herausforderung seiner Karriere darstellt. Die Rolle testet seine Fähigkeiten, während das Team um den Abstieg kämpft."
      },
      "es": {
        "title": "Tudor: El trabajo en Spurs es el mayor desafío de mi carrera",
        "summary": "El entrenador interino del Tottenham Igor Tudor reconoció que dirigir al club a través de sus dificultades actuales representa el mayor desafío de su carrera. El rol pone a prueba sus habilidades mientras el equipo lucha por evitar el descenso."
      }
    }
  },
  {
    "title": "Mascherano: Miami to use whole squad in friendly",
    "slug": "mascherano-miami-whole-squad-friendly",
    "url": "https://www.espn.com/soccer/story/_/id/48043958/inter-miami-javier-mascherano-lionel-messi-puerto-rico-independiente-del-valle",
    "source": "ESPN Soccer",
    "date": "2026-02-26T17:29:00.000Z",
    "summary": "Inter Miami head coach Javier Mascherano confirmed the team will use an upcoming friendly match against Independiente del Valle to provide playing time for all squad members. The fixture offers valuable preparation time for the squad.",
    "content": "Inter Miami head coach Javier Mascherano confirmed he'll use the friendly against Independiente del Valle on Thursday night as an opportunity to give all players some minutes on the field.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "马斯切拉诺：迈阿密将在友谊赛中使用全队",
        "summary": "国际迈阿密主教练哈维尔·马斯切拉诺确认，球队将在即将到来的与独立特谷队的友谊赛中为所有球队成员提供出场时间。这场比赛为球队提供了宝贵的准备时间。"
      },
      "fr": {
        "title": "Mascherano : Miami utilisera tout l'effectif en amical",
        "summary": "L'entraîneur d'Inter Miami Javier Mascherano a confirmé que l'équipe utiliserait un prochain match amical contre Independiente del Valle pour donner du temps de jeu à tous les membres de l'effectif. Le match offre un temps de préparation précieux pour l'équipe."
      },
      "de": {
        "title": "Mascherano: Miami wird ganzen Kader im Freundschaftsspiel einsetzen",
        "summary": "Inter Miamis Trainer Javier Mascherano bestätigte, dass das Team in einem bevorstehenden Freundschaftsspiel gegen Independiente del Valle allen Spielern Spielzeit geben wird. Das Spiel bietet wertvolle Vorbereitungszeit für das Team."
      },
      "es": {
        "title": "Mascherano: Miami usará todo el equipo en amistoso",
        "summary": "El entrenador de Inter Miami Javier Mascherano confirmó que el equipo utilizará un próximo amistoso contra Independiente del Valle para dar tiempo de juego a todos los miembros de la plantilla. El partido ofrece un valioso tiempo de preparación para el equipo."
      }
    }
  },
  {
    "title": "Edwards and Le Bris condemn racist abuse of players",
    "slug": "edwards-le-bris-condemn-racist-abuse-players",
    "url": "https://www.bbc.com/sport/football/articles/cp81wgjx9ejo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T17:24:46.000Z",
    "summary": "Wolves manager Rob Edwards and Sunderland manager Regis Le Bris have condemned the racist abuse their players experienced during matches last weekend. Both managers addressed the unacceptable behavior directed at their players.",
    "content": "Wolves manager Rob Edwards and Sunderland counterpart Regis Le Bris condemn the racist abuse their players suffered last weekend.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "爱德华兹和勒布里斯谴责对球员的种族歧视辱骂",
        "summary": "狼队经理罗伯·爱德华兹和桑德兰经理雷吉斯·勒布里斯谴责了他们的球员在上周末比赛中遭受的种族歧视辱骂。两位经理都谈及了针对他们球员的不可接受的行为。"
      },
      "fr": {
        "title": "Edwards et Le Bris condamnent les abus racistes contre les joueurs",
        "summary": "Le manager de Wolves Rob Edwards et le manager de Sunderland Regis Le Bris ont condamné les abus racistes que leurs joueurs ont subis lors des matchs du week-end dernier. Les deux managers ont abordé le comportement inacceptable dirigé contre leurs joueurs."
      },
      "de": {
        "title": "Edwards und Le Bris verurteilen rassistische Beleidigungen gegen Spieler",
        "summary": "Wolves-Manager Rob Edwards und Sunderland-Manager Regis Le Bris haben die rassistischen Beleidigungen verurteilt, die ihre Spieler bei Spielen am letzten Wochenende erlebten. Beide Manager sprachen sich gegen das inakzeptable Verhalten gegen ihre Spieler aus."
      },
      "es": {
        "title": "Edwards y Le Bris condenan abuso racista de jugadores",
        "summary": "El manager de Wolves Rob Edwards y el manager de Sunderland Regis Le Bris han condenado el abuso racista que sus jugadores experimentaron durante los partidos del fin de semana pasado. Ambos managers abordaron el comportamiento inaceptable dirigido a sus jugadores."
      }
    }
  },
  {
    "title": "'Easy from afar' - no Foxes flak for Rowett comments",
    "slug": "easy-afar-no-foxes-flak-rowett-comments",
    "url": "https://www.bbc.com/sport/football/articles/cyv96rgy48po?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T17:07:14.000Z",
    "summary": "Gary Rowett stated he has not faced any issues with Leicester's hierarchy regarding critical comments he made about the club shortly before his recent appointment. The manager indicated his previous criticism has not caused friction internally.",
    "content": "Gary Rowett says he has not had to clear the air with Leicester's hierarchy about criticism he aimed their way just weeks before his appointment.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"远方轻而易举\" - 莱斯特城对罗韦特评论无异议",
        "summary": "加里·罗韦特表示，他没有因在最近任命前对俱乐部的批评性评论而与莱斯特城管理层产生问题。这位经理表示，他之前的批评没有在内部造成摩擦。"
      },
      "fr": {
        "title": "\"Facile de loin\" - Pas de critique des Foxes pour les commentaires de Rowett",
        "summary": "Gary Rowett a déclaré qu'il n'avait pas eu de problèmes avec la direction de Leicester concernant les commentaires critiques qu'il a faits sur le club peu de temps avant sa nomination récente. Le manager a indiqué que ses critiques précédentes n'ont pas causé de friction en interne."
      },
      "de": {
        "title": "\"Leicht von fern\" - Keine Kritik der Foxes an Rowetts Kommentaren",
        "summary": "Gary Rowett gab an, dass er keine Probleme mit der Leicester-Führung bezüglich der kritischen Kommentare hatte, die er über den Klub kurz vor seiner kürzlichen Ernennung machte. Der Manager deutete an, dass seine vorherige Kritik keine inneren Spannungen verursacht hat."
      },
      "es": {
        "title": "\"Fácil desde lejos\" - Sin críticas de Foxes para los comentarios de Rowett",
        "summary": "Gary Rowett afirmó que no ha enfrentado problemas con la jerarquía del Leicester respecto a los comentarios críticos que hizo sobre el club poco antes de su reciente nombramiento. El gerente indicó que su crítica anterior no ha causado fricción internamente."
      }
    }
  },
  {
    "title": "Fans of richest PL clubs pay £74 per match as ticket revenue soars",
    "slug": "fans-richest-pl-clubs-pay-74-per-match",
    "url": "https://www.bbc.com/sport/articles/c2lrxyw4p02o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T16:35:02.000Z",
    "summary": "According to a new report, fans of the Premier League's six wealthiest clubs are paying an average of £74 per ticket while ticket revenue reaches record levels. The data highlights the financial burden on supporters of top clubs as revenues continue to climb.",
    "content": "Fans of the Premier League's six wealthiest clubs are paying an average of £74 per ticket for each match they attend, while ticket revenues are soaring, according to data from a new report.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "英超最富有俱乐部的球迷每场比赛支付74英镑，门票收入激增",
        "summary": "根据一份新报告，英超六家最富有俱乐部的球迷每张票平均支付74英镑，而门票收入达到创纪录水平。该数据突显了顶级俱乐部支持者在收入持续攀升的情况下的财务负担。"
      },
      "fr": {
        "title": "Les fans des clubs PL les plus riches payent 74 £ par match alors que les revenus de billets montent en flèche",
        "summary": "Selon un nouveau rapport, les fans des six clubs de la Premier League les plus riches paient en moyenne 74 £ par billet tandis que les revenus des billets atteignent des niveaux record. Les données mettent en évidence le fardeau financier pour les supporters des meilleurs clubs alors que les revenus continuent d'augmenter."
      },
      "de": {
        "title": "Fans der reichsten PL-Clubs zahlen £74 pro Spiel, da die Ticketeinnahmen in die Höhe schnellen",
        "summary": "Nach einem neuen Bericht zahlen Fans der sechs reichsten Premier-League-Clubs durchschnittlich £74 pro Karte, während die Ticketeinnahmen Rekordhöhen erreichen. Die Daten verdeutlichen die finanzielle Belastung für Anhänger von Top-Clubs, da die Einnahmen weiter steigen."
      },
      "es": {
        "title": "Los aficionados de los clubes de la PL más ricos pagan £74 por partido mientras los ingresos de entradas se disparan",
        "summary": "Según un nuevo informe, los aficionados de los seis clubes de la Premier League más ricos están pagando un promedio de £74 por entrada mientras que los ingresos de entradas alcanzan niveles récord. Los datos destacan la carga financiera en los aficionados de los principales clubes mientras que los ingresos continúan aumentando."
      }
    }
  },
  {
    "title": "Why is it all going wrong at Walsall again?",
    "slug": "why-all-going-wrong-walsall-again",
    "url": "https://www.bbc.com/sport/football/articles/c7479gl8xd0o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T16:31:47.000Z",
    "summary": "Walsall faces another season of turmoil marked by a divided fanbase, tactical questions, and their lack of a home victory since Boxing Day. The club's struggles reflect broader challenges in its recent performances and direction.",
    "content": "A split fanbase, questions over style of play and no home win since Boxing Day, it has become another winter of discontent at Walsall.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "为什么沃尔索尔又陷入困境？",
        "summary": "沃尔索尔面临另一个赛季的混乱，其特点是球迷分裂、战术问题以及自圣诞节以来没有取得主场胜利。俱乐部的困境反映了其最近表现和方向中的广泛挑战。"
      },
      "fr": {
        "title": "Pourquoi tout va mal à Walsall à nouveau ?",
        "summary": "Walsall fait face à une autre saison de chaos marquée par un groupe de supporters divisé, des questions tactiques, et l'absence de victoire à domicile depuis le jour de Noël. Les difficultés du club reflètent des défis plus larges dans ses performances récentes et sa direction."
      },
      "de": {
        "title": "Warum läuft es bei Walsall schon wieder falsch?",
        "summary": "Walsall steht vor einer weiteren Saison voller Turbulenzen, gekennzeichnet durch eine gespaltene Fanbasis, taktische Fragen und dem Fehlen eines Heimsiegs seit Weihnachten. Die Probleme des Clubs spiegeln umfassendere Herausforderungen in seinen jüngsten Leistungen und seiner Ausrichtung wider."
      },
      "es": {
        "title": "¿Por qué vuelve a ir todo mal en Walsall?",
        "summary": "Walsall enfrenta otra temporada de turbulencia marcada por una afición dividida, cuestionamientos tácticos y la falta de una victoria en casa desde el Día de Boxeo. Las dificultades del club reflejan desafíos más amplios en su desempeño reciente y dirección."
      }
    }
  },
  {
    "title": "Handling of Man City case damaging for Premier League - Tebas",
    "slug": "handling-man-city-case-damaging-premier-league",
    "url": "https://www.bbc.com/sport/football/articles/c62dny013zno?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T16:30:55.000Z",
    "summary": "La Liga president Javier Tebas argues that the Premier League's handling of the ongoing case against Manchester City has damaged the league's credibility. The lengthy legal process without resolution continues to affect perceptions of English football's governance.",
    "content": "The Premier League has been \"damaged\" by the fact there is yet to be a verdict in the case against Man City, says Javier Tebas.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "曼城案件处理对英超造成伤害 - 特巴斯",
        "summary": "西甲主席哈维尔·特巴斯辩称，英超对曼城案件的处理损害了英超的公信力。这个旷日持久的法律程序缺乏解决方案，继续影响对英超足球治理的认知。"
      },
      "fr": {
        "title": "Le traitement de l'affaire Manchester City endommage la Premier League - Tebas",
        "summary": "Le président de La Liga, Javier Tebas, soutient que la gestion par la Premier League du dossier en cours contre Manchester City a endommagé la crédibilité de la ligue. Le long processus juridique sans résolution continue d'affecter les perceptions sur la gouvernance du football anglais."
      },
      "de": {
        "title": "Der Umgang mit dem Manchester-City-Fall schadet der Premier League - Tebas",
        "summary": "La Liga-Präsident Javier Tebas argumentiert, dass die Handhabung des laufenden Falls gegen Manchester City durch die Premier League die Glaubwürdigkeit der Liga beschädigt hat. Das langwierige Rechtsverfahren ohne Lösung beeinträchtigt weiterhin die Wahrnehmung der Verwaltung des englischen Fußballs."
      },
      "es": {
        "title": "El manejo del caso del Manchester City daña la Premier League - Tebas",
        "summary": "El presidente de La Liga, Javier Tebas, argumenta que el manejo de la Premier League del caso en curso contra el Manchester City ha dañado la credibilidad de la liga. El prolongado proceso legal sin resolución sigue afectando las percepciones sobre la gobernanza del fútbol inglés."
      }
    }
  },
  {
    "title": "Ranking all 18 new NWSL team jerseys: The good, bad and ugly",
    "slug": "ranking-all-18-new-nwsl-team-jerseys",
    "url": "https://www.espn.com/soccer/story/_/id/48035838/ranking-all-18-new-nwsl-team-2026-jerseys-photo-gallery",
    "source": "ESPN Soccer",
    "date": "2026-02-26T16:28:54.000Z",
    "summary": "With a new NWSL season underway, all 18 teams have unveiled fresh kit designs for 2026. The article ranks the new jerseys from the most mundane to the most visually striking.",
    "content": "A new NWSL season means one thing: New kits! Here are all 18 new jerseys for 2026, ranked from boring to beautiful.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "排名所有18支新女足职业联赛球队球衣：好的、坏的和丑的",
        "summary": "随着新一赛季女足职业联赛的开始，所有18支球队都为2026年推出了全新的球衣设计。这篇文章将新球衣从最平凡的到最引人注目的进行了排名。"
      },
      "fr": {
        "title": "Classement de tous les 18 nouveaux maillots des équipes NWSL : les bons, les mauvais et les horribles",
        "summary": "Avec une nouvelle saison de la NWSL en cours, les 18 équipes ont dévoilé de nouveaux designs de kit pour 2026. L'article classe les nouveaux maillots du plus banal au plus visuellement frappant."
      },
      "de": {
        "title": "Ranking aller 18 neuen NWSL-Team-Trikots: Das Gute, das Schlechte und das Hässliche",
        "summary": "Mit einer neuen NWSL-Saison haben alle 18 Teams frische Kitdesigns für 2026 enthüllt. Der Artikel ordnet die neuen Trikots vom Gewöhnlichsten bis zum visuell am meisten fesselnd."
      },
      "es": {
        "title": "Clasificación de los 18 nuevos uniformes de equipos de la NWSL: Lo bueno, lo malo y lo feo",
        "summary": "Con la nueva temporada de la NWSL en marcha, los 18 equipos han presentado nuevos diseños de uniforme para 2026. El artículo clasifica los nuevos uniformes desde los más mundanos hasta los más visualmente impactantes."
      }
    }
  },
  {
    "title": "Antonio set to join Qatar's Al‑Sailiya after Charlton talks",
    "slug": "antonio-set-join-qatars-al-sailiya-charlton",
    "url": "https://www.bbc.com/sport/football/articles/cn4gwqn8p05o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T16:24:17.000Z",
    "summary": "Michail Antonio is preparing to sign a short-term contract with Qatari club Al-Sailiya as he returns to professional football following his recovery from a near-fatal car crash. The move marks an important step in his comeback to competitive play.",
    "content": "Michail Antonio is set to sign a short-term deal with Qatari club Al‑Sailiya before his return to club football following a near-fatal car crash.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "安东尼将在查尔顿谈判后加入卡塔尔阿尔赛利亚",
        "summary": "米卡埃尔·安东尼正准备与卡塔尔俱乐部阿尔赛利亚签署短期合同，在从一场近致命的车祸恢复后重返职业足球。这次转会标志着他职业生涯复出的重要一步。"
      },
      "fr": {
        "title": "Antonio sur le point de rejoindre l'Al-Sailiya du Qatar après les pourparlers de Charlton",
        "summary": "Michail Antonio s'apprête à signer un contrat à court terme avec le club qatari Al-Sailiya alors qu'il fait son retour au football professionnel suite à sa récupération d'un accident automobile quasi mortel. Ce transfert marque une étape importante dans son retour à la compétition."
      },
      "de": {
        "title": "Antonio wird Katars Al-Sailiya beitreten nach Charlton-Gesprächen",
        "summary": "Michail Antonio bereitet sich darauf vor, einen kurzfristigen Vertrag mit dem katarischen Verein Al-Sailiya zu unterzeichnen, während er nach seiner Genesung von einem fast tödlichen Autounfall zum Profifußball zurückkehrt. Der Transfer markiert einen wichtigen Schritt in seinem Comeback zum Wettkampfspiel."
      },
      "es": {
        "title": "Antonio se unirá a Al-Sailiya de Qatar después de las conversaciones de Charlton",
        "summary": "Michail Antonio se prepara para firmar un contrato a corto plazo con el club qatarí Al-Sailiya mientras regresa al fútbol profesional tras su recuperación de un accidente automovilístico casi mortal. Este movimiento marca un paso importante en su regreso al fútbol competitivo."
      }
    }
  },
  {
    "title": "A 'normal guy' doing 'brilliant' things - Lammens on life at Man Utd",
    "slug": "lammens-on-life-at-man-utd",
    "url": "https://www.bbc.com/sport/football/articles/cx2l01g40ygo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T12:00:31.000Z",
    "summary": "Senne Lammens, Manchester United's goalkeeper, describes himself as a normal guy despite growing recognition for an impressive debut season at Old Trafford. His strong performances have established him as a key player for the club this season.",
    "content": "Manchester United goalkeeper Senne Lammens says he is \"just a normal guy\", but his reputation is growing after an impressive debut season at Old Trafford.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "一个\"普通人\"做着\"出色\"的事——拉默斯在曼联的生活",
        "summary": "曼联门神塞内·拉默斯称自己是个普通人，尽管他在老特拉福德的首赛季表现令人印象深刻，获得越来越多的认可。他出色的表现使他成为本赛季俱乐部的关键球员。"
      },
      "fr": {
        "title": "Un \"gars normal\" qui fait des choses \"brillantes\" - Lammens sur la vie à Man Utd",
        "summary": "Senne Lammens, gardien de Manchester United, se décrit comme un gars normal malgré la reconnaissance croissante de sa saison de débuts impressionnante à Old Trafford. Ses performances solides l'ont établi comme joueur clé du club cette saison."
      },
      "de": {
        "title": "Ein \"normaler Kerl\" macht \"brillante\" Dinge - Lammens über sein Leben bei Man Utd",
        "summary": "Senne Lammens, Torwart von Manchester United, beschreibt sich selbst als normaler Kerl, trotz wachsender Anerkennung für eine beeindruckende Debütsaison auf Old Trafford. Seine starken Leistungen haben ihn als Schlüsselspieler des Clubs in dieser Saison etabliert."
      },
      "es": {
        "title": "Un \"tipo normal\" haciendo cosas \"brillantes\" - Lammens habla sobre la vida en el Manchester United",
        "summary": "Senne Lammens, portero del Manchester United, se describe a sí mismo como un tipo normal a pesar del creciente reconocimiento por su impresionante temporada de debut en Old Trafford. Sus excelentes actuaciones lo han establecido como un jugador clave para el club esta temporada."
      }
    }
  },
  {
    "title": "Ronaldo becomes co-owner of Spanish side Almeria",
    "slug": "ronaldo-becomes-co-owner-almeria",
    "url": "https://www.bbc.com/sport/football/articles/c39wry03jvmo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T11:25:43.000Z",
    "summary": "Cristiano Ronaldo has acquired a 25% ownership stake in Spanish second division club UD Almeria, becoming a co-owner of the Saudi Arabian-owned club. This investment expands Ronaldo's football business portfolio beyond his playing career.",
    "content": "Cristiano Ronaldo becomes part-owner of Spanish second division side Almeria after acquiring a 25% share in the Saudi Arabian-owned club.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "罗纳尔多成为西班牙阿尔梅里亚俱乐部的共同所有人",
        "summary": "克里斯蒂亚诺·罗纳尔多已收购西班牙第二级别俱乐部乌迪内斯·阿尔梅里亚25%的所有权份额，成为这家沙特阿拉伯所有俱乐部的共同所有人。这项投资扩展了罗纳尔多的足球商业投资组合，超越了他的职业球员生涯。"
      },
      "fr": {
        "title": "Ronaldo devient copropriétaire du club espagnol Almeria",
        "summary": "Cristiano Ronaldo a acquis une participation de 25% dans le club de deuxième division espagnole UD Almeria, devenant copropriétaire du club détenu par l'Arabie saoudite. Cet investissement élargit le portefeuille commercial du football de Ronaldo au-delà de sa carrière de joueur."
      },
      "de": {
        "title": "Ronaldo wird Miteigentümer des spanischen Clubs Almeria",
        "summary": "Cristiano Ronaldo hat sich einen 25%igen Eigentumsanteil am spanischen Zweitdivisions-Club UD Almeria gesichert und ist damit Miteigentümer des von Saudi-Arabien kontrollierten Clubs geworden. Diese Investition erweitert Ronaldos Geschäftsportfolio im Fußball über seine Spielerkarriere hinaus."
      },
      "es": {
        "title": "Ronaldo se convierte en copropietario del club español Almeria",
        "summary": "Cristiano Ronaldo ha adquirido una participación del 25% en el club de segunda división española UD Almería, convirtiéndose en copropietario del club propiedad de Arabia Saudita. Esta inversión amplía la cartera comercial de fútbol de Ronaldo más allá de su carrera como jugador."
      }
    }
  },
  {
    "title": "Wrexham urged to 'appreciate' top six challenge",
    "slug": "wrexham-urged-appreciate-top-six-challenge",
    "url": "https://www.bbc.com/sport/football/articles/cev7zlgmr1do?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T11:19:47.000Z",
    "summary": "Manager Phil Parkinson is encouraging Wrexham players to embrace the challenge ahead as they push toward the Championship play-offs in the season's final stretch. The team remains focused on securing a position in the crucial end-of-season run-in.",
    "content": "Phil Parkinson has urged his Wrexham players to \"appreciate\" the challenge of their Championship play-off push as the regular season edges towards the crucial run-in.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "雷克瑟姆被敦促\"珍惜\"前六名的挑战",
        "summary": "主教练菲尔·帕金森正在鼓励雷克瑟姆球员欢迎即将到来的挑战，因为他们朝着英冠附加赛推进，进入赛季的最后阶段。球队保持专注，确保在关键的赛季末期获得一席之地。"
      },
      "fr": {
        "title": "Wrexham exhortée à \"apprécier\" le défi du top six",
        "summary": "Le gestionnaire Phil Parkinson encourage les joueurs de Wrexham à adopter le défi à venir alors qu'ils se dirigent vers les barrages du Championnat dans la dernière étape de la saison. L'équipe reste concentrée sur la sécurisation d'une position dans la course cruciale de fin de saison."
      },
      "de": {
        "title": "Wrexham aufgefordert, \"Wertschätzung\" für die Top-Six-Herausforderung zu zeigen",
        "summary": "Manager Phil Parkinson ermutigt die Wrexham-Spieler, sich der bevorstehenden Herausforderung zu stellen, während sie sich den Meisterschafts-Play-offs in der Zielgeraden der Saison nähern. Das Team bleibt konzentriert darauf, sich einen Platz in der entscheidenden Endphase der Saison zu sichern."
      },
      "es": {
        "title": "Wrexham insta a \"apreciar\" el desafío de los seis primeros",
        "summary": "El entrenador Phil Parkinson está animando a los jugadores del Wrexham a aprovechar el desafío que se avecina mientras avanzan hacia los playoffs del Campeonato en la recta final de la temporada. El equipo se mantiene enfocado en asegurar una posición en la crucial carrera de final de temporada."
      }
    }
  },
  {
    "title": "Ronaldo buys 25% stake in Spanish club Almeria",
    "slug": "ronaldo-buys-25-stake-almeria",
    "url": "https://www.espn.com/soccer/story/_/id/48041207/cristiano-ronaldo-purchases-25-stake-spanish-club-almeria",
    "source": "ESPN Soccer",
    "date": "2026-02-26T10:26:43.000Z",
    "summary": "Cristiano Ronaldo has purchased a 25% ownership stake in Spanish second division club UD Almeria. This represents another significant business venture for the football superstar.",
    "content": "Cristiano Ronaldo has acquired a 25% ownership stake in Spanish second division club UD Almeria.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "罗纳尔多收购西班牙俱乐部阿美尼亚25%股份",
        "summary": "克里斯蒂亚诺·罗纳尔多已收购西班牙乙级俱乐部阿美尼亚队25%的所有权。这代表了这位足球巨星的又一重要商业投资。"
      },
      "fr": {
        "title": "Ronaldo achète une participation de 25% au club espagnol Almería",
        "summary": "Cristiano Ronaldo a acquis une participation de 25% dans le club de deuxième division espagnol UD Almería. Cela représente une autre venture commerciale importante pour la superstar du football."
      },
      "de": {
        "title": "Ronaldo kauft 25% Anteil am spanischen Club Almería",
        "summary": "Cristiano Ronaldo hat einen 25%igen Eigentumsanteil am spanischen Zweitliga-Club UD Almería erworben. Dies stellt ein weiteres wichtiges Geschäftsunternehmen für den Fußballstar dar."
      },
      "es": {
        "title": "Ronaldo compra una participación del 25% en el club español Almería",
        "summary": "Cristiano Ronaldo ha adquirido una participación del 25% en el club de segunda división española UD Almería. Esto representa otro importante negocio para la superestrella del fútbol."
      }
    }
  },
  {
    "title": "Tchouaméni: Prestianni suspension 'victory' for all",
    "slug": "tchoaumeni-prestianni-suspension-victory",
    "url": "https://www.espn.com/soccer/story/_/id/48040942/real-madrid-aurelien-tchouameni-gianluca-prestianni-suspension-victory-all-us",
    "source": "ESPN Soccer",
    "date": "2026-02-26T10:26:29.000Z",
    "summary": "Real Madrid midfielder Aurélien Tchouaméni praised the absence of Benfica's Gianluca Prestianni from their Champions League clash at the Bernabéu as a positive outcome for competitive fairness. The suspension was viewed as important for balance in the fixture.",
    "content": "Real Madrid midfielder Aurélien Tchouaméni believes it was a \"victory for all of us\" that Benfica's Gianluca Prestianni did not feature in Wednesday's Champions League game at the Bernabéu stadium.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "特库埃梅尼：普雷斯蒂安尼禁赛是所有人的\"胜利\"",
        "summary": "皇马中场球员奥雷连·特库埃梅尼赞扬本菲卡选手吉安卢卡·普雷斯蒂安尼缺席他们在伯纳乌的欧冠对阵，认为这是竞争公平的积极结果。禁赛被视为对本场比赛平衡的重要意义。"
      },
      "fr": {
        "title": "Tchouaméni : suspension de Prestianni « victoire » pour tous",
        "summary": "Le milieu de terrain du Real Madrid Aurélien Tchouaméni a salué l'absence de Gianluca Prestianni de Benfica de leur affrontement de Ligue des Champions au Bernabéu comme un résultat positif pour l'équité concurrentielle. La suspension a été considérée comme importante pour l'équilibre du match."
      },
      "de": {
        "title": "Tchouaméni: Prestianni-Sperrung ein „Sieg\" für alle",
        "summary": "Real Madrids Mittelfeldspieler Aurélien Tchouaméni würdigte die Abwesenheit von Gianluca Prestianni von Benfica bei ihrer Champions-League-Begegnung im Bernabéu als positives Ergebnis für faire Konkurrenz. Die Sperrung wurde als wichtig für die Balance des Spiels angesehen."
      },
      "es": {
        "title": "Tchouaméni: suspensión de Prestianni «victoria» para todos",
        "summary": "El centrocampista del Real Madrid Aurélien Tchouaméni elogió la ausencia de Gianluca Prestianni del Benfica en su choque de la Liga de Campeones en el Bernabéu como un resultado positivo para la equidad competitiva. La suspensión fue vista como importante para el equilibrio del encuentro."
      }
    }
  },
  {
    "title": "Premier League overreactions: Spurs to get relegated?",
    "slug": "premier-league-overreactions-spurs-relegated",
    "url": "https://www.espn.com/soccer/story/_/id/48023451/premier-league-overreactions-man-city-arsenal-title-race-spurs-relegation-chelsea-gyokeres-jimenez",
    "source": "ESPN Soccer",
    "date": "2026-02-26T10:12:38.000Z",
    "summary": "Sports writers offer playful overreactions to the latest Premier League fixtures in what could be a historically significant season. The piece suggests some teams like Tottenham Hotspur may face dire circumstances based on recent form.",
    "content": "Let's overreact to the latest fixtures of a potentially epic Premier League season. Spurs are in dire straits.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "英超反应过度：热刺会被降级吗？",
        "summary": "体育记者对最新的英超比赛做出了夸大的反应，这可能是一个历史上重要的赛季。这篇文章暗示像托特纳姆热刺这样的球队可能因最近的表现而面临严峻的困境。"
      },
      "fr": {
        "title": "Surréactions de la Premier League : Tottenham relégué ?",
        "summary": "Les journalistes sportifs offrent des surréactions ludiques aux derniers matchs de la Premier League lors de ce qui pourrait être une saison historiquement importante. L'article suggère que certaines équipes comme Tottenham Hotspur pourraient faire face à des circonstances désastreuses basées sur la forme récente."
      },
      "de": {
        "title": "Premier-League-Überreaktionen: Spurs abgestiegen?",
        "summary": "Sportjournalisten reagieren spielerisch übertrieben auf die neuesten Premier-League-Spiele in dem, was eine historisch bedeutsame Saison sein könnte. Der Artikel deutet an, dass Teams wie Tottenham Hotspur aufgrund ihrer jüngsten Form in ernsthafte Schwierigkeiten geraten könnten."
      },
      "es": {
        "title": "Reacciones exageradas de la Premier League: ¿Spurs descendidos?",
        "summary": "Los periodistas deportivos ofrecen reacciones exageradas y lúdicas a los últimos partidos de la Premier League en lo que podría ser una temporada históricamente importante. El artículo sugiere que algunos equipos como el Tottenham Hotspur podrían enfrentar circunstancias difíciles según su forma reciente."
      }
    }
  },
  {
    "title": "Haaland, Rice, Semenyo ... Igor Thiago? Our writers pick Premier League Player of the Year",
    "slug": "premier-league-player-year-writers-picks",
    "url": "https://www.espn.com/soccer/story/_/id/48033788/premier-league-player-year-haaland-rice-semenyo-szoboszlai-igor-thiago-predictions-projections",
    "source": "ESPN Soccer",
    "date": "2026-02-26T10:12:37.000Z",
    "summary": "With the 2025-26 Premier League season reaching its climax, sports writers debate their candidates for Player of the Year without a clear consensus frontrunner. Featured candidates include Erling Haaland, Declan Rice, and Armando Semenyo.",
    "content": "We're approaching the business end of the 2025-26 Premier League season, and it's time to start thinking about year-end awards. But who has stood out? With no consensus No.1 player, our writers debate their picks.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "哈兰德、赖斯、塞门约... 伊戈尔·蒂亚戈？我们的写手选择英超本赛季最佳球员",
        "summary": "随着2025-26英超赛季进入高潮，体育记者讨论他们的本赛季最佳球员候选名单，但还没有明确的热门人选。被提名的候选人包括埃尔林·哈兰德、德克兰·赖斯和阿尔曼多·塞门约。"
      },
      "fr": {
        "title": "Haaland, Rice, Semenyo... Igor Thiago? Nos journalistes choisissent le meilleur joueur de la Premier League",
        "summary": "Avec la saison 2025-26 de la Premier League qui touche à sa fin, les journalistes sportifs débattent de leurs candidats pour le joueur de l'année sans un favori évident. Les candidats en vedette incluent Erling Haaland, Declan Rice et Armando Semenyo."
      },
      "de": {
        "title": "Haaland, Rice, Semenyo... Igor Thiago? Unsere Schriftsteller wählen den Spieler des Jahres der Premier League",
        "summary": "Mit der Saison 2025-26 der Premier League auf ihrem Höhepunkt debattieren Sportjournalisten ihre Kandidaten für den Spieler des Jahres ohne klaren Favoriten. Zu den vorgestellten Kandidaten gehören Erling Haaland, Declan Rice und Armando Semenyo."
      },
      "es": {
        "title": "¿Haaland, Rice, Semenyo... Igor Thiago? Nuestros escritores eligen el Jugador del Año de la Premier League",
        "summary": "Con la temporada 2025-26 de la Premier League en su punto álgido, los periodistas deportivos debaten sus candidatos para Jugador del Año sin un claro favorito. Los candidatos destacados incluyen a Erling Haaland, Declan Rice y Armando Semenyo."
      }
    }
  },
  {
    "title": "Real Madrid condemn fan for alleged Nazi salute",
    "slug": "real-madrid-condemn-fan-nazi-salute",
    "url": "https://www.bbc.com/sport/football/articles/c4ge9842n0xo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T09:43:55.000Z",
    "summary": "Real Madrid has initiated an investigation into a supporter who allegedly performed a Nazi salute before the club's Champions League victory against Benfica. The club's swift condemnation reflects strong action against discriminatory behavior.",
    "content": "Real Madrid launch an investigation after a supporter allegedly performed a Nazi salute before the club's Champions League win against Benfica on Wednesday.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "皇家马德里谴责球迷涉嫌纳粹敬礼",
        "summary": "皇家马德里已启动调查，针对一名球迷在俱乐部欧冠战胜本菲卡前涉嫌做出纳粹敬礼的行为。俱乐部的迅速谴责反映了对歧视行为的强硬立场。"
      },
      "fr": {
        "title": "Le Real Madrid condamne un supporter pour un salut nazi présumé",
        "summary": "Le Real Madrid a lancé une enquête contre un supporter qui aurait effectué un salut nazi avant la victoire de la Ligue des champions du club contre Benfica. La condamnation rapide du club reflète une action forte contre le comportement discriminatoire."
      },
      "de": {
        "title": "Real Madrid verurteilt Fan wegen mutmaßlichen Hitlergrußes",
        "summary": "Real Madrid hat eine Untersuchung gegen einen Anhänger eingeleitet, der angeblich einen Hitlergruß vor dem Champions-League-Sieg des Clubs gegen Benfica gezeigt haben soll. Die schnelle Verurteilung des Clubs spiegelt entschiedenes Vorgehen gegen diskriminierendes Verhalten wider."
      },
      "es": {
        "title": "Real Madrid condena a aficionado por presunto saludo nazi",
        "summary": "Real Madrid ha iniciado una investigación contra un seguidor que supuestamente realizó un saludo nazi antes de la victoria de la Champions League del club contra el Benfica. La rápida condena del club refleja una acción firme contra el comportamiento discriminatorio."
      }
    }
  },
  {
    "title": "Pick Ekitike, Sesko and Van Dijk - FPL team of the week",
    "slug": "fpl-team-week-ekitike-sesko-van-dijk",
    "url": "https://www.bbc.com/sport/football/articles/cpw0y9x17n0o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T09:01:28.000Z",
    "summary": "Fantasy Premier League managers should prioritize selecting players from Liverpool and Manchester United this week according to Thomas Woods' analysis. Recommended picks include Ekitike, Sesko, and Van Dijk.",
    "content": "It is a good week for Fantasy Premier League managers to load up on Liverpool and Manchester United players, write Thomas Woods.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "选择埃基蒂克、塞斯科和范迪克 - 本周幻想超级联赛最佳阵容",
        "summary": "根据托马斯·伍兹的分析，幻想超级联赛管理者应该优先选择利物浦和曼联球员本周。推荐选择包括埃基蒂克、塞斯科和范迪克。"
      },
      "fr": {
        "title": "Choisissez Ekitike, Sesko et Van Dijk - Équipe Fantasy Premier League de la semaine",
        "summary": "Selon l'analyse de Thomas Woods, les gestionnaires de Fantasy Premier League devraient prioriser la sélection de joueurs de Liverpool et Manchester United cette semaine. Les sélections recommandées incluent Ekitike, Sesko et Van Dijk."
      },
      "de": {
        "title": "Wählen Sie Ekitike, Sesko und Van Dijk - Fantasy Premier League Team der Woche",
        "summary": "Nach der Analyse von Thomas Woods sollten Fantasy Premier League Manager diese Woche Spieler aus Liverpool und Manchester United priorisieren. Empfohlene Auswahlmöglichkeiten sind Ekitike, Sesko und Van Dijk."
      },
      "es": {
        "title": "Elige Ekitike, Sesko y Van Dijk - Equipo de Fantasy Premier League de la semana",
        "summary": "Según el análisis de Thomas Woods, los gerentes de Fantasy Premier League deben priorizar la selección de jugadores de Liverpool y Manchester United esta semana. Las opciones recomendadas incluyen Ekitike, Sesko y Van Dijk."
      }
    }
  },
  {
    "title": "Transfer rumors, news: Real Madrid interested in Arsenal's Gabriel",
    "slug": "transfer-rumors-real-madrid-gabriel",
    "url": "https://www.espn.com/soccer/story/_/id/48040723/transfer-rumors-news-real-madrid-interested-arsenal-gabriel-magalhaes",
    "source": "ESPN Soccer",
    "date": "2026-02-26T08:59:01.000Z",
    "summary": "Real Madrid are pursuing Arsenal defender Gabriel Magalhães while Chelsea continue their interest in Aston Villa's Morgan Rogers. The latest transfer developments highlight top clubs' activity in the market.",
    "content": "Real Madrid have their eye on Arsenal's Gabriel Magalhães, and Chelsea remain keen on Aston Villa's Morgan Rogers. Transfer Talk has the latest.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "转会传言、新闻：皇家马德里对阿森纳的加布里埃尔感兴趣",
        "summary": "皇家马德里追求阿森纳后卫加布里埃尔·马加良斯，而切尔西继续对阿斯顿维拉的摩根·罗杰斯感兴趣。最新的转会发展突显了顶级俱乐部在市场上的活动。"
      },
      "fr": {
        "title": "Rumeurs de transfert, actualités : le Real Madrid intéressé par Gabriel d'Arsenal",
        "summary": "Le Real Madrid poursuit le défenseur d'Arsenal Gabriel Magalhães tandis que Chelsea continue à s'intéresser à Morgan Rogers d'Aston Villa. Les derniers développements des transferts mettent en évidence l'activité des grands clubs sur le marché."
      },
      "de": {
        "title": "Transfergerüchte, Nachrichten: Real Madrid interessiert sich für Gabriel von Arsenal",
        "summary": "Real Madrid verfolgt Arsenals Abwehrspieler Gabriel Magalhães, während Chelsea sein Interesse an Aston Villas Morgan Rogers fortsetzt. Die neuesten Transferentwicklungen unterstreichen die Aktivität der Top-Clubs auf dem Markt."
      },
      "es": {
        "title": "Rumores de transferencia, noticias: Real Madrid interesado en Gabriel del Arsenal",
        "summary": "El Real Madrid persigue al defensa del Arsenal Gabriel Magalhães mientras Chelsea continúa su interés en Morgan Rogers del Aston Villa. Los últimos desarrollos de transferencia destacan la actividad de los principales clubes en el mercado."
      }
    }
  },
  {
    "title": "PSG's title defense on shaky ground",
    "slug": "psg-title-defense-shaky-ground",
    "url": "https://www.espn.com/soccer/story/_/id/48039500/paris-saint-germains-champions-league-title-defense-shaky-ground",
    "source": "ESPN Soccer",
    "date": "2026-02-26T08:22:22.000Z",
    "summary": "Luis Enrique's Paris Saint-Germain, the defending Ligue 1 champions, appeared below their usual standard in narrowly defeating AS Monaco. The unconvincing performance raises questions about PSG's credentials for retaining their title.",
    "content": "Luis Enrique's defending champs looked a shadow of their former selves, only just edging past Monaco.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "巴黎圣日耳曼的卫冕之路摇摇欲坠",
        "summary": "卫冕法甲冠军路易斯·恩里克的巴黎圣日耳曼在勉强击败摩纳哥的比赛中表现不如平时。这场不令人信服的表现引发了人们对巴黎圣日耳曼保卫冠军资格的质疑。"
      },
      "fr": {
        "title": "La défense du titre du PSG sur des bases fragiles",
        "summary": "Paris Saint-Germain, le champion de Ligue 1 sortant entraîné par Luis Enrique, a semblé être au-dessous de ses standards habituels en battant de justesse l'AS Monaco. Cette performance peu convaincante soulève des questions sur les credentials du PSG pour conserver son titre."
      },
      "de": {
        "title": "PSGs Titelverteidigung auf wackligen Beinen",
        "summary": "Luis Enriques Paris Saint-Germain, der verteidigende Ligue-1-Meister, wirkte unter ihrem üblichen Standard, als sie AS Monaco knapp besiegten. Die wenig überzeugende Leistung wirft Fragen zu PSGs Anspruch auf Titelverteidigung auf."
      },
      "es": {
        "title": "La defensa del título del PSG en terreno inestable",
        "summary": "El París Saint-Germain de Luis Enrique, campeones defensores de la Ligue 1, pareció estar por debajo de su estándar habitual al vencer de manera ajustada al AS Mónaco. El desempeño poco convincente plantea preguntas sobre las credenciales del PSG para retener su título."
      }
    }
  },
  {
    "title": "Podcast: Why are Celtic fans so unhappy?",
    "slug": "podcast-why-celtic-fans-unhappy",
    "url": "https://www.bbc.co.uk/sounds/play/p0n3b94x?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T07:59:00.000Z",
    "summary": "Scott Allan and Stephen McGowan join Charlotte Cohen to discuss the current challenges affecting Celtic Football Club. The podcast explores the reasons behind fan dissatisfaction at the Scottish club.",
    "content": "Scott Allan and Stephen McGowan join Charlotte Cohen to discuss what's happening at Celtic",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "播客：凯尔特人球迷为何不满？",
        "summary": "斯科特·艾伦和斯蒂芬·麦高恩与夏洛特·科恩一起讨论影响凯尔特人足球俱乐部的当前挑战。这个播客探索了苏格兰俱乐部球迷不满的原因。"
      },
      "fr": {
        "title": "Podcast : Pourquoi les fans de Celtic sont-ils si mécontents ?",
        "summary": "Scott Allan et Stephen McGowan rejoignent Charlotte Cohen pour discuter des défis actuels affectant le Celtic Football Club. Le podcast explore les raisons de l'insatisfaction des fans au sein du club écossais."
      },
      "de": {
        "title": "Podcast: Warum sind Celtic-Fans so unglücklich?",
        "summary": "Scott Allan und Stephen McGowan schließen sich Charlotte Cohen an, um die aktuellen Herausforderungen zu diskutieren, die Celtic Football Club betreffen. Der Podcast untersucht die Gründe für die Unzufriedenheit der Fans beim schottischen Club."
      },
      "es": {
        "title": "Podcast: ¿Por qué los aficionados del Celtic están tan descontentos?",
        "summary": "Scott Allan y Stephen McGowan se unen a Charlotte Cohen para discutir los desafíos actuales que afectan al Celtic Football Club. El podcast explora las razones detrás de la insatisfacción de los aficionados en el club escocés."
      }
    }
  },
  {
    "title": "Celtic linked with Plymouth's Tolaj & Pepple - gossip",
    "slug": "celtic-linked-plymouth-tolaj-pepple",
    "url": "https://www.bbc.com/sport/football/articles/cjeny4z9xdko?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T07:34:58.000Z",
    "summary": "Celtic are reportedly interested in signing Plymouth players Tolaj and Pepple, while Hearts consider a move for Rangers defender. Transfer speculation continues around Scottish football clubs.",
    "content": "Plymouth pair linked with Celtic as Hearts consider move for Rangers defender.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "凯尔特人与普利茅斯球员托拉伊和佩普尔有关联 - 八卦",
        "summary": "据报道凯尔特人对签下普利茅斯球员托拉伊和佩普尔感兴趣，而哈茨则考虑引进游骑兵后卫。苏格兰足球俱乐部周围的转会猜测仍在继续。"
      },
      "fr": {
        "title": "Celtic lié aux joueurs Plymouth Tolaj et Pepple - potins",
        "summary": "Celtic s'intéresse prétendument à la signature des joueurs de Plymouth Tolaj et Pepple, tandis que Hearts envisage un transfert pour un défenseur de Rangers. Les spéculations de transfert se poursuivent autour des clubs de football écossais."
      },
      "de": {
        "title": "Celtic mit Plymouths Tolaj und Pepple verbunden - Gerüchte",
        "summary": "Celtic ist Berichten zufolge an der Verpflichtung der Plymouth-Spieler Tolaj und Pepple interessiert, während Hearts einen Wechsel für einen Rangers-Verteidiger erwägt. Spekulationen über Transfers gehen weiter bei schottischen Fußballclubs."
      },
      "es": {
        "title": "Celtic vinculado con Tolaj y Pepple de Plymouth - rumores",
        "summary": "Se informa que Celtic está interesado en fichar a los jugadores de Plymouth Tolaj y Pepple, mientras que Hearts considera un movimiento para un defensa de Rangers. La especulación de transferencias continúa en torno a los clubes de fútbol escoceses."
      }
    }
  },
  {
    "title": "Why Villa are this season's big overperformers",
    "slug": "villa-season-big-overperformers",
    "url": "https://www.bbc.com/sport/football/articles/cjrq18vx2qro?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T07:03:37.000Z",
    "summary": "Aston Villa has emerged as one of the season's surprise packages with strong performances exceeding expectations. The analysis examines whether Villa's impressive run can be sustained through the remainder of the season.",
    "content": "Are Aston Villa wobbling?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "为什么阿斯顿维拉是本赛季的大惊喜",
        "summary": "阿斯顿维拉已成为赛季中的意外之喜，表现出色超出预期。分析考察了维拉的出色表现是否能在赛季剩余时间内保持。"
      },
      "fr": {
        "title": "Pourquoi Villa est la grande surprise de cette saison",
        "summary": "Aston Villa est devenu l'une des équipes surprises de la saison avec des performances solides dépassant les attentes. L'analyse examine si la série impressionnante de Villa peut être maintenue pour le reste de la saison."
      },
      "de": {
        "title": "Warum Villa die große Überraschung dieser Saison ist",
        "summary": "Aston Villa hat sich als eines der Überraschungsteams der Saison mit starken Leistungen, die Erwartungen übertreffen, etabliert. Die Analyse untersucht, ob Villas beeindruckende Serie für den Rest der Saison aufrechterhalten werden kann."
      },
      "es": {
        "title": "Por qué Villa es la gran sorpresa de esta temporada",
        "summary": "Aston Villa se ha convertido en uno de los paquetes sorpresa de la temporada con actuaciones sólidas que superan las expectativas. El análisis examina si la carrera impresionante de Villa puede sostenerse durante el resto de la temporada."
      }
    }
  },
  {
    "title": "Man Utd post profit but debt rises to £1.3bn",
    "slug": "man-utd-profit-debt-rises-1-3bn",
    "url": "https://www.bbc.com/sport/football/articles/c4gq70yqv0do?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T06:20:30.000Z",
    "summary": "Manchester United reported a profit but their outstanding debt reached £1.3bn, including transfer fees, credit facilities, and legacy debt. The financial figures highlight the club's ongoing financial challenges.",
    "content": "The amount Manchester United owe increases to almost £1.3bn in outstanding transfer fees, rolling credit facility and legacy debt.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "曼联录得利润但债务上升至13亿英镑",
        "summary": "曼联报告实现利润,但其未偿债务达到13亿英镑,包括转会费、信贷便利和历史债务。这些财务数字凸显了该俱乐部持续的财务挑战。"
      },
      "fr": {
        "title": "Man Utd affiche un bénéfice mais la dette monte à 1,3 milliard de livres sterling",
        "summary": "Manchester United a annoncé un bénéfice mais sa dette restante a atteint 1,3 milliard de livres sterling, y compris les frais de transfert, les facilités de crédit et la dette héritée. Les chiffres financiers soulignent les défis financiers persistants du club."
      },
      "de": {
        "title": "Man Utd meldet Gewinn, aber Schulden steigen auf 1,3 Milliarden Pfund",
        "summary": "Manchester United meldete einen Gewinn, aber die ausstehenden Schulden erreichten 1,3 Milliarden Pfund, einschließlich Transfergebühren, Kreditlinien und historischer Schulden. Die Finanzzahlen verdeutlichen die anhaltenden finanziellen Herausforderungen des Clubs."
      },
      "es": {
        "title": "Man Utd registra beneficio pero la deuda sube a 1.300 millones de libras",
        "summary": "Manchester United reportó una ganancia pero su deuda pendiente alcanzó 1.300 millones de libras, incluyendo tarifas de transferencia, facilidades crediticias y deuda heredada. Las cifras financieras destacan los desafíos financieros continuos del club."
      }
    }
  },
  {
    "title": "'I'm ready' - Park bids to show Man Utd form for England",
    "slug": "park-ready-show-man-utd-form-england",
    "url": "https://www.bbc.com/sport/football/articles/c5ykx4nqgv6o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T06:06:34.000Z",
    "summary": "Jess Park, Manchester United's midfielder in strong form since her summer transfer, seeks to replicate her club success for England in upcoming internationals. Her recent performances suggest she can impact at international level.",
    "content": "Manchester United midfielder Jess Park has been in brilliant form since her move in the summer - but can she take that into England's upcoming matches?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"我已准备好\" - 帕克誓言为英格兰展现曼联状态",
        "summary": "杰西·帕克是曼联中场球员,自夏季转会以来状态良好,她力求在即将到来的国际比赛中复制她的俱乐部成功。她最近的表现表明她可以在国际赛场上产生影响。"
      },
      "fr": {
        "title": "« Je suis prête » - Park cherche à montrer sa forme de Man Utd pour l'Angleterre",
        "summary": "Jess Park, milieu de terrain de Manchester United en grande forme depuis son transfert estival, cherche à reproduire son succès en club pour l'Angleterre lors des prochains matchs internationaux. Ses performances récentes suggèrent qu'elle peut avoir un impact au niveau international."
      },
      "de": {
        "title": "„Ich bin bereit\" - Park möchte ihre Form bei Man Utd für England zeigen",
        "summary": "Jess Park, Mittelfeldspielerin von Manchester United in guter Form seit ihrem Sommertransfer, versucht, ihre Cluberfolge für England in kommenden internationalen Spielen zu wiederholen. Ihre jüngsten Leistungen deuten darauf hin, dass sie auf internationaler Ebene Einfluss haben kann."
      },
      "es": {
        "title": "\"Estoy lista\" - Park busca mostrar su forma de Man Utd para Inglaterra",
        "summary": "Jess Park, centrocampista de Manchester United en buena forma desde su transferencia veraniega, busca replicar su éxito en el club para Inglaterra en los próximos partidos internacionales. Sus actuaciones recientes sugieren que puede impactar a nivel internacional."
      }
    }
  },
  {
    "title": "UCL talking points: Madrid, PSG or Italian football -- who is worse off?",
    "slug": "ucl-talking-points-madrid-psg-italian-clubs",
    "url": "https://www.espn.com/soccer/story/_/id/48035109/champions-league-talking-points-madrid-psg-italian-football-worse-off",
    "source": "ESPN Soccer",
    "date": "2026-02-26T05:24:56.000Z",
    "summary": "With 16 teams remaining in the Champions League, the article examines whether Real Madrid, PSG, or Italian football faces the worst fortunes. The analysis questions which major football regions are struggling most this season.",
    "content": "And then there were 16. Who has what it takes to win the Champions League?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "欧冠话题:皇马、巴黎或意大利足球——谁处境更糟?",
        "summary": "随着欧冠还有16支球队,该文章研究皇家马德里、巴黎圣日耳曼或意大利足球是否面临最坏的命运。分析质疑本赛季哪个主要足球地区正在经历最大的困难。"
      },
      "fr": {
        "title": "Points clés de la LDC : Madrid, PSG ou football italien -- qui est le plus mal loti?",
        "summary": "Avec 16 équipes restantes en Ligue des champions, l'article examine si le Real Madrid, le PSG, ou le football italien fait face aux pires fortunes. L'analyse remet en question quelle région majeure du football lutte le plus cette saison."
      },
      "de": {
        "title": "CL-Gesprächspunkte: Madrid, PSG oder italienischer Fußball -- wer geht es am schlechtesten?",
        "summary": "Mit 16 verbleibenden Teams in der Champions League untersucht der Artikel, ob Real Madrid, PSG oder der italienische Fußball die schlimmsten Chancen hat. Die Analyse stellt in Frage, welche großen Fußballregionen in dieser Saison am meisten kämpfen."
      },
      "es": {
        "title": "Puntos clave de la UCL: Madrid, PSG o fútbol italiano -- ¿quién está en peor situación?",
        "summary": "Con 16 equipos restantes en la Liga de Campeones, el artículo examina si el Real Madrid, PSG o el fútbol italiano enfrenta las peores fortunas. El análisis cuestiona qué regiones futbolísticas principales están luchando más esta temporada."
      }
    }
  },
  {
    "title": "Locatelli: UCL exit left Juventus on verge of tears",
    "slug": "locatelli-ucl-exit-juventus-tears",
    "url": "https://www.espn.com/soccer/story/_/id/48036888/juventus-captain-ucl-exit-juventus-verge-tears",
    "source": "ESPN Soccer",
    "date": "2026-02-26T00:28:50.000Z",
    "summary": "Despite an impressive comeback from 5-2 down, Juventus fell short in extra time against Galatasaray in the Champions League. The midfielder Locatelli expressed the emotional toll of the exit on the club.",
    "content": "Trailing 5-2 after the first leg, Juventus went 3-0 up in the return match -- despite playing almost the entire second half with 10 men following Lloyd Kelly's sending-off -- to take the game to extra time.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "洛卡特利：欧冠出局让尤文图斯接近泪水",
        "summary": "尽管尤文图斯从0-5落后的情况下进行了令人印象深刻的反击，但他们在欧冠与加拉塔萨雷的加时赛中最终没有成功。中场球员洛卡特利表达了这次出局对俱乐部造成的情感影响。"
      },
      "fr": {
        "title": "Locatelli : L'élimination en Ligue des Champions a laissé la Juventus au bord des larmes",
        "summary": "Malgré un impressionnant retour de 5-2 en arrière, la Juventus n'a pas réussi en prolongation contre Galatasaray en Ligue des Champions. Le milieu de terrain Locatelli a exprimé le coût émotionnel de cette élimination pour le club."
      },
      "de": {
        "title": "Locatelli: Champions-League-Ausscheiden ließ Juventus am Rande der Tränen",
        "summary": "Trotz eines beeindruckenden Comebacks aus einem 5:2-Rückstand scheiterte Juventus in der Verlängerung gegen Galatasaray in der Champions League. Der Mittelfeldspieler Locatelli drückte die emotionale Belastung des Ausscheidens für den Verein aus."
      },
      "es": {
        "title": "Locatelli: La salida de la UCL dejó a la Juventus al borde de las lágrimas",
        "summary": "A pesar de un impresionante regreso desde 5-2 abajo, la Juventus se quedó corta en la prórroga contra el Galatasaray en la Champions League. El centrocampista Locatelli expresó el costo emocional de la eliminación en el club."
      }
    }
  },
  {
    "title": "Real Madrid win 'for everyone who stands against racism'",
    "slug": "real-madrid-win-everyone-stands-against-racism",
    "url": "https://www.bbc.com/sport/football/articles/cewzn4leyx1o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T00:15:59.000Z",
    "summary": "Real Madrid midfielder Aurelien Tchouameni described his team's win against Benfica as a victory for those opposing racism. The statement highlights the match's significance beyond sporting achievement.",
    "content": "Real Madrid's win against Benfica was a \"victory for everyone who stands against racism\", midfielder Aurelien Tchouameni says.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "皇马赢球\"为所有反对种族歧视的人\"",
        "summary": "皇马中场球员姆瓦尼将球队对阵本菲卡的胜利描述为反对种族歧视的人们的胜利。这一声明突显了比赛超越体育成就的意义。"
      },
      "fr": {
        "title": "La victoire du Real Madrid \"pour tous ceux qui s'opposent au racisme\"",
        "summary": "Le milieu de terrain du Real Madrid Aurélien Tchouaméni a décrit la victoire de son équipe contre Benfica comme une victoire pour ceux qui s'opposent au racisme. La déclaration souligne l'importance du match au-delà de la réussite sportive."
      },
      "de": {
        "title": "Real Madrids Sieg \"für alle, die sich gegen Rassismus stellen\"",
        "summary": "Madrids Mittelfeldspieler Aurélien Tchouaméni beschrieb den Sieg seines Teams gegen Benfica als einen Sieg für diejenigen, die sich gegen Rassismus stellen. Die Aussage unterstreicht die Bedeutung des Spiels über den sportlichen Erfolg hinaus."
      },
      "es": {
        "title": "La victoria del Real Madrid \"para todos los que se oponen al racismo\"",
        "summary": "El centrocampista del Real Madrid Aurélien Tchouaméni describió la victoria de su equipo contra el Benfica como una victoria para quienes se oponen al racismo. La declaración destaca la importancia del partido más allá del logro deportivo."
      }
    }
  }
]