[
  {
    "title": "Stunned Inter say Bodo/Glimt 'proved' they belong",
    "slug": "stunned-inter-bodoglimt-proved-they-belong",
    "url": "https://www.espn.com/soccer/story/_/id/48026748/upset-inter-milan-bodo-glimt-proved-belong",
    "source": "ESPN Soccer",
    "date": "2026-02-25T01:50:51.000Z",
    "summary": "Inter Milan was eliminated from the Champions League in a shocking upset, losing 2-1 at home to Bodø/Glimt and 5-2 on aggregate in the playoff round. This is considered one of the biggest surprises in Champions League history, highlighting that smaller clubs can compete at the highest level.",
    "content": "Inter Milan limped out of the Champions League with a disappointing 2-1 loss at home to Bodø/Glimt -- knocked out in the playoff round 5-2 on aggregate -- in what is being labeled as one of the biggest upsets in competition history.",
    "category": "sports"
  },
  {
    "title": "Mexico's Aguirre: Everyone 'safe' for Iceland game",
    "slug": "mexicos-aguirre-everyone-safe-iceland-game",
    "url": "https://www.espn.com/soccer/story/_/id/48027164/mexico-coach-aguirre-everyone-safe-iceland-game",
    "source": "ESPN Soccer",
    "date": "2026-02-25T01:50:50.000Z",
    "summary": "Mexico's coach Javier Aguirre assured players and staff that security measures are in place for an upcoming friendly match against Iceland, following recent concerns stemming from cartel violence in the country. The match is scheduled for Queretaro amid heightened national security tensions.",
    "content": "Mexico coach Javier Aguirre said his federation promised everyone will be safe at a friendly against Iceland in Queretaro this Wednesday amid recent security concerns across the country that emerged after the killing of a powerful cartel leader.",
    "category": "sports"
  },
  {
    "title": "FPL Podcast from BBC Sport",
    "slug": "fpl-podcast-from-bbc-sport",
    "url": "https://www.bbc.co.uk/sounds/play/p0n2s4mp?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-25T01:00:00.000Z",
    "summary": "BBC Sport's FPL Podcast features experts Alistair Bruce-Ball, Chris Sutton, and Statman Dave discussing Fantasy Premier League strategy with host Carl Anka. The episode offers strategic insights and analysis for FPL enthusiasts. This is valuable for players seeking expert guidance to optimize their fantasy team selections.",
    "content": "Alistair Bruce-Ball, Chris Sutton and Statman Dave talk FPL with Carl Anka.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "BBC体育FPL播客",
        "summary": "BBC Sport的FPL播客由专家Alistair Bruce-Ball、Chris Sutton和Statman Dave与主持人Carl Anka讨论梦幻英超联赛策略。该节目为FPL爱好者提供战略见解和分析。这对寻求专家指导以优化梦幻球队选择的球员很有价值。"
      },
      "fr": {
        "title": "Podcast FPL de BBC Sport",
        "summary": "Le podcast FPL de BBC Sport met en vedette les experts Alistair Bruce-Ball, Chris Sutton et Statman Dave discutant de la stratégie de la Fantasy Premier League avec l'animatrice Carl Anka. L'épisode offre des informations stratégiques et une analyse pour les passionnés de la FPL. C'est précieux pour les joueurs recherchant des conseils d'experts pour optimiser leurs sélections d'équipe de rêve."
      },
      "de": {
        "title": "FPL-Podcast von BBC Sport",
        "summary": "Der FPL-Podcast von BBC Sport präsentiert die Experten Alistair Bruce-Ball, Chris Sutton und Statman Dave, die Fantasy-Premier-League-Strategie mit Moderator Carl Anka diskutieren. Die Episode bietet strategische Einblicke und Analysen für FPL-Enthusiasten. Dies ist wertvoll für Spieler, die fachkundige Anleitung suchen, um ihre Fantasy-Teamauswahl zu optimieren."
      },
      "es": {
        "title": "Podcast FPL de BBC Sport",
        "summary": "El podcast FPL de BBC Sport presenta a los expertos Alistair Bruce-Ball, Chris Sutton y Statman Dave discutiendo la estrategia de la Premier League Fantasy con el presentador Carl Anka. El episodio ofrece información estratégica y análisis para los entusiastas de la FPL. Esto es valioso para los jugadores que buscan orientación experta para optimizar sus selecciones de equipo de fantasía."
      }
    }
  },
  {
    "title": "'Bring it on' – Newcastle's message to Chelsea and Barcelona",
    "slug": "bring-it-on-newcastle-s-message-to-chelsea-and-barcelona",
    "url": "https://www.bbc.com/sport/football/articles/cx2j9d6eqpyo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-25T00:12:54.000Z",
    "summary": "Jacob Murphy says Newcastle will relish whoever they face in the Champions League last 16 after progressing via the play-offs.",
    "content": "Jacob Murphy says Newcastle will relish whoever they face in the Champions League last 16 after progressing via the play-offs.",
    "category": "sports"
  }
]