[
  {
    "title": "PSG's Hakimi to stand trial over rape allegation",
    "slug": "psgs-hakimi-stand-trial-rape",
    "url": "https://www.espn.com/soccer/story/_/id/48021662/psg-achraf-hakimi-face-trial-rape-allegation-ligue-1-morocco",
    "source": "ESPN Soccer",
    "date": "2026-02-24T16:35:54.000Z",
    "summary": "Paris Saint-Germain defender Achraf Hakimi will face trial following a rape allegation. Hakimi maintains his innocence, stating he will \"allow the truth to come out publicly.\"",
    "content": "Paris Saint-Germain defender Achraf Hakimi insists he will \"allow the truth to come out publicly\" after learning he is to face trial for an alleged rape.",
    "category": "sports"
  },
  {
    "title": "Courtois 'disappointed' with Mourinho's Vini claim",
    "slug": "courtois-disappointed-mourinho-vini",
    "url": "https://www.espn.com/soccer/story/_/id/48021911/thibaut-courtois-disappointed-jose-mourinho-criticism-vinicius-junior-celebration",
    "source": "ESPN Soccer",
    "date": "2026-02-24T16:35:54.000Z",
    "summary": "Real Madrid goalkeeper Thibaut Courtois expressed disappointment with José Mourinho's claim linking Vinícius Júnior's goal celebration to alleged racial abuse. Courtois believes the celebration does not justify any suspected act of racism.",
    "content": "Thibaut Courtois was \"disappointed\" by José Mourinho's claim that Vinícius Júnior's goal celebration led to the star being allegedly racially abused.",
    "category": "sports"
  },
  {
    "title": "Man United pressure is a privilege says Sesko",
    "slug": "man-united-pressure-privilege-sesko",
    "url": "https://www.espn.com/soccer/story/_/id/48021082/man-united-pressure-privilege-says-sesko",
    "source": "ESPN Soccer",
    "date": "2026-02-24T16:35:54.000Z",
    "summary": "Manchester United target Benjamin Sesko views the pressure of playing for the club as a privilege. Sesko believes embracing this pressure is essential for achieving success at Old Trafford.",
    "content": "Benjamin Sesko says he must embrace the pressure that comes with playing for Manchester United if he's going to succeed at Old Trafford.",
    "category": "sports"
  },
  {
    "title": "Benfica prez defends Prestianni: He isn't racist",
    "slug": "benfica-defends-prestianni-not-racist",
    "url": "https://www.espn.com/soccer/story/_/id/48023079/benfica-president-defends-gianluca-prestianni-guarantee-racist",
    "source": "ESPN Soccer",
    "date": "2026-02-24T16:35:54.000Z",
    "summary": "Benfica president Manuel Rui Costa strongly defended player Gianluca Prestianni against allegations of racially abusing Real Madrid's Vinícius Júnior. Costa argues that Prestianni is not a racist.",
    "content": "Benfica president Manuel Rui Costa¡ strongly defended Gianluca Prestianni following allegations he racially abused Real Madrid's Vinícius Júnior, arguing the Argentinian winger \"is not a racist\".",
    "category": "sports"
  },
  {
    "title": "Snoop Dogg to drop in on Swansea for first time",
    "slug": "snoop-dogg-swansea-first-time",
    "url": "https://www.espn.com/soccer/story/_/id/48021229/snoop-dogg-visit-swansea-first-watch-first-game",
    "source": "ESPN Soccer",
    "date": "2026-02-24T16:35:54.000Z",
    "summary": "Swansea co-owner Snoop Dogg is scheduled to visit the club for the first time. The rapper has asked fans to welcome him by twirling towels during his visit.",
    "content": "Swansea co-owner Snoop Dogg has asked fans to serenade him by twirling towels when he visits the club for the first time.",
    "category": "sports"
  },
  {
    "title": "Ngumoha wants game-time after Liverpool cameo",
    "slug": "ngumoha-game-time-liverpool-cameo",
    "url": "https://www.espn.com/soccer/story/_/id/48021760/rio-ngumoha-aims-more-minutes-game-changing-liverpool-cameo",
    "source": "ESPN Soccer",
    "date": "2026-02-24T16:35:54.000Z",
    "summary": "Liverpool forward Rio Ngumoha impressed in a recent cameo appearance against Nottingham Forest. The young player hopes the performance will earn him additional playing time this season.",
    "content": "Liverpool forward Rio Ngumoha has said he is hopeful of earning more minutes after his impressive cameo against Nottingham Forest at the weekend.",
    "category": "sports"
  },
  {
    "title": "Sources: Mexico game still on amid cartel violence",
    "slug": "mexico-game-cartel-violence",
    "url": "https://www.espn.com/soccer/story/_/id/48018058/mexico-iceland-game-cartel-violence",
    "source": "ESPN Soccer",
    "date": "2026-02-24T16:35:54.000Z",
    "summary": "Mexico plans to proceed with its friendly match against Iceland on Wednesday despite ongoing cartel violence and unrest in the country. The match will take place at the Corregidora Stadium in Queretaro.",
    "content": "Mexico plans to proceed with its friendly match scheduled against Iceland on Wednesday at the Corregidora Stadium in Queretaro amid unrest and violence in the country, sources told ESPN.",
    "category": "sports"
  },
  {
    "title": "👀 Surprise! Pulisic's prematch AC Milan kit reveal",
    "slug": "pulisic-ac-milan-kit-reveal",
    "url": "https://www.espn.com/soccer/story/_/id/48012830/usmnt-christian-pulisic-ac-milan-surprise-fans-megan-thee-stallion-prematch-new-kit-reveal",
    "source": "ESPN Soccer",
    "date": "2026-02-24T16:35:54.000Z",
    "summary": "USMNT star Christian Pulisic and AC Milan surprised fans with a prematch kit reveal before Sunday's match. Special guest Megan Thee Stallion attended the exclusive event.",
    "content": "USMNT star Christian Pulisic & Co. surprised AC Milan fans -- and special guest Megan Thee Stallion -- by suiting up in a new kit for Sunday's match.",
    "category": "sports"
  },
  {
    "title": "Marsch hits back at Allardyce in relegation row",
    "slug": "marsch-allardyce-relegation",
    "url": "https://www.espn.com/soccer/story/_/id/48021071/jesse-marsch-hits-back-sam-allardyce-leeds-relegation-row",
    "source": "ESPN Soccer",
    "date": "2026-02-24T16:35:53.000Z",
    "summary": "Jesse Marsch responded to criticism from former Leeds United manager Sam Allardyce. The two former Leeds bosses are engaged in a dispute over management and relegation matters.",
    "content": "Jesse Marsch has fired back at criticism of his management from fellow former Leeds United boss Sam Allardyce.",
    "category": "sports"
  },
  {
    "title": "'It would be catastrophic' - are Spurs too big to go down?",
    "slug": "spurs-too-big-go-down",
    "url": "https://www.bbc.com/sport/football/articles/cx24x48232vo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-24T16:31:32.000Z",
    "summary": "Tottenham faces a serious relegation threat following their heavy defeat to Arsenal in the north London derby. BBC Sport analysis questions whether the club is \"too big to go down.\"",
    "content": "Tottenham's heavy north London derby defeat against Arsenal on Sunday just confirmed what everyone already knew - Igor Tudor's team are in serious trouble. BBC Sport assesses their precarious situation, what relegation might bring and asks if they are too big to go down?",
    "category": "sports"
  },
  {
    "title": "Fifa 'closely monitoring' Mexico cartel violence before World Cup",
    "slug": "fifa-mexico-cartel-world-cup",
    "url": "https://www.bbc.com/sport/football/articles/cpd81d7y901o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-24T16:26:31.000Z",
    "summary": "FIFA says it is closely monitoring security developments in Mexico ahead of this summer's World Cup. BBC Sport explores the ongoing cartel violence situation and its potential impact on the tournament.",
    "content": "BBC Sport explores the unfolding security situation in Mexico, as Fifa says it is \"closely monitoring\" developments before this summer's World Cup.",
    "category": "sports"
  },
  {
    "title": "Leggings, gloves, snoods - football's fashion trends",
    "slug": "football-fashion-trends",
    "url": "https://www.bbc.com/sport/football/articles/cy4wdwqg80no?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-24T15:44:10.000Z",
    "summary": "BBC Sport explores current fashion trends in football including leggings, gloves, and snoods worn by players. The report examines how these accessories have become increasingly popular in modern football.",
    "content": "BBC Sport's Ask Me Anything team explains the number of fashion trends that have taken place in football.",
    "category": "sports"
  },
  {
    "title": "PSG's Hakimi to face trial after rape allegation",
    "slug": "psgs-hakimi-face-trial-rape",
    "url": "https://www.bbc.com/sport/football/articles/clyxrxj5n8yo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-24T15:35:04.000Z",
    "summary": "Paris Saint-Germain defender Achraf Hakimi will face trial following a rape allegation. Hakimi says he is prepared to proceed through the legal process.",
    "content": "Paris St-Germain defender Achraf Hakimi says he is set to face trial after an allegation of rape was made against him.",
    "category": "sports"
  },
  {
    "title": "Why Champions League return is crucial to Man Utd",
    "slug": "champions-league-crucial-man-utd",
    "url": "https://www.bbc.com/sport/football/articles/cre0v1x8nlvo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-24T15:19:53.000Z",
    "summary": "Manchester United's potential return to the Champions League would provide significant financial benefits after two years competing outside Europe's elite club competition. The club currently sits fourth in the Premier League.",
    "content": "Up to fourth in the Premier League after Monday's win at Everton, Champions League qualification would be a big boost to Manchester United's finances after two years outside Europe's elite club competition.",
    "category": "sports"
  },
  {
    "title": "'It bothers me that Vinicius' celebration is being used against him'",
    "slug": "vinicius-celebration-racism",
    "url": "https://www.bbc.com/sport/football/articles/cze0r6zw2e6o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-24T14:43:41.000Z",
    "summary": "Real Madrid goalkeeper Thibaut Courtois says Vinícius Júnior's goal celebration does not justify alleged racist abuse. Courtois expresses concern that the celebration is being used as a justification for racism.",
    "content": "Real Madrid goalkeeper Thibaut Courtois says Vinicius Jr's celebration against Benfica in last week's Champions League tie does not \"justify a suspected act of racism\".",
    "category": "sports"
  },
  {
    "title": "Arsenal Extends Premier League Lead with 3-1 Victory Over Chelsea",
    "slug": "arsenal-extends-premier-league-lead-with-3-1-victory-over-chelsea",
    "url": "https://www.bbc.com/sport/example/arsenal-chelsea",
    "source": "BBC Football",
    "date": "2026-02-24T06:00:00Z",
    "summary": "Arsenal moved five points clear at the top of the Premier League after a dominant display against Chelsea at the Emirates. Goals from Saka, Havertz, and Rice sealed an impressive win.",
    "content": "",
    "category": "sports"
  },
  {
    "title": "Champions League Quarter-Final Draw: Barcelona vs Bayern Munich",
    "slug": "champions-league-quarter-final-draw-barcelona-vs-bayern-munich",
    "url": "https://www.bbc.com/sport/example/cl-draw",
    "source": "BBC Sport",
    "date": "2026-02-23T18:00:00Z",
    "summary": "The Champions League quarter-final draw has produced several blockbuster ties, with Barcelona facing Bayern Munich and Real Madrid drawn against Manchester City in a repeat of recent classic encounters.",
    "content": "",
    "category": "sports"
  },
  {
    "title": "Lionel Messi Scores 900th Career Goal in Inter Miami Win",
    "slug": "lionel-messi-scores-900th-career-goal-in-inter-miami-win",
    "url": "https://www.espn.com/example/messi-900",
    "source": "ESPN",
    "date": "2026-02-23T04:00:00Z",
    "summary": "Lionel Messi reached the remarkable milestone of 900 career goals with a trademark free-kick for Inter Miami. The 38-year-old continues to defy age with 15 goals already this MLS season.",
    "content": "",
    "category": "sports"
  }
]