[
  {
    "title": "USMNT starlet Banks considering Germany switch",
    "slug": "usmnt-starlet-banks-considering-germany-switch",
    "url": "https://www.espn.com/soccer/story/_/id/48066548/usmnt-noahkai-banks-germany-switch-augsburg",
    "source": "ESPN Soccer",
    "date": "2026-03-01T05:33:17.000Z",
    "summary": "U.S. youth national team starlet Noahkai Banks is weighing his international future between the U.S. and Germany, with a potential spot on this summer's senior World Cup squad at stake. This decision could impact USMNT's squad composition for a major tournament.",
    "content": "U.S. youth national team starlet Noahkai Banks, a potential pick for this summer's senior World Cup squad, has said he is still considering whether his international future lies with the U.S. or Germany.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "USMNT新星班克斯考虑转向德国",
        "summary": "美国青年国家队新星诺亚凯·班克斯在美国和德国之间权衡自己的国际足球生涯，争取在今年夏天的成年世界杯球队中获得一席之地。这个决定可能会影响USMNT在重大赛事中的阵容组成。"
      },
      "fr": {
        "title": "La jeune star de l'USMNT Banks envisage un changement vers l'Allemagne",
        "summary": "La jeune star de l'équipe nationale des jeunes américains Noahkai Banks pèse son avenir international entre les États-Unis et l'Allemagne, avec un spot potentiel sur l'équipe de la Coupe du monde senior de cet été en jeu. Cette décision pourrait avoir un impact sur la composition de l'équipe de l'USMNT pour un tournoi majeur."
      },
      "de": {
        "title": "USMNT-Talent Banks erwägt Wechsel nach Deutschland",
        "summary": "Das US-amerikanische Nachwuchsnational-Talent Noahkai Banks wägt seine internationale Zukunft zwischen den USA und Deutschland ab, mit einem möglichen Platz in der Senior-Weltcup-Mannschaft diesen Sommer auf dem Spiel. Diese Entscheidung könnte die Zusammensetzung des USMNT-Kaders für ein großes Turnier beeinflussen."
      },
      "es": {
        "title": "La joven estrella de USMNT Banks considerando un cambio a Alemania",
        "summary": "La joven estrella del equipo nacional juvenil estadounidense Noahkai Banks está sopesando su futuro internacional entre Estados Unidos y Alemania, con un posible lugar en el equipo senior de la Copa del Mundo de este verano en juego. Esta decisión podría impactar la composición del equipo de USMNT para un torneo importante."
      }
    }
  },
  {
    "title": "Iran women's NT: 'Let's just focus' on Asian Cup",
    "slug": "iran-womens-nt-focus-asian-cup",
    "url": "https://www.espn.com/soccer/story/_/id/48069381/iran-women-national-team-let-just-focus-asian-cup",
    "source": "ESPN Soccer",
    "date": "2026-03-01T05:33:17.000Z",
    "summary": "The Iran women's national football team coach and captain emphasized their focus on preparation for the Women's Asian Cup in Australia, deflecting questions about broader political issues. The team reported they have enjoyed good preparation ahead of the tournament.",
    "content": "A question regarding the killing of Ayatollah Ali Khamenei has been shut down as the Iran women's national football team coach and captain said they had enjoyed a \"good preparation\" for the Women's Asian Cup in Australia.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "伊朗女足：专注亚洲杯",
        "summary": "伊朗女足国家队主教练和队长强调专注于澳大利亚女性亚洲杯的准备工作，回避了关于更广泛政治问题的问题。该队报告称他们在比赛前做好了充分准备。"
      },
      "fr": {
        "title": "Équipe féminine de l'Iran : \"Concentrons-nous\" sur la Coupe d'Asie",
        "summary": "L'entraîneur et le capitaine de l'équipe nationale féminine de football iranienne ont souligné leur concentration sur la préparation de la Coupe d'Asie des femmes en Australie, éludant les questions sur les enjeux politiques plus larges. L'équipe a signalé qu'elle avait eu une bonne préparation avant le tournoi."
      },
      "de": {
        "title": "Irans Frauennationalmannschaft: \"Konzentrieren wir uns\" auf den Asienpokal",
        "summary": "Der Trainer und Kapitän der iranischen Frauenfußball-Nationalmannschaft betonten ihren Fokus auf die Vorbereitung auf den Frauenasienpokal in Australien und wichen Fragen zu breiteren politischen Problemen aus. Das Team berichtete, dass es sich gut auf das Turnier vorbereitet hat."
      },
      "es": {
        "title": "Selección femenina de Irán: \"Enfoquémonos\" en la Copa de Asia",
        "summary": "El entrenador y capitán del equipo nacional femenino de fútbol de Irán enfatizaron su enfoque en la preparación para la Copa de Asia Femenina en Australia, eludiendo preguntas sobre cuestiones políticas más amplias. El equipo informó que ha tenido una buena preparación antes del torneo."
      }
    }
  },
  {
    "title": "'World-class save' - How Pickford & Everton thwarted Newcastle",
    "slug": "pickford-everton-save-newcastle",
    "url": "https://www.bbc.com/sport/football/videos/cx2lgevrr67o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-01T00:04:22.000Z",
    "summary": "Jordan Pickford made a remarkable injury-time save for Everton against Newcastle, with Match of the Day pundits praising the goalkeeper's crucial performance in preserving the result.",
    "content": "Match of the Day pundits Alan Shearer and Ashley Williams react to Jordan Pickford's \"remarkable\" injury-time save against Newcastle.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"世界级扑救\" - 皮克福德和埃弗顿如何阻止了纽卡斯尔",
        "summary": "乔丹·皮克福德为埃弗顿对阵纽卡斯尔的比赛做出了一次非凡的伤停补时救球，《每日比赛》的专家称赞这位门将在保持比赛结果中的关键表现。"
      },
      "fr": {
        "title": "\"Un arrêt de classe mondiale\" - Comment Pickford et Everton ont arrêté Newcastle",
        "summary": "Jordan Pickford a effectué un arrêt remarquable en fin de match pour Everton contre Newcastle, les experts du Match of the Day félicitant la performance cruciale du gardien pour préserver le résultat."
      },
      "de": {
        "title": "\"Weltklasse-Rettung\" - Wie Pickford und Everton Newcastle stoppten",
        "summary": "Jordan Pickford machte eine bemerkenswerte Rettung in der Nachspielzeit für Everton gegen Newcastle, wobei Match of the Day-Experten die entscheidende Leistung des Torwarts zur Sicherung des Ergebnisses lobten."
      },
      "es": {
        "title": "\"Una atajada de clase mundial\" - Cómo Pickford y Everton frenaron al Newcastle",
        "summary": "Jordan Pickford realizó una atajada extraordinaria en tiempo de descuento para el Everton contra el Newcastle, con los expertos del Match of the Day elogiando la actuación crucial del portero al preservar el resultado."
      }
    }
  }
]