[
  {
    "title": "Man Utd post profit but debt rises to £1.3bn",
    "slug": "man-utd-profit-debt-rises-1-3bn",
    "url": "https://www.bbc.com/sport/football/articles/c4gq70yqv0do?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T06:20:30.000Z",
    "summary": "Manchester United reported a profit but their outstanding debt reached £1.3bn, including transfer fees, credit facilities, and legacy debt. The financial figures highlight the club's ongoing financial challenges.",
    "content": "The amount Manchester United owe increases to almost £1.3bn in outstanding transfer fees, rolling credit facility and legacy debt.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "曼联录得利润但债务上升至13亿英镑",
        "summary": "曼联报告实现利润,但其未偿债务达到13亿英镑,包括转会费、信贷便利和历史债务。这些财务数字凸显了该俱乐部持续的财务挑战。"
      },
      "fr": {
        "title": "Man Utd affiche un bénéfice mais la dette monte à 1,3 milliard de livres sterling",
        "summary": "Manchester United a annoncé un bénéfice mais sa dette restante a atteint 1,3 milliard de livres sterling, y compris les frais de transfert, les facilités de crédit et la dette héritée. Les chiffres financiers soulignent les défis financiers persistants du club."
      },
      "de": {
        "title": "Man Utd meldet Gewinn, aber Schulden steigen auf 1,3 Milliarden Pfund",
        "summary": "Manchester United meldete einen Gewinn, aber die ausstehenden Schulden erreichten 1,3 Milliarden Pfund, einschließlich Transfergebühren, Kreditlinien und historischer Schulden. Die Finanzzahlen verdeutlichen die anhaltenden finanziellen Herausforderungen des Clubs."
      },
      "es": {
        "title": "Man Utd registra beneficio pero la deuda sube a 1.300 millones de libras",
        "summary": "Manchester United reportó una ganancia pero su deuda pendiente alcanzó 1.300 millones de libras, incluyendo tarifas de transferencia, facilidades crediticias y deuda heredada. Las cifras financieras destacan los desafíos financieros continuos del club."
      }
    }
  },
  {
    "title": "'I'm ready' - Park bids to show Man Utd form for England",
    "slug": "park-ready-show-man-utd-form-england",
    "url": "https://www.bbc.com/sport/football/articles/c5ykx4nqgv6o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T06:06:34.000Z",
    "summary": "Jess Park, Manchester United's midfielder in strong form since her summer transfer, seeks to replicate her club success for England in upcoming internationals. Her recent performances suggest she can impact at international level.",
    "content": "Manchester United midfielder Jess Park has been in brilliant form since her move in the summer - but can she take that into England's upcoming matches?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"我已准备好\" - 帕克誓言为英格兰展现曼联状态",
        "summary": "杰西·帕克是曼联中场球员,自夏季转会以来状态良好,她力求在即将到来的国际比赛中复制她的俱乐部成功。她最近的表现表明她可以在国际赛场上产生影响。"
      },
      "fr": {
        "title": "« Je suis prête » - Park cherche à montrer sa forme de Man Utd pour l'Angleterre",
        "summary": "Jess Park, milieu de terrain de Manchester United en grande forme depuis son transfert estival, cherche à reproduire son succès en club pour l'Angleterre lors des prochains matchs internationaux. Ses performances récentes suggèrent qu'elle peut avoir un impact au niveau international."
      },
      "de": {
        "title": "„Ich bin bereit\" - Park möchte ihre Form bei Man Utd für England zeigen",
        "summary": "Jess Park, Mittelfeldspielerin von Manchester United in guter Form seit ihrem Sommertransfer, versucht, ihre Cluberfolge für England in kommenden internationalen Spielen zu wiederholen. Ihre jüngsten Leistungen deuten darauf hin, dass sie auf internationaler Ebene Einfluss haben kann."
      },
      "es": {
        "title": "\"Estoy lista\" - Park busca mostrar su forma de Man Utd para Inglaterra",
        "summary": "Jess Park, centrocampista de Manchester United en buena forma desde su transferencia veraniega, busca replicar su éxito en el club para Inglaterra en los próximos partidos internacionales. Sus actuaciones recientes sugieren que puede impactar a nivel internacional."
      }
    }
  },
  {
    "title": "UCL talking points: Madrid, PSG or Italian football -- who is worse off?",
    "slug": "ucl-talking-points-madrid-psg-italian-clubs",
    "url": "https://www.espn.com/soccer/story/_/id/48035109/champions-league-talking-points-madrid-psg-italian-football-worse-off",
    "source": "ESPN Soccer",
    "date": "2026-02-26T05:24:56.000Z",
    "summary": "With 16 teams remaining in the Champions League, the article examines whether Real Madrid, PSG, or Italian football faces the worst fortunes. The analysis questions which major football regions are struggling most this season.",
    "content": "And then there were 16. Who has what it takes to win the Champions League?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "欧冠话题:皇马、巴黎或意大利足球——谁处境更糟?",
        "summary": "随着欧冠还有16支球队,该文章研究皇家马德里、巴黎圣日耳曼或意大利足球是否面临最坏的命运。分析质疑本赛季哪个主要足球地区正在经历最大的困难。"
      },
      "fr": {
        "title": "Points clés de la LDC : Madrid, PSG ou football italien -- qui est le plus mal loti?",
        "summary": "Avec 16 équipes restantes en Ligue des champions, l'article examine si le Real Madrid, le PSG, ou le football italien fait face aux pires fortunes. L'analyse remet en question quelle région majeure du football lutte le plus cette saison."
      },
      "de": {
        "title": "CL-Gesprächspunkte: Madrid, PSG oder italienischer Fußball -- wer geht es am schlechtesten?",
        "summary": "Mit 16 verbleibenden Teams in der Champions League untersucht der Artikel, ob Real Madrid, PSG oder der italienische Fußball die schlimmsten Chancen hat. Die Analyse stellt in Frage, welche großen Fußballregionen in dieser Saison am meisten kämpfen."
      },
      "es": {
        "title": "Puntos clave de la UCL: Madrid, PSG o fútbol italiano -- ¿quién está en peor situación?",
        "summary": "Con 16 equipos restantes en la Liga de Campeones, el artículo examina si el Real Madrid, PSG o el fútbol italiano enfrenta las peores fortunas. El análisis cuestiona qué regiones futbolísticas principales están luchando más esta temporada."
      }
    }
  },
  {
    "title": "Locatelli: UCL exit left Juventus on verge of tears",
    "slug": "locatelli-ucl-exit-juventus-tears",
    "url": "https://www.espn.com/soccer/story/_/id/48036888/juventus-captain-ucl-exit-juventus-verge-tears",
    "source": "ESPN Soccer",
    "date": "2026-02-26T00:28:50.000Z",
    "summary": "Despite an impressive comeback from 5-2 down, Juventus fell short in extra time against Galatasaray in the Champions League. The midfielder Locatelli expressed the emotional toll of the exit on the club.",
    "content": "Trailing 5-2 after the first leg, Juventus went 3-0 up in the return match -- despite playing almost the entire second half with 10 men following Lloyd Kelly's sending-off -- to take the game to extra time.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "洛卡特利：欧冠出局让尤文图斯接近泪水",
        "summary": "尽管尤文图斯从0-5落后的情况下进行了令人印象深刻的反击，但他们在欧冠与加拉塔萨雷的加时赛中最终没有成功。中场球员洛卡特利表达了这次出局对俱乐部造成的情感影响。"
      },
      "fr": {
        "title": "Locatelli : L'élimination en Ligue des Champions a laissé la Juventus au bord des larmes",
        "summary": "Malgré un impressionnant retour de 5-2 en arrière, la Juventus n'a pas réussi en prolongation contre Galatasaray en Ligue des Champions. Le milieu de terrain Locatelli a exprimé le coût émotionnel de cette élimination pour le club."
      },
      "de": {
        "title": "Locatelli: Champions-League-Ausscheiden ließ Juventus am Rande der Tränen",
        "summary": "Trotz eines beeindruckenden Comebacks aus einem 5:2-Rückstand scheiterte Juventus in der Verlängerung gegen Galatasaray in der Champions League. Der Mittelfeldspieler Locatelli drückte die emotionale Belastung des Ausscheidens für den Verein aus."
      },
      "es": {
        "title": "Locatelli: La salida de la UCL dejó a la Juventus al borde de las lágrimas",
        "summary": "A pesar de un impresionante regreso desde 5-2 abajo, la Juventus se quedó corta en la prórroga contra el Galatasaray en la Champions League. El centrocampista Locatelli expresó el costo emocional de la eliminación en el club."
      }
    }
  },
  {
    "title": "Real Madrid win 'for everyone who stands against racism'",
    "slug": "real-madrid-win-everyone-stands-against-racism",
    "url": "https://www.bbc.com/sport/football/articles/cewzn4leyx1o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T00:15:59.000Z",
    "summary": "Real Madrid midfielder Aurelien Tchouameni described his team's win against Benfica as a victory for those opposing racism. The statement highlights the match's significance beyond sporting achievement.",
    "content": "Real Madrid's win against Benfica was a \"victory for everyone who stands against racism\", midfielder Aurelien Tchouameni says.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "皇马赢球\"为所有反对种族歧视的人\"",
        "summary": "皇马中场球员姆瓦尼将球队对阵本菲卡的胜利描述为反对种族歧视的人们的胜利。这一声明突显了比赛超越体育成就的意义。"
      },
      "fr": {
        "title": "La victoire du Real Madrid \"pour tous ceux qui s'opposent au racisme\"",
        "summary": "Le milieu de terrain du Real Madrid Aurélien Tchouaméni a décrit la victoire de son équipe contre Benfica comme une victoire pour ceux qui s'opposent au racisme. La déclaration souligne l'importance du match au-delà de la réussite sportive."
      },
      "de": {
        "title": "Real Madrids Sieg \"für alle, die sich gegen Rassismus stellen\"",
        "summary": "Madrids Mittelfeldspieler Aurélien Tchouaméni beschrieb den Sieg seines Teams gegen Benfica als einen Sieg für diejenigen, die sich gegen Rassismus stellen. Die Aussage unterstreicht die Bedeutung des Spiels über den sportlichen Erfolg hinaus."
      },
      "es": {
        "title": "La victoria del Real Madrid \"para todos los que se oponen al racismo\"",
        "summary": "El centrocampista del Real Madrid Aurélien Tchouaméni describió la victoria de su equipo contra el Benfica como una victoria para quienes se oponen al racismo. La declaración destaca la importancia del partido más allá del logro deportivo."
      }
    }
  }
]