[
  {
    "title": "Real Madrid win 'for everyone who stands against racism'",
    "slug": "real-madrid-win-everyone-stands-against-racism",
    "url": "https://www.bbc.com/sport/football/articles/cewzn4leyx1o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-02-26T00:15:59.000Z",
    "summary": "Real Madrid midfielder Aurelien Tchouameni described his team's win against Benfica as a victory for those opposing racism. The statement highlights the match's significance beyond sporting achievement.",
    "content": "Real Madrid's win against Benfica was a \"victory for everyone who stands against racism\", midfielder Aurelien Tchouameni says.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "皇马赢球\"为所有反对种族歧视的人\"",
        "summary": "皇马中场球员姆瓦尼将球队对阵本菲卡的胜利描述为反对种族歧视的人们的胜利。这一声明突显了比赛超越体育成就的意义。"
      },
      "fr": {
        "title": "La victoire du Real Madrid \"pour tous ceux qui s'opposent au racisme\"",
        "summary": "Le milieu de terrain du Real Madrid Aurélien Tchouaméni a décrit la victoire de son équipe contre Benfica comme une victoire pour ceux qui s'opposent au racisme. La déclaration souligne l'importance du match au-delà de la réussite sportive."
      },
      "de": {
        "title": "Real Madrids Sieg \"für alle, die sich gegen Rassismus stellen\"",
        "summary": "Madrids Mittelfeldspieler Aurélien Tchouaméni beschrieb den Sieg seines Teams gegen Benfica als einen Sieg für diejenigen, die sich gegen Rassismus stellen. Die Aussage unterstreicht die Bedeutung des Spiels über den sportlichen Erfolg hinaus."
      },
      "es": {
        "title": "La victoria del Real Madrid \"para todos los que se oponen al racismo\"",
        "summary": "El centrocampista del Real Madrid Aurélien Tchouaméni describió la victoria de su equipo contra el Benfica como una victoria para quienes se oponen al racismo. La declaración destaca la importancia del partido más allá del logro deportivo."
      }
    }
  }
]