[
  {
    "title": "Yamal is eclipsing young Ronaldo, Messi. Are Barça too dependent on him already?",
    "slug": "yamal-eclipsing-ronaldo-messi",
    "url": "https://www.espn.com/soccer/story/_/id/48080022/lamine-yamal-eclipsing-young-cristiano-ronaldo-lionel-messi-barcelona-too-dependent-already",
    "source": "ESPN Soccer",
    "date": "2026-03-02T12:05:24.000Z",
    "summary": "Lamine Yamal's goal and assist statistics exceed those of Lionel Messi, Cristiano Ronaldo, and Kylian Mbappé at comparable stages of their careers. However, Barcelona's heavy dependence on the teenage sensation raises questions about whether he is being overused at such a young age.",
    "content": "Lamine Yamal's goal and assist stats are streets ahead of Lionel Messi, Cristiano Ronaldo and Kylian Mbappé at the same age. But is he playing too much?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "亚马尔超越年轻的罗纳尔多和梅西。巴塞罗那已经过度依赖他了吗?",
        "summary": "拉米娜·亚马尔的进球和助攻数据超过了莱昂内尔·梅西、克里斯蒂亚诺·罗纳尔多和基利安·姆巴佩在职业生涯相似阶段的表现。然而，巴塞罗那对这位青少年天才的沉重依赖引发了人们对他在如此年轻的年纪是否被过度使用的质疑。"
      },
      "fr": {
        "title": "Yamal éclipse le jeune Ronaldo et Messi. Barcelone dépend-elle déjà trop de lui?",
        "summary": "Les statistiques de buts et d'passes décisives de Lamine Yamal dépassent celles de Lionel Messi, Cristiano Ronaldo et Kylian Mbappé à des stades comparables de leurs carrières. Cependant, la forte dépendance de Barcelone envers cette sensation adolescente soulève des questions sur le fait qu'il soit surexploité à un si jeune âge."
      },
      "de": {
        "title": "Yamal übertrifft den jungen Ronaldo und Messi. Ist Barcelona bereits zu abhängig von ihm?",
        "summary": "Lamine Yamals Tor- und Vorlagenstatistiken übertreffen die von Lionel Messi, Cristiano Ronaldo und Kylian Mbappé in vergleichbaren Karrierestadien. Die starke Abhängigkeit Barcelonas von diesem jugendlichen Supertalent wirft jedoch Fragen auf, ob er in einem so jungen Alter überfordert wird."
      },
      "es": {
        "title": "Yamal eclipsa al joven Ronaldo y Messi. ¿Barcelona ya depende demasiado de él?",
        "summary": "Las estadísticas de goles y asistencias de Lamine Yamal superan las de Lionel Messi, Cristiano Ronaldo y Kylian Mbappé en etapas comparables de sus carreras. Sin embargo, la fuerte dependencia del Barcelona respecto a esta sensación adolescente plantea interrogantes sobre si está siendo sobreutilizado a una edad tan temprana."
      }
    }
  },
  {
    "title": "Set-pieces mean Premier League no longer a joy - Slot",
    "slug": "set-pieces-premier-league-slot",
    "url": "https://www.bbc.com/sport/football/articles/c4gjwm99we8o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-02T11:59:13.000Z",
    "summary": "Liverpool manager Arne Slot has criticized the Premier League's increasing reliance on set-pieces this season. Slot stated that the tactical shift contradicts his vision of how football should be played.",
    "content": "Liverpool manager Arne Slot says his \"football heart doesn't like\" the reliance on set-pieces in this season's Premier League.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "定位球意味着英超联赛不再是一种快乐——斯洛特",
        "summary": "利物浦主教练阿尔内·斯洛特批评了英超联赛本赛季对定位球的日益增加的依赖。斯洛特表示，这种战术转变与他对足球应该如何进行的愿景相矛盾。"
      },
      "fr": {
        "title": "Les coups de pied arrêtés signifient que la Premier League n'est plus une joie - Slot",
        "summary": "Le manager de Liverpool Arne Slot a critiqué la dépendance croissante de la Premier League aux coups de pied arrêtés cette saison. Slot a déclaré que ce changement tactique contredit sa vision de la façon dont le football devrait être joué."
      },
      "de": {
        "title": "Standardsituationen bedeuten, dass die Premier League keine Freude mehr ist - Slot",
        "summary": "Liverpools Manager Arne Slot hat die wachsende Abhängigkeit der Premier League von Standardsituationen in dieser Saison kritisiert. Slot erklärte, dass diese taktische Verschiebung seiner Vorstellung widerspricht, wie Fußball gespielt werden sollte."
      },
      "es": {
        "title": "Los saques estáticos significan que la Premier League ya no es una alegría - Slot",
        "summary": "El entrenador del Liverpool Arne Slot ha criticado la creciente dependencia de la Premier League de los saques estáticos esta temporada. Slot declaró que este cambio táctico contradice su visión de cómo debería jugarse el fútbol."
      }
    }
  },
  {
    "title": "Transfer rumors, news: Will Kane, Vinícius extend their contracts?",
    "slug": "kane-vinicius-contract-extensions",
    "url": "https://www.espn.com/soccer/story/_/id/48079544/transfer-rumors-news-harry-kane-vinicius-junior-extend-their-bayern-munich-real-madrid-contracts",
    "source": "ESPN Soccer",
    "date": "2026-03-02T11:41:03.000Z",
    "summary": "Bayern Munich are pursuing a new contract with striker Harry Kane, while Real Madrid seek a similar extension with Vinícius Júnior. Both clubs are working to secure their star attacking players long-term.",
    "content": "Bayern Munich want striker Harry Kane to sign a new contract, and Real Madrid want the same for Vinícius Júnior. Transfer Talk has the latest.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "转会传闻，新闻：凯恩和维尼修斯会延长他们的合同吗?",
        "summary": "拜仁慕尼黑正在与前锋哈里·凯恩谈判新合同，而皇家马德里则寻求与维尼修斯·朱尼奥尔签订类似的延长合同。两家俱乐部都在努力长期确保他们的明星进攻球员。"
      },
      "fr": {
        "title": "Rumeurs de transfert, nouvelles : Kane et Vinícius vont-ils prolonger leurs contrats?",
        "summary": "Le Bayern Munich poursuit un nouveau contrat avec l'attaquant Harry Kane, tandis que le Real Madrid cherche une prolongation similaire avec Vinícius Júnior. Les deux clubs travaillent pour sécuriser à long terme leurs joueurs d'attaque vedettes."
      },
      "de": {
        "title": "Transfergerüchte, Nachrichten: Werden Kane und Vinícius ihre Verträge verlängern?",
        "summary": "Bayern München verhandelt über einen neuen Vertrag mit Stürmer Harry Kane, während Real Madrid eine ähnliche Verlängerung mit Vinícius Júnior anstrebt. Beide Clubs arbeiten daran, ihre Star-Angreifer langfristig zu sichern."
      },
      "es": {
        "title": "Rumores de transferencia, noticias: ¿Extenderán Kane y Vinícius sus contratos?",
        "summary": "El Bayern Munich está persiguiendo un nuevo contrato con el delantero Harry Kane, mientras que el Real Madrid busca una extensión similar con Vinícius Júnior. Ambos clubes están trabajando para asegurar a largo plazo a sus jugadores estrella del ataque."
      }
    }
  },
  {
    "title": "Four into three doesn't go: Predicting the Premier League's race for UCL spots",
    "slug": "premier-league-champions-league-race",
    "url": "https://www.espn.com/soccer/story/_/id/48080163/predicting-premier-league-race-champions-league-spots-man-united-aston-villa-chelsea-liverpool",
    "source": "ESPN Soccer",
    "date": "2026-03-02T11:29:29.000Z",
    "summary": "Arsenal and Manchester City have secured Champions League qualification, but four teams remain in a tight race for the three remaining spots. The competitive battle is expected to intensify as the season reaches its conclusion.",
    "content": "The four-way race for the three Champions League spots behind Arsenal and Man City is tight. How will it play out and who will miss out?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "四进三不通：预测英超联赛争夺欧冠席位的竞争",
        "summary": "阿森纳和曼城已经确保了欧冠资格，但四支球队仍在为剩余的三个席位展开激烈竞争。随着赛季接近尾声，这场竞争战役预计会更加激烈。"
      },
      "fr": {
        "title": "Quatre dans trois ça ne marche pas : Prédire la course aux places de Ligue des Champions de la Premier League",
        "summary": "Arsenal et Manchester City ont assuré leur qualification pour la Ligue des Champions, mais quatre équipes restent dans une lutte serrée pour les trois places restantes. La bataille compétitive devrait s'intensifier alors que la saison touche à sa fin."
      },
      "de": {
        "title": "Vier in drei geht nicht: Vorhersage des Rennens um die Champions-League-Plätze der Premier League",
        "summary": "Arsenal und Manchester City haben ihre Teilnahme an der Champions League gesichert, aber vier Teams kämpfen um die drei verbleibenden Plätze. Der Wettbewerb dürfte sich zum Ende der Saison hin verschärfen."
      },
      "es": {
        "title": "Cuatro en tres no cabe: Predicción de la carrera por los puestos de Champions League de la Premier League",
        "summary": "Arsenal y Manchester City han asegurado la clasificación para la Champions League, pero cuatro equipos se disputan los tres lugares restantes. Se espera que la batalla competitiva se intensifique a medida que se acerca el final de la temporada."
      }
    }
  },
  {
    "title": "Guardiola unsure about Haaland injury absence",
    "slug": "guardiola-haaland-injury",
    "url": "https://www.espn.com/soccer/story/_/id/48079619/pep-guardiola-unsure-erling-haaland-injury-absence",
    "source": "ESPN Soccer",
    "date": "2026-03-02T11:26:56.000Z",
    "summary": "Manchester City manager Pep Guardiola expressed uncertainty about the severity of Erling Haaland's injury that sidelined him over the weekend. The club remains hopeful that the absence will not be prolonged.",
    "content": "Manchester City are hopeful the injury which sidelined Erling Haaland at the weekend is not serious.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "瓜迪奥拉对哈兰德伤病缺席感到不确定",
        "summary": "曼城主教练佩普·瓜迪奥拉对埃尔林·哈兰德周末伤病的严重程度表示不确定。俱乐部希望这次缺席不会持续太长时间。"
      },
      "fr": {
        "title": "Guardiola incertain à propos de l'absence de blessure de Haaland",
        "summary": "Le manager de Manchester City, Pep Guardiola, a exprimé son incertitude quant à la gravité de la blessure d'Erling Haaland qui l'a tenu à l'écart le week-end dernier. Le club reste optimiste quant au fait que l'absence ne sera pas prolongée."
      },
      "de": {
        "title": "Guardiola unsicher über Halands Verletzungsabwesenheit",
        "summary": "Manchester City-Manager Pep Guardiola äußerte sich unsicher über den Schweregrad der Verletzung von Erling Haaland, die ihn über das Wochenende aussetzte. Der Verein bleibt optimistisch, dass die Abwesenheit nicht lange anhalten wird."
      },
      "es": {
        "title": "Guardiola inseguro sobre la ausencia por lesión de Haaland",
        "summary": "El entrenador del Manchester City, Pep Guardiola, expresó incertidumbre sobre la gravedad de la lesión de Erling Haaland que lo dejó fuera el fin de semana. El club sigue esperanzado en que la ausencia no será prolongada."
      }
    }
  },
  {
    "title": "Coach quells injury fears after Ronaldo limps off",
    "slug": "ronaldo-injury-al-nassr",
    "url": "https://www.espn.com/soccer/story/_/id/48079925/al-nassr-coach-quells-injury-fears-cristiano-ronaldo-limps-off",
    "source": "ESPN Soccer",
    "date": "2026-03-02T11:26:56.000Z",
    "summary": "Al Nassr coach Jorge Jesus has downplayed concerns about Cristiano Ronaldo's injury following his departure from Saturday's 3-1 league victory over Al-Fayha. Jesus suggested the injury is less serious than it appeared on the pitch.",
    "content": "Al Nassr coach Jorge Jesus has played down fears that his captain, Cristiano Ronaldo, had suffered a serious injury after he limped off the pitch in Saturday's 3-1 league win over Al-Fayha.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "教练消除罗纳尔多跛行下场后的伤病担忧",
        "summary": "Al Nassr主教练豪尔赫·耶稣淡化了克里斯蒂亚诺·罗纳尔多在周六对Al-Fayha的3-1联赛胜利中下场后的伤病担忧。耶稣暗示这次伤病比在球场上看起来的要轻。"
      },
      "fr": {
        "title": "L'entraîneur apaise les craintes de blessure après le départ de Ronaldo en boitant",
        "summary": "L'entraîneur d'Al Nassr, Jorge Jesus, a minimisé les craintes concernant la blessure de Cristiano Ronaldo suite à son départ du match de la ligue 3-1 de samedi contre Al-Fayha. Jesus a suggéré que la blessure est moins grave qu'elle ne l'a paru sur le terrain."
      },
      "de": {
        "title": "Trainer beruhigt Verletzungssorgen nach Ronaldos hinkender Abgang",
        "summary": "Al Nassrs Trainer Jorge Jesus hat die Besorgnis über die Verletzung von Cristiano Ronaldo nach seinem Ausscheiden aus Samstags 3:1-Ligasieg gegen Al-Fayha verharmlost. Jesus deutete an, dass die Verletzung weniger schwerwiegend ist als sie auf dem Spielfeld wirkte."
      },
      "es": {
        "title": "El entrenador calma los temores de lesión después de que Ronaldo se fue cojeando",
        "summary": "El entrenador del Al Nassr, Jorge Jesus, ha minimizado las preocupaciones sobre la lesión de Cristiano Ronaldo tras su salida de la victoria de la liga 3-1 del sábado contra Al-Fayha. Jesus sugirió que la lesión es menos grave de lo que parecía en el campo."
      }
    }
  },
  {
    "title": "England 'given reassurances' over safety in Turkey",
    "slug": "england-safety-turkey-world-cup",
    "url": "https://www.bbc.com/sport/football/articles/cpv87y79zpzo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-02T09:36:54.000Z",
    "summary": "England manager Sarina Wiegman confirmed that officials have provided reassurances about safety for their World Cup qualifier in Turkey despite regional tensions in the Middle East. The match is expected to proceed as scheduled.",
    "content": "Sarina Wiegman says England have been told there are no safety concerns over their World Cup qualifier in Turkey despite the conflict in the Middle East.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "英格兰获得土耳其安全保证",
        "summary": "英格兰主教练萨里娜·威格曼确认,尽管中东地区存在紧张局势,官方已向球队提供了有关在土耳其世界杯预选赛的安全保证。比赛预计将按计划进行。"
      },
      "fr": {
        "title": "L'Angleterre 'rassurée' sur la sécurité en Turquie",
        "summary": "La sélectionneuse de l'Angleterre, Sarina Wiegman, a confirmé que les autorités ont donné des assurances concernant la sécurité pour leur match de qualification pour la Coupe du monde en Turquie, malgré les tensions régionales au Moyen-Orient. Le match devrait se dérouler comme prévu."
      },
      "de": {
        "title": "England erhält Sicherheitsgarantien für die Türkei",
        "summary": "Englands Trainerin Sarina Wiegman bestätigte, dass die Behörden Zusicherungen zur Sicherheit für ihr WM-Qualifikationsspiel in der Türkei gegeben haben, trotz regionaler Spannungen im Nahen Osten. Das Spiel soll wie geplant stattfinden."
      },
      "es": {
        "title": "Inglaterra recibe garantías de seguridad en Turquía",
        "summary": "La seleccionadora de Inglaterra, Sarina Wiegman, confirmó que las autoridades han proporcionado garantías de seguridad para su partido clasificatorio para la Copa del Mundo en Turquía a pesar de las tensiones regionales en Oriente Medio. Se espera que el partido se lleve a cabo como está programado."
      }
    }
  },
  {
    "title": "Messi scores twice in Miami comeback at Orlando",
    "slug": "messi-inter-miami-orlando",
    "url": "https://www.bbc.com/sport/football/articles/cwykw52dp35o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-02T08:54:20.000Z",
    "summary": "Lionel Messi scored twice as Inter Miami overcame a two-goal deficit to defeat Orlando City 4-2 in the Florida derby. Messi's brace was instrumental in securing the dramatic comeback victory.",
    "content": "Lionel Messi scores twice as Inter Miami fight back from two goals down to beat Orlando City 4-2 in the Florida derby.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "梅西在迈阿密对奥兰多的复出中连进两球",
        "summary": "莱昂内尔·梅西连进两球,帮助国际迈阿密在佛罗里达德比中以4-2击败奥兰多城队,逆转两球的落后局面。梅西的进球在这场戏剧性的复出胜利中至关重要。"
      },
      "fr": {
        "title": "Messi marque deux fois dans le retour de Miami à Orlando",
        "summary": "Lionel Messi a marqué deux fois alors que l'Inter Miami a surmonté un retard de deux buts pour vaincre Orlando City 4-2 dans le derby de Floride. Le doublé de Messi a été déterminant dans la victoire spectaculaire du retour."
      },
      "de": {
        "title": "Messi schießt zweimal beim Miami-Comeback gegen Orlando",
        "summary": "Lionel Messi schoss zweimal, als Inter Miami einen Zwei-Tor-Rückstand überwand und Orlando City 4:2 im Florida-Derby besiegte. Messis Doppelpack war entscheidend für den dramatischen Comeback-Sieg."
      },
      "es": {
        "title": "Messi anota dos goles en el regreso de Miami en Orlando",
        "summary": "Lionel Messi anotó dos goles cuando el Inter Miami superó un déficit de dos goles para derrotar a Orlando City 4-2 en el derbi de Florida. El doblete de Messi fue fundamental para asegurar la victoria dramática del regreso."
      }
    }
  },
  {
    "title": "Was Chermiti's overhead kick best Old Firm goal this century?",
    "slug": "chermiti-overhead-kick-old-firm",
    "url": "https://www.bbc.com/sport/football/articles/c4gjkj330lyo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-02T08:52:34.000Z",
    "summary": "Youssef Chermiti's overhead kick for Rangers in the Old Firm derby against Celtic has generated discussion about its place among the fixture's best goals in the 2000s. The technically impressive strike impressed supporters.",
    "content": "Is Youssef Chermiti's overhead kick for Rangers against Celtic the best of the 2000s so far? Or do some of the other strikes in the fixture get your vote?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "切米蒂的倒挂金钩是本世纪旧老字号德比最好的进球吗?",
        "summary": "切米蒂在旧老字号德比中为流浪者队打进的倒挂金钩引发了关于其在2000年代这一赛事最佳进球中地位的讨论。这个技术印象深刻的进球给球迷留下了深刻印象。"
      },
      "fr": {
        "title": "Le coup de pied retourné de Chermiti est-il le meilleur but d'Old Firm de ce siècle ?",
        "summary": "Le coup de pied retourné de Youssef Chermiti pour les Rangers dans le dernier Old Firm contre le Celtic a suscité une discussion sur sa place parmi les meilleurs buts du match de cette décennie. Cette frappe techniquement impressionnante a impressionné les supporters."
      },
      "de": {
        "title": "War Chermitis Fallrückzieher das beste Old-Firm-Tor dieses Jahrhunderts?",
        "summary": "Youssef Chermitis Fallrückzieher für die Rangers im Old-Firm-Derby gegen Celtic hat eine Diskussion über seinen Platz unter den besten Toren des Derbys in den 2000er Jahren ausgelöst. Der technisch beeindruckende Schuss beeindruckte die Anhänger."
      },
      "es": {
        "title": "¿Fue la chilena de Chermiti el mejor gol del Old Firm de este siglo?",
        "summary": "La chilena de Youssef Chermiti para los Rangers en el derbi Old Firm contra el Celtic ha generado discusión sobre su lugar entre los mejores goles del partido en los años 2000. El golpe técnicamente impresionante impresionó a los aficionados."
      }
    }
  },
  {
    "title": "Quiz: Name every team who has played in the Premier League",
    "slug": "premier-league-teams-quiz",
    "url": "https://www.bbc.com/sport/football/articles/c80jgdvdpnvo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-02T08:12:04.000Z",
    "summary": "This quiz challenges supporters to name all fifty-one teams that have competed in at least one Premier League season. The test covers the league's entire history across multiple decades.",
    "content": "Fifty-one teams have played in at least one Premier League season, but can you name them all? Good luck!",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "测验：说出英超联赛中所有参加过的球队",
        "summary": "这个测验挑战球迷命名过去参加过至少一个英超赛季的五十一支球队。该测试涵盖了联赛整个历史，跨越多个十年。"
      },
      "fr": {
        "title": "Quiz : Nommez toutes les équipes qui ont joué en Premier League",
        "summary": "Ce quiz défie les supporters de nommer les cinquante et une équipes qui ont participé à au moins une saison de Premier League. Le test couvre toute l'histoire de la ligue sur plusieurs décennies."
      },
      "de": {
        "title": "Quiz: Nennen Sie alle Teams, die in der Premier League gespielt haben",
        "summary": "Dieses Quiz fordert Anhänger heraus, alle einundfünfzig Teams zu nennen, die mindestens in einer Premier-League-Saison angetreten sind. Der Test umfasst die gesamte Geschichte der Liga über mehrere Jahrzehnte hinweg."
      },
      "es": {
        "title": "Quiz: Nombra todos los equipos que han jugado en la Premier League",
        "summary": "Este cuestionario desafía a los aficionados a nombrar los cincuenta y uno equipos que han competido en al menos una temporada de la Premier League. La prueba cubre toda la historia de la liga a lo largo de varias décadas."
      }
    }
  },
  {
    "title": "Watch the best of the weekend's action from Scotland",
    "slug": "scotland-football-weekend-highlights",
    "url": "https://www.bbc.com/sport/football/videos/czx7p2r2q28o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-02T08:02:02.000Z",
    "summary": "A compilation showcases the best moments from the weekend's matches across the Scottish Championship, League 1, and League 2. The highlights feature goals, saves, and standout plays from Scotland's professional divisions.",
    "content": "Watch the best of the action from the weekend's action in the Scottish Championship, League 1 and League 2.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "观看苏格兰周末比赛的精彩时刻",
        "summary": "一段视频集锦展示了苏格兰锦标赛、甲级和乙级联赛周末比赛的最佳瞬间。亮点包括苏格兰职业联赛的进球、扑救和精彩表现。"
      },
      "fr": {
        "title": "Regardez le meilleur de l'action du week-end en Écosse",
        "summary": "Une compilation met en avant les meilleurs moments des matchs du week-end du Championnat d'Écosse, de la Ligue 1 et de la Ligue 2. Les temps forts incluent les buts, les arrêts et les jeux remarquables des divisions professionnelles écossaises."
      },
      "de": {
        "title": "Sehen Sie das Beste der Wochenendaktionen aus Schottland",
        "summary": "Eine Zusammenstellung zeigt die besten Momente der Wochenendspiele der Scottish Championship, League 1 und League 2. Die Highlights enthalten Tore, Rettungen und herausragende Spielzüge aus Schottlands professionellen Ligen."
      },
      "es": {
        "title": "Mira lo mejor de la acción del fin de semana desde Escocia",
        "summary": "Una compilación muestra los mejores momentos de los partidos del fin de semana en el Campeonato Escocés, Liga 1 y Liga 2. Los aspectos más destacados incluyen goles, atajadas y jugadas destacadas de las divisiones profesionales escocesas."
      }
    }
  },
  {
    "title": "Listen: Are Hearts nine games from title after Old Firm derby drama?",
    "slug": "hearts-title-old-firm",
    "url": "https://www.bbc.co.uk/sounds/play/p0n422bs?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-02T08:00:00.000Z",
    "summary": "Hearts recorded another victory while an Old Firm match featured a dramatic late equalizer, keeping the Scottish title race open and competitive. The results maintain Hearts' position in their pursuit of the championship.",
    "content": "There’s a late Old Firm equaliser and Hearts win again as the title race twists again.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "听：老农场德比戏剧后，心脏队距离冠军还有九场比赛吗？",
        "summary": "心脏队又赢了一场，而老农场比赛有一个戏剧性的后期扳平，保持苏格兰冠军竞争开放和竞争激烈。这些结果保持了心脏队在追求冠军中的位置。"
      },
      "fr": {
        "title": "Écoutez : Hearts est-elle à neuf matchs du titre après le drame du derby Old Firm ?",
        "summary": "Hearts a enregistré une autre victoire tandis qu'un match Old Firm a présenté une égalisation dramatique tardive, maintenant la course au titre écossaise ouverte et compétitive. Les résultats maintiennent la position de Hearts dans leur quête du championnat."
      },
      "de": {
        "title": "Hören Sie: Sind Hearts neun Spiele vom Titel entfernt nach dem Old-Firm-Derby-Drama?",
        "summary": "Hearts erzielte einen weiteren Sieg, während ein Old-Firm-Match einen dramatischen Ausgleich in letzter Minute aufwies, das schottische Titelrennen offenhielt und wettbewerbsfähig machte. Die Ergebnisse behalten Hearts' Position in ihrem Meisterschaftsstreben."
      },
      "es": {
        "title": "Escucha: ¿Está Hearts a nueve juegos del título después del drama del derbi Old Firm?",
        "summary": "Hearts registró otra victoria mientras que un partido Old Firm presentó un empate dramático tardío, manteniendo la carrera por el título escocés abierta y competitiva. Los resultados mantienen la posición de Hearts en su búsqueda del campeonato."
      }
    }
  },
  {
    "title": "What can players and clubs do about 'AI slop'?",
    "slug": "ai-slop-football",
    "url": "https://www.bbc.com/sport/football/articles/cy8pdr55219o?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-02T07:48:48.000Z",
    "summary": "There has been exponential growth in AI-generated content involving football players and clubs that many in the sport consider of poor quality. The article examines what measures players and organizations can take to address the issue.",
    "content": "There is an exponential growth of AI 'slop' involving players and football clubs. Is there anything that can be done to stop it?",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "球员和俱乐部如何应对\"AI垃圾\"?",
        "summary": "AI生成的内容涉及足球运动员和俱乐部的数量呈指数级增长，体育界许多人认为这些内容质量低劣。本文审视了球员和组织可以采取哪些措施来解决这一问题。"
      },
      "fr": {
        "title": "Que peuvent faire les joueurs et les clubs contre le \"contenu IA de mauvaise qualité\"?",
        "summary": "Il y a une croissance exponentielle du contenu généré par l'IA impliquant des joueurs et des clubs de football que beaucoup dans le sport considèrent de mauvaise qualité. L'article examine les mesures que les joueurs et les organisations peuvent prendre pour résoudre le problème."
      },
      "de": {
        "title": "Was können Spieler und Clubs gegen \"KI-Müll\" tun?",
        "summary": "Es gibt exponentielles Wachstum bei KI-generiertem Inhalt mit Fußballspielern und Clubs, die viele im Sport als minderwertig betrachten. Der Artikel untersucht, welche Maßnahmen Spieler und Organisationen ergreifen können, um das Problem zu beheben."
      },
      "es": {
        "title": "¿Qué pueden hacer los jugadores y clubes sobre el \"contenido generado por IA de baja calidad\"?",
        "summary": "Ha habido un crecimiento exponencial en contenido generado por IA que involucra a jugadores y clubes de fútbol que muchos en el deporte consideran de baja calidad. El artículo examina qué medidas pueden tomar los jugadores y las organizaciones para abordar el problema."
      }
    }
  },
  {
    "title": "'Russell in talks over Dundee United return' - gossip",
    "slug": "russell-dundee-united-transfer",
    "url": "https://www.bbc.com/sport/football/articles/c78jell37ezo?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-02T07:42:03.000Z",
    "summary": "Dundee United are in negotiations with Johnny Russell about a potential return to the club, while Kilmarnock's Marcus Dackers is reportedly heading toward a six-figure transfer. These moves represent significant activity in Scottish football's transfer market.",
    "content": "Dundee United are reportedly in talks with Johnny Russell about a return to Tannadice as Marcus Dackers in tipped to leave Kilmarnock in a six-figure transfer.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"拉塞尔与邓迪联队谈判回归\"——传言",
        "summary": "邓迪联队正在与约翰尼·拉塞尔就潜在回归俱乐部进行谈判，同时基马诺克的马库斯·达克斯据报道正在谈判一项六位数的转会。这些举动代表了苏格兰足球转会市场中的重大活动。"
      },
      "fr": {
        "title": "\"Russell en pourparlers pour un retour à Dundee United\" - rumeur",
        "summary": "Dundee United est en négociations avec Johnny Russell pour un retour potentiel au club, tandis que Marcus Dackers de Kilmarnock se dirigerait vers un transfert à six chiffres. Ces mouvements représentent une activité importante sur le marché des transferts du football écossais."
      },
      "de": {
        "title": "\"Russell im Gespräch über Rückkehr zu Dundee United\" - Gerüchte",
        "summary": "Dundee United führt Verhandlungen mit Johnny Russell über eine mögliche Rückkehr zum Verein, während Marcus Dackers von Kilmarnock Berichten zufolge einen sechsstelligen Transfer anstrebt. Diese Züge stellen erhebliche Aktivitäten auf dem Transfermarkt des schottischen Fußballs dar."
      },
      "es": {
        "title": "\"Russell en negociaciones sobre retorno a Dundee United\" - rumor",
        "summary": "El Dundee United está en negociaciones con Johnny Russell sobre un posible regreso al club, mientras que Marcus Dackers del Kilmarnock se dirige hacia una transferencia de seis cifras. Estos movimientos representan una actividad significativa en el mercado de transferencias del fútbol escocés."
      }
    }
  },
  {
    "title": "Heaps, Shaw lead USWNT to win over Argentina",
    "slug": "heaps-shaw-lead-uswnt-win-over-argentina",
    "url": "https://www.espn.com/soccer/report/_/gameId/401846987",
    "source": "ESPN Soccer",
    "date": "2026-03-02T05:17:17.000Z",
    "summary": "Lindsey Heaps and Jaedyn Shaw scored to give the USWNT a 2-0 win over Argentina in the SheBelieves Cup, extending their shutout streak to six games. This victory demonstrates the team's strong defensive form heading into international competition.",
    "content": "Lindsey Heaps had a goal and an assist, and Jaedyn Shaw also scored to propel the United States to a sixth straight shutout victory with a 2-0 win over Argentina in the SheBelieves Cup on Sunday.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "希普斯、肖领导美国女足击败阿根廷",
        "summary": "林赛·希普斯和贾埃丁·肖进球，使美国女足在她相信杯中以2-0击败阿根廷，将零封纪录延续至六场比赛。这场胜利展示了该队在国际比赛前的强大防线。"
      },
      "fr": {
        "title": "Heaps et Shaw menent l'USWNT à la victoire sur l'Argentine",
        "summary": "Lindsey Heaps et Jaedyn Shaw ont marqué pour donner à l'USWNT une victoire 2-0 sur l'Argentine lors du SheBelieves Cup, prolongeant leur série de buts blanchis à six matchs. Cette victoire démontre la forte forme défensive de l'équipe en préparation de la compétition internationale."
      },
      "de": {
        "title": "Heaps und Shaw führen USWNT zum Sieg über Argentinien",
        "summary": "Lindsey Heaps und Jaedyn Shaw erzielten Tore, um der USWNT einen 2-0-Sieg über Argentinien beim SheBelieves Cup zu sichern und ihre Serie ohne Gegentor auf sechs Spiele auszudehnen. Dieser Sieg zeigt die starke defensive Form des Teams vor dem internationalen Wettbewerb."
      },
      "es": {
        "title": "Heaps y Shaw lideran victoria de USWNT sobre Argentina",
        "summary": "Lindsey Heaps y Jaedyn Shaw anotaron para darle a USWNT una victoria de 2-0 sobre Argentina en la Copa SheBelieves, extendiendo su racha de portería en cero a seis juegos. Esta victoria demuestra la sólida forma defensiva del equipo en preparación para la competencia internacional."
      }
    }
  },
  {
    "title": "Wales boss Wilkinson to continue rotating keepers",
    "slug": "wales-wilkinson-goalkeepers",
    "url": "https://www.bbc.com/sport/football/articles/cpv81j3jldno?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-02T04:40:38.000Z",
    "summary": "Wales head coach Rhian Wilkinson plans to continue rotating her goalkeepers throughout the Women's World Cup qualifying campaign. The rotational approach indicates confidence in multiple goalkeeper options.",
    "content": "Head coach Rhian Wilkinson intends to continue rotating her goalkeepers during Wales' Women's World Cup qualifying campaign.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "威尔士主教练威尔金森继续轮换门将",
        "summary": "威尔士女足主教练里安·威尔金森计划在女子世界杯预选赛期间继续轮换门将。轮换方式表明对多个门将选择的信心。"
      },
      "fr": {
        "title": "La patronne du Pays de Galles, Wilkinson, continuera à faire tourner les gardiens",
        "summary": "La sélectionneuse du Pays de Galles, Rhian Wilkinson, prévoit de continuer à faire tourner ses gardiens de but tout au long des éliminatoires de la Coupe du monde féminine. L'approche de rotation indique la confiance dans plusieurs options de gardien."
      },
      "de": {
        "title": "Walisischer Trainer Wilkinson wird die Torwartrotation fortsetzen",
        "summary": "Die walisische Trainerin Rhian Wilkinson plant, ihre Torwarte während der Qualifikation zur Frauenfußball-Weltmeisterschaft weiterhin zu wechseln. Der Rotationsansatz zeigt Vertrauen in mehrere Torwartoptionen."
      },
      "es": {
        "title": "La jefa de Gales, Wilkinson, continuará rotando porteras",
        "summary": "La entrenadora de Gales, Rhian Wilkinson, planea continuar rotando a sus porteras a lo largo de la campaña de calificación para la Copa Mundial Femenina. El enfoque de rotación indica confianza en múltiples opciones de portera."
      }
    }
  },
  {
    "title": "Mourinho: 'Over' for Prestianni if guilty of abuse",
    "slug": "mourinho-over-prestianni-if-guilty-of-abuse",
    "url": "https://www.espn.com/soccer/story/_/id/48077297/mourinho-prestianni-benfica-guilty",
    "source": "ESPN Soccer",
    "date": "2026-03-02T03:51:52.000Z",
    "summary": "Jose Mourinho stated that Gianluca Prestianni's future at Benfica would end if he is found guilty of racially abusing Real Madrid's Vinícius Júnior. The statement emphasizes the club's zero-tolerance policy on racial abuse.",
    "content": "Jose Mourinho said Gianluca Prestianni will have no future at Benfica if he is found guilty of racially abusing Real Madrid's Vinícius Júnior.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "穆里尼奥：普雷斯蒂亚尼若有罪将\"结束\"",
        "summary": "若瑞尼亚迪斯蒂亚尼被判对皇马维尼修斯·朱尼奥尔进行种族辱骂，何塞·穆里尼奥表示他在本菲卡的未来将结束。这一声明强调了俱乐部对种族辱骂的零容忍政策。"
      },
      "fr": {
        "title": "Mourinho : \"Fini\" pour Prestianni s'il est coupable d'abus",
        "summary": "Jose Mourinho a déclaré que l'avenir de Gianluca Prestianni à Benfica prendrait fin s'il était reconnu coupable d'abus racial envers Vinícius Júnior du Real Madrid. La déclaration souligne la politique de zéro tolérance du club envers les abus raciaux."
      },
      "de": {
        "title": "Mourinho: \"Vorbei\" für Prestianni bei Schuldspruch wegen Missbrauch",
        "summary": "Jose Mourinho erklärte, dass Gianluca Prestiannis Zukunft bei Benfica enden würde, falls er wegen rassistischer Beleidigung gegen Vinícius Júnior von Real Madrid schuldig befunden wird. Die Aussage unterstreicht die Null-Toleranz-Politik des Clubs gegenüber rassistischem Missbrauch."
      },
      "es": {
        "title": "Mourinho: \"Fin\" para Prestianni si es culpable de abuso",
        "summary": "Jose Mourinho afirmó que el futuro de Gianluca Prestianni en el Benfica terminaría si es declarado culpable de abusar racialmente a Vinícius Júnior del Real Madrid. La declaración enfatiza la política de cero tolerancia del club hacia el abuso racial."
      }
    }
  },
  {
    "title": "Messi's first goals of season inspire big Miami rally",
    "slug": "messi-first-goals-season-inspire-big-miami-rally",
    "url": "https://www.espn.com/soccer/report/_/gameId/761467",
    "source": "ESPN Soccer",
    "date": "2026-03-02T03:51:52.000Z",
    "summary": "Lionel Messi scored twice as Inter Miami CF rallied from behind to defeat Orlando City SC 4-2, with defender Telasco Segovia also contributing a goal and two assists. The victory showcases the defending champions' ability to mount comebacks with their star players in form.",
    "content": "Lionel Messi scored twice in a four-goal second half, defender Telasco Segovia added a goal and two assists and defending champion Inter Miami CF rallied to beat Orlando City SC 4-2 on Sunday night.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "梅西本赛季首球激励迈阿密大翻身",
        "summary": "莱昂内尔·梅西打进两球，国际迈阿密队反超战胜奥兰多城队4-2，后卫特拉斯科·塞戈维亚也贡献一球和两次助攻。这场胜利展示了卫冕冠军在明星球员发挥出色时的反扑能力。"
      },
      "fr": {
        "title": "Les premiers buts de la saison de Messi inspirent un grand retour de Miami",
        "summary": "Lionel Messi a marqué deux fois alors que l'Inter Miami CF a réussi un retour remarquable pour vaincre Orlando City SC 4-2, le défenseur Telasco Segovia contribuant également avec un but et deux passes décisives. La victoire montre la capacité des champions en titre à monter des remontadas avec leurs vedettes en forme."
      },
      "de": {
        "title": "Messis erste Saisontore inspirieren großes Miami-Comeback",
        "summary": "Lionel Messi erzielte zweimal, als Inter Miami CF von hinten aufholte und Orlando City SC 4-2 besiegte, wobei Abwehrspieler Telasco Segovia mit einem Tor und zwei Vorlagen beitrug. Der Sieg zeigt die Fähigkeit der Titelverteidiger, Comebacks mit ihren Topspielern in Form zu erreichen."
      },
      "es": {
        "title": "Los primeros goles de la temporada de Messi inspiran gran remontada de Miami",
        "summary": "Lionel Messi anotó dos goles mientras Inter Miami CF se recuperó de atrás para derrotar a Orlando City SC 4-2, y el defensa Telasco Segovia también contribuyó con un gol y dos asistencias. La victoria muestra la capacidad de los campeones defensores de hacer remontadas con sus jugadores estrella en forma."
      }
    }
  },
  {
    "title": "Hayes sees 'growth' in USWNT since Portugal loss",
    "slug": "hayes-sees-growth-uswnt-since-portugal-loss",
    "url": "https://www.espn.com/soccer/story/_/id/48077631/emma-hayes-sees-growth-uswnt-portugal-loss",
    "source": "ESPN Soccer",
    "date": "2026-03-02T03:51:51.000Z",
    "summary": "Coach Emma Hayes praised her team's emotional control in the USWNT's 2-0 victory over Argentina in the SheBelieves Cup, noting positive development since a previous loss to Portugal. The win demonstrates the team's resilience and tactical improvement.",
    "content": "United States coach Emma Hayes said she was pleased with her team's emotional control in a \"scrappy\" 2-0 victory over Argentina on Sunday to open the 2026 SheBelieves Cup in Nashville, Tennessee.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "海耶斯看到美国女足自葡萄牙失利后的\"成长\"",
        "summary": "埃玛·海耶斯教练在美国女足在谢信杯上以2-0战胜阿根廷的比赛中赞扬了她的球队的情绪控制，并指出自葡萄牙之前的失利以来取得了积极进展。这次胜利展示了球队的韧性和战术改进。"
      },
      "fr": {
        "title": "Hayes voit de la « croissance » chez l'USWNT depuis la défaite contre le Portugal",
        "summary": "L'entraîneuse Emma Hayes a félicité le contrôle émotionnel de son équipe dans la victoire 2-0 de l'USWNT contre l'Argentine à la Coupe SheBelieves, notant un développement positif depuis une défaite antérieure contre le Portugal. La victoire démontre la résilience de l'équipe et son amélioration tactique."
      },
      "de": {
        "title": "Hayes sieht \"Wachstum\" bei der USWNT seit der Niederlage gegen Portugal",
        "summary": "Trainerin Emma Hayes lobte die emotionale Kontrolle ihres Teams beim 2:0-Sieg der USWNT über Argentinien im SheBelieves Cup und vermerkte positive Entwicklungen seit einer vorherigen Niederlage gegen Portugal. Der Sieg zeigt die Widerstandsfähigkeit des Teams und ihre taktische Verbesserung."
      },
      "es": {
        "title": "Hayes ve \"crecimiento\" en la USWNT desde la derrota contra Portugal",
        "summary": "La entrenadora Emma Hayes elogió el control emocional de su equipo en la victoria 2-0 de la USWNT sobre Argentina en la Copa SheBelieves, señalando un desarrollo positivo desde una derrota anterior contra Portugal. La victoria demuestra la resiliencia del equipo y su mejora táctica."
      }
    }
  },
  {
    "title": "Follow live: Messi, Miami visit Orlando seeking first win of 2026",
    "slug": "messi-miami-orlando-first-win-2026",
    "url": "https://www.espn.com/soccer/match/_/gameId/761467/inter-miami-cf-orlando-city-sc",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:22:22.000Z",
    "summary": "Inter Miami seek their first win of 2026 as they visit Orlando in a live match featuring Lionel Messi. The team looks to improve their early season record.",
    "content": "null",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "现场直播：梅西、迈阿密客战奥兰多，力求2026赛季首胜",
        "summary": "迈阿密国际队在客场挑战奥兰多城队，力求取得2026赛季的首场胜利。这场直播比赛将有梅西的参加。球队希望改善赛季初期的战绩。"
      },
      "fr": {
        "title": "En direct : Messi et Miami visitent Orlando à la recherche de la première victoire de 2026",
        "summary": "L'Inter Miami cherche sa première victoire de 2026 en visitant Orlando dans un match en direct mettant en vedette Lionel Messi. L'équipe cherche à améliorer son bilan en début de saison."
      },
      "de": {
        "title": "Live: Messi und Miami besuchen Orlando auf der Suche nach dem ersten Sieg 2026",
        "summary": "Inter Miami sucht seinen ersten Sieg 2026, während sie Orlando in einem Liveübertragungs-Match mit Lionel Messi besuchen. Das Team möchte seine Bilanz in der frühen Saison verbessern."
      },
      "es": {
        "title": "En vivo: Messi y Miami visitan a Orlando buscando su primer triunfo de 2026",
        "summary": "Inter Miami busca su primer triunfo de 2026 mientras visita a Orlando en un partido en vivo que presenta a Lionel Messi. El equipo busca mejorar su récord de principios de temporada."
      }
    }
  },
  {
    "title": "Follow live: USWNT faces off against Argentina in SheBelieves Cup battle",
    "slug": "uswnt-argentina-shebelieves-cup",
    "url": "https://www.espn.com/soccer/match/_/gameId/401846987/argentina-united-states",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:20:32.000Z",
    "summary": "The USWNT plays Argentina in a SheBelieves Cup match, a key tournament for women's international soccer.",
    "content": "null",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "现场直播：美国女足对阵阿根廷，谢贝利夫杯激战",
        "summary": "美国女足在谢贝利夫杯中与阿根廷对战，这是女子国际足球的关键赛事。"
      },
      "fr": {
        "title": "En direct : L'USWNT affronte l'Argentine dans la bataille de la Coupe SheBelieves",
        "summary": "L'USWNT joue contre l'Argentine dans un match de la Coupe SheBelieves, un tournoi clé pour le soccer féminin international."
      },
      "de": {
        "title": "Live: USWNT trifft in der SheBelieves Cup auf Argentinien",
        "summary": "Die USWNT spielt gegen Argentinien in einem SheBelieves Cup-Spiel, einem wichtigen Turnier für internationalen Frauenfußball."
      },
      "es": {
        "title": "En vivo: USWNT se enfrenta a Argentina en la batalla de la Copa SheBelieves",
        "summary": "La USWNT juega contra Argentina en un partido de la Copa SheBelieves, un torneo clave para el fútbol femenino internacional."
      }
    }
  },
  {
    "title": "Arsenal riding corner kicks to Premier League title; Chelsea's red card problem continues",
    "slug": "arsenal-corner-kicks-chelsea-red-cards",
    "url": "https://www.espn.com/soccer/story/_/id/48073847/arsenal-riding-corner-kicks-premier-league-title-chelsea-red-cards-continue",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:12:47.000Z",
    "summary": "Arsenal is excelling through dominance on corner kicks and maintains the Premier League title lead, while Chelsea continues to struggle with disciplinary issues including multiple red cards.",
    "content": "Arsenal may be the most dominant corner kick team the Premier League has ever seen. Meanwhile, Chelsea keep hurting themselves with red cards.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "阿森纳借助角球优势领跑英超，切尔西红牌问题继续困扰",
        "summary": "阿森纳通过在角球上的主动性取得了英超冠军领先，同时切尔西继续为包括多张红牌在内的纪律问题所困扰。"
      },
      "fr": {
        "title": "Arsenal mène la Premier League grâce à sa domination sur les coups de coin ; le problème des cartons rouges de Chelsea persiste",
        "summary": "Arsenal excelle grâce à sa domination sur les coups de coin et maintient sa place de leader de la Premier League, tandis que Chelsea continue de lutter avec des problèmes de discipline incluant plusieurs cartons rouges."
      },
      "de": {
        "title": "Arsenal führt die Premier League an, dank Dominanz bei Ecken; Chelseas Problem mit roten Karten bleibt bestehen",
        "summary": "Arsenal zeichnet sich durch seine Dominanz bei Eckbällen aus und behält die Führung in der Premier League, während Chelsea weiterhin mit Disziplinarproblemen kämpft, einschließlich mehrerer roter Karten."
      },
      "es": {
        "title": "Arsenal lidera la Premier League gracias al dominio en tiros de esquina; el problema de tarjetas rojas de Chelsea continúa",
        "summary": "Arsenal destaca por su dominio en los saques de esquina y mantiene el liderato de la Premier League, mientras que Chelsea continúa luchando con problemas disciplinarios que incluyen múltiples tarjetas rojas."
      }
    }
  },
  {
    "title": "Iran federation says participation in WC in doubt",
    "slug": "iran-federation-world-cup-participation",
    "url": "https://www.espn.com/soccer/story/_/id/48074546/iran-soccer-federation-world-cup-participation-doubt",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:12:38.000Z",
    "summary": "Iran's soccer federation president questions whether the national team can participate in the World Cup in the United States following recent U.S. and Israeli military action against the country.",
    "content": "The president of Iran's soccer federation says he does not know if the national team can play World Cup matches in the United States following the surprise U.S. and Israeli bombardment of his country.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "伊朗足协表示世界杯参赛前景不明",
        "summary": "伊朗足协主席质疑，在美国和以色列最近对该国的军事行动后，伊朗国家队是否能够参加世界杯比赛。"
      },
      "fr": {
        "title": "La fédération iranienne doute de la participation à la Coupe du monde",
        "summary": "Le président de la fédération iranienne de football remet en question la capacité de l'équipe nationale à participer à la Coupe du monde aux États-Unis suite aux récentes actions militaires américaines et israéliennes contre le pays."
      },
      "de": {
        "title": "Iranischer Verband stellt WM-Teilnahme in Frage",
        "summary": "Der Präsident des iranischen Fußballverbandes zweifelt daran, ob die Nationalmannschaft nach den jüngsten militärischen Aktionen der USA und Israels gegen das Land an der Weltmeisterschaft in den USA teilnehmen kann."
      },
      "es": {
        "title": "Federación iraní cuestiona participación en Copa del Mundo",
        "summary": "El presidente de la federación de fútbol de Irán cuestiona si el equipo nacional puede participar en la Copa del Mundo en Estados Unidos después de las recientes acciones militares estadounidenses e israelíes contra el país."
      }
    }
  },
  {
    "title": "Arteta: 'Heart almost stopped' on late Raya save",
    "slug": "arteta-raya-save-arsenal-chelsea",
    "url": "https://www.espn.com/soccer/story/_/id/48074318/heart-almost-stopped-late-raya-save",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:12:38.000Z",
    "summary": "Arsenal manager Mikel Arteta praised goalkeeper David Raya's crucial late-game save in Arsenal's 2-1 victory over Chelsea, which keeps the team atop the Premier League standings.",
    "content": "Mikel Arteta hailed David Raya's performance in Arsenal's 2-1 win against Chelsea after saying his \"heart almost stopped\" before the goalkeeper made a crucial stoppage time save to keep the Gunners in pole position in the Premier League title race.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "阿尔特塔：\"心脏几乎停止\"拉亚关键扑救",
        "summary": "阿森纳主教练米克尔·阿尔特塔称赞门神大卫·拉亚在阿森纳2-1击败切尔西比赛中关键时刻的精彩扑救，这场胜利使球队保持英超领先位置。"
      },
      "fr": {
        "title": "Arteta : le cœur \"a presque arrêté\" sur l'arrêt décisif de Raya",
        "summary": "Le manager d'Arsenal Mikel Arteta a félicité le gardien David Raya pour son arrêt décisif en fin de match dans la victoire 2-1 d'Arsenal contre Chelsea, qui maintient l'équipe en tête de la Premier League."
      },
      "de": {
        "title": "Arteta: \"Das Herz blieb fast stehen\" bei Rayas entscheidendem Reflex",
        "summary": "Arsenal-Manager Mikel Arteta lobte Torwart David Rayas entscheidenden Reflex in der Schlussphase von Arsenals 2-1-Sieg über Chelsea, der das Team an der Spitze der Premier League hält."
      },
      "es": {
        "title": "Arteta: \"El corazón casi se detiene\" por la crucial parada de Raya",
        "summary": "El manager del Arsenal Mikel Arteta elogió la parada crucial del portero David Raya en los últimos minutos del partido en la victoria 2-1 del Arsenal sobre el Chelsea, que mantiene al equipo en la cima de la Premier League."
      }
    }
  },
  {
    "title": "Late Aubameyang goals lead Marseille past Lyon",
    "slug": "aubameyang-marseille-lyon-comeback",
    "url": "https://www.espn.com/soccer/report/_/gameId/746623",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:12:38.000Z",
    "summary": "Pierre-Emerick Aubameyang scored twice in the final nine minutes to lead Marseille to a dramatic 3-2 comeback victory over Lyon in Ligue 1.",
    "content": "Pierre-Emerick Aubameyang struck twice in the final nine minutes as Marseille came from behind to snatch a dramatic 3-2 win over Lyon in Ligue 1.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "阿布巴梅扬补时进球助马赛战胜里昂",
        "summary": "皮埃尔-埃梅里克·阿布巴梅扬在最后9分钟内连进两球，帮助马赛以3-2逆转战胜法甲对手里昂。"
      },
      "fr": {
        "title": "Les buts tardifs d'Aubameyang permettent à Marseille de battre Lyon",
        "summary": "Pierre-Emerick Aubameyang a marqué deux fois dans les neuf dernières minutes pour mener Marseille à une victoire remarquable 3-2 contre Lyon en Ligue 1."
      },
      "de": {
        "title": "Aubameyangus Spättore führen Marseille zum Sieg über Lyon",
        "summary": "Pierre-Emerick Aubameyang erzielte in den letzten neun Minuten zwei Tore und führte Marseille zu einem dramatischen 3-2-Comeback-Sieg gegen Lyon in der Ligue 1."
      },
      "es": {
        "title": "Goles tardíos de Aubameyang dan victoria a Marsella sobre Lyon",
        "summary": "Pierre-Emerick Aubameyang marcó dos goles en los últimos nueve minutos para llevar al Marsella a una dramática victoria de 3-2 sobre Lyon en la Ligue 1."
      }
    }
  },
  {
    "title": "LaLiga game stopped for anti-racism protocol",
    "slug": "laliga-anti-racism-espanyol-elche",
    "url": "https://www.espn.com/soccer/story/_/id/48076288/espanyol-elche-la-liga-game-stopped-referee-anti-racism-protocol",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:12:38.000Z",
    "summary": "An Espanyol versus Elche LaLiga match ended 2-2 after being briefly paused when the referee activated UEFA's anti-racism protocol.",
    "content": "Espanyol and Elche drew 2-2 on Sunday in a LaLiga match briefly interrupted toward the end after the referee activated the anti-racism protocol.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "西甲比赛因反种族歧视协议中止",
        "summary": "埃斯帕尼奥尔与埃尔切的西甲比赛在裁判启动欧足联反种族歧视协议后短暂暂停，最终以2-2平手结束。"
      },
      "fr": {
        "title": "Match de La Liga suspendu pour le protocole anti-racisme",
        "summary": "Un match de La Liga entre Espanyol et Elche s'est terminé 2-2 après une brève pause lorsque l'arbitre a activé le protocole anti-racisme de l'UEFA."
      },
      "de": {
        "title": "La Liga Spiel wegen Anti-Rassismus-Protokoll unterbrochen",
        "summary": "Ein La Liga Spiel zwischen Espanyol und Elche endete 2-2, nachdem es kurz unterbrochen wurde, als der Schiedsrichter das Anti-Rassismus-Protokoll der UEFA aktivierte."
      },
      "es": {
        "title": "Partido de La Liga detenido por protocolo antirracismo",
        "summary": "Un partido de La Liga entre Espanyol y Elche terminó 2-2 después de una breve pausa cuando el árbitro activó el protocolo antirracismo de la UEFA."
      }
    }
  },
  {
    "title": "Tudor slams 'cheating' Fulham after Spurs loss",
    "slug": "tudor-fulham-tottenham-loss",
    "url": "https://www.espn.com/soccer/story/_/id/48073570/igor-tudor-bemoans-tottenham-problems-says-fulham-cheated",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:12:38.000Z",
    "summary": "Tottenham interim manager Igor Tudor criticized Fulham for \"cheating\" and expressed frustration with his own players following another loss.",
    "content": "Tottenham interim head coach Igor Tudor took aim at his own players before he slammed \"cheating\" Fulham after another defeat.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "图德在热刺失利后抨击富勒姆\"作弊\"",
        "summary": "热刺临时主帅伊戈尔·图德在又一次失利后批评富勒姆\"作弊\"，并对自己的球员表示不满。"
      },
      "fr": {
        "title": "Tudor critique Fulham pour \"triche\" après la défaite de Tottenham",
        "summary": "Le manager intérimaire de Tottenham, Igor Tudor, a critiqué Fulham pour \"tricher\" et a exprimé sa frustration envers ses propres joueurs suite à une nouvelle défaite."
      },
      "de": {
        "title": "Tudor kritisiert Fulham wegen \"Betrug\" nach Spurs-Niederlage",
        "summary": "Tottenams Interimsmanager Igor Tudor kritisierte Fulham wegen \"Betrug\" und drückte seine Frustration über seine eigenen Spieler nach einer weiteren Niederlage aus."
      },
      "es": {
        "title": "Tudor critica a Fulham por \"trampa\" después de la derrota de Spurs",
        "summary": "El entrenador interino del Tottenham, Igor Tudor, criticó a Fulham por \"trampa\" y expresó su frustración con sus propios jugadores después de otra derrota."
      }
    }
  },
  {
    "title": "United got 'Old Trafford bonus' in win - Palace boss",
    "slug": "old-trafford-bonus-manchester-united",
    "url": "https://www.espn.com/soccer/story/_/id/48074032/man-united-got-old-trafford-bonus-win-crystal-palace-oliver-glasner",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:12:37.000Z",
    "summary": "Crystal Palace manager Oliver Glasner criticized the penalty decision that favored Manchester United in their 2-1 victory, claiming it reflects home advantage bias.",
    "content": "Crystal Palace manager Oliver Glasner has branded the decision to award Manchester United a penalty in their 2-1 defeat on Sunday an \"Old Trafford bonus.\"",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "水晶宫主帅：曼联在胜利中得到\"老特拉福德红利\"",
        "summary": "水晶宫主帅奥利弗·格拉斯纳批评了有利于曼联的点球判罚，声称这反映了主场优势偏见，曼联以2-1获胜。"
      },
      "fr": {
        "title": "Boss de Palace : United a bénéficié du \"bonus Old Trafford\" dans leur victoire",
        "summary": "Le manager de Crystal Palace, Oliver Glasner, a critiqué la décision de penalty en faveur de Manchester United dans leur victoire 2-1, affirmant qu'elle reflète un biais d'avantage à domicile."
      },
      "de": {
        "title": "Palace-Chef: United bekam \"Old Trafford Bonus\" im Sieg",
        "summary": "Cristal Palaces Manager Oliver Glasner kritisierte die Elfmeterentscheidung, die Manchester United in ihrem 2-1-Sieg begünstigte, und behauptete, dass dies einen Heimvorteilsbias widerspiegelt."
      },
      "es": {
        "title": "Jefe del Palace: United obtuvo el \"bono Old Trafford\" en la victoria",
        "summary": "El entrenador del Crystal Palace, Oliver Glasner, criticó la decisión de penalti que favoreció a Manchester United en su victoria 2-1, afirmando que refleja un sesgo de ventaja en casa."
      }
    }
  },
  {
    "title": "Infantino calls for red cards for covering mouths",
    "slug": "infantino-red-cards-covering-mouths",
    "url": "https://www.espn.com/soccer/story/_/id/48073911/fifa-boss-gianni-infantino-calls-red-cards-players-cover-mouths",
    "source": "ESPN Soccer",
    "date": "2026-03-02T00:12:37.000Z",
    "summary": "FIFA president Gianni Infantino proposes issuing red cards to players who cover their mouths during on-pitch confrontations, a controversial new disciplinary measure.",
    "content": "FIFA president Gianni Infantino has called for players who cover their mouth in on-pitch confrontations to be sent off.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "因凡蒂诺呼吁对遮住嘴巴的球员出示红牌",
        "summary": "FIFA主席詹尼·因凡蒂诺提议对在场上对峙中遮住嘴巴的球员出示红牌，这是一项有争议的新纪律措施。"
      },
      "fr": {
        "title": "Infantino demande des cartons rouges pour avoir couvert la bouche",
        "summary": "Le président de la FIFA, Gianni Infantino, propose d'adresser des cartons rouges aux joueurs qui se couvrent la bouche lors de confrontations sur le terrain, une nouvelle mesure disciplinaire controversée."
      },
      "de": {
        "title": "Infantino fordert Rote Karten für Mundbedeckung",
        "summary": "FIFA-Präsident Gianni Infantino schlägt vor, rote Karten für Spieler auszustellen, die während Konfrontationen auf dem Spielfeld ihre Münder bedecken, eine umstrittene neue Disziplinarmaßnahme."
      },
      "es": {
        "title": "Infantino pide tarjetas rojas por cubrirse la boca",
        "summary": "El presidente de la FIFA, Gianni Infantino, propone emitir tarjetas rojas a los jugadores que se cubran la boca durante enfrentamientos en el campo, una medida disciplinaria nueva y controvertida."
      }
    }
  },
  {
    "title": "'They look all over the shop' - Hart",
    "slug": "tottenham-disorganisation-fulham",
    "url": "https://www.bbc.com/sport/football/videos/c9v0j9kdg0go?at_medium=RSS&at_campaign=rss",
    "source": "BBC Football",
    "date": "2026-03-02T00:11:40.000Z",
    "summary": "Match of the Day pundits analyze how Tottenham's disorganization and poor structure contributed significantly to their 2-1 loss to Fulham.",
    "content": "Match of the Day pundits Leon Osman and Joe Hart look at how Tottenham Hotspur's disorganisation played a big part in their 2-1 defeat against Fulham.",
    "category": "sports",
    "translations": {
      "zh": {
        "title": "\"他们看起来一片混乱\" - 哈特",
        "summary": "每日赛事评论员分析了托特纳姆热刺的混乱和糟糕的结构如何显著导致他们以1:2输给富勒姆。"
      },
      "fr": {
        "title": "\"Ils ont l'air complètement désorganisés\" - Hart",
        "summary": "Les commentateurs de Match of the Day analysent comment la désorganisation et la mauvaise structure de Tottenham ont considérablement contribué à leur défaite 2-1 contre Fulham."
      },
      "de": {
        "title": "\"Sie sehen völlig desorganisiert aus\" - Hart",
        "summary": "Match-of-the-Day-Experten analysieren, wie Tottenhams Desorganisation und schlechte Struktur wesentlich zu ihrer 2:1-Niederlage gegen Fulham beigetragen haben."
      },
      "es": {
        "title": "\"Se ven completamente desorganizados\" - Hart",
        "summary": "Los comentaristas de Match of the Day analizan cómo la desorganización y la mala estructura del Tottenham contribuyeron significativamente a su derrota 2-1 contra el Fulham."
      }
    }
  }
]