[
  {
    "title": "The Motorola Razr Fold is shaping up to be pure flagship",
    "slug": "motorola-razr-fold-flagship",
    "url": "https://www.theverge.com/tech/887249/motorola-razr-fold-specs-camera-silicon-carbon-battery",
    "source": "The Verge",
    "date": "2026-03-02T05:00:00.000Z",
    "summary": "Motorola's upcoming Razr Fold will be a premium-tier foldable phone priced at €1,999 (roughly $2,350) with the Moto Pen Ultra stylus, launching first in Europe before coming to North America. The device features a 6,000mAh silicon-carbon battery, making it the first foldable sold in North America to use this technology. This positions the Razr Fold as a high-end competitor in the folding phone market rather than a budget alternative.",
    "content": "It’s all starting to unfold. | Photo: Allison Johnson / The Verge\t\n\nMotorola has revealed a little more about its upcoming folding phone, and all signs point toward a premium option - not the budget-friendlier alternative the category could use. \nFor starters, the Razr Fold will cost €1,999 (about $2,350) bundled with the Moto Pen Ultra. It'll go on sale first in Europe, with North America to follow \"in the coming months.\" Motorola hasn't confirmed how much it will cost without the stylus, or what the price is in US dollars.\nThe Razr Fold will come with a huge 6,000mAh silicon-carbon battery, making it the first foldable sold in North America to use the technology. It's not quite the biggest battery on any …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "摩托罗拉 Razr Fold 正在成为纯旗舰机型",
        "summary": "摩托罗拉即将推出的 Razr Fold 是一款高端折叠屏手机,定价 €1,999(约合 $2,350),配备 Moto Pen Ultra 手写笔,首先在欧洲推出,随后登陆北美。该设备搭载 6,000mAh 硅碳电池,成为在北美销售的首款采用该技术的折叠屏手机。这使 Razr Fold 成为折叠屏手机市场中的高端竞争者,而不是预算型替代品。"
      },
      "fr": {
        "title": "Le Motorola Razr Fold s'annonce comme un pur flagship",
        "summary": "Le prochain Razr Fold de Motorola sera un téléphone pliable haut de gamme au prix de 1 999 € (environ 2 350 $) avec le stylet Moto Pen Ultra, lancé d'abord en Europe avant d'arriver en Amérique du Nord. L'appareil dispose d'une batterie en silicium-carbone de 6 000 mAh, ce qui en ferait le premier téléphone pliable vendu en Amérique du Nord à utiliser cette technologie. Cela positionne le Razr Fold comme un concurrent haut de gamme sur le marché des téléphones pliants plutôt qu'une alternative budgétaire."
      },
      "de": {
        "title": "Das Motorola Razr Fold entwickelt sich zu einem echten Flaggschiff",
        "summary": "Das kommende Motorola Razr Fold wird ein Premium-Falttelefon zum Preis von 1.999 € (etwa 2.350 $) mit dem Moto Pen Ultra Stylus sein und zunächst in Europa eingeführt werden, bevor es nach Nordamerika kommt. Das Gerät verfügt über einen 6.000-mAh-Silizium-Kohlenstoff-Akku und ist das erste in Nordamerika verkaufte Falttelefon mit dieser Technologie. Dies positioniert das Razr Fold als hochwertige Konkurrenz auf dem Markt für faltbare Telefone und nicht als budgetfreundliche Alternative."
      },
      "es": {
        "title": "El Motorola Razr Fold se perfila como un puro buque insignia",
        "summary": "El próximo Motorola Razr Fold será un teléfono plegable de gama premium con un precio de 1.999 € (aproximadamente $2.350) con el stylus Moto Pen Ultra, lanzándose primero en Europa antes de llegar a América del Norte. El dispositivo cuenta con una batería de silicio-carbono de 6.000 mAh, lo que lo convierte en el primer teléfono plegable vendido en América del Norte que utiliza esta tecnología. Esto posiciona al Razr Fold como un competidor de gama alta en el mercado de teléfonos plegables en lugar de una alternativa presupuestaria."
      }
    }
  }
]