[
  {
    "title": "A robot arm with puppy dog eyes is just one of Lenovo&#8217;s new desktop AI concepts",
    "slug": "robot-arm-puppy-dog-eyes-lenovo-ai-concept",
    "url": "https://www.theverge.com/tech/885228/lenovo-ai-workmate-companion-work-concept-robot-arm-desktop-clock-hub",
    "source": "The Verge",
    "date": "2026-03-01T23:01:00.000Z",
    "summary": "Lenovo's AI Workmate Concept, unveiled at MWC 2026, is a robotic arm with an expressive screen and local AI processing designed as a desk companion for office productivity and support.",
    "content": "The AI Workmate Concept can move and rotate to accomplish various tasks, but can it ever truly know love? | Image: Lenovo\t\n\nAlongside a handful of new laptop concepts (and a range of real products too), Lenovo used MWC to announce a pair of AI-based productivity companion concepts. Both are standalone desk devices designed to boost productivity while providing office workers with a bit of artificial dystopic companionship.\nLenovo describes its AI Workmate Concept as an \"always-on desk companion,\" but it looks like a tiny robotic arm on a swiveling base with a bulbous screen on the end displaying an expressive pair of eyes. It doesn't look as engaging as a human co-worker, but through local AI processing you can interact with the device as a smart assistant via v …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "联想推出配有小狗眼睛的机械臂等新型桌面AI概念产品",
        "summary": "联想在MWC 2026发布的AI Workmate概念产品是一款具有表情屏幕和本地AI处理功能的机械臂，被设计为办公生产力和支持的桌面伙伴。"
      },
      "fr": {
        "title": "Un bras robotisé avec des yeux de chiot est l'un des nouveaux concepts d'IA de bureau de Lenovo",
        "summary": "Le concept AI Workmate de Lenovo, présenté au MWC 2026, est un bras robotisé avec un écran expressif et un traitement d'IA local conçu comme un compagnon de bureau pour la productivité et le support au bureau."
      },
      "de": {
        "title": "Ein Roboterarm mit Welpenaugen ist eines von Lenovos neuen Desktop-KI-Konzepten",
        "summary": "Lenovos AI Workmate Concept, das auf der MWC 2026 enthüllt wurde, ist ein Roboterarm mit einem ausdrucksstarken Bildschirm und lokaler KI-Verarbeitung, der als Schreibtischbegleiter für Büroproduktivität und -unterstützung konzipiert ist."
      },
      "es": {
        "title": "Un brazo robótico con ojos de cachorro es uno de los nuevos conceptos de IA de escritorio de Lenovo",
        "summary": "El concepto AI Workmate de Lenovo, presentado en MWC 2026, es un brazo robótico con una pantalla expresiva y procesamiento de IA local diseñado como un compañero de escritorio para productividad y soporte de oficina."
      }
    }
  },
  {
    "title": "The new Yoga 9i 2-in-1 from Lenovo has an angled ‘canvas mode’ for easier note-taking",
    "slug": "yoga-9i-angled-canvas-mode-note-taking",
    "url": "https://www.theverge.com/tech/885724/lenovo-yoga-9i-2-in-1-angled-canvas-mode",
    "source": "The Verge",
    "date": "2026-03-01T23:01:00.000Z",
    "summary": "Lenovo's new Yoga 9i 2-in-1 convertible features a 2880 x 1800 120Hz OLED touchscreen that angles to an elevated position when a magnetic pen case attaches to the lid, improving ergonomics for drawing and note-taking.",
    "content": "The magnetic pen case is pulling wedge duty in there.\t\n\nLenovo has a few new Yoga laptops it's announcing at MWC 2026: the 14-inch Yoga Slim 7i Aura Edition, 15-inch Yoga Pro 7a, and 14-inch Yoga 9i 2-in-1 Aura Edition.\nThe most interesting of the pack is that 9i 2-in-1, outfitted with a 2880 x 1800, 120Hz OLED touchscreen. It includes a Yoga Pen Gen 2 stylus with a case that attaches to the laptop's lid. Fold the convertible back with the pen case attached and the screen sits at a slightly elevated angle. This should be more ergonomic while drawing and taking notes than writing on it flat, and the laptop has rounded edges and corners for a comfier grip. The 9i's main specs include an Intel Core …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "联想新款Yoga 9i二合一笔记本具有倾斜的\"画布模式\"以便更容易地记笔记",
        "summary": "联想新款Yoga 9i二合一可转换笔记本配备2880 x 1800 120Hz OLED触摸屏，当磁性笔套附着到盖子上时，屏幕会倾斜到一个升起的位置，改进了绘图和记笔记的人体工学设计。"
      },
      "fr": {
        "title": "Le nouveau Yoga 9i 2-en-1 de Lenovo a un mode 'toile' incliné pour faciliter la prise de notes",
        "summary": "Le nouveau Yoga 9i 2-en-1 convertible de Lenovo dispose d'un écran tactile OLED 2880 x 1800 120Hz qui s'incline à une position surélevée lorsqu'un étui de stylet magnétique s'attache au couvercle, améliorant l'ergonomie pour le dessin et la prise de notes."
      },
      "de": {
        "title": "Das neue Lenovo Yoga 9i 2-in-1 hat einen geneigten \"Canvas-Modus\" für einfachere Notizen",
        "summary": "Das neue Lenovo Yoga 9i 2-in-1 Convertible verfügt über einen 2880 x 1800 120Hz OLED-Touchscreen, der sich in eine erhöhte Position neigt, wenn ein magnetischer Stiftetui am Deckel befestigt wird, was die Ergonomie zum Zeichnen und Notizenmachen verbessert."
      },
      "es": {
        "title": "El nuevo Yoga 9i 2 en 1 de Lenovo tiene un modo \"lienzo\" inclinado para tomar notas más fácil",
        "summary": "El nuevo Yoga 9i 2 en 1 convertible de Lenovo cuenta con una pantalla táctil OLED de 2880 x 1800 120Hz que se inclina a una posición elevada cuando un estuche magnético de lápiz se adhiere a la tapa, mejorando la ergonomía para dibujar y tomar notas."
      }
    }
  },
  {
    "title": "Lenovo’s redesigned ThinkPad Detachable tablet has a bigger screen and legit keyboard",
    "slug": "thinkpad-detachable-bigger-screen-keyboard",
    "url": "https://www.theverge.com/tech/886134/lenovo-thinkpad-x13-detachable-tablet-t14-t14s-t16-laptops-price-specs",
    "source": "The Verge",
    "date": "2026-03-01T23:01:00.000Z",
    "summary": "Lenovo announced the ThinkPad X13 Detachable tablet at MWC 2026, marking the first major update to the line in five years with a larger screen and redesigned keyboard.",
    "content": "We’ve been waiting five years for this follow-up to the X12 Detachable. | Image: Lenovo\t\n\nLenovo is announcing five new ThinkPads and a new ThinkBook laptop for MWC 2026. There are various new chip offerings and updates for this swathe of ThinkPads,  but the device I find the most interesting is the X13 Detachable. We haven't seen a major update to Lenovo's tablet-style ThinkPad in years, when it was the X12 Detachable. \nThe new releases (and starting prices) are:\nThinkPad T14S Gen 7 ($1,899)\nThinkPad T14S 2-in-1 Gen 2 ($1,849)\nThinkPad T16 Gen 5 ($1,799)\nThinkPad T14 Gen 7 ($1,799)\nThinkPad X13 Detachable ($1,999)\nThinkBook 14 2-in-1 Gen 6 ($1,754)\nCompared to its predecessor, the X13 D …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "联想重新设计的ThinkPad Detachable平板电脑拥有更大的屏幕和真正的键盘",
        "summary": "联想在MWC 2026发布了ThinkPad X13 Detachable平板电脑，这是该产品线五年来的首次重大更新，配备更大的屏幕和重新设计的键盘。"
      },
      "fr": {
        "title": "La tablette ThinkPad Detachable redessinée de Lenovo dispose d'un plus grand écran et d'un vrai clavier",
        "summary": "Lenovo a annoncé la tablette ThinkPad X13 Detachable au MWC 2026, marquant la première mise à jour majeure de la gamme en cinq ans avec un écran plus grand et un clavier redessiné."
      },
      "de": {
        "title": "Lenovos umgestaltetes ThinkPad Detachable-Tablet hat einen größeren Bildschirm und eine echte Tastatur",
        "summary": "Lenovo kündigte das ThinkPad X13 Detachable Tablet auf der MWC 2026 an, was das erste Major-Update der Produktlinie in fünf Jahren mit einem größeren Bildschirm und einer neuen Tastatur markiert."
      },
      "es": {
        "title": "La tableta ThinkPad Detachable rediseñada de Lenovo tiene una pantalla más grande y un teclado legítimo",
        "summary": "Lenovo anunció la tableta ThinkPad X13 Detachable en MWC 2026, marcando la primera actualización importante de la línea en cinco años con una pantalla más grande y un teclado rediseñado."
      }
    }
  },
  {
    "title": "Lenovo made a Framework-like laptop with modular ports — and a second screen",
    "slug": "lenovo-thinkbook-modular-dual-screen-concept",
    "url": "https://www.theverge.com/tech/886814/lenovo-thinkbook-modular-ai-pc-concept-mwc-2026-specs",
    "source": "The Verge",
    "date": "2026-03-01T23:01:00.000Z",
    "summary": "Lenovo's ThinkBook Modular AI PC Concept features interchangeable ports and a removable 14-inch secondary display magnetically attached to the laptop, configurable for dual-screen productivity setups.",
    "content": "Lenovo goes a little Franken-laptop. | Photo: Antonio G. Di Benedetto / The Verge\t\n\nOne of Lenovo's big laptop concepts for MWC 2026 is a modular ThinkBook with two screens. Officially called the ThinkBook Modular AI PC Concept, the proof-of-concept is a 14-inch productivity machine with two plug-and-play interchangeable ports and a second 14-inch display magnetically attached to the rear of its lid. The second display is removable, and can be propped up on a magnetic kickstand (stored under the laptop) and plugged in via USB-C. \nBut this concept PC has one more trick: removing the keyboard / trackpad deck and replacing it with the second screen, turning the whole thing into a dual-screen laptop you use with the keyboard a …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "联想推出Framework风格的笔记本，配备模块化接口和双屏幕",
        "summary": "联想的ThinkBook模块化AI PC概念产品采用可互换端口和可拆卸的14英寸二级显示屏，该显示屏通过磁力固定在笔记本上，可配置为双屏生产力设置。"
      },
      "fr": {
        "title": "Lenovo a créé un ordinateur portable de type Framework avec des ports modulaires et un second écran",
        "summary": "Le Lenovo ThinkBook Modular AI PC Concept dispose de ports interchangeables et d'un écran secondaire 14 pouces amovible magnétiquement fixé à l'ordinateur portable, configurable pour les configurations de productivité à double écran."
      },
      "de": {
        "title": "Lenovo hat einen Framework-ähnlichen Laptop mit modularen Anschlüssen und einem zweiten Bildschirm entwickelt",
        "summary": "Das Lenovo ThinkBook Modular AI PC Concept verfügt über austauschbare Anschlüsse und ein abnehmbares 14-Zoll-Sekundärdisplay, das magnetisch am Laptop befestigt ist und für produktive Dual-Screen-Setups konfigurierbar ist."
      },
      "es": {
        "title": "Lenovo fabricó una portátil tipo Framework con puertos modulares y una segunda pantalla",
        "summary": "El concepto Lenovo ThinkBook Modular AI PC cuenta con puertos intercambiables y una pantalla secundaria removible de 14 pulgadas magnéticamente adherida a la portátil, configurable para configuraciones de productividad de doble pantalla."
      }
    }
  },
  {
    "title": "This Windows gaming handheld has a screen that folds in half",
    "slug": "legion-go-fold-gaming-handheld-foldable-screen",
    "url": "https://www.theverge.com/tech/886848/lenovo-legion-go-fold-concept-windows-foldable-pc-gaming-handheld",
    "source": "The Verge",
    "date": "2026-03-01T23:01:00.000Z",
    "summary": "The Legion Go Fold Concept is a Windows gaming handheld with a flexible POLED foldable display and detachable Joy-Con-like controllers that reposition for vertical or horizontal gameplay modes.",
    "content": "I love a tall boy.\t\n\nLenovo put a foldable display on a gaming handheld. The Legion Go Fold Concept is a Windows-based handheld with a flexible POLED display, detachable Joy-Con-like controllers, and a folio case to turn the whole thing into a mini laptop. \nYou can use it as a standard Steam Deck-esque handheld with the display folded down to 7.7 inches and controllers attached at its sides, or you can unfold it for a bigger experience. When unfolded, the controllers can be repositioned to all four sides, allowing you to play with the screen in vertical or horizontal orientations. \nIn vertical splitscreen mode, you can put your game on one half of the screen a …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "这款Windows游戏掌机配备可折叠屏幕",
        "summary": "Legion Go Fold概念产品是一款配备灵活POLED可折叠显示屏和可拆卸Joy-Con风格控制器的Windows游戏掌机，可重新定位以适应纵向或横向游戏模式。"
      },
      "fr": {
        "title": "Ce jeu de poche Windows a un écran qui se plie en deux",
        "summary": "Le concept Legion Go Fold est un jeu de poche Windows avec un écran POLED pliable flexible et des contrôleurs amovibles de style Joy-Con qui se repositionnent pour les modes de jeu verticaux ou horizontaux."
      },
      "de": {
        "title": "Dieses Windows-Gaming-Handheld hat einen Bildschirm, der sich in der Mitte faltet",
        "summary": "Das Legion Go Fold Concept ist ein Windows-Gaming-Handheld mit einem flexiblen POLED-Faltdisplay und abnehmbaren Joy-Con-ähnlichen Controllern, die sich für vertikale oder horizontale Spielmodi neu positionieren."
      },
      "es": {
        "title": "Este videojuego portátil de Windows tiene una pantalla que se dobla por la mitad",
        "summary": "El concepto Legion Go Fold es un videojuego portátil de Windows con una pantalla POLED plegable flexible y controles removibles estilo Joy-Con que se reposicionan para modos de juego verticales u horizontales."
      }
    }
  },
  {
    "title": "Portable Sonos Play speaker leaks on Canadian Best Buy",
    "slug": "portable-sonos-play-speaker-canadian-best-buy",
    "url": "https://www.theverge.com/tech/887220/sonos-play-leak",
    "source": "The Verge",
    "date": "2026-03-01T20:10:10.000Z",
    "summary": "A leaked Sonos Play portable speaker spotted on Canadian Best Buy features a compact design with loop handle, Wi-Fi, AirPlay 2, Bluetooth 5.3, and IP67 water resistance, with an expected March 31, 2026 release at CAD $399.99.",
    "content": "Why is this outdoor kitchen? | Image: Sonos\t\n\nAn unannounced Sonos speaker called Play has been spotted on the Canadian Best Buy site. The Sonos Play looks like a slightly shrunk-down version of the Move 2 with a loop on the back for toting it around. While nothing is confirmed yet, it's listed at CAD $399.99 with a release date of March 31st, 2026. In addition to Wi-Fi for multi-room Sonos setups with up to 32 speakers, there's support for AirPlay 2 and Bluetooth 5.3. There's even an aux in for hooking up to a turntable or other audio equipment.\nThe Best Buy listing mentions Trueplay, which automatically tunes sound to your environment. Unlike the Move, the Play says it's IP67 rated f …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "便携式Sonos Play扬声器在加拿大百思买泄露",
        "summary": "在加拿大百思买泄露的Sonos Play便携式扬声器具有紧凑设计、环形把手、Wi-Fi、AirPlay 2、蓝牙5.3和IP67防水功能，预期发布日期为2026年3月31日，价格为399.99加元。"
      },
      "fr": {
        "title": "L'enceinte portable Sonos Play se retrouve en ligne sur le Best Buy canadien",
        "summary": "L'enceinte portable Sonos Play divulguée aperçue sur le Best Buy canadien présente un design compact avec une poignée en boucle, Wi-Fi, AirPlay 2, Bluetooth 5.3 et une résistance à l'eau IP67, avec une sortie prévue le 31 mars 2026 à 399,99 CAD."
      },
      "de": {
        "title": "Tragbare Sonos Play Lautsprecher lecken auf kanadischem Best Buy",
        "summary": "Der durchgesickerte tragbare Sonos Play Lautsprecher, der auf dem kanadischen Best Buy gesichtet wurde, verfügt über ein kompaktes Design mit Schleifengriff, Wi-Fi, AirPlay 2, Bluetooth 5.3 und IP67-Wasserbeständigkeit mit geplanter Veröffentlichung am 31. März 2026 zu 399,99 CAD."
      },
      "es": {
        "title": "Altavoz portátil Sonos Play se filtra en Best Buy canadiense",
        "summary": "El altavoz portátil Sonos Play filtrado visto en Best Buy canadiense presenta un diseño compacto con asa de bucle, Wi-Fi, AirPlay 2, Bluetooth 5.3 y resistencia al agua IP67, con un lanzamiento previsto para el 31 de marzo de 2026 a 399,99 CAD."
      }
    }
  },
  {
    "title": "Polymarket saw $529M traded on bets tied to bombing of Iran",
    "slug": "polymarket-529m-traded-iran-bombing-bets",
    "url": "https://techcrunch.com/2026/03/01/polymarket-saw-529m-traded-on-bets-tied-to-bombing-of-iran/",
    "source": "TechCrunch",
    "date": "2026-03-01T19:05:35.000Z",
    "summary": "Six newly-created accounts on Polymarket generated $1 million profit by correctly betting on a U.S. strike against Iran before February 28, raising integrity concerns amid the $529 million in total trading volume.",
    "content": "Six newly-created accounts made a profit of $1 million by correctly betting that the U.S. would strike Iran by February 28.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Polymarket在伊朗轰炸赌注中成交5.29亿美元",
        "summary": "Polymarket上六个新创建的账户通过在2月28日之前正确押注美国对伊朗的打击获得了100万美元的利润，这在总交易量5.29亿美元中引发了完整性问题。"
      },
      "fr": {
        "title": "Polymarket a vu 529 millions de dollars échangés sur des paris liés au bombardement de l'Iran",
        "summary": "Six nouveaux comptes sur Polymarket ont généré un bénéfice d'1 million de dollars en pariant correctement sur une frappe américaine contre l'Iran avant le 28 février, soulevant des préoccupations concernant l'intégrité au milieu du volume total de 529 millions de dollars en transactions."
      },
      "de": {
        "title": "Polymarket verzeichnete 529 Millionen Dollar Handelsvolumen bei Wetten auf Bombenanschlag auf Iran",
        "summary": "Sechs neu erstellte Konten auf Polymarket generierten einen Gewinn von 1 Million Dollar durch korrekte Wetten auf einen US-Angriff auf den Iran vor dem 28. Februar, was Integritätsbedenken angesichts des Gesamthandelsvolumens von 529 Millionen Dollar aufwirft."
      },
      "es": {
        "title": "Polymarket registró 529 millones de dólares negociados en apuestas vinculadas al bombardeo de Irán",
        "summary": "Seis cuentas recién creadas en Polymarket generaron una ganancia de 1 millón de dólares apostando correctamente sobre un ataque estadounidense contra Irán antes del 28 de febrero, generando preocupaciones sobre la integridad en medio del volumen total de transacciones de 529 millones de dólares."
      }
    }
  },
  {
    "title": "Let’s explore the best alternatives to Discord",
    "slug": "best-alternatives-discord-age-verification",
    "url": "https://techcrunch.com/2026/03/01/best-discord-alternatives-age-verification-identity-privacy/",
    "source": "TechCrunch",
    "date": "2026-03-01T19:00:01.000Z",
    "summary": "As Discord users express concerns about the platform's new age verification requirement, this article explores alternative messaging platforms that could serve as viable replacements.",
    "content": "With many users feeling uneasy about Discord's new age verification requirement, here are some alternatives that could be worth exploring.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "让我们探索Discord的最佳替代品",
        "summary": "随着Discord用户对该平台新的年龄验证要求表示担忧，本文章探讨了可以作为可行替代品的替代消息传递平台。"
      },
      "fr": {
        "title": "Explorons les meilleures alternatives à Discord",
        "summary": "Alors que les utilisateurs de Discord expriment des préoccupations concernant la nouvelle exigence de vérification d'âge de la plateforme, cet article explore les plateformes de messagerie alternatives qui pourraient servir de remplaçants viables."
      },
      "de": {
        "title": "Lassen Sie uns die besten Alternativen zu Discord erkunden",
        "summary": "Da Discord-Benutzer Bedenken hinsichtlich der neuen Altersverifizierungsanforderung der Plattform äußern, untersucht dieser Artikel alternative Messaging-Plattformen, die als brauchbare Ersatze dienen könnten."
      },
      "es": {
        "title": "Exploremos las mejores alternativas a Discord",
        "summary": "Mientras los usuarios de Discord expresan preocupaciones sobre el nuevo requisito de verificación de edad de la plataforma, este artículo explora plataformas de mensajería alternativas que podrían servir como reemplazos viables."
      }
    }
  },
  {
    "title": "Kalshi voids some bets on Khamenei’s ouster because it’s ‘directly tied to death’",
    "slug": "kalshi-voids-bets-khamenei-ouster",
    "url": "https://www.theverge.com/tech/887210/kalshi-void-bets-khamenei-death",
    "source": "The Verge",
    "date": "2026-03-01T18:06:10.000Z",
    "summary": "Kalshi voided certain bets on Iranian Supreme Leader Khamenei's ouster following his death, citing a policy against markets directly tied to death. The predictive betting platform is refunding fees and reimbursing anyone who purchased shares after the event, though the handling has drawn criticism.",
    "content": "In a statement on X, Kalshi CEO Tarek Mansour said his company would pay out positions on \"Ali Khamenei out as Supreme Leader?\" at the last trading price before his death. Mansour said that Kalshi doesn't \"list markets directly tied to death\" and that its rules are designed to \"prevent people from profiting from death.\" In addition, Kalshi is refunding fees related to the market and reimbursing anyone who purchased shares after Khamenei's death. \nSome users have voiced anger at how the situation was handled, claiming that either Kalshi's rules should have been communicated more clearly, or that its markets should have been more narrowly wor …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Kalshi因\"直接与死亡相关\"而撤销一些关于哈梅内伊下台的赌注",
        "summary": "Kalshi在伊朗最高领袖哈梅内伊去世后撤销了某些关于其下台的赌注，理由是其政策禁止与死亡直接相关的市场。这个预测性投注平台正在退款并补偿在事件发生后购买股票的任何人，尽管此举引发了批评。"
      },
      "fr": {
        "title": "Kalshi annule certains paris sur la destitution de Khamenei car c'est « directement lié à la mort »",
        "summary": "Kalshi a annulé certains paris sur la destitution du Guide suprême iranien Khamenei suivant son décès, invoquant une politique contre les marchés directement liés à la mort. La plateforme de paris prédictifs rembourse les frais et compense toute personne ayant acheté des actions après l'événement, bien que cette gestion ait suscité des critiques."
      },
      "de": {
        "title": "Kalshi hebt einige Wetten auf Khameneis Sturz auf, weil sie « direkt mit dem Tod verbunden sind »",
        "summary": "Kalshi hat bestimmte Wetten auf den Sturz des iranischen Obersten Führers Khamenei nach seinem Tod aufgehoben und beruft sich auf eine Richtlinie gegen Märkte, die unmittelbar mit dem Tod verbunden sind. Die Vorhersage-Wettplattform erstattet Gebühren zurück und erstattet jedem, der nach dem Ereignis Anteile gekauft hat, die Kosten, obwohl die Behandlung Kritik ausgelöst hat."
      },
      "es": {
        "title": "Kalshi anula algunas apuestas sobre la destitución de Jamenei porque está 'directamente vinculada a la muerte'",
        "summary": "Kalshi anuló ciertas apuestas sobre la destitución del Líder Supremo de Irán, Jamenei, después de su muerte, citando una política contra mercados directamente vinculados a la muerte. La plataforma de apuestas predictivas está reembolsando tarifas e indemnizando a cualquier persona que compró acciones después del evento, aunque el manejo ha atraído críticas."
      }
    }
  },
  {
    "title": "Google looks to tackle longstanding RCS spam in India — but not alone",
    "slug": "google-tackles-rcs-spam-india-airtel",
    "url": "https://techcrunch.com/2026/03/01/google-looks-to-tackle-longstanding-rcs-spam-in-india-but-not-alone/",
    "source": "TechCrunch",
    "date": "2026-03-01T17:30:00.000Z",
    "summary": "Google is integrating carrier-level spam filtering into RCS messaging in India through a partnership with telecom provider Airtel. The collaboration aims to strengthen protections against spam in the messaging standard.",
    "content": "Google is integrating carrier-level filtering into RCS in India through a partnership with Airtel to strengthen protections against spam.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Google寻求解决印度RCS垃圾邮件问题——但不是独自行动",
        "summary": "Google通过与电信运营商Airtel的合作，正在将运营商级别的垃圾邮件过滤集成到印度的RCS消息传递中。这次合作旨在加强对消息标准中垃圾邮件的保护。"
      },
      "fr": {
        "title": "Google cherche à résoudre le problème chronique du spam RCS en Inde — mais pas seul",
        "summary": "Google intègre le filtrage des spams au niveau de l'opérateur dans la messagerie RCS en Inde grâce à un partenariat avec le fournisseur de télécommunications Airtel. La collaboration vise à renforcer les protections contre les spams dans la norme de messagerie."
      },
      "de": {
        "title": "Google versucht, das lang bestehende RCS-Spam-Problem in Indien zu bewältigen — aber nicht allein",
        "summary": "Google integriert Spam-Filterung auf Carrier-Ebene in RCS-Messaging in Indien durch eine Partnerschaft mit dem Telekommunikationsanbieter Airtel. Die Zusammenarbeit zielt darauf ab, den Schutz gegen Spam in den Messaging-Standard zu stärken."
      },
      "es": {
        "title": "Google busca abordar el problema duradero del spam de RCS en India, pero no solo",
        "summary": "Google está integrando el filtrado de spam a nivel de operador en la mensajería RCS en India a través de una asociación con el proveedor de telecomunicaciones Airtel. La colaboración tiene como objetivo fortalecer las protecciones contra el spam en el estándar de mensajería."
      }
    }
  },
  {
    "title": "Investors spill what they aren’t looking for anymore in AI SaaS companies",
    "slug": "investors-spill-ai-saas-expectations",
    "url": "https://techcrunch.com/2026/03/01/investors-spill-what-they-arent-looking-for-anymore-in-ai-saas-companies/",
    "source": "TechCrunch",
    "date": "2026-03-01T17:00:00.000Z",
    "summary": "Venture capital investors are sharing what they no longer want to see in AI SaaS startups as the market matures. The shift reflects changing investment criteria in the competitive AI software landscape.",
    "content": "TechCrunch spoke with VCs to learn what investors aren't looking for in AI SaaS startups anymore.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "投资者透露他们在AI SaaS公司中不再寻找的东西",
        "summary": "风险投资者分享他们不再想在AI SaaS初创公司中看到的东西，因为市场在成熟。这种转变反映了竞争激烈的AI软件领域中投资标准的改变。"
      },
      "fr": {
        "title": "Les investisseurs révèlent ce qu'ils ne recherchent plus dans les entreprises AI SaaS",
        "summary": "Les investisseurs en capital-risque partagent ce qu'ils ne veulent plus voir dans les startups AI SaaS à mesure que le marché mûrit. Ce changement reflète l'évolution des critères d'investissement dans le paysage compétitif des logiciels d'IA."
      },
      "de": {
        "title": "Investoren enthüllen, was sie in AI-SaaS-Unternehmen nicht mehr suchen",
        "summary": "Risikokapitalinvestoren teilen mit, was sie in AI-SaaS-Startups nicht mehr sehen möchten, da der Markt reift. Die Verschiebung spiegelt sich in verändernden Investitionskriterien in der wettbewerbsintensiven KI-Softwarelandschaft wider."
      },
      "es": {
        "title": "Los inversores revelan qué ya no buscan en empresas de IA SaaS",
        "summary": "Los inversores de capital riesgo comparten lo que ya no quieren ver en startups de IA SaaS a medida que el mercado madura. El cambio refleja los criterios de inversión cambiantes en el panorama competitivo del software de IA."
      }
    }
  },
  {
    "title": "OpenAI reveals more details about its agreement with the Pentagon",
    "slug": "openai-pentagon-agreement-details",
    "url": "https://techcrunch.com/2026/03/01/openai-shares-more-details-about-its-agreement-with-the-pentagon/",
    "source": "TechCrunch",
    "date": "2026-03-01T16:30:10.000Z",
    "summary": "OpenAI has disclosed additional details about its Department of Defense agreement, with CEO Sam Altman acknowledging the deal was \"rushed\" and faces negative perception. The revelation provides more transparency around the controversial military partnership.",
    "content": "By CEO Sam Altman’s own admission, OpenAI’s deal with the Department of Defense was “definitely rushed,” and “the optics don’t look good.”",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "OpenAI公开与五角大楼协议的更多细节",
        "summary": "OpenAI披露了其与国防部协议的更多细节，首席执行官萨姆·奥特曼承认该交易\"仓促\"且面临负面看法。这一披露为围绕这个有争议的军事合作伙伴关系提供了更多透明度。"
      },
      "fr": {
        "title": "OpenAI révèle plus de détails sur son accord avec le Pentagone",
        "summary": "OpenAI a divulgué des détails supplémentaires sur son accord avec le Département de la Défense, le PDG Sam Altman reconnaissant que l'accord était \"précipité\" et fait face à une perception négative. La révélation apporte plus de transparence autour du partenariat militaire controversé."
      },
      "de": {
        "title": "OpenAI offenbart weitere Details zu seiner Vereinbarung mit dem Pentagon",
        "summary": "OpenAI hat zusätzliche Details zu seiner Vereinbarung mit dem Verteidigungsministerium offengelegt, wobei CEO Sam Altman eingestand, dass der Deal \"überstürzt\" war und mit negativer Wahrnehmung konfrontiert ist. Die Offenbarung bietet mehr Transparenz um die kontroverse militärische Partnerschaft."
      },
      "es": {
        "title": "OpenAI revela más detalles sobre su acuerdo con el Pentágono",
        "summary": "OpenAI ha divulgado detalles adicionales sobre su acuerdo con el Departamento de Defensa, con el CEO Sam Altman reconociendo que el acuerdo fue \"apresurado\" y enfrenta percepciones negativas. La revelación proporciona más transparencia en torno a la controvertida asociación militar."
      }
    }
  },
  {
    "title": "Lego’s Smart Brick is here, and it transforms these new Star Wars sets",
    "slug": "lego-smart-brick-star-wars-sets",
    "url": "https://www.theverge.com/gadgets/886014/lego-smart-brick-star-wars-set-price-availability-release-date-buy",
    "source": "The Verge",
    "date": "2026-03-01T16:00:10.000Z",
    "summary": "Lego has launched its Smart Brick, a 2×4 brick containing a miniature computer, microphone, and NFC technology that won \"best in show\" at CES 2026. The technology is now available in eight Star Wars-themed sets with interactive experiences powered by NFC tags and smart minifigures.",
    "content": "Lego's new Smart Brick is a pretty big deal. It packs a miniature computer, a microphone, and NFC tech into a classic 2×4 Lego brick, which can power all sorts of new experiences with select sets. It has so much promise that we awarded it \"best in show\" at CES 2026, and now, eight Star Wars-themed sets that support the Smart Brick (and include it, in some cases) are now available.\nThree of them include at least one Smart Brick, along with a charging cradle and cable, while the rest are merely \"Smart Play compatible,\" meaning they're BYOB (bring your own brick). The interactivity of the NFC tags and the smart minifigurs won't be possible unl …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "乐高Smart Brick来了，它改变了这些新的星球大战套装",
        "summary": "乐高推出了其Smart Brick，一种2×4积木，内含微型计算机、麦克风和NFC技术，在CES 2026上获得\"最佳展品\"。该技术现已用于八个星球大战主题套装，具有由NFC标签和智能小人仔驱动的交互体验。"
      },
      "fr": {
        "title": "Le Smart Brick de Lego est là et il transforme ces nouveaux ensembles Star Wars",
        "summary": "Lego a lancé son Smart Brick, une brique 2×4 contenant un mini-ordinateur, un microphone et une technologie NFC qui a remporté le \"meilleur spectacle\" au CES 2026. La technologie est maintenant disponible dans huit ensembles à thème Star Wars avec des expériences interactives alimentées par les étiquettes NFC et les minifigures intelligentes."
      },
      "de": {
        "title": "Legos Smart Brick ist da und verändert diese neuen Star Wars-Sets",
        "summary": "Lego hat seinen Smart Brick gestartet, einen 2×4-Stein mit einem Minicomputer, Mikrofon und NFC-Technologie, der beim CES 2026 \"Best in Show\" gewann. Die Technologie ist jetzt in acht Star Wars-Themensätzen mit interaktiven Erfahrungen verfügbar, die von NFC-Tags und intelligenten Minifiguren angetrieben werden."
      },
      "es": {
        "title": "El Smart Brick de Lego está aquí y transforma estos nuevos sets de Star Wars",
        "summary": "Lego ha lanzado su Smart Brick, un ladrillo 2×4 que contiene una computadora en miniatura, micrófono y tecnología NFC que ganó \"mejor en espectáculo\" en CES 2026. La tecnología ahora está disponible en ocho sets temáticos de Star Wars con experiencias interactivas impulsadas por etiquetas NFC y minifiguras inteligentes."
      }
    }
  },
  {
    "title": "Honor says its ‘Robot phone’ with moving camera can dance to music",
    "slug": "honor-robot-phone-moving-camera",
    "url": "https://techcrunch.com/2026/03/01/honor-says-its-robot-phone-with-moving-camera-can-dance-to-music/",
    "source": "TechCrunch",
    "date": "2026-03-01T15:30:00.000Z",
    "summary": "Honor is showcasing its \"Robot phone\" with a movable camera arm that can dance to music and respond to different situations without commands. The device will be demonstrated ahead of Mobile World Congress in Barcelona.",
    "content": "Honor first teased its “Robot phone” with a movable camera arm earlier this year. Ahead of the Mobile World Congress (MWC) in Barcelona, the Chinese company provided more details about the device, including how the robot can respond to different situations without commands. The company said that it is planning to launch this device in […]",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "荣耀表示其带有活动摄像头的\"机器人手机\"可以随音乐舞动",
        "summary": "荣耀正在展示其\"机器人手机\"，配备可移动摄像头臂，可以随音乐舞动并在无需命令的情况下应对不同情况。该设备将在巴塞罗那移动世界大会之前进行演示。"
      },
      "fr": {
        "title": "Honor dit que son \"téléphone robot\" avec caméra mobile peut danser au rythme de la musique",
        "summary": "Honor présente son \"téléphone robot\" avec un bras caméra mobile qui peut danser au rythme de la musique et réagir à différentes situations sans commandes. L'appareil sera démontré avant le Mobile World Congress à Barcelone."
      },
      "de": {
        "title": "Honor sagt, sein \"Roboter-Telefon\" mit beweglicher Kamera kann zu Musik tanzen",
        "summary": "Honor präsentiert sein \"Roboter-Telefon\" mit einem beweglichen Kameraarm, der zu Musik tanzen und auf verschiedene Situationen ohne Befehle reagieren kann. Das Gerät wird vor dem Mobile World Congress in Barcelona demonstriert."
      },
      "es": {
        "title": "Honor dice que su \"teléfono robot\" con cámara móvil puede bailar al ritmo de la música",
        "summary": "Honor está mostrando su \"teléfono robot\" con un brazo de cámara móvil que puede bailar al ritmo de la música y responder a diferentes situaciones sin comandos. El dispositivo será demostrado antes del Mobile World Congress en Barcelona."
      }
    }
  },
  {
    "title": "Honor launches its new slim foldable Magic V6 with a 6,600 mAh battery",
    "slug": "honor-magic-v6-foldable-battery",
    "url": "https://techcrunch.com/2026/03/01/honor-launches-its-new-slim-foldable-magic-v6-with-a-6600-mah-battery/",
    "source": "TechCrunch",
    "date": "2026-03-01T15:13:09.000Z",
    "summary": "Honor launched the slim Magic V6 foldable phone featuring a 6,600 mAh battery and previewed new battery technology that could exceed 7,000 mAh for future foldables. The device represents continued improvements in foldable phone design and battery capacity.",
    "content": "Honor also previewed battery tech that could take foldable batteries over 7,000 mAh mark",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "荣耀推出新款轻薄折叠屏手机Magic V6，电池容量为6,600毫安时",
        "summary": "荣耀推出了轻薄的Magic V6折叠屏手机，配备6,600毫安时电池，并展示了未来折叠屏手机可能超过7,000毫安时的新电池技术。该设备代表了折叠屏手机设计和电池容量的持续改进。"
      },
      "fr": {
        "title": "Honor lance son nouveau téléphone pliable ultra-fin Magic V6 avec une batterie de 6 600 mAh",
        "summary": "Honor a lancé le téléphone pliable Magic V6 ultra-fin avec une batterie de 6 600 mAh et a présenté une nouvelle technologie de batterie qui pourrait dépasser 7 000 mAh pour les téléphones pliables futurs. L'appareil représente des améliorations continues dans la conception des téléphones pliables et la capacité de la batterie."
      },
      "de": {
        "title": "Honor bringt sein neues schlankes faltbares Telefon Magic V6 mit 6.600-mAh-Akku auf den Markt",
        "summary": "Honor hat das schlanke faltbare Telefon Magic V6 mit einem 6.600-mAh-Akku vorgestellt und eine neue Batterietechnologie gezeigt, die für zukünftige faltbare Geräte über 7.000 mAh überschreiten könnte. Das Gerät stellt fortlaufende Verbesserungen beim Design von Falt-Telefonen und der Akkukapazität dar."
      },
      "es": {
        "title": "Honor lanza su nuevo teléfono plegable ultrafino Magic V6 con batería de 6.600 mAh",
        "summary": "Honor lanzó el teléfono plegable ultrafino Magic V6 con batería de 6.600 mAh y presentó una nueva tecnología de batería que podría superar los 7.000 mAh para futuros teléfonos plegables. El dispositivo representa mejoras continuas en el diseño de teléfonos plegables y la capacidad de batería."
      }
    }
  },
  {
    "title": "Soundcore’s Space 2 are an evolution of its budget headphones",
    "slug": "soundcore-space-2-budget-headphones",
    "url": "https://www.theverge.com/tech/886180/soundcore-space-2-announcement-mwc-2026",
    "source": "The Verge",
    "date": "2026-03-01T15:00:00.000Z",
    "summary": "Soundcore has unveiled the Space 2, an update to its Space One budget headphones with improved full-band noise cancellation targeting low frequencies. The headphones will launch April 21st for $129.99, a $30 increase from the original Space One price.",
    "content": "We finally have an update to the Soundcore Space One that launched two and a half years ago. At MWC 2026, Soundcore has announced the Space 2, which will be available in the US on April 21st in three colors - linen white, jet black, and seafoam green - for $129.99. That's $30 more than the Space One's original price.\nAccording to Soundcore, the Space 2 have had a full-band noise cancellation upgrade with the focus of those improvements on the low-frequency sounds we all generally use ANC headphones to block - things like airplane, train, and bus engine sounds while traveling. The Space 2 use the same number of microphones as the Space One f …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Soundcore推出Space 2，是其预算耳机的进化版本",
        "summary": "Soundcore推出了Space 2，这是其Space One预算耳机的升级版本，具有改进的全频段噪声消除功能。这款耳机将于4月21日以$129.99的价格上市，比原来的Space One贵30美元。"
      },
      "fr": {
        "title": "Le Soundcore Space 2 est une évolution de ses casques d'entrée de gamme",
        "summary": "Soundcore a dévoilé le Space 2, une mise à jour de ses casques d'entrée de gamme Space One avec une réduction de bruit améliorée sur toute la bande passante ciblant les basses fréquences. Les casques seront lancés le 21 avril pour 129,99 $, une augmentation de 30 $ par rapport au prix d'origine du Space One."
      },
      "de": {
        "title": "Soundcore Space 2 sind eine Weiterentwicklung seiner günstigen Kopfhörer",
        "summary": "Soundcore hat die Space 2 vorgestellt, eine Aktualisierung seiner günstigen Space One-Kopfhörer mit verbesserter Geräuschunterdrückung im gesamten Frequenzbereich mit Fokus auf niedrige Frequenzen. Die Kopfhörer werden am 21. April für 129,99 $ auf den Markt kommen, eine Preiserhöhung von 30 $ gegenüber dem ursprünglichen Space One-Preis."
      },
      "es": {
        "title": "Soundcore Space 2 es una evolución de sus auriculares de presupuesto",
        "summary": "Soundcore ha presentado el Space 2, una actualización de sus auriculares presupuestarios Space One con cancelación de ruido mejorada en toda la banda de frecuencias dirigida a frecuencias bajas. Los auriculares se lanzarán el 21 de abril por $129.99, un aumento de $30 con respecto al precio original de Space One."
      }
    }
  },
  {
    "title": "Anthropic’s Claude rises to No. 1 in the App Store following Pentagon dispute",
    "slug": "anthropic-claude-no-1-app-store",
    "url": "https://techcrunch.com/2026/03/01/anthropics-claude-rises-to-no-2-in-the-app-store-following-pentagon-dispute/",
    "source": "TechCrunch",
    "date": "2026-03-01T14:48:58.000Z",
    "summary": "Anthropic's Claude chatbot has reached No. 1 on the App Store following heightened attention around the company's negotiations with the Pentagon. The surge appears tied to the controversy surrounding the military partnership discussions.",
    "content": "Anthropic’s chatbot Claude seems to have benefited from the attention around the company’s fraught negotiations with the Pentagon.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "五角大楼纠纷后，Anthropic的Claude在App Store上升至第1名",
        "summary": "Anthropic的Claude聊天机器人在App Store上升至第1名，这是在公司与五角大楼谈判引起广泛关注之后。这种飙升似乎与围绕军事合作讨论的争议有关。"
      },
      "fr": {
        "title": "Claude d'Anthropic atteint la 1ère place de l'App Store suite au différend du Pentagone",
        "summary": "Le chatbot Claude d'Anthropic a atteint la 1ère place de l'App Store suite à l'attention accrue autour des négociations de l'entreprise avec le Pentagone. La montée en flèche semble liée à la controverse entourant les discussions de partenariat militaire."
      },
      "de": {
        "title": "Anthropics Claude steigt nach Pentagon-Streit auf Platz 1 im App Store auf",
        "summary": "Anthropics Claude-Chatbot hat nach gestiegener Aufmerksamkeit um die Verhandlungen des Unternehmens mit dem Pentagon den 1. Platz im App Store erreicht. Der Anstieg scheint an der Kontroverse um die Diskussionen über die Militärpartnerschaft gebunden zu sein."
      },
      "es": {
        "title": "Claude de Anthropic sube al No. 1 en la App Store después de la disputa del Pentágono",
        "summary": "El chatbot Claude de Anthropic ha alcanzado el No. 1 en la App Store tras una mayor atención a las negociaciones de la empresa con el Pentágono. El aumento parece estar vinculado a la controversia que rodea las discusiones de asociación militar."
      }
    }
  },
  {
    "title": "Honor claims its Robot Phone will launch later this year",
    "slug": "honor-robot-phone-launch-2026",
    "url": "https://www.theverge.com/gadgets/887140/honor-robot-phone-mwc-release-date-specs",
    "source": "The Verge",
    "date": "2026-03-01T14:22:27.000Z",
    "summary": "Honor has revealed the Robot Phone features a 200-megapixel camera with gimbal stabilization in the industry's smallest 4DoF gimbal system. The company confirmed a planned launch in the second half of 2026, initially in China only.",
    "content": "I saw the camera arm unfold from this demo phone, though it didn’t do much else.\t\n\nHonor has revealed more details of its so-called Robot Phone at MWC 2026, and finally showed a working unit in action alongside a dancing humanoid robot. Specs are still thin on the ground, but the company has confirmed it plans to release the phone in the second half of this year - though I've been told that will only be in China.\nThe Robot Phone doesn't quite live up to the name - really it's a smartphone with a gimbal-stabilized camera arm crammed into the back. Honor has now revealed that the main camera will have a 200-megapixel sensor, and is built into what it says is the smallest 4DoF gimbal system in the industry, though those are  …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "荣耀声称其机器人手机将在今年晚些时候推出",
        "summary": "荣耀透露了机器人手机配备200万像素摄像头和云台稳定系统，采用业界最小的4自由度云台系统。该公司确认计划在2026年下半年推出，初期仅在中国上市。"
      },
      "fr": {
        "title": "Honor affirme que son Robot Phone sera lancé plus tard cette année",
        "summary": "Honor a révélé que le Robot Phone dispose d'un appareil photo de 200 mégapixels avec stabilisation par cardan dans le plus petit système de cardan 4DoF de l'industrie. L'entreprise a confirmé un lancement prévu au second semestre 2026, initialement en Chine uniquement."
      },
      "de": {
        "title": "Honor behauptet, dass sein Robot Phone später dieses Jahr auf den Markt kommt",
        "summary": "Honor hat enthüllt, dass das Robot Phone eine 200-Megapixel-Kamera mit Gimbal-Stabilisierung im kleinsten 4-DoF-Gimbal-System der Branche hat. Das Unternehmen bestätigte eine geplante Einführung in der zweiten Jahreshälfte 2026, zunächst nur in China."
      },
      "es": {
        "title": "Honor afirma que su Robot Phone se lanzará más adelante este año",
        "summary": "Honor ha revelado que el Robot Phone cuenta con una cámara de 200 megapíxeles con estabilización de gimbal en el sistema gimbal 4DoF más pequeño de la industria. La empresa confirmó un lanzamiento planeado en la segunda mitad de 2026, inicialmente solo en China."
      }
    }
  },
  {
    "title": "SaaS in, SaaS out: Here’s what’s driving the SaaSpocalypse",
    "slug": "saas-in-saas-out-saaspocalypse",
    "url": "https://techcrunch.com/2026/03/01/saas-in-saas-out-heres-whats-driving-the-saaspocalypse/",
    "source": "TechCrunch",
    "date": "2026-03-01T14:00:00.000Z",
    "summary": "The SaaS market is experiencing significant shifts as a new paradigm rises in the software-as-a-service landscape. The trend reflects changing dynamics in how enterprise and consumer software is being developed and valued.",
    "content": "What's behind the SaaSpocalypse? It simply seems a new supreme has risen.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "SaaS进，SaaS出：驱动SaaS大灾难的原因",
        "summary": "SaaS市场正在经历重大转变，软件即服务领域出现了新的范式。这一趋势反映了企业和消费者软件开发和估值方式的动态变化。"
      },
      "fr": {
        "title": "SaaS dedans, SaaS dehors : voici ce qui motive la SaaSpokalypse",
        "summary": "Le marché du SaaS connaît des changements importants à mesure qu'un nouveau paradigme émerge dans le paysage du logiciel en tant que service. La tendance reflète les évolutions dans la façon dont les logiciels d'entreprise et de consommation sont développés et évalués."
      },
      "de": {
        "title": "SaaS rein, SaaS raus: Das führt zur SaaS-Apokalypse",
        "summary": "Der SaaS-Markt erlebt bedeutende Verschiebungen, da sich ein neues Paradigma in der Software-as-a-Service-Landschaft abzeichnet. Der Trend spiegelt sich in den sich ändernden Dynamiken bei der Entwicklung und Bewertung von Unternehmens- und Verbrauchersoftware wider."
      },
      "es": {
        "title": "SaaS dentro, SaaS fuera: Esto es lo que impulsa el SaaSpocalipsis",
        "summary": "El mercado de SaaS está experimentando cambios significativos mientras surge un nuevo paradigma en el panorama de software como servicio. La tendencia refleja la dinámica cambiante en cómo se desarrolla y valora el software empresarial y de consumo."
      }
    }
  },
  {
    "title": "Resident Evil Requiem leans too much on the series’ past",
    "slug": "resident-evil-requiem-game-review",
    "url": "https://www.theverge.com/games/885811/resident-evil-requiem-grace-leon-nostalgia-ending",
    "source": "The Verge",
    "date": "2026-03-01T13:00:00.000Z",
    "summary": "Resident Evil Requiem aims to appeal to both longtime fans and newcomers by pairing new character Grace Ashcroft with series favorite Leon Kennedy. The game's first half delivers fresh horror gameplay, though it increasingly leans on the franchise's extensive history.",
    "content": "Leon Kennedy, one of the game’s protagonists.\t\n\nResident Evil turns 30 this year. The series is full of history - the new Resident Evil Requiem is technically the ninth mainline game, but there are a bunch of spinoffs, remakes, movies, and even a TV show - which can make it fun to follow for fans. But it's also intimidating for people like me who haven't played everything. The latest release, Resident Evil Requiem, tries to appeal to both sides by starring a new character, the cowering FBI agent Grace Ashcroft, and a series favorite, action hero Leon Kennedy.\nInitially, it really works: the first half of Resident Evil Requiem is one of the freshest horror games I've ever played. But as t …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "生化危机安魂曲过度依赖该系列的过去",
        "summary": "《生化危机安魂曲》通过将新角色格蕾丝·阿什克罗夫特与系列明星莱昂·肯尼迪配对，旨在吸引长期粉丝和新手。游戏的前半部分提供了新鲜的恐怖游戏体验，但越来越多地依赖该系列的丰富历史。"
      },
      "fr": {
        "title": "Resident Evil Requiem s'appuie trop sur le passé de la série",
        "summary": "Resident Evil Requiem vise à séduire à la fois les fans de longue date et les nouveaux venus en associant le nouveau personnage Grace Ashcroft au personnage préféré de la série Leon Kennedy. La première moitié du jeu offre un gameplay d'horreur novateur, bien qu'il s'appuie de plus en plus sur l'histoire riche de la franchise."
      },
      "de": {
        "title": "Resident Evil Requiem lehnt sich zu sehr auf die Vergangenheit der Serie",
        "summary": "Resident Evil Requiem zielt darauf ab, sowohl langjährige Fans als auch Neulinge anzusprechen, indem die neue Figur Grace Ashcroft mit dem Serienliebling Leon Kennedy gepaart wird. Die erste Hälfte des Spiels bietet frisches Horror-Gameplay, lehnt sich aber zunehmend auf die umfangreiche Geschichte der Franchise."
      },
      "es": {
        "title": "Resident Evil Requiem se apoya demasiado en el pasado de la serie",
        "summary": "Resident Evil Requiem tiene como objetivo atraer tanto a fans de larga data como a recién llegados al emparejar el nuevo personaje Grace Ashcroft con el favorito de la serie Leon Kennedy. La primera mitad del juego ofrece un gameplay de terror fresco, aunque depende cada vez más de la extensa historia de la franquicia."
      }
    }
  },
  {
    "title": "How MLB can make baseball relevant on a fast-changing internet",
    "slug": "mlb-baseball-internet-relevance",
    "url": "https://www.theverge.com/column/886115/how-mlb-can-make-baseball-relevant-on-a-fast-changing-internet",
    "source": "The Verge",
    "date": "2026-03-01T13:00:00.000Z",
    "summary": "Major League Baseball faces challenges in remaining relevant amid a rapidly changing internet landscape and evolving viewer attention patterns. The league must adapt its content strategy to engage audiences in the contemporary media environment.",
    "content": "This is The Stepback, a weekly newsletter breaking down one essential story from the tech world. For more on the contemporary attention economy, follow Mia Sato. The Stepback arrives in our subscribers' inboxes at 8AM ET. Opt in for The Stepback here.\nHow it started\n\"KING BASEBALL, monarch of the American sport world, is sick,\" a New York Times story on the disappearance of amateur and small town sandlots begins. Hundreds of thousands of fans attended the opening games of the season, and star players are making bank in huge stadiums. \"Nevertheless the critics say that his Royal Highness is indisposed.\" \nThe story is from 1925. But it read …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "MLB如何在快速变化的互联网上保持棒球的相关性",
        "summary": "美国职业棒球大联盟面临着在快速变化的互联网环境和不断演变的观众关注模式中保持相关性的挑战。该联盟必须调整其内容策略以吸引当代媒体环境中的观众。"
      },
      "fr": {
        "title": "Comment la MLB peut rendre le baseball pertinent sur internet en rapide évolution",
        "summary": "La Ligue majeure de baseball fait face à des défis pour rester pertinente au milieu d'un paysage internet en rapide évolution et de l'évolution des modèles d'attention des spectateurs. La ligue doit adapter sa stratégie de contenu pour engager les audiences dans l'environnement médiatique contemporain."
      },
      "de": {
        "title": "Wie die MLB Baseball im schnell verändernden Internet relevant machen kann",
        "summary": "Major League Baseball steht vor Herausforderungen, um angesichts einer sich schnell verändernden Internetlandschaft und sich entwickelnder Zuschauermerkmalsmuster relevant zu bleiben. Die Liga muss ihre Content-Strategie anpassen, um Zuschauer im zeitgenössischen Medienumfeld zu erreichen."
      },
      "es": {
        "title": "Cómo la MLB puede hacer que el béisbol sea relevante en un internet que cambia rápidamente",
        "summary": "Las Grandes Ligas de Béisbol enfrenta desafíos para seguir siendo relevante en medio de un panorama de internet que cambia rápidamente y patrones de atención de audiencia en evolución. La liga debe adaptar su estrategia de contenido para atraer a las audiencias en el entorno mediático contemporáneo."
      }
    }
  },
  {
    "title": "Meta won’t let morality get in the way of a product launch",
    "slug": "meta-facial-recognition-glasses-nametag",
    "url": "https://www.theverge.com/policy/886348/meta-glasses-ice-doxxing-privacy",
    "source": "The Verge",
    "date": "2026-03-01T13:00:00.000Z",
    "summary": "Meta has added Name Tag, a facial recognition feature to Ray-Ban Meta glasses that identifies people in real-world interactions through the device's cameras. The feature raises significant privacy concerns as facial recognition technology becomes embedded in everyday wearables.",
    "content": "There's never been a better time to add facial recognition to everything! The public at large is gradually becoming numb to our Palantirized surveillance state, and American communities are responding to the militarization of federal law enforcement with their own increasingly intricate webs of sousveillance. \nThe Ray-Ban Meta glasses are sleek, unobtrusive wearables with front-facing cameras and a passthrough display in the right lens that can show maps, texts, social media posts, and more. Name Tag is a new feature that uses facial recognition to identify people you see in real life through the glasses. Perhaps the glasses would have soun …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Meta不会让道德阻碍产品发布",
        "summary": "Meta在Ray-Ban Meta眼镜中添加了Name Tag功能,这是一项面部识别功能,可通过设备摄像头在现实互动中识别人物。随着面部识别技术嵌入日常可穿戴设备,这项功能引发了重大隐私顾虑。"
      },
      "fr": {
        "title": "Meta ne laissera pas la moralité entraver le lancement d'un produit",
        "summary": "Meta a ajouté Name Tag, une fonction de reconnaissance faciale aux lunettes Ray-Ban Meta qui identifie les personnes dans les interactions du monde réel via les caméras de l'appareil. La fonction soulève des préoccupations importantes en matière de confidentialité à mesure que la technologie de reconnaissance faciale s'intègre dans les appareils portables courants."
      },
      "de": {
        "title": "Meta wird sich von Moral nicht beim Produktstart aufhalten lassen",
        "summary": "Meta hat Name Tag hinzugefügt, eine Gesichtserkennungsfunktion für Ray-Ban Meta-Brillen, die Menschen in realen Interaktionen durch die Kameras des Geräts identifiziert. Diese Funktion wirft erhebliche Datenschutzbedenken auf, da die Gesichtserkennungstechnologie in alltägliche tragbare Geräte integriert wird."
      },
      "es": {
        "title": "Meta no dejará que la moralidad obstaculice el lanzamiento de un producto",
        "summary": "Meta ha añadido Name Tag, una función de reconocimiento facial a los lentes Ray-Ban Meta que identifica personas en interacciones del mundo real a través de las cámaras del dispositivo. La función genera importantes preocupaciones sobre privacidad a medida que la tecnología de reconocimiento facial se integra en los dispositivos portátiles cotidianos."
      }
    }
  },
  {
    "title": "Honor’s Magic V6 is the first foldable with an IP69 rating",
    "slug": "honor-magic-v6-ip69-first-foldable",
    "url": "https://www.theverge.com/tech/887104/honor-magic-v6-thinnest-battery-launch-mwc",
    "source": "The Verge",
    "date": "2026-03-01T13:00:00.000Z",
    "summary": "Honor's Magic V6 becomes the first foldable phone to achieve an IP69 rating for water resistance while maintaining the title of world's thinnest book-style foldable and largest foldable battery. The phone launches in China later in March with international availability in the second half of 2026.",
    "content": "The Magic V6 is just slightly more water-resistant than the Pixel 10 Pro Fold.\t\n\nFor the third year running, Honor has announced what it says is the world's thinnest book-style folding phone. For the second year, it's combined that with the biggest battery in any foldable too. This year, for its third and final trick, the company went ahead and made sure it was the first foldable with an IP69 rating too.\nThe Honor Magic V6 was announced at MWC in Barcelona today, though Honor has played a bit fast and loose with timing to guarantee those three records: the V6 won't go on sale in China until some time later this month, and the international release is still months away, in the second half of the year, so Honor isn't sayi …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Honor Magic V6是首款获得IP69等级的可折叠手机",
        "summary": "Honor Magic V6成为首款获得IP69水阻等级的可折叠手机,同时保持世界最薄书式可折叠手机和最大可折叠电池的称号。该手机将于3月晚些时候在中国推出,国际版将于2026年下半年推出。"
      },
      "fr": {
        "title": "Le Honor Magic V6 est le premier pliable avec une certification IP69",
        "summary": "Le Honor Magic V6 devient le premier téléphone pliable à obtenir une certification IP69 pour la résistance à l'eau tout en conservant le titre de téléphone pliable de style livre le plus fin du monde et de plus grande batterie pliable. Le téléphone sort en Chine plus tard en mars avec une disponibilité internationale au second semestre 2026."
      },
      "de": {
        "title": "Honor Magic V6 ist das erste faltbare Telefon mit IP69-Zertifizierung",
        "summary": "Das Honor Magic V6 wird zum ersten faltbaren Telefon, das eine IP69-Zertifizierung für Wasserbeständigkeit erreicht, während es den Titel des dünnsten faltbaren Telefonbuches der Welt und der größten faltbaren Batterie behält. Das Telefon wird später im März in China mit internationaler Verfügbarkeit in der zweiten Hälfte 2026 auf den Markt gebracht."
      },
      "es": {
        "title": "Honor Magic V6 es el primer plegable con clasificación IP69",
        "summary": "Honor Magic V6 se convierte en el primer teléfono plegable en lograr una clasificación IP69 para resistencia al agua mientras mantiene el título de teléfono plegable de estilo libro más delgado del mundo y batería plegable más grande. El teléfono se lanza en China a finales de marzo con disponibilidad internacional en la segunda mitad de 2026."
      }
    }
  },
  {
    "title": "The strange animals that control their body heat",
    "slug": "strange-animals-control-body-heat",
    "url": "https://arstechnica.com/science/2026/03/the-strange-animals-that-control-their-body-heat/",
    "source": "Ars Technica",
    "date": "2026-03-01T12:07:22.000Z",
    "summary": "Some animal species can dramatically regulate their internal body temperature, enabling them to survive extreme weather events, floods, and predator encounters more effectively than other creatures.",
    "content": "Some creatures can dramatically alter their internal temperature and outlast storms, floods and, predators",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "能够控制体温的奇异动物",
        "summary": "某些动物物种可以显著调节其内部体温，使它们能够比其他生物更有效地在极端天气事件、洪水和捕食者遭遇中生存。"
      },
      "fr": {
        "title": "Les animaux étranges qui contrôlent leur température corporelle",
        "summary": "Certaines espèces animales peuvent réguler dramatiquement leur température corporelle interne, ce qui leur permet de survivre plus efficacement aux événements météorologiques extrêmes, aux inondations et aux rencontres avec des prédateurs par rapport à d'autres créatures."
      },
      "de": {
        "title": "Die seltsamen Tiere, die ihre Körpertemperatur kontrollieren",
        "summary": "Einige Tierarten können ihre interne Körpertemperatur dramatisch regulieren und können so extreme Wetterereignisse, Überschwemmungen und Begegnungen mit Raubtieren effektiver überstehen als andere Lebewesen."
      },
      "es": {
        "title": "Los animales extraños que controlan su temperatura corporal",
        "summary": "Algunas especies animales pueden regular drásticamente su temperatura corporal interna, permitiéndoles sobrevivir a eventos climáticos extremos, inundaciones y encuentros con depredadores de manera más efectiva que otras criaturas."
      }
    }
  },
  {
    "title": "The trap Anthropic built for itself",
    "slug": "the-trap-anthropic-built-for-itself",
    "url": "https://techcrunch.com/2026/02/28/the-trap-anthropic-built-for-itself/",
    "source": "TechCrunch",
    "date": "2026-03-01T00:08:58.000Z",
    "summary": "Anthropic and other AI companies have long promised responsible self-governance, but without formal regulatory oversight, there are few mechanisms to hold them accountable. This governance gap creates a potential vulnerability as these companies shape the future of AI.",
    "content": "Anthropic, OpenAI, Google DeepMind and others have long promised to govern themselves responsibly. Now, in the absence of rules, there's not a lot to protect them.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "人工智能公司为自己建造的陷阱",
        "summary": "人工智能公司长期以来承诺负责任的自我治理，但没有正式的监管监督，很少有机制能够追究它们的责任。这种治理缺陷在这些公司塑造人工智能未来时造成了潜在的脆弱性。"
      },
      "fr": {
        "title": "Le piège qu'Anthropic s'est construit",
        "summary": "Anthropic et d'autres entreprises d'IA ont longtemps promis une autogouvernance responsable, mais sans supervision réglementaire formelle, il existe peu de mécanismes pour les tenir responsables. Cette lacune de gouvernance crée une vulnérabilité potentielle alors que ces entreprises façonnent l'avenir de l'IA."
      },
      "de": {
        "title": "Die Falle, die Anthropic für sich selbst gebaut hat",
        "summary": "Anthropic und andere KI-Unternehmen haben lange Zeit verantwortungsvolle Selbstregulierung versprochen, aber ohne formale behördliche Aufsicht gibt es nur wenige Mechanismen, um sie zur Rechenschaft zu ziehen. Diese Governance-Lücke schafft eine potenzielle Schwachstelle, da diese Unternehmen die Zukunft der KI gestalten."
      },
      "es": {
        "title": "La trampa que Anthropic se construyó a sí misma",
        "summary": "Anthropic y otras empresas de IA han prometido durante mucho tiempo la autogobernanza responsable, pero sin supervisión regulatoria formal, hay pocos mecanismos para responsabilizarlas. Esta brecha de gobernanza crea una vulnerabilidad potencial mientras estas empresas moldean el futuro de la IA."
      }
    }
  }
]