[
  {
    "title": "India disrupts access to popular developer platform Supabase with blocking order",
    "slug": "india-disrupts-supabase-blocking-order",
    "url": "https://techcrunch.com/2026/02/27/india-disrupts-access-to-popular-developer-platform-supabase-with-blocking-order/",
    "source": "TechCrunch",
    "date": "2026-02-28T03:51:52.000Z",
    "summary": "India has issued a blocking order against Supabase, a major developer platform, causing disrupted access in one of its largest markets. The action impacts a significant portion of the platform's user base in the region.",
    "content": "India, one of Supabase’s biggest markets, is seeing patchy access after a government block order.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "印度对热门开发者平台Supabase下达封锁令",
        "summary": "印度对主要开发者平台Supabase下达了封锁令，导致该平台在其最大市场之一的访问受阻。该行动影响了该地区该平台用户基数的重要部分。"
      },
      "fr": {
        "title": "L'Inde bloque l'accès à la plateforme populaire pour développeurs Supabase",
        "summary": "L'Inde a émis un ordre de blocage contre Supabase, une plateforme majeure pour développeurs, causant un accès perturbé dans l'un de ses plus grands marchés. L'action affecte une part importante de la base d'utilisateurs de la plateforme dans la région."
      },
      "de": {
        "title": "Indien sperrt beliebte Entwicklerplattform Supabase durch Blockierungsbefehl",
        "summary": "Indien hat einen Blockierungsbefehl gegen Supabase, eine wichtige Entwicklerplattform, erlassen, was zu gestörtem Zugriff in einem seiner größten Märkte führt. Die Maßnahme wirkt sich auf einen erheblichen Teil der Nutzerbasis der Plattform in der Region aus."
      },
      "es": {
        "title": "India interrumpe el acceso a la plataforma popular de desarrolladores Supabase con orden de bloqueo",
        "summary": "India ha emitido una orden de bloqueo contra Supabase, una importante plataforma para desarrolladores, causando acceso interrumpido en uno de sus mercados más grandes. La acción afecta a una porción significativa de la base de usuarios de la plataforma en la región."
      }
    }
  },
  {
    "title": "Google quantum-proofs HTTPS by squeezing 2.5kB of data into 64-byte space",
    "slug": "google-quantum-proofs-https-merkle-tree",
    "url": "https://arstechnica.com/security/2026/02/google-is-using-clever-math-to-quantum-proof-https-certificates/",
    "source": "Ars Technica",
    "date": "2026-02-28T01:26:41.000Z",
    "summary": "Google has quantum-proofed HTTPS by implementing Merkle Tree Certificate support, compressing security data from 2.5KB to 64 bytes. The technology is already available in Chrome and will expand across the web to protect against future quantum computing threats.",
    "content": "Merkle Tree Certificate support is already in Chrome. Soon, it will be everywhere.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "谷歌通过将2.5KB数据压缩到64字节来对HTTPS进行量子防护",
        "summary": "谷歌通过实现默克尔树证书支持，将HTTPS进行了量子防护，将安全数据从2.5KB压缩到64字节。该技术已在Chrome中提供，并将扩展到整个网络，以防御未来的量子计算威胁。"
      },
      "fr": {
        "title": "Google rend HTTPS résistant aux attaques quantiques en comprimant 2,5 kB de données en 64 octets",
        "summary": "Google a rendu HTTPS résistant aux attaques quantiques en implémentant le support des certificats Merkle Tree, comprimant les données de sécurité de 2,5 KB à 64 octets. La technologie est déjà disponible dans Chrome et s'étendra sur le web pour se protéger contre les menaces futures de l'informatique quantique."
      },
      "de": {
        "title": "Google macht HTTPS quantensicher, indem 2,5 KB Daten auf 64 Bytes komprimiert werden",
        "summary": "Google hat HTTPS quantensicher gemacht, indem Merkle-Tree-Zertifikatunterstützung implementiert wurde und Sicherheitsdaten von 2,5 KB auf 64 Bytes komprimiert wurden. Die Technologie ist bereits in Chrome verfügbar und wird sich über das Web ausbreiten, um sich vor zukünftigen Quantencomputer-Bedrohungen zu schützen."
      },
      "es": {
        "title": "Google protege HTTPS contra ataques cuánticos al comprimir 2,5 kB de datos en 64 bytes",
        "summary": "Google ha protegido HTTPS contra amenazas cuánticas implementando soporte de certificados Merkle Tree, comprimiendo datos de seguridad de 2,5 KB a 64 bytes. La tecnología ya está disponible en Chrome y se expandirá por toda la web para protegerse contra futuras amenazas de computación cuántica."
      }
    }
  },
  {
    "title": "The Air Force's new ICBM is nearly ready to fly, but there’s nowhere to put it",
    "slug": "air-force-new-icbm-deployment-challenge",
    "url": "https://arstechnica.com/space/2026/02/the-air-forces-new-icbm-is-nearly-ready-to-fly-but-theres-nowhere-to-put-them/",
    "source": "Ars Technica",
    "date": "2026-02-28T00:32:24.000Z",
    "summary": "The U.S. Air Force's next-generation ICBM is nearing deployment readiness but faces placement challenges due to failed strategic assumptions. The delay affects the military's modernization timeline.",
    "content": "\"There were assumptions that were made in the strategy that obviously didn’t come to fruition.\"",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "美国空军新型洲际弹道导弹即将就绪，但却无处可放",
        "summary": "美国空军下一代洲际弹道导弹即将部署就绪，但由于战略假设失败而面临部署地点的挑战。该延迟影响了军事现代化的时间表。"
      },
      "fr": {
        "title": "Le nouveau missile balistique intercontinental de l'armée de l'air est presque prêt à voler, mais il n'y a nulle part où le mettre",
        "summary": "Le prochain missile balistique intercontinental de l'armée de l'air américaine est près de la capacité de déploiement mais fait face à des défis de placement dus aux hypothèses stratégiques échouées. Le retard affecte le calendrier de modernisation militaire."
      },
      "de": {
        "title": "Das neue Interkontinentalflugkörper der Luftwaffe ist bald einsatzbereit, aber es gibt keinen Platz dafür",
        "summary": "Das nächste ICBM der US-Luftwaffe steht kurz vor der Einsatzbereitschaft, sieht sich jedoch aufgrund fehlgeschlagener strategischer Annahmen mit Platzierungsproblemen konfrontiert. Die Verzögerung wirkt sich auf den Militärmodernisierungsplan aus."
      },
      "es": {
        "title": "El nuevo ICBM de la Fuerza Aérea está casi listo para volar, pero no hay lugar para colocarlo",
        "summary": "El próximo ICBM de la Fuerza Aérea de EE.UU. está cerca de estar listo para el despliegue pero enfrenta desafíos de colocación debido a suposiciones estratégicas fallidas. El retraso afecta la línea de tiempo de modernización militar."
      }
    }
  },
  {
    "title": "The best instant cameras you can buy right now",
    "slug": "best-instant-cameras-to-buy",
    "url": "https://www.theverge.com/23133103/best-instant-cameras-fujifilm-polaroid-kodak",
    "source": "The Verge",
    "date": "2026-02-28T00:32:11.000Z",
    "summary": "The Verge tested instant cameras from major brands and recommends the Fujifilm Instax Mini 12 as the best overall option for its print quality, ease of use, and affordability. The buying guide helps consumers find cameras suited to different needs and budgets.",
    "content": "Even with the ability to take excellent photos with our phones and instantly share them across the world, there’s something magical about the old-school instant camera. With just a click of a button, you can capture a moment in a photo that you can see and touch almost immediately. Images captured by an instant camera aren’t as pristine or perfect as those produced by modern digital cameras, but their soft images and imperfections are often a big part of the allure.\nYet not all instant cameras are the same, and some of them are better suited for different needs and budgets. That’s why we tested some of the most popular instant cameras on the market from brands like Fujifilm, Polaroid, Leica, Canon, Kodak, and others.\nAll the models featured in our instant camera buying guide are enjoyable to use, but each offers a distinct set of features at a different price point. As a result, some are more appropriate for a child or budding photographer, while others are more advanced and provide added creative control (for a price). When it comes down to it, though, we consider print quality, ease of use, and affordability to be the hallmarks of a quality shooter. That’s why we picked Fujifilm’s Instax Mini 12 as the best instant camera for most people, as it ticks all three boxes wonderfully.\nIf you’re looking for more creative control or features like filters, however, the Instax Mini Evo is our choice, one that offers great image quality and lets you choose which photos you’d like to print. Other instant cameras, like Kodak’s Mini Retro 3, also offer a variety of advanced creative modes for those who desire more.\nTake a look at this list of our instant camera recommendations to find the best fit for you.\nThe best instant camera for most people\nFujifilm Instax Mini 12\n\n\nScore: 8\n\nProsCons\n\n\nProduces relatively true-to-life photos\nTerrific ease of use\nVery affordable\n\nInstax film can get pricey\nMinimal creative control\nFlash can be overpowering\n\n\n\nWhere to Buy:\n\n $93.95 $86.24",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "现在可以买到的最佳拍立得相机",
        "summary": "The Verge 测试了主要品牌的拍立得相机，推荐富士 Instax Mini 12 作为整体最佳选择，因其打印质量、易用性和经济性。该购买指南帮助消费者找到适合不同需求和预算的相机。"
      },
      "fr": {
        "title": "Les meilleures caméras instantanées que vous pouvez acheter maintenant",
        "summary": "The Verge a testé les caméras instantanées des grandes marques et recommande le Fujifilm Instax Mini 12 comme la meilleure option globale pour sa qualité d'impression, sa facilité d'utilisation et son accessibilité. Le guide d'achat aide les consommateurs à trouver des caméras adaptées à différents besoins et budgets."
      },
      "de": {
        "title": "Die besten Sofortbildkameras, die Sie jetzt kaufen können",
        "summary": "The Verge testete Sofortbildkameras von großen Marken und empfiehlt die Fujifilm Instax Mini 12 als beste Gesamtoption für ihre Druckqualität, Benutzerfreundlichkeit und Erschwinglichkeit. Der Kaufführer hilft Verbrauchern, Kameras zu finden, die ihren unterschiedlichen Anforderungen und Budgets entsprechen."
      },
      "es": {
        "title": "Las mejores cámaras instantáneas que puedes comprar ahora",
        "summary": "The Verge probó cámaras instantáneas de grandes marcas y recomienda la Fujifilm Instax Mini 12 como la mejor opción general por su calidad de impresión, facilidad de uso y asequibilidad. La guía de compra ayuda a los consumidores a encontrar cámaras adecuadas para diferentes necesidades y presupuestos."
      }
    }
  }
]