[
  {
    "title": "Instagram now alerts parents if their teen searches for suicide or self-harm content",
    "slug": "instagram-alerts-parents-teen-suicide-self-harm",
    "url": "https://techcrunch.com/2026/02/26/instagram-now-alerts-parents-if-their-teen-searches-for-suicide-or-self-harm-content/",
    "source": "TechCrunch",
    "date": "2026-02-26T12:00:00.000Z",
    "summary": "Instagram is adding a feature to alert parents when their teens search for suicide or self-harm content, providing families with resources to support their children's mental health. This initiative aims to help parents identify teens at risk and intervene early.",
    "content": "Parents will be informed if their teen searches for suicide or self-harm content and offered resources.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Instagram现在在青少年搜索自杀或自残内容时提醒家长",
        "summary": "Instagram正在添加一项功能，在青少年搜索自杀或自残内容时提醒家长，为家庭提供资源来支持孩子的心理健康。这一举措旨在帮助家长识别有风险的青少年并进行早期干预。"
      },
      "fr": {
        "title": "Instagram alerte maintenant les parents si leurs ados recherchent du contenu suicidaire ou d'automutilation",
        "summary": "Instagram ajoute une fonctionnalité pour alerter les parents lorsque leurs adolescents recherchent du contenu suicidaire ou d'automutilation, en fournissant aux familles des ressources pour soutenir la santé mentale de leurs enfants. Cette initiative vise à aider les parents à identifier les adolescents à risque et à intervenir rapidement."
      },
      "de": {
        "title": "Instagram benachrichtigt nun Eltern, wenn ihre Jugendlichen nach Suizid- oder Selbstverletzen-Inhalten suchen",
        "summary": "Instagram fügt eine Funktion hinzu, um Eltern zu benachrichtigen, wenn ihre Jugendlichen nach Suizid- oder Selbstverletzen-Inhalten suchen, und stellt Familien Ressourcen zur Verfügung, um die psychische Gesundheit ihrer Kinder zu unterstützen. Diese Initiative soll Eltern helfen, gefährdete Jugendliche zu identifizieren und frühzeitig einzugreifen."
      },
      "es": {
        "title": "Instagram ahora alerta a los padres si sus adolescentes buscan contenido de suicidio o autolesiones",
        "summary": "Instagram está agregando una función para alertar a los padres cuando sus adolescentes buscan contenido de suicidio o autolesiones, proporcionando recursos a las familias para apoyar la salud mental de sus hijos. Esta iniciativa tiene como objetivo ayudar a los padres a identificar adolescentes en riesgo e intervenir temprano."
      }
    }
  },
  {
    "title": "Instagram will alert parents if their kids &#8216;repeatedly&#8217; search for self-harm topics",
    "slug": "instagram-alert-parents-repeatedly-self-harm",
    "url": "https://www.theverge.com/tech/885110/meta-instagram-parent-alert-teen-self-harm-suicide",
    "source": "The Verge",
    "date": "2026-02-26T12:00:00.000Z",
    "summary": "Instagram is launching a parental alert system that notifies parents when teens repeatedly search for suicide or self-harm related terms, rolling out first in the US, UK, Australia, and Canada for opted-in supervision accounts. Meta also plans similar protections for its AI chatbots later this year.",
    "content": "The alerts will start rolling out to Teen accounts with parental supervision protections next week. | Image: Meta / The Verge\t\n\nStarting next week, Instagram will notify parents to check on their teen searching for terms related to self-harm or suicide. Meta says a similar alert system for its AI chatbots is coming later this year.\nThe new Instagram feature  sends parents an alert when their child \"repeatedly tries to search for terms clearly associated with suicide or self-harm within a short period of time.\" It's rolling out in the US, UK, Australia, and Canada starting next week, but it's only for parents and teens who opt in to supervision. It's expected to expand to other regions later this year.\n\"The vast majority of teens do not try to search for suicide and …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Instagram将在孩子反复搜索自残话题时提醒家长",
        "summary": "Instagram正在推出一个家长提醒系统，当青少年反复搜索自杀或自残相关内容时通知家长，首先在美国、英国、澳大利亚和加拿大为已选择监管的账户推出。Meta还计划今年晚些时候为其AI聊天机器人提供类似保护。"
      },
      "fr": {
        "title": "Instagram alertera les parents si leurs enfants recherchent régulièrement des sujets d'automutilation",
        "summary": "Instagram lance un système d'alerte parentale qui notifie les parents lorsque les adolescents recherchent à plusieurs reprises des termes liés au suicide ou à l'automutilation, se déployant d'abord aux États-Unis, au Royaume-Uni, en Australie et au Canada pour les comptes de supervision activés. Meta prévoit également des protections similaires pour ses chatbots IA plus tard cette année."
      },
      "de": {
        "title": "Instagram wird Eltern benachrichtigen, wenn ihre Kinder wiederholte Selbstverletzen-Themen suchen",
        "summary": "Instagram führt ein Eltern-Benachrichtigungssystem ein, das Eltern benachrichtigt, wenn Jugendliche wiederholt nach Suizid- oder Selbstverletzen-Begriffen suchen, und rollt es zunächst in den USA, Großbritannien, Australien und Kanada für aktivierte Überwachungskonten aus. Meta plant außerdem ähnliche Schutzmaßnahmen für seine KI-Chatbots später in diesem Jahr."
      },
      "es": {
        "title": "Instagram alertará a los padres si sus hijos buscan repetidamente temas de autolesiones",
        "summary": "Instagram está lanzando un sistema de alerta para padres que notifica a los padres cuando los adolescentes buscan repetidamente términos relacionados con suicidio o autolesiones, implementándose primero en EE.UU., Reino Unido, Australia y Canadá para cuentas de supervisión activadas. Meta también planea protecciones similares para sus chatbots de IA más adelante este año."
      }
    }
  },
  {
    "title": "Google takes control of ‘Android of robotics’ project in quest for physical AI",
    "slug": "google-takes-control-android-robotics-physical-ai",
    "url": "https://www.theverge.com/tech/885113/google-swallows-ai-robotics-moonshot-intrinsic",
    "source": "The Verge",
    "date": "2026-02-26T11:06:33.000Z",
    "summary": "Google is integrating Alphabet's robotics AI company Intrinsic into its core operations after five years as an independent venture, signaling a strategic shift toward physical AI development. The move brings Intrinsic's Android-like robotics platform closer to Google's main business.",
    "content": "Google is folding Alphabet's AI robotics \"moonshot,\" Intrinsic, into the company after five years as an independent unit. The move marks a strategic shift as Google doubles down on physical AI and pulls experimental projects closer to its core business. \nIntrinsic \"graduated\" into an independent company inside Alphabet's Other Bets division in 2021, a portfolio of high-risk, speculative ventures that also includes robotaxi firm Waymo and healthcare company Verily. It pitches itself as an Android-like layer for robotics, building software and tools that make it easier to create robot applications.\nDetails of the purchase are not clear but t …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "谷歌接管\"机器人的安卓\"项目，追求物理人工智能",
        "summary": "谷歌将Alphabet的机器人AI公司Intrinsic整合到其核心业务中，该公司在五年前作为独立企业成立，这标志着向物理人工智能发展的战略转变。此举将Intrinsic类似安卓的机器人平台更接近谷歌的主要业务。"
      },
      "fr": {
        "title": "Google prend le contrôle du projet \"Android de la robotique\" dans sa quête pour l'IA physique",
        "summary": "Google intègre Intrinsic, la société d'IA robotique d'Alphabet, dans ses activités principales après cinq ans en tant qu'entreprise indépendante, signalant un changement stratégique vers le développement de l'IA physique. Cette démarche rapproche la plateforme robotique de type Android d'Intrinsic du cœur de métier de Google."
      },
      "de": {
        "title": "Google übernimmt Kontrolle über das \"Android der Robotik\"-Projekt im Streben nach physischer KI",
        "summary": "Google integriert Alphabets Robotik-KI-Unternehmen Intrinsic in seine Kernoperationen nach fünf Jahren als unabhängiges Unternehmen, was einen strategischen Wandel in Richtung Entwicklung physischer KI signalisiert. Der Schritt bringt Intrinsics Android-ähnliche Robotik-Plattform näher an Googles Hauptgeschäft."
      },
      "es": {
        "title": "Google toma control del proyecto \"Android de la robótica\" en busca de IA física",
        "summary": "Google está integrando Intrinsic, la empresa de IA de robótica de Alphabet, en sus operaciones principales después de cinco años como empresa independiente, señalando un cambio estratégico hacia el desarrollo de IA física. El movimiento acerca la plataforma de robótica similar a Android de Intrinsic más cerca del negocio principal de Google."
      }
    }
  },
  {
    "title": "Salesforce CEO Marc Benioff: This isn’t our first SaaSpocalypse",
    "slug": "salesforce-ceo-marc-benioff-saaspocalypse",
    "url": "https://techcrunch.com/2026/02/25/salesforce-ceo-marc-benioff-this-isnt-our-first-saaspocalypse/",
    "source": "TechCrunch",
    "date": "2026-02-26T01:59:12.000Z",
    "summary": "Salesforce reported strong year-end earnings while addressing concerns about AI threatening its business model. CEO Marc Benioff emphasized the company's resilience through previous technological disruptions. The announcement aims to counter narratives about AI obsolescence in the SaaS sector.",
    "content": "Salesforce reported a solid year-end earnings and then pulled out all the stops to ward off more talk of the death of its business to AI.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Salesforce首席执行官Marc Benioff：这不是我们第一次\"SaaS末日\"",
        "summary": "Salesforce报告了强劲的年终业绩，同时回应了有关人工智能威胁其商业模式的担忧。首席执行官Marc Benioff强调了该公司在以往技术颠覆中的韧性。这项声明旨在反驳关于SaaS领域AI过时的叙述。"
      },
      "fr": {
        "title": "Le PDG de Salesforce Marc Benioff : Ce n'est pas notre premier SaaSpocalypse",
        "summary": "Salesforce a rapporté de solides résultats de fin d'année tout en abordant les préoccupations concernant l'IA menaçant son modèle commercial. Le PDG Marc Benioff a souligné la résilience de l'entreprise face aux perturbations technologiques précédentes. L'annonce vise à contrer les récits sur l'obsolescence de l'IA dans le secteur du SaaS."
      },
      "de": {
        "title": "Salesforce-CEO Marc Benioff: Dies ist nicht unser erstes SaaSpocalypse",
        "summary": "Salesforce meldete starke Jahresendergebnisse und befasste sich mit Bedenken hinsichtlich der künstlichen Intelligenz, die sein Geschäftsmodell bedroht. CEO Marc Benioff betonte die Widerstandsfähigkeit des Unternehmens gegen frühere technologische Störungen. Die Ankündigung zielt darauf ab, Narrative über die Veralterung von KI im SaaS-Sektor entgegenzuwirken."
      },
      "es": {
        "title": "El CEO de Salesforce Marc Benioff: Este no es nuestro primer SaaSpocalipsis",
        "summary": "Salesforce reportó sólidas ganancias de fin de año mientras abordaba las preocupaciones sobre la IA que amenaza su modelo de negocio. El CEO Marc Benioff enfatizó la resiliencia de la empresa frente a perturbaciones tecnológicas previas. El anuncio tiene como objetivo contrarrestar las narrativas sobre la obsolescencia de la IA en el sector SaaS."
      }
    }
  },
  {
    "title": "Gushwork bets on AI search for customer leads — and early results are emerging",
    "slug": "gushwork-ai-search-customer-leads",
    "url": "https://techcrunch.com/2026/02/25/gushwork-bets-on-ai-search-for-customer-leads-and-early-results-are-emerging/",
    "source": "TechCrunch",
    "date": "2026-02-26T00:00:00.000Z",
    "summary": "Gushwork, a startup leveraging AI search tools like ChatGPT for customer lead generation, has raised $9 million in a seed round led by SIG and Lightspeed. Early customer traction suggests the approach is gaining market interest.",
    "content": "Gushwork has raised $9 million in a seed round led by SIG and Lightspeed. The startup has seen early customer traction from AI search tools like ChatGPT.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Gushwork 押注 AI 搜索获取客户线索——早期成果正在出现",
        "summary": "初创公司 Gushwork 利用 ChatGPT 等 AI 搜索工具进行客户线索生成，已在由 SIG 和 Lightspeed 领投的种子轮中融资 900 万美元。早期客户吸引力表明该方法正在获得市场关注。"
      },
      "fr": {
        "title": "Gushwork parie sur la recherche IA pour générer des prospects — et les premiers résultats émergent",
        "summary": "Gushwork, une startup exploitant des outils de recherche IA comme ChatGPT pour la génération de prospects, a levé 9 millions de dollars au cours d'un tour de financement dirigé par SIG et Lightspeed. L'intérêt des premiers clients suggère que cette approche gagne du terrain."
      },
      "de": {
        "title": "Gushwork setzt auf KI-Suche für Kundenakquise — erste Ergebnisse zeichnen sich ab",
        "summary": "Gushwork, ein Startup, das KI-Suchwerkzeuge wie ChatGPT zur Kundenakquise nutzt, hat in einer von SIG und Lightspeed angeführten Seed-Runde 9 Millionen Dollar aufgebracht. Frühe Kundenbindung deutet darauf hin, dass der Ansatz Marktinteresse gewinnt."
      },
      "es": {
        "title": "Gushwork apuesta por la búsqueda de IA para generar clientes — y los primeros resultados están emergiendo",
        "summary": "Gushwork, una startup que aprovecha herramientas de búsqueda de IA como ChatGPT para la generación de clientes, ha recaudado 9 millones de dólares en una ronda de semilla liderada por SIG y Lightspeed. El interés inicial de los clientes sugiere que el enfoque está ganando tracción en el mercado."
      }
    }
  }
]