[
  {
    "title": "Anthropic acquires computer-use AI startup Vercept after Meta poached one of its founders",
    "slug": "anthropic-acquires-vercept-computer-use-ai",
    "url": "https://techcrunch.com/2026/02/25/anthropic-acquires-vercept-ai-startup-agents-computer-use-founders-investors/",
    "source": "TechCrunch",
    "date": "2026-02-25T23:49:19.000Z",
    "summary": "Anthropic has acquired Seattle-based Vercept, a startup that developed complex agentic tools including computer-use agents capable of completing tasks in applications. The acquisition comes after Meta recruited one of Vercept's founders.",
    "content": "Seattle-based Vercept developed complex agentic tools, including a computer-use agent that could complete tasks inside applications like a person with a laptop would.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "在 Meta 挖走一位联合创始人后，Anthropic 收购计算机使用 AI 初创公司 Vercept",
        "summary": "Anthropic 已收购总部位于西雅图的 Vercept，这是一家开发复杂代理工具的初创公司，包括能够在应用程序中完成任务的计算机使用代理。此次收购发生在 Meta 招募了 Vercept 一位联合创始人之后。"
      },
      "fr": {
        "title": "Anthropic acquiert Vercept, la startup d'IA pour l'utilisation d'ordinateurs, après que Meta ait recruté l'un de ses fondateurs",
        "summary": "Anthropic a acquis Vercept, basée à Seattle, une startup qui a développé des outils d'agents complexes, y compris des agents informatiques capables d'effectuer des tâches dans les applications. L'acquisition intervient après que Meta a recruté l'un des fondateurs de Vercept."
      },
      "de": {
        "title": "Anthropic erwirbt KI-Startup Vercept für Computernutzung, nachdem Meta einen seiner Gründer abgeworben hat",
        "summary": "Anthropic hat das in Seattle ansässige Startup Vercept erworben, das komplexe agentische Tools entwickelt hat, einschließlich Computer-Use-Agents, die Aufgaben in Anwendungen ausführen können. Die Akquisition folgt auf die Rekrutierung eines der Gründer von Vercept durch Meta."
      },
      "es": {
        "title": "Anthropic adquiere Vercept, startup de IA para uso de computadoras, después de que Meta reclutara a uno de sus fundadores",
        "summary": "Anthropic ha adquirido Vercept, con sede en Seattle, una startup que desarrolló herramientas de agentes complejos, incluidos agentes de uso de computadora capaces de completar tareas en aplicaciones. La adquisición se produce después de que Meta reclutara a uno de los fundadores de Vercept."
      }
    }
  },
  {
    "title": "New York sues Valve, alleging its loot boxes are ‘quintessential gambling’",
    "slug": "new-york-sues-valve-loot-boxes-gambling",
    "url": "https://www.theverge.com/games/884978/valve-lawsuit-loot-boxes-new-york-attorney-general-lawsuit",
    "source": "The Verge",
    "date": "2026-02-25T23:22:18.000Z",
    "summary": "New York Attorney General Letitia James is suing Valve for illegally promoting gambling through loot box systems in games like Counter-Strike 2 and Dota 2. The lawsuit seeks to permanently stop the loot box model and recover ill-gotten gains through fines.",
    "content": "New York Attorney General Letitia James is suing Valve for \"illegally promoting gambling\" through the loot box systems it has built for video games like Counter-Strike 2, Team Fortress 2, and Dota 2, according to a press release. The attorney general seeks to \"permanently stop Valve from promoting gambling features in its games, disgorge all ill-gotten gains, and pay fines for violating New York's laws.\"\n\"This loot box model that Valve has developed - charging an individual for a chance to win something of value based on luck alone - is quintessential gambling, prohibited under New York's Constitution and Penal Law,\" the lawsuit says. Valve …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "纽约起诉 Valve，声称其战利品箱是\"典型的赌博\"",
        "summary": "纽约司法部长 Letitia James 正在起诉 Valve，指控其通过在 Counter-Strike 2 和 Dota 2 等游戏中的战利品箱系统非法推广赌博。该诉讼旨在永久停止战利品箱模式并通过罚款收回非法所得。"
      },
      "fr": {
        "title": "New York poursuit Valve, alléguant que ses coffres à butin sont du « jeu de hasard quintessentiel »",
        "summary": "Le procureur général de l'État de New York, Letitia James, poursuit Valve pour avoir illégalement promu le jeu d'argent par le système de coffres à butin dans des jeux comme Counter-Strike 2 et Dota 2. L'action en justice vise à arrêter définitivement le modèle des coffres à butin et à récupérer les gains illicites par des amendes."
      },
      "de": {
        "title": "New York verklagt Valve und behauptet, dass seine Loot Boxes « quintessenzielles Glücksspiel » sind",
        "summary": "Die Generalstaatsanwältin von New York, Letitia James, verklagt Valve, um das illegale Fördern von Glücksspielen durch Loot-Box-Systeme in Spielen wie Counter-Strike 2 und Dota 2 zu unterbinden. Die Klage zielt darauf ab, das Loot-Box-Modell dauerhaft zu stoppen und illegale Gewinne durch Geldstrafen einzutreiben."
      },
      "es": {
        "title": "New York demanda a Valve, alegando que sus cajas de botín son « juego de azar quintaesencial »",
        "summary": "La Fiscal General de Nueva York, Letitia James, está demandando a Valve por promover ilegalmente el juego a través de sistemas de cajas de botín en juegos como Counter-Strike 2 y Dota 2. La demanda busca detener permanentemente el modelo de cajas de botín y recuperar ganancias ilícitas a través de multas."
      }
    }
  },
  {
    "title": "Nvidia has another record quarter amid record capex spends",
    "slug": "nvidia-record-quarter-capex-spending",
    "url": "https://techcrunch.com/2026/02/25/nvidia-earnings-record-capex-spend-ai/",
    "source": "TechCrunch",
    "date": "2026-02-25T23:04:42.000Z",
    "summary": "Nvidia reported another record quarter, with CEO Jensen Huang noting exponential demand for AI tokens. The company is investing heavily in capital expenditures to meet this surging demand.",
    "content": "\"The demand for tokens in the world has gone completely exponential,\" Nvidia CEO Jensen Huang said about the company's earnings.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "英伟达在创纪录资本支出中再创纪录季度",
        "summary": "英伟达公布了又一个创纪录的季度，首席执行官黄仁勋指出对AI代币的需求呈指数增长。该公司正在加大资本支出投资，以满足这一激增的需求。"
      },
      "fr": {
        "title": "Nvidia a un autre trimestre record au milieu des dépenses en capital records",
        "summary": "Nvidia a déclaré un autre trimestre record, le PDG Jensen Huang notant une demande exponentielle de jetons IA. L'entreprise investit massivement dans les dépenses en capital pour répondre à cette demande croissante."
      },
      "de": {
        "title": "Nvidia verzeichnet weiteres Rekordquartal inmitten von Rekord-Kapitalausgaben",
        "summary": "Nvidia meldete ein weiteres Rekordquartal, wobei CEO Jensen Huang eine exponentielle Nachfrage nach KI-Token feststellte. Das Unternehmen investiert stark in Investitionsausgaben, um diese steigende Nachfrage zu erfüllen."
      },
      "es": {
        "title": "Nvidia tiene otro trimestre récord en medio del gasto de capital récord",
        "summary": "Nvidia reportó otro trimestre récord, con el CEO Jensen Huang señalando una demanda exponencial de tokens de IA. La empresa está invirtiendo mucho en gastos de capital para satisfacer esta creciente demanda."
      }
    }
  },
  {
    "title": "How the new Galaxy S26 phones stack up against each other on paper",
    "slug": "galaxy-s26-phones-specs-comparison",
    "url": "https://www.theverge.com/gadgets/883733/samsung-galaxy-s26-vs-plus-ultra-specs-features-hardware-comparison",
    "source": "The Verge",
    "date": "2026-02-25T22:26:31.000Z",
    "summary": "Samsung's new Galaxy S26 lineup introduces AI-powered features including call screening and AI-assisted photo editing. All three models run Qualcomm's Snapdragon 8 Elite Gen 5 with enhanced performance starting at $899.99.",
    "content": "Samsung’s Galaxy S26 phones introduce a slate of new AI-powered features, including some new photography tools. | Image: Samsung\t\n\nSamsung has just announced its new Galaxy S26 lineup, which includes the S26, S26 Plus, and S26 Ultra. While they aren't radical departures from last year's models, they bring a handful of notable upgrades. All three run on Qualcomm's Galaxy-centric Snapdragon 8 Elite Gen 5, which delivers improved performance and powers a slew of new AI-based features. This includes the ability to screen unknown calls and edit photos by typing what you want changed, along with an update to Google Gemini that can carry out certain tasks in supported third-party apps, like Uber and DoorDash, on your behalf.\nStarting at $899.99, the S26 is the smallest and mo …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "新款Galaxy S26手机规格对比分析",
        "summary": "三星新的Galaxy S26系列推出了AI驱动的功能，包括通话筛选和AI辅助照片编辑。所有三款机型均搭载高通Snapdragon 8 Elite Gen 5，性能增强，起价为899.99美元。"
      },
      "fr": {
        "title": "Comment les nouveaux téléphones Galaxy S26 se comparent sur le papier",
        "summary": "La nouvelle gamme Galaxy S26 de Samsung introduit des fonctionnalités alimentées par l'IA, notamment le filtrage des appels et l'édition de photos assistée par l'IA. Les trois modèles exécutent le Snapdragon 8 Elite Gen 5 de Qualcomm avec des performances améliorées à partir de 899,99 $."
      },
      "de": {
        "title": "Wie die neuen Galaxy S26-Telefone auf dem Papier miteinander vergleichen",
        "summary": "Samsungs neue Galaxy S26-Linie führt KI-gestützte Funktionen ein, einschließlich Anruffilterung und KI-gestützte Fotobearbeitung. Alle drei Modelle führen Qualcomms Snapdragon 8 Elite Gen 5 mit verbesserter Leistung ab 899,99 $ aus."
      },
      "es": {
        "title": "Cómo se comparan los nuevos teléfonos Galaxy S26 en el papel",
        "summary": "La nueva línea Galaxy S26 de Samsung introduce características impulsadas por IA, incluida la detección de llamadas y la edición de fotos asistida por IA. Los tres modelos ejecutan el Snapdragon 8 Elite Gen 5 de Qualcomm con rendimiento mejorado a partir de $899.99."
      }
    }
  },
  {
    "title": "Musk has no proof OpenAI stole xAI trade secrets, judge rules, tossing lawsuit",
    "slug": "musk-openai-lawsuit-dismissed-trade-secrets",
    "url": "https://arstechnica.com/tech-policy/2026/02/judge-xai-cant-claim-openai-stole-trade-secrets-just-by-hiring-ex-staffers/",
    "source": "Ars Technica",
    "date": "2026-02-25T22:09:21.000Z",
    "summary": "A judge has dismissed Elon Musk's lawsuit against OpenAI over alleged trade secret theft, ruling that Musk lacks sufficient evidence. The decision came despite attempts to reframe an ex-employee's messages in xAI's favor.",
    "content": "Even twisting an ex-employee's text to favor xAI's reading fails to sway judge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "马斯克无证据证明OpenAI窃取xAI商业秘密，法官驳回诉讼",
        "summary": "法官驳回了埃隆·马斯克针对OpenAI涉嫌盗取商业秘密的诉讼，裁定马斯克证据不足。尽管试图将前员工的消息重新解释为对xAI有利，但该裁决仍然生效。"
      },
      "fr": {
        "title": "Musk n'a pas de preuve qu'OpenAI a volé les secrets commerciaux de xAI, a statué le juge, rejetant le procès",
        "summary": "Un juge a rejeté la plainte d'Elon Musk contre OpenAI pour vol présumé de secrets commerciaux, statuant que Musk manque de preuves suffisantes. La décision est intervenue malgré les tentatives de reformuler les messages d'un ancien employé en faveur de xAI."
      },
      "de": {
        "title": "Musk hat keinen Beweis, dass OpenAI xAI-Geschäftsgeheimnisse gestohlen hat, entscheidet Richter, verwirft Klage",
        "summary": "Ein Richter hat Elon Musks Klage gegen OpenAI wegen mutmaßlichen Diebstahls von Geschäftsgeheimnissen abgewiesen und entschieden, dass Musk unzureichende Beweise hat. Die Entscheidung kam trotz Versuche, die Nachrichten eines ehemaligen Mitarbeiters zugunsten von xAI umzudeuten."
      },
      "es": {
        "title": "Musk no tiene prueba de que OpenAI robó secretos comerciales de xAI, falla el juez, desestimando la demanda",
        "summary": "Un juez desestimó la demanda de Elon Musk contra OpenAI por supuesto robo de secretos comerciales, dictaminando que Musk carece de evidencia suficiente. La decisión se produjo a pesar de los intentos de reinterpretar los mensajes de un ex empleado a favor de xAI."
      }
    }
  },
  {
    "title": "Corsair is halting Drop sales after March 25th",
    "slug": "corsair-halting-drop-sales-march-25",
    "url": "https://www.theverge.com/news/884824/corsair-ending-drop-shopping-site",
    "source": "The Verge",
    "date": "2026-02-25T21:58:53.000Z",
    "summary": "Corsair, which acquired the specialty gear retailer Drop in 2023, is shutting down the Drop store effective March 25th. Selected products will migrate to Corsair's main site while the Drop platform itself will become view-only after March 31st.",
    "content": "The Drop Mythic Journey keyboard from 2022. | Photo by Jon Porter / The Verge\t\n\nThe Drop store, which was acquired by gaming gear giant Corsair in 2023, was a haven for mechanical keyboard enthusiasts and audiophiles to discover and buy hard-to-find gear - sometimes at surprisingly good prices. The company will cease sales after March 25th at 11:59PM PT, which is also the cut off to redeem Drop Rewards. After March 31st, the site will be accessible for a limited time to view order history, but all retail functionality will shift to Corsair.\nCorsair's marketing manager Andrew Williams confirmed to The Verge that several products featured on Drop will be integrated into Corsair's site for purchase. Select others will be  …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "科赛尔停止Drop销售服务至3月25日",
        "summary": "科赛尔于2023年收购了专业装备零售商Drop,现在决定在3月25日停止运营Drop商店。精选产品将迁移到科赛尔主网站,而Drop平台本身将在3月31日后变为只读状态。"
      },
      "fr": {
        "title": "Corsair arrête les ventes Drop après le 25 mars",
        "summary": "Corsair, qui a acquis le détaillant spécialisé Drop en 2023, ferme le magasin Drop à partir du 25 mars. Les produits sélectionnés seront transférés vers le site principal de Corsair, tandis que la plateforme Drop deviendra en lecture seule après le 31 mars."
      },
      "de": {
        "title": "Corsair stellt Drop-Verkäufe nach dem 25. März ein",
        "summary": "Corsair, das das spezialisierte Einzelhandelsunternehmen Drop 2023 erworben hat, stellt den Drop-Shop ab dem 25. März ein. Ausgewählte Produkte werden auf die Hauptwebseite von Corsair migriert, während die Drop-Plattform selbst nach dem 31. März schreibgeschützt wird."
      },
      "es": {
        "title": "Corsair detiene las ventas de Drop después del 25 de marzo",
        "summary": "Corsair, que adquirió al minorista especializado Drop en 2023, cierra la tienda Drop a partir del 25 de marzo. Los productos seleccionados se migrarán al sitio principal de Corsair, mientras que la plataforma Drop se volverá de solo lectura después del 31 de marzo."
      }
    }
  },
  {
    "title": "The Galaxy S26 is faster, more expensive, and even more chock-full of AI",
    "slug": "galaxy-s26-faster-expensive-ai-features",
    "url": "https://arstechnica.com/gadgets/2026/02/samsung-reveals-galaxy-s26-lineup-with-privacy-display-and-exclusive-gemini-smarts/",
    "source": "Ars Technica",
    "date": "2026-02-25T21:41:27.000Z",
    "summary": "Samsung's Galaxy S26 series is now available for preorder and ships on March 11. The new lineup offers improved performance and expanded AI capabilities at higher price points.",
    "content": "Samsung's Galaxy S26 series is available for preorder today and ships on March 11.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Galaxy S26更快、更贵,还配备了更多AI功能",
        "summary": "三星Galaxy S26系列现已开放预购,将于3月11日发货。新系列提供改进的性能和扩展的AI功能,价格也更高。"
      },
      "fr": {
        "title": "Le Galaxy S26 est plus rapide, plus cher et encore plus rempli d'IA",
        "summary": "La série Samsung Galaxy S26 est maintenant disponible en précommande et sera livrée le 11 mars. La nouvelle gamme offre des performances améliorées et des capacités IA étendues à des prix plus élevés."
      },
      "de": {
        "title": "Das Galaxy S26 ist schneller, teurer und noch voller KI-Funktionen",
        "summary": "Die Samsung Galaxy S26-Serie ist jetzt zur Vorbestellung verfügbar und wird am 11. März versendet. Die neue Serie bietet verbesserte Leistung und erweiterte KI-Funktionen zu höheren Preisen."
      },
      "es": {
        "title": "El Galaxy S26 es más rápido, más caro y aún más lleno de IA",
        "summary": "La serie Samsung Galaxy S26 ya está disponible para preorden y se enviará el 11 de marzo. La nueva línea ofrece rendimiento mejorado y capacidades de IA expandidas a precios más altos."
      }
    }
  },
  {
    "title": "Judge doesn't trust DOJ with search of devices seized from Wash. Post reporter",
    "slug": "judge-doj-devices-washington-post-reporter",
    "url": "https://arstechnica.com/tech-policy/2026/02/judge-doesnt-trust-doj-with-search-of-devices-seized-from-wash-post-reporter/",
    "source": "Ars Technica",
    "date": "2026-02-25T20:53:54.000Z",
    "summary": "A judge has ordered the court to conduct searches of devices seized from a Washington Post reporter rather than granting the DOJ full access. The decision reflects judicial concerns about government handling of the materials.",
    "content": "Court to search devices itself instead of letting government have full access.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "法官不信任司法部对扣押的华盛顿邮报记者设备的搜查",
        "summary": "一位法官已下令由法院自行进行搜查,而非向司法部提供对扣押华盛顿邮报记者设备的全面访问权限。该决定反映了司法机构对政府处理相关物品方式的担忧。"
      },
      "fr": {
        "title": "Le juge ne fait pas confiance au DOJ pour fouiller les appareils saisis du journaliste du Washington Post",
        "summary": "Un juge a ordonné à la cour de mener elle-même les fouilles des appareils saisis d'un journaliste du Washington Post plutôt que d'accorder au DOJ un accès complet. La décision reflète les préoccupations judiciaires concernant la gestion gouvernementale des matériaux."
      },
      "de": {
        "title": "Richter vertraut dem Justizministerium nicht bei der Durchsuchung beschlagnahmter Geräte des Washington-Post-Reporters",
        "summary": "Ein Richter hat angeordnet, dass das Gericht selbst die Durchsuchung von Geräten durchführt, die einem Washington-Post-Reporter entzogen wurden, anstatt dem Justizministerium vollständigen Zugriff zu gewähren. Die Entscheidung spiegelt Bedenken der Justiz bezüglich des Regierungsumgangs mit den Materialien wider."
      },
      "es": {
        "title": "El juez no confía en el DOJ para buscar dispositivos incautados al periodista del Washington Post",
        "summary": "Un juez ha ordenado que sea la corte quien realice las búsquedas de dispositivos incautados a un periodista del Washington Post en lugar de otorgar al DOJ acceso completo. La decisión refleja preocupaciones judiciales sobre cómo el gobierno maneja los materiales."
      }
    }
  },
  {
    "title": "The Peace Corps is recruiting volunteers to sell AI to developing nations",
    "slug": "peace-corps-tech-corps-ai-developing-nations",
    "url": "https://www.theverge.com/policy/884625/peace-corps-tech-promote-american-ai",
    "source": "The Verge",
    "date": "2026-02-25T20:45:00.000Z",
    "summary": "The Peace Corps has launched a \"Tech Corps\" initiative to recruit volunteers to promote major AI companies to developing nations, raising concerns about mission drift from the agency's traditional focus on education, healthcare, and agriculture. The program ties the Peace Corps to companies with Trump administration connections.",
    "content": "For more than six decades, the Peace Corps has represented itself as an agency focused on helping underserved communities around the globe. But a new initiative, called the \"Tech Corps,\" threatens to unravel the agency's original mission by recruiting de facto Silicon Valley salespeople to promote the biggest names in AI - many of which have ties to President Donald Trump.\nEstablished by President John F. Kennedy in 1961, the Peace Corps recruited skilled Americans interested in assisting developing countries in industries like education, healthcare, and agriculture. As noted by the Brookings Institution, the agency was created to \"win the  …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "美国和平队招募志愿者向发展中国家推销人工智能",
        "summary": "美国和平队发起了一项\"科技队\"倡议，招募志愿者向发展中国家推广主要的人工智能公司，引发了人们对该机构偏离其传统关注领域（教育、医疗和农业）的担忧。该项目将和平队与与特朗普政府有关联的公司联系在一起。"
      },
      "fr": {
        "title": "Le Corps de la paix recrute des volontaires pour vendre l'IA aux pays en développement",
        "summary": "Le Corps de la paix a lancé une initiative \"Tech Corps\" pour recruter des volontaires afin de promouvoir les principales entreprises d'IA auprès des pays en développement, suscitant des inquiétudes quant à la dérive de la mission de l'agence par rapport à son orientation traditionnelle vers l'éducation, la santé et l'agriculture. Le programme lie le Corps de la paix à des entreprises ayant des liens avec l'administration Trump."
      },
      "de": {
        "title": "Das Peace Corps rekrutiert Freiwillige, um KI an Entwicklungsländer zu verkaufen",
        "summary": "Das Peace Corps hat eine \"Tech Corps\"-Initiative gestartet, um Freiwillige zu rekrutieren, die große KI-Unternehmen in Entwicklungsländern fördern sollen. Dies weckt Bedenken hinsichtlich einer Abweichung vom traditionellen Fokus der Behörde auf Bildung, Gesundheitswesen und Landwirtschaft. Das Programm verbindet das Peace Corps mit Unternehmen, die Verbindungen zur Trump-Administration haben."
      },
      "es": {
        "title": "El Cuerpo de Paz recluta voluntarios para vender IA a países en desarrollo",
        "summary": "El Cuerpo de Paz ha lanzado una iniciativa \"Tech Corps\" para reclutar voluntarios que promuevan las principales empresas de IA en países en desarrollo, lo que genera preocupaciones sobre la desviación de la misión de la agencia de su enfoque tradicional en educación, atención médica y agricultura. El programa vincula al Cuerpo de Paz con empresas con conexiones con la administración Trump."
      }
    }
  },
  {
    "title": "The White House wants AI companies to cover rate hikes. Most have already said they would.",
    "slug": "white-house-ai-companies-electricity-rate-hikes",
    "url": "https://techcrunch.com/2026/02/25/the-white-house-wants-ai-companies-to-cover-rate-hikes-most-have-already-said-they-would/",
    "source": "TechCrunch",
    "date": "2026-02-25T20:42:14.000Z",
    "summary": "The White House is pushing AI companies to cover electricity cost increases for their data centers, a commitment many hyperscalers have already publicly pledged to make. The initiative aims to address concerns about rising power costs.",
    "content": "Many hyperscalers have already made public commitments to cover electricity cost increases.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "白宫要求人工智能公司承担电价上涨成本。大多数公司已经同意。",
        "summary": "白宫正在推动人工智能公司承担数据中心的电力成本增加，许多超大规模计算公司已经公开承诺这样做。这项倡议旨在解决对电力成本上升的担忧。"
      },
      "fr": {
        "title": "La Maison Blanche veut que les entreprises d'IA couvrent les augmentations tarifaires. La plupart ont déjà dit qu'elles le feraient.",
        "summary": "La Maison Blanche pousse les entreprises d'IA à couvrir les augmentations des coûts d'électricité pour leurs centres de données, un engagement que de nombreux hyperscalers ont déjà publiquement promis de faire. L'initiative vise à répondre aux préoccupations concernant la hausse des coûts de l'énergie."
      },
      "de": {
        "title": "Das Weiße Haus möchte, dass KI-Unternehmen die Tariferhöhungen tragen. Die meisten haben bereits zugesagt.",
        "summary": "Das Weiße Haus drängt KI-Unternehmen, die Stromkostenerhöhungen für ihre Rechenzentren zu tragen, ein Engagement, das viele Hyperscaler bereits öffentlich zugesagt haben. Die Initiative zielt darauf ab, Bedenken hinsichtlich steigender Stromkosten zu bewältigen."
      },
      "es": {
        "title": "La Casa Blanca quiere que las empresas de IA cubran los aumentos de tarifas. La mayoría ya han dicho que lo harían.",
        "summary": "La Casa Blanca está presionando a las empresas de IA para que cubran los aumentos en los costos de electricidad de sus centros de datos, un compromiso que muchos hipergigantes ya han prometido públicamente. La iniciativa tiene como objetivo abordar las preocupaciones sobre el aumento de los costos de energía."
      }
    }
  },
  {
    "title": "Trump claims tech companies will sign deals next week to pay for their own power supply",
    "slug": "trump-tech-companies-power-supply-pledge-march-4",
    "url": "https://www.theverge.com/science/884191/ai-data-center-energy-state-of-the-union-trump",
    "source": "The Verge",
    "date": "2026-02-25T20:37:25.000Z",
    "summary": "President Trump announced that major tech companies including Amazon, Google, Meta, Microsoft, xAI, Oracle, and OpenAI will sign a \"rate payer protection pledge\" on March 4th to build or fund new electricity generation. The pledge aims to address rising electricity costs by having tech companies invest in their own power infrastructure.",
    "content": "President Donald Trump tried to quell Americans' concerns about rising electricity costs during his State of the Union speech - and now we're learning that the deals he promised could land next week. Trump claimed that he's negotiated a \"rate payer protection pledge\" with major tech companies, which would see them build out or pay for new electricity generation for their data centers. Leaders from Amazon, Google, Meta, Microsoft, xAI, Oracle and OpenAI are expected to attend a March 4th event to sign the pledge, Fox News reported today.  \nThere are very few details at this point on what the pledge entails, nor how companies would be held ac …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "特朗普声称科技公司下周将签署协议为自己的电力供应付费",
        "summary": "特朗普总统宣布，包括亚马逊、谷歌、Meta、微软、xAI、甲骨文和OpenAI在内的主要科技公司将于3月4日签署\"费率支付者保护承诺\"，以建设或资助新的电力生成设施。该承诺旨在通过让科技公司投资自己的电力基础设施来解决电力成本上升的问题。"
      },
      "fr": {
        "title": "Trump affirme que les entreprises technologiques signeront des accords la semaine prochaine pour payer leur propre approvisionnement en électricité",
        "summary": "Le président Trump a annoncé que les principales entreprises technologiques, y compris Amazon, Google, Meta, Microsoft, xAI, Oracle et OpenAI, signeront un \"engagement de protection des payeurs de tarifs\" le 4 mars pour construire ou financer une nouvelle génération d'électricité. L'engagement vise à résoudre la hausse des coûts d'électricité en incitant les entreprises technologiques à investir dans leur propre infrastructure énergétique."
      },
      "de": {
        "title": "Trump behauptet, dass Technologieunternehmen nächste Woche Vereinbarungen unterzeichnen werden, um für ihre eigene Stromversorgung zu zahlen",
        "summary": "Präsident Trump kündigte an, dass große Technologieunternehmen, darunter Amazon, Google, Meta, Microsoft, xAI, Oracle und OpenAI, am 4. März ein \"Tarifzahler-Schutzversprechen\" unterzeichnen werden, um neue Stromerzeugungskapazitäten zu bauen oder zu finanzieren. Das Versprechen zielt darauf ab, die steigenden Stromkosten zu bekämpfen, indem Technologieunternehmen in ihre eigene Energieinfrastruktur investieren."
      },
      "es": {
        "title": "Trump afirma que las empresas tecnológicas firmarán acuerdos la próxima semana para pagar su propio suministro de energía",
        "summary": "El presidente Trump anunció que las principales empresas tecnológicas, incluidas Amazon, Google, Meta, Microsoft, xAI, Oracle y OpenAI, firmarán un \"compromiso de protección del pagador de tarifas\" el 4 de marzo para construir o financiar nueva generación de electricidad. El compromiso tiene como objetivo abordar el aumento de los costos de electricidad haciendo que las empresas tecnológicas inviertan en su propia infraestructura de energía."
      }
    }
  },
  {
    "title": "US cybersecurity agency CISA reportedly in dire shape amid Trump cuts and layoffs",
    "slug": "cisa-dire-shape-trump-cuts-layoffs",
    "url": "https://techcrunch.com/2026/02/25/us-cybersecurity-agency-cisa-reportedly-in-dire-shape-amid-trump-cuts-and-layoffs/",
    "source": "TechCrunch",
    "date": "2026-02-25T20:26:57.000Z",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) is reportedly struggling under budget cuts, layoffs, and furloughs during the Trump administration. Bipartisan lawmakers and industry sources warn the agency is unprepared to handle a major security crisis.",
    "content": "Under the first year of the Trump administration, the U.S. cyber agency CISA has faced cuts, layoffs, and furloughs, as bipartisan lawmakers and cybersecurity industry sources say the agency is unprepared to handle a crisis.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "美国网络安全机构CISA在特朗普削减和裁员中陷入困境",
        "summary": "美国网络安全和基础设施安全局(CISA)据报道在特朗普政府期间受预算削减、裁员和休假的困扰。两党议员和行业来源警告该机构准备不足以应对重大安全危机。"
      },
      "fr": {
        "title": "L'agence américaine de cybersécurité CISA en mauvaise forme après les réductions et les licenciements de Trump",
        "summary": "L'Agence américaine de cybersécurité et de sécurité des infrastructures (CISA) connaît apparemment des difficultés en raison des réductions budgétaires, des licenciements et des congés forcés pendant l'administration Trump. Les législateurs des deux partis et les sources du secteur avertissent que l'agence est mal préparée pour faire face à une grave crise de sécurité."
      },
      "de": {
        "title": "US-Cybersicherheitsbehörde CISA in schwieriger Lage inmitten von Trumps Kürzungen und Entlassungen",
        "summary": "Die US-Behörde für Cybersicherheit und Infrastrukturschutz (CISA) kämpft Berichten zufolge unter Haushaltskürzungen, Entlassungen und Beurlaubungen während der Trump-Administration. Gesetzgeber beider Parteien und Branchenquellen warnen, dass die Behörde unvorbereitet auf eine größere Sicherheitskrise ist."
      },
      "es": {
        "title": "La agencia estadounidense de ciberseguridad CISA en situación crítica por los recortes y despidos de Trump",
        "summary": "La Agencia estadounidense de Seguridad Cibernética e Infraestructura (CISA) está teniendo dificultades bajo recortes presupuestarios, despidos y licencias forzadas durante la administración Trump. Los legisladores bipartidistas y las fuentes de la industria advierten que la agencia está mal preparada para manejar una crisis de seguridad importante."
      }
    }
  },
  {
    "title": "Welcome to the post-hype crypto market",
    "slug": "post-hype-crypto-market-policy-regulations",
    "url": "https://techcrunch.com/video/welcome-to-the-post-hype-crypto-market/",
    "source": "TechCrunch",
    "date": "2026-02-25T20:22:11.000Z",
    "summary": "Crypto is re-entering startup conversations as the hype cycle cools, with market attention shifting toward policy and practical applications. Players like Stripe are returning to the space while stablecoins and Tether face increasing regulatory scrutiny.",
    "content": "Crypto is creeping back into the startup conversation, but at ETHDenver last week, the buzz was as much about Washington as it was about tokens. Policy shifts are rippling through the market as Tether and stablecoins face scrutiny, players like Stripe re-enter the conversation, and startups either find traction or flame out. The hype cycle is over, or at least taking a break. So what comes next?  On […]",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "欢迎来到炒作后的加密货币市场",
        "summary": "随着炒作周期冷却，加密货币重新进入初创公司的讨论中，市场注意力转向政策和实际应用。Stripe等企业回归该领域，而稳定币和泰达币面临越来越多的监管审查。"
      },
      "fr": {
        "title": "Bienvenue sur le marché crypto post-hype",
        "summary": "La cryptomonnaie réintègre les conversations des startups à mesure que le cycle de battage médiatique se refroidit, l'attention du marché se déplaçant vers la politique et les applications pratiques. Des acteurs comme Stripe reviennent dans l'espace tandis que les stablecoins et Tether font face à un contrôle réglementaire croissant."
      },
      "de": {
        "title": "Willkommen auf dem Post-Hype-Kryptomarkt",
        "summary": "Kryptowährungen kehren in Startup-Gespräche zurück, während der Hype-Zyklus abkühlt, wobei sich die Marktaufmerksamkeit auf Politik und praktische Anwendungen verlagert. Akteure wie Stripe kehren in den Bereich zurück, während Stablecoins und Tether einer zunehmenden regulatorischen Prüfung ausgesetzt sind."
      },
      "es": {
        "title": "Bienvenido al mercado de criptomonedas post-hype",
        "summary": "Las criptomonedas están volviendo a las conversaciones de las startups a medida que el ciclo de publicidad se enfría, con la atención del mercado dirigida hacia las políticas y aplicaciones prácticas. Empresas como Stripe están volviendo al espacio mientras que las monedas estables y Tether enfrentan un escrutinio regulatorio creciente."
      }
    }
  },
  {
    "title": "Here’s how the new Samsung Galaxy S26 compares with last year’s S25",
    "slug": "samsung-galaxy-s26-vs-s25-comparison",
    "url": "https://www.theverge.com/gadgets/884281/samsung-galaxy-s26-plus-ultra-vs-s25-specs-features",
    "source": "The Verge",
    "date": "2026-02-25T20:09:14.000Z",
    "summary": "Samsung's Galaxy S26 lineup starts at $899.99 for the base model, with the Plus at $1,099.99 and Ultra at $1,299.99, offering minor hardware updates and new Galaxy AI software features. The $400 price gap between the cheapest and most expensive model represents a $100 reduction from the S25 generation.",
    "content": "Samsung unveiled its Galaxy S26 lineup at its recent Unpacked event in San Francisco. As expected, the new series consists of the baseline S26, which starts at $899.99, and the bigger S26 Plus, which starts at $1,099.99. At the high end, there's also the $1,299.99 S26 Ultra, which is the largest in the lineup and comes with a bigger battery, better cameras, S Pen support, and expanded options for both storage and RAM. The price difference between Samsung's cheapest and most expensive S26 phones is $400 (last year, it was $500).\nWhile some of its updated Galaxy AI software features are new, it's another year of minor hardware updates for Sam …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "新款三星Galaxy S26与去年的S25的对比",
        "summary": "三星Galaxy S26系列基础款起价899.99美元，Plus款为1,099.99美元，Ultra款为1,299.99美元，提供小的硬件更新和新的Galaxy AI软件功能。最便宜和最昂贵型号之间的400美元价差比S25代减少了100美元。"
      },
      "fr": {
        "title": "Voici comment le nouveau Samsung Galaxy S26 se compare avec le S25 de l'année dernière",
        "summary": "La gamme Samsung Galaxy S26 commence à 899,99 dollars pour le modèle de base, avec le Plus à 1 099,99 dollars et l'Ultra à 1 299,99 dollars, offrant des mises à jour matérielles mineures et de nouvelles fonctionnalités logicielles Galaxy AI. L'écart de prix de 400 dollars entre le modèle le moins cher et le plus cher représente une réduction de 100 dollars par rapport à la génération S25."
      },
      "de": {
        "title": "So schneidet das neue Samsung Galaxy S26 gegen das S25 des letzten Jahres ab",
        "summary": "Das Samsung Galaxy S26-Sortiment beginnt bei 899,99 Dollar für das Basismodell, das Plus bei 1.099,99 Dollar und das Ultra bei 1.299,99 Dollar und bietet kleinere Hardware-Updates und neue Galaxy-AI-Softwarefunktionen. Der 400-Dollar-Preisunterschied zwischen dem billigsten und teuersten Modell stellt eine Reduzierung von 100 Dollar gegenüber der S25-Generation dar."
      },
      "es": {
        "title": "Así es como el nuevo Samsung Galaxy S26 se compara con el S25 del año pasado",
        "summary": "La línea Samsung Galaxy S26 comienza a $899.99 para el modelo base, con el Plus a $1,099.99 y el Ultra a $1,299.99, ofreciendo actualizaciones de hardware menores y nuevas funciones de software Galaxy AI. La brecha de precio de $400 entre el modelo más barato y el más caro representa una reducción de $100 con respecto a la generación S25."
      }
    }
  },
  {
    "title": "Alphabet-owned robotics software company Intrinsic joins Google",
    "slug": "intrinsic-robotics-joins-google",
    "url": "https://techcrunch.com/2026/02/25/alphabet-owned-robotics-software-company-intrinsic-joins-google/",
    "source": "TechCrunch",
    "date": "2026-02-25T20:00:00.000Z",
    "summary": "Intrinsic, an Alphabet-owned robotics software company that operated independently for nearly five years, is being consolidated under Google. The move represents a strategic reorganization within Alphabet's portfolio, bringing robotics software capabilities directly under Google's umbrella.",
    "content": "Nearly five years after graduating into an independent Alphabet company, Intrinsic is moving under Google's domain.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "字母公司旗下机器人软件公司Intrinsic加入谷歌",
        "summary": "作为字母公司旗下独立运营近五年的机器人软件公司Intrinsic，正在被整合到谷歌旗下。此举代表了字母公司投资组合内的战略重组，将机器人软件能力直接纳入谷歌的旗下。"
      },
      "fr": {
        "title": "La société de logiciels robotiques Intrinsic, propriété d'Alphabet, rejoint Google",
        "summary": "Intrinsic, une société de logiciels robotiques propriété d'Alphabet qui a fonctionné indépendamment pendant près de cinq ans, est consolidée sous Google. Cette décision représente une réorganisation stratégique au sein du portefeuille d'Alphabet, ramenant les capacités de logiciels robotiques directement sous le parapluie de Google."
      },
      "de": {
        "title": "Alphabets Robotik-Softwareunternehmen Intrinsic schließt sich Google an",
        "summary": "Intrinsic, ein Robotik-Softwareunternehmen von Alphabet, das knapp fünf Jahre lang unabhängig tätig war, wird unter Google konsolidiert. Der Schritt stellt eine strategische Umstrukturierung innerhalb des Portfolios von Alphabet dar und bringt Robotik-Softwarefähigkeiten direkt unter Googles Dach."
      },
      "es": {
        "title": "La empresa de software de robótica de Alphabet Intrinsic se une a Google",
        "summary": "Intrinsic, una empresa de software de robótica propiedad de Alphabet que operó de forma independiente durante casi cinco años, se está consolidando bajo Google. El movimiento representa una reorganización estratégica dentro de la cartera de Alphabet, trayendo las capacidades de software de robótica directamente bajo el paraguas de Google."
      }
    }
  },
  {
    "title": "Google and Samsung just launched the AI features Apple couldn’t with Siri",
    "slug": "google-samsung-launch-ai-features-apple-couldnt-siri",
    "url": "https://www.theverge.com/tech/884703/google-samsung-galaxy-s26-gemini-apple-siri",
    "source": "The Verge",
    "date": "2026-02-25T19:56:55.000Z",
    "summary": "Google and Samsung have launched Gemini's agentic capabilities on Pixel 10 and Galaxy S26 phones, enabling multistep tasks like food ordering and ride-hailing. These features echo Apple's delayed Siri Intelligence features announced at WWDC 2024 and still unreleased. The development highlights Google's competitive edge in deploying advanced AI assistant functionality.",
    "content": "Google just announced that Gemini will soon be able to take care of some multistep tasks on your phone, like ordering food or hailing a car, starting first with the Pixel 10, Pixel 10 Pro, and the just-announced Samsung Galaxy S26 phones. It all sounds a bit like features Apple announced for Siri way back at the 2024 Worldwide Developers Conference - before Apple delayed those planned features in March 2025 and which still aren't released.\nOnstage, Sameer Samat, Google's president of Android, showed off a demo of how Gemini's new agentic features would work to help wrangle a pizza dinner order from his busy family group chat. Samat asks Gem …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "谷歌和三星推出了苹果无法用Siri实现的人工智能功能",
        "summary": "谷歌和三星在Pixel 10和Galaxy S26手机上推出了Gemini的代理功能，支持食品订购和打车等多步骤任务。这些功能呼应了苹果在2024年WWDC大会上宣布但仍未发布的Siri Intelligence功能。这一进展突显了谷歌在部署先进AI助手功能方面的竞争优势。"
      },
      "fr": {
        "title": "Google et Samsung viennent de lancer les fonctionnalités d'IA qu'Apple ne pouvait pas offrir avec Siri",
        "summary": "Google et Samsung ont lancé les capacités d'agent de Gemini sur les téléphones Pixel 10 et Galaxy S26, permettant des tâches en plusieurs étapes comme la commande de nourriture et les services de covoiturage. Ces fonctionnalités font écho aux fonctionnalités Siri Intelligence d'Apple annoncées à la WWDC 2024 et toujours non publiées. Le développement souligne l'avantage concurrentiel de Google dans le déploiement de fonctionnalités avancées d'assistant IA."
      },
      "de": {
        "title": "Google und Samsung haben gerade die KI-Funktionen gestartet, die Apple mit Siri nicht konnte",
        "summary": "Google und Samsung haben Geminis agentengestützte Funktionen auf Pixel 10 und Galaxy S26 Telefonen eingeführt und ermöglichen mehrstufige Aufgaben wie Essensbestellung und Fahrdienste. Diese Funktionen entsprechen Apples verzögerten Siri Intelligence-Funktionen, die auf der WWDC 2024 angekündigt wurden und immer noch nicht veröffentlicht sind. Die Entwicklung unterstreicht Googles Wettbewerbsvorteil beim Einsatz fortgeschrittener KI-Assistentenfunktionen."
      },
      "es": {
        "title": "Google y Samsung acaban de lanzar las características de IA que Apple no pudo lograr con Siri",
        "summary": "Google y Samsung han lanzado las capacidades de agente de Gemini en los teléfonos Pixel 10 y Galaxy S26, permitiendo tareas de varios pasos como pedidos de comida y servicios de transporte compartido. Estas características hacen eco de las características retrasadas de Siri Intelligence de Apple anunciadas en la WWDC 2024 y aún sin lanzar. El desarrollo resalta la ventaja competitiva de Google en la implementación de funcionalidades avanzadas de asistente de IA."
      }
    }
  },
  {
    "title": "Snapchat announces ‘The Snappys,’ its first-ever creator awards show",
    "slug": "snapchat-announces-snappys-creator-awards",
    "url": "https://techcrunch.com/2026/02/25/snapchat-announces-the-snappys-its-first-ever-creator-awards-show/",
    "source": "TechCrunch",
    "date": "2026-02-25T19:54:18.000Z",
    "summary": "Snapchat is launching \"The Snappys,\" its inaugural awards program for creators, joining platforms like TikTok and Instagram. The move reflects growing competition among social media platforms to recognize and retain top creator talent. Creator awards programs have become standard for major platforms seeking to strengthen creator ecosystems.",
    "content": "Snapchat is the latest social media platform to launch awards for creators, joining TikTok and Instagram.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Snapchat宣布推出首届\"The Snappys\"创作者奖项颁奖典礼",
        "summary": "Snapchat推出了\"The Snappys\"，这是其首个创作者奖项计划，与TikTok和Instagram等平台相似。这一举措反映了社交媒体平台之间为识别和留住顶级创作者而日益激烈的竞争。创作者奖项计划已成为寻求加强创作者生态的主要平台的标准配置。"
      },
      "fr": {
        "title": "Snapchat annonce 'The Snappys', sa première cérémonie de remise de prix pour créateurs",
        "summary": "Snapchat lance \"The Snappys\", son premier programme de récompenses pour créateurs, rejoignant des plateformes comme TikTok et Instagram. Ce geste reflète la concurrence croissante entre les plateformes de médias sociaux pour reconnaître et conserver les meilleurs talents de créateurs. Les programmes de récompenses pour créateurs sont devenus standard pour les grandes plateformes cherchant à renforcer leurs écosystèmes de créateurs."
      },
      "de": {
        "title": "Snapchat kündigt 'The Snappys' an, seine erste Creator-Preisverleihung",
        "summary": "Snapchat startet \"The Snappys\", sein erstes Prämienprogramm für Creator, das sich den Plattformen wie TikTok und Instagram anreiht. Der Schritt spiegelt den wachsenden Wettbewerb zwischen Social-Media-Plattformen wider, um Top-Creator-Talent zu erkennen und zu halten. Creator-Prämienprogramme sind zur Norm für große Plattformen geworden, die ihre Creator-Ökosysteme stärken möchten."
      },
      "es": {
        "title": "Snapchat anuncia 'The Snappys', su primer programa de premios para creadores",
        "summary": "Snapchat está lanzando \"The Snappys\", su primer programa de premios para creadores, uniéndose a plataformas como TikTok e Instagram. Este movimiento refleja la creciente competencia entre plataformas de redes sociales para reconocer y retener el talento de los mejores creadores. Los programas de premios para creadores se han convertido en estándar para las principales plataformas que buscan fortalecer sus ecosistemas de creadores."
      }
    }
  },
  {
    "title": "An accountant won a big jackpot on Kalshi by betting against DOGE",
    "slug": "accountant-wins-kalshi-jackpot-betting-against-doge",
    "url": "https://techcrunch.com/2026/02/25/an-accountant-won-a-big-jackpot-on-kalshi-by-betting-against-doge/",
    "source": "TechCrunch",
    "date": "2026-02-25T19:36:03.000Z",
    "summary": "A tax accountant identified an arbitrage opportunity on Kalshi prediction markets by betting against inflated Dogecoin valuations driven by retail investors. The successful bet demonstrates how professional market analysis can exploit mispricings created by speculative trading. The case shows prediction markets attracting diverse participants seeking profitable opportunities.",
    "content": "A tax accountant saw Elon Musk fans bidding up a Kalshi prediction market and saw a sure bet to make easy money.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "一名会计师通过在Kalshi上做空DOGE赢得了大奖",
        "summary": "一名税务会计师在Kalshi预测市场上发现了套利机会，通过做空由散户投资者推高的狗狗币估值。成功的交易证明了专业市场分析如何能够利用投机交易造成的定价错误。该案例表明预测市场正在吸引寻求盈利机会的多样化参与者。"
      },
      "fr": {
        "title": "Un comptable a remporté un gros jackpot sur Kalshi en pariant contre DOGE",
        "summary": "Un comptable fiscal a identifié une opportunité d'arbitrage sur les marchés de prédiction Kalshi en pariant contre les évaluations gonflées de Dogecoin alimentées par les investisseurs particuliers. Le pari réussi démontre comment l'analyse de marché professionnelle peut exploiter les mésestimations créées par le commerce spéculatif. Le cas montre que les marchés de prédiction attirent des participants divers à la recherche d'opportunités rentables."
      },
      "de": {
        "title": "Ein Buchhalter gewann einen großen Jackpot auf Kalshi durch eine Wette gegen DOGE",
        "summary": "Ein Steuerberater identifizierte eine Arbitrage-Gelegenheit auf Kalshi-Prognose-Märkten, indem er gegen die aufgeblasenen Dogecoin-Bewertungen wettete, die von Privatanlegern angetrieben werden. Die erfolgreiche Wette zeigt, wie professionelle Marktanalyse Fehlbewertungen ausnutzen kann, die durch spekulative Handelsaktivitäten entstehen. Der Fall zeigt, dass Prognose-Märkte unterschiedliche Teilnehmer anziehen, die rentable Gelegenheiten suchen."
      },
      "es": {
        "title": "Un contador ganó un gran premio en Kalshi apostando contra DOGE",
        "summary": "Un contador de impuestos identificó una oportunidad de arbitraje en los mercados de predicción de Kalshi apostando en contra de las valuaciones infladas de Dogecoin impulsadas por inversores minoristas. La apuesta exitosa demuestra cómo el análisis de mercado profesional puede explotar las valoraciones incorrectas creadas por el comercio especulativo. El caso muestra que los mercados de predicción atraen a participantes diversos que buscan oportunidades lucrativas."
      }
    }
  },
  {
    "title": "Inside the story of the US defense contractor who leaked hacking tools to Russia",
    "slug": "us-defense-contractor-leaked-hacking-tools-russia",
    "url": "https://techcrunch.com/2026/02/25/inside-the-story-of-the-us-defense-contractor-who-leaked-hacking-tools-to-russia/",
    "source": "TechCrunch",
    "date": "2026-02-25T19:30:47.000Z",
    "summary": "A former executive of a U.S. hacking tools company was imprisoned for selling sensitive software exploits to Russian intermediaries. The case reveals significant national security vulnerabilities in the defense contracting sector. Unresolved questions remain about the full scope of the leaked capabilities and their use.",
    "content": "The former boss of a U.S. hacking tools maker was jailed for selling highly sensitive software exploits to a Russian broker. This is how we first learned of his arrest, reported the story, and some of the unanswered questions we still have.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "美国防务承包商向俄罗斯泄露黑客工具的故事",
        "summary": "一名美国黑客工具公司的前高管因向俄罗斯中介出售敏感软件漏洞而被监禁。该案例揭示了国防承包部门存在的重大国家安全漏洞。关于泄露功能的全部范围及其使用方式仍存在未解决的问题。"
      },
      "fr": {
        "title": "L'histoire d'un entrepreneur en défense américain qui a divulgué des outils de piratage à la Russie",
        "summary": "Un ancien cadre d'une entreprise américaine d'outils de piratage a été emprisonné pour avoir vendu des exploits de logiciels sensibles à des intermédiaires russes. L'affaire révèle des vulnérabilités importantes en matière de sécurité nationale dans le secteur de la défense. Des questions non résolues restent ouvertes quant à l'étendue complète des capacités divulguées et à leur utilisation."
      },
      "de": {
        "title": "Die Geschichte des US-Verteidigungsunternehmens, das Hacking-Tools an Russland weitergab",
        "summary": "Ein ehemaliger Geschäftsführer eines amerikanischen Hacking-Tools-Unternehmens wurde wegen des Verkaufs sensibler Software-Exploits an russische Vermittler inhaftiert. Der Fall offenbart erhebliche Sicherheitslücken der nationalen Sicherheit im Verteidigungsauftragsektor. Ungeklärte Fragen bleiben zu dem vollständigen Umfang der durchgesickerten Fähigkeiten und deren Verwendung."
      },
      "es": {
        "title": "La historia del contratista de defensa estadounidense que filtró herramientas de piratería a Rusia",
        "summary": "Un ex ejecutivo de una empresa estadounidense de herramientas de piratería fue encarcelado por vender exploits de software sensibles a intermediarios rusos. El caso revela vulnerabilidades significativas de seguridad nacional en el sector de contratación de defensa. Quedan preguntas sin resolver sobre el alcance completo de las capacidades filtradas y su uso."
      }
    }
  },
  {
    "title": "Could a vaccine prevent dementia? Shingles shot data only getting stronger.",
    "slug": "vaccine-prevent-dementia-shingles-shot-data",
    "url": "https://arstechnica.com/health/2026/02/could-a-vaccine-prevent-dementia-shingles-shot-data-only-getting-stronger/",
    "source": "Ars Technica",
    "date": "2026-02-25T19:29:50.000Z",
    "summary": "Recent data on shingles vaccines suggests potential benefits in dementia prevention, with initial research indicating benefits may exceed current estimates. The findings represent a promising development in preventive health approaches for cognitive decline. Continued research may reveal additional protective effects of shingles vaccination.",
    "content": "Latest data hints that benefits seen so far could be underestimates.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "疫苗能预防痴呆症吗？带状疱疹疫苗数据不断增强",
        "summary": "关于带状疱疹疫苗的最新数据表明其在痴呆症预防中的潜在益处，初步研究表明其益处可能超过现有估计。这些发现代表了认知衰退预防健康方法中的一个有前景的发展。持续的研究可能会揭示带状疱疹疫苗接种的额外保护作用。"
      },
      "fr": {
        "title": "Un vaccin pourrait-il prévenir la démence? Les données sur le vaccin contre le zona deviennent plus fortes",
        "summary": "Les données récentes sur les vaccins contre le zona suggèrent des avantages potentiels dans la prévention de la démence, la recherche initiale indiquant que les avantages pourraient dépasser les estimations actuelles. Les conclusions représentent un développement prometteur dans les approches de santé préventive du déclin cognitif. La recherche continue pourrait révéler des effets protecteurs supplémentaires de la vaccination contre le zona."
      },
      "de": {
        "title": "Könnte ein Impfstoff Demenz verhindern? Gürtelrose-Impfstoff-Daten werden immer stärker",
        "summary": "Aktuelle Daten zu Gürtelrose-Impfstoffen deuten auf potenzielle Vorteile bei der Vorbeugung von Demenz hin, wobei erste Forschungen darauf hindeuten, dass die Vorteile die aktuellen Schätzungen übersteigen könnten. Die Ergebnisse stellen eine vielversprechende Entwicklung in präventiven Gesundheitsansätzen für kognitiven Rückgang dar. Weitere Forschung könnte zusätzliche schützende Wirkungen der Gürtelrose-Impfung offenbaren."
      },
      "es": {
        "title": "¿Podría una vacuna prevenir la demencia? Los datos de la vacuna contra el herpes zóster cada vez son más sólidos",
        "summary": "Los datos recientes sobre las vacunas contra el herpes zóster sugieren beneficios potenciales en la prevención de la demencia, con la investigación inicial indicando que los beneficios podrían exceder las estimaciones actuales. Los hallazgos representan un desarrollo prometedor en los enfoques de salud preventiva para el deterioro cognitivo. La investigación continua podría revelar efectos protectores adicionales de la vacunación contra el herpes zóster."
      }
    }
  },
  {
    "title": "Samsung shows off new display tech that adds a privacy screen to apps and notifications",
    "slug": "samsung-privacy-display-tech-apps-notifications",
    "url": "https://techcrunch.com/2026/02/25/samsung-shows-off-new-display-tech-that-adds-a-privacy-screen-to-apps-and-notifications/",
    "source": "TechCrunch",
    "date": "2026-02-25T19:23:58.000Z",
    "summary": "Samsung has developed display technology that selectively blocks specific apps and notifications from being viewed by others nearby. The innovation uses advanced pixel technology to create privacy controls at the hardware level, addressing concerns about information exposure in public spaces.",
    "content": "The new privacy tech uses different types of pixels to let you block certain apps and notifications from being viewed by others.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "三星展示新显示屏技术，为应用程序和通知添加隐私屏幕",
        "summary": "三星开发了显示屏技术，可以选择性地阻止特定应用程序和通知被附近的其他人看到。该创新使用先进的像素技术在硬件级别创建隐私控制，解决了公共场所信息泄露的问题。"
      },
      "fr": {
        "title": "Samsung démontre une nouvelle technologie d'affichage qui ajoute un écran de confidentialité aux applications et notifications",
        "summary": "Samsung a développé une technologie d'affichage qui bloque sélectivement des applications et des notifications spécifiques d'être vues par d'autres à proximité. L'innovation utilise une technologie de pixels avancée pour créer des contrôles de confidentialité au niveau matériel, répondant aux préoccupations concernant l'exposition des informations dans les espaces publics."
      },
      "de": {
        "title": "Samsung zeigt neue Display-Technologie, die Apps und Benachrichtigungen einen Datenschutzbildschirm hinzufügt",
        "summary": "Samsung hat eine Display-Technologie entwickelt, die selektiv spezifische Apps und Benachrichtigungen daran hindert, von anderen in der Nähe gesehen zu werden. Die Innovation nutzt fortschrittliche Pixeltechnologie, um Datenschutzkontrollen auf Hardware-Ebene zu schaffen und Bedenken hinsichtlich der Informationsoffenlegung in öffentlichen Räumen auszuräumen."
      },
      "es": {
        "title": "Samsung muestra nueva tecnología de pantalla que añade una pantalla de privacidad a aplicaciones y notificaciones",
        "summary": "Samsung ha desarrollado una tecnología de pantalla que bloquea selectivamente que aplicaciones y notificaciones específicas sean vistas por otros cercanos. La innovación utiliza tecnología de píxeles avanzada para crear controles de privacidad a nivel de hardware, abordando las preocupaciones sobre la exposición de información en espacios públicos."
      }
    }
  },
  {
    "title": "Wearable startup CUDIS launches a new health ring line with an AI-fueled ‘coach’",
    "slug": "cudis-launches-health-ring-ai-coach",
    "url": "https://techcrunch.com/2026/02/25/wearable-startup-cudis-launches-a-new-health-ring-line-with-an-ai-fueled-coach/",
    "source": "TechCrunch",
    "date": "2026-02-25T19:10:04.000Z",
    "summary": "CUDIS is releasing a new health ring line featuring an AI-powered coaching system that gamifies wellness through points-based incentives. Users earn points for healthy behavior that can be redeemed for health products. The approach combines wearable technology with behavioral incentives and AI personalization.",
    "content": "The wearable incentivizes healthy behavior with points that can be redeemed for health products.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "可穿戴初创企业CUDIS推出新的健康环产品线，配备AI教练",
        "summary": "CUDIS发布了一条新的健康环产品线，配备由AI驱动的教练系统，通过基于点数的激励将健康游戏化。用户可以通过健康行为获得积分，这些积分可以兑换健康产品。该方法将可穿戴技术与行为激励和AI个性化相结合。"
      },
      "fr": {
        "title": "La startup de technologie portable CUDIS lance une nouvelle gamme de bagues de santé avec un entraîneur alimenté par l'IA",
        "summary": "CUDIS lance une nouvelle gamme de bagues de santé dotée d'un système d'entraînement alimenté par l'IA qui gamifie le bien-être grâce à des incitations basées sur les points. Les utilisateurs gagnent des points pour un comportement sain qui peuvent être échangés contre des produits de santé. L'approche combine la technologie portable avec des incitations comportementales et une personnalisation basée sur l'IA."
      },
      "de": {
        "title": "Das Wearable-Startup CUDIS startet eine neue Gesundheitsring-Produktlinie mit einem KI-gestützten Coach",
        "summary": "CUDIS gibt eine neue Gesundheitsring-Produktlinie mit einem KI-gestützten Coaching-System frei, das Wellness durch punktebasierte Anreize gamifiziert. Benutzer verdienen Punkte für gesundes Verhalten, die gegen Gesundheitsprodukte eingelöst werden können. Der Ansatz kombiniert Wearable-Technologie mit Verhaltensanreizen und KI-Personalisierung."
      },
      "es": {
        "title": "La startup de tecnología portátil CUDIS lanza una nueva línea de anillos de salud con un entrenador impulsado por IA",
        "summary": "CUDIS está lanzando una nueva línea de anillos de salud con un sistema de entrenamiento impulsado por IA que gamifica el bienestar a través de incentivos basados en puntos. Los usuarios ganan puntos por comportamiento saludable que pueden ser canjeados por productos de salud. El enfoque combina tecnología portátil con incentivos de comportamiento y personalización impulsada por IA."
      }
    }
  },
  {
    "title": "Preorders for Samsung’s S26 phones come with up to $200 in gift cards",
    "slug": "samsung-s26-preorders-gift-cards",
    "url": "https://www.theverge.com/gadgets/883829/samsung-galaxy-s26-plus-ultra-how-to-buy-preorder-price-release-date",
    "source": "The Verge",
    "date": "2026-02-25T19:09:29.000Z",
    "summary": "Samsung's Galaxy S26, S26 Plus, and S26 Ultra flagship phones are now available for preorder starting at $899.99, launching March 11th with promotional gift cards up to $200. The 2026 lineup features incremental improvements over the S25 series with major software updates including new privacy display features. Pricing ranges from $899.99 to $1,299.99.",
    "content": "As expected, Samsung has taken the wraps off its flagship lineup for 2026. Introduced during the company's recent Unpacked event, the new Galaxy devices - which include the standard S26, the larger S26 Plus, and the high-end S26 Ultra - will be available on March 11th. Preorders are now open ahead of launch, with pricing starting at $899.99 for the base-model S26, $1,099.99 for the Plus, and $1,299.99 for the Ultra.\nOverall, the forthcoming S26 lineup looks largely similar to last year's S25 series, only with a handful of notable upgrades. The biggest changes this year are on the software side, with Samsung introducing a privacy display in  …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "三星S26手机预购可获最高200美元礼卡",
        "summary": "三星Galaxy S26、S26 Plus和S26 Ultra旗舰手机现已开放预购，起价899.99美元，将于3月11日发布，并提供最高200美元的促销礼卡。2026系列相比S25系列有小幅升级，包括主要软件更新和新的隐私屏幕显示功能。定价范围从899.99美元至1,299.99美元。"
      },
      "fr": {
        "title": "Les précommandes des téléphones Samsung S26 incluent jusqu'à 200 dollars en cartes cadeaux",
        "summary": "Les téléphones phares Samsung Galaxy S26, S26 Plus et S26 Ultra sont maintenant disponibles en précommande à partir de 899,99 dollars, avec un lancement le 11 mars et des cartes cadeaux promotionnelles jusqu'à 200 dollars. La gamme 2026 offre des améliorations progressives par rapport à la série S25 avec des mises à jour logicielles majeures incluant de nouvelles fonctionnalités d'affichage de confidentialité. Les prix vont de 899,99 dollars à 1 299,99 dollars."
      },
      "de": {
        "title": "Vorbestellungen für Samsungs S26-Telefone beinhalten bis zu 200 Dollar Geschenkkarten",
        "summary": "Die Flaggschiff-Smartphones Samsung Galaxy S26, S26 Plus und S26 Ultra sind nun ab 899,99 Dollar in der Vorbestellung erhältlich und werden am 11. März mit Aktionsgutscheine bis zu 200 Dollar eingeführt. Die 2026er-Serie bietet schrittweise Verbesserungen gegenüber der S25-Serie mit großen Softwareaktualisierungen, einschließlich neuer Datenschutzanzeigesfunktionen. Die Preise reichen von 899,99 bis 1.299,99 Dollar."
      },
      "es": {
        "title": "Los pedidos anticipados de los teléfonos Samsung S26 incluyen tarjetas de regalo de hasta $200",
        "summary": "Los teléfonos insignia Samsung Galaxy S26, S26 Plus y S26 Ultra ahora están disponibles para preorden a partir de $899.99, lanzándose el 11 de marzo con tarjetas de regalo promocionales de hasta $200. La línea 2026 presenta mejoras incrementales sobre la serie S25 con actualizaciones de software importantes que incluyen nuevas funciones de pantalla de privacidad. Los precios oscilan entre $899.99 y $1,299.99."
      }
    }
  },
  {
    "title": "Kalshi fined a MrBeast editor for insider trading on markets related to the YouTube star",
    "slug": "kalshi-fines-mrbeast-editor-insider-trading",
    "url": "https://techcrunch.com/2026/02/25/kalshi-fined-a-mrbeast-editor-for-insider-trading-on-markets-related-to-the-youtube-star/",
    "source": "TechCrunch",
    "date": "2026-02-25T19:08:04.000Z",
    "summary": "Kalshi issued a fine exceeding $20,000 to Artem Kaptur, an editor at MrBeast's production company, for insider trading on prediction markets. The penalty reflects regulatory concerns about information asymmetry and market manipulation on prediction platforms. The case demonstrates growing scrutiny of insider trading on alternative trading venues.",
    "content": "Kalshi fined the MrBeast editor, Artem Kaptur, over $20,000.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Kalshi因内幕交易对MrBeast编辑进行罚款",
        "summary": "Kalshi对MrBeast制作公司的编辑Artem Kaptur处以超过20,000美元的罚款，原因是其在预测市场上进行内幕交易。该罚款反映了监管机构对预测平台上信息不对称和市场操纵的关注。该案例显示监管部门对替代交易场所内幕交易的审查力度在加大。"
      },
      "fr": {
        "title": "Kalshi inflige une amende à un éditeur de MrBeast pour délit d'initié",
        "summary": "Kalshi a imposé une amende dépassant 20 000 dollars à Artem Kaptur, un éditeur de la société de production de MrBeast, pour délit d'initié sur les marchés de prédiction. La pénalité reflète les préoccupations réglementaires concernant l'asymétrie d'information et la manipulation du marché sur les plateformes de prédiction. Cette affaire démontre un contrôle réglementaire croissant du délit d'initié sur les lieux de négociation alternatifs."
      },
      "de": {
        "title": "Kalshi verhängt Geldstrafe gegen MrBeast-Editor wegen Insiderhandels",
        "summary": "Kalshi verhängte eine Geldstrafe von über 20.000 Dollar gegen Artem Kaptur, einen Editor von MrBeasts Produktionsunternehmen, wegen Insiderhandels auf Vorhersagemärkten. Die Strafe spiegelt behördliche Bedenken hinsichtlich Informationsasymmetrie und Marktmanipulation auf Vorhersageplattformen wider. Der Fall zeigt zunehmende Kontrolle von Insiderhandel auf alternativen Handelsplätzen."
      },
      "es": {
        "title": "Kalshi multó a un editor de MrBeast por negociación con información privilegiada",
        "summary": "Kalshi impuso una multa superior a $20,000 a Artem Kaptur, un editor de la compañía de producción de MrBeast, por negociación con información privilegiada en mercados de predicción. La sanción refleja las preocupaciones regulatorias sobre asimetría de información y manipulación del mercado en plataformas de predicción. El caso demuestra un escrutinio regulatorio cada vez mayor de la negociación con información privilegiada en lugares de negociación alternativos."
      }
    }
  },
  {
    "title": "The public opposition to AI infrastructure is heating up",
    "slug": "public-opposition-ai-infrastructure-heating-up",
    "url": "https://techcrunch.com/2026/02/25/the-public-opposition-to-ai-infrastructure-is-heating-up/",
    "source": "TechCrunch",
    "date": "2026-02-25T19:03:34.000Z",
    "summary": "Public backlash against data center expansion for AI operations is driving increasingly restrictive policies, including construction bans in some areas. Local communities are expressing concerns about resource consumption, environmental impact, and land use implications of AI infrastructure. The response reflects tensions between AI development and community interests.",
    "content": "Public backlash over the data center boom is leading to a variety of draconian policies — including bans on new construction.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "公众对人工智能基础设施的反对正在升温",
        "summary": "对AI运营数据中心扩展的公众反对正在推动越来越多的限制性政策，包括某些地区的建设禁令。当地社区对资源消耗、环境影响和人工智能基础设施的土地使用影响表示关注。这种反应反映了人工智能发展和社区利益之间的紧张关系。"
      },
      "fr": {
        "title": "L'opposition du public aux infrastructures d'IA s'intensifie",
        "summary": "La réaction négative du public contre l'expansion des centres de données pour les opérations d'IA pousse à des politiques de plus en plus restrictives, y compris des interdictions de construction dans certaines régions. Les communautés locales expriment des préoccupations concernant la consommation de ressources, l'impact environnemental et les implications d'utilisation des terres des infrastructures d'IA. La réaction reflète les tensions entre le développement de l'IA et les intérêts des communautés."
      },
      "de": {
        "title": "Der öffentliche Widerstand gegen die KI-Infrastruktur verschärft sich",
        "summary": "Der Gegenwind der Öffentlichkeit gegen die Ausweitung von Rechenzentren für KI-Operationen führt zu zunehmend restriktiven Richtlinien, einschließlich Baubeschränkungen in einigen Gebieten. Lokale Gemeinden äußern Bedenken bezüglich des Ressourcenverbrauchs, der Umweltauswirkungen und der Auswirkungen auf die Landnutzung durch die KI-Infrastruktur. Die Reaktion spiegelt Spannungen zwischen KI-Entwicklung und Gemeindeinteressen wider."
      },
      "es": {
        "title": "La oposición pública a la infraestructura de inteligencia artificial se intensifica",
        "summary": "La reacción negativa del público contra la expansión de centros de datos para operaciones de IA está impulsando políticas cada vez más restrictivas, incluidas prohibiciones de construcción en algunas áreas. Las comunidades locales expresan preocupaciones sobre el consumo de recursos, el impacto ambiental e implicaciones de uso de tierras de la infraestructura de IA. La respuesta refleja tensiones entre el desarrollo de la IA y los intereses de la comunidad."
      }
    }
  },
  {
    "title": "Waymo to begin testing in Chicago and Charlotte",
    "slug": "waymo-testing-chicago-charlotte",
    "url": "https://techcrunch.com/2026/02/25/waymo-to-begin-testing-in-chicago-and-charlotte/",
    "source": "TechCrunch",
    "date": "2026-02-25T18:33:52.000Z",
    "summary": "Waymo is expanding operations by beginning mapping and data collection in Chicago and Charlotte this week. The company currently operates fully autonomous robotaxis in 10 U.S. cities and continues geographic expansion. The new cities represent further diversification of Waymo's autonomous vehicle deployments.",
    "content": "Waymo this week will begin mapping and collecting data in Chicago and Charlotte. The move comes as Waymo announces it is currently operating its robotaxis fully autonomously in 10 US cities.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Waymo将在芝加哥和夏洛特开始测试",
        "summary": "Waymo通过在芝加哥和夏洛特本周开始测绘和数据收集来扩展业务。该公司目前在10个美国城市运营完全自动驾驶出租车，并继续地理扩展。新城市代表Waymo自动驾驶汽车部署的进一步多元化。"
      },
      "fr": {
        "title": "Waymo commencera les tests à Chicago et Charlotte",
        "summary": "Waymo élargit ses opérations en commençant la cartographie et la collecte de données à Chicago et Charlotte cette semaine. L'entreprise exploite actuellement des taxis robotisés entièrement autonomes dans 10 villes des États-Unis et poursuit son expansion géographique. Les nouvelles villes représentent une diversification supplémentaire du déploiement des véhicules autonomes de Waymo."
      },
      "de": {
        "title": "Waymo beginnt Tests in Chicago und Charlotte",
        "summary": "Waymo erweitert seine Aktivitäten durch Kartierung und Datenerfassung in Chicago und Charlotte in dieser Woche. Das Unternehmen betreibt derzeit vollständig autonome Robotaxis in 10 US-amerikanischen Städten und setzt seine geografische Expansion fort. Die neuen Städte stellen eine weitere Diversifizierung der autonomen Fahrzeugeinführungen von Waymo dar."
      },
      "es": {
        "title": "Waymo comenzará a hacer pruebas en Chicago y Charlotte",
        "summary": "Waymo está expandiendo operaciones al comenzar la cartografía y recopilación de datos en Chicago y Charlotte esta semana. La empresa actualmente opera taxis robóticos completamente autónomos en 10 ciudades estadounidenses y continúa la expansión geográfica. Las nuevas ciudades representan una diversificación adicional de los despliegues de vehículos autónomos de Waymo."
      }
    }
  },
  {
    "title": "2026 Lexus RZ 550e review: Likable, but it needs improvement",
    "slug": "2026-lexus-rz-550e-review",
    "url": "https://arstechnica.com/cars/2026/02/2026-lexus-rz-550e-review-likable-but-it-needs-improvement/",
    "source": "Ars Technica",
    "date": "2026-02-25T18:27:27.000Z",
    "summary": "The 2026 Lexus RZ 550e electric vehicle offers appealing qualities but falls short on efficiency metrics and has suboptimal synthetic gearshift implementation. Despite shortcomings in technical execution, the vehicle presents likeable attributes for buyer consideration. The review suggests the RZ 550e needs refinements to powertrain efficiency and transmission.",
    "content": "It's not very efficient, and the synthetic gearshifts aren't great, but I liked it?",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "2026雷克萨斯RZ 550e评测：令人喜爱，但需要改进",
        "summary": "2026款雷克萨斯RZ 550e电动车提供吸引人的特性，但在效率指标上表现不足，且合成变速箱实现欠佳。尽管在技术执行方面存在不足，但该车为买家考虑提供了令人喜爱的属性。评测表明RZ 550e需要在动力系统效率和变速箱方面进行改进。"
      },
      "fr": {
        "title": "Critique du Lexus RZ 550e 2026 : Agréable, mais nécessite des améliorations",
        "summary": "Le véhicule électrique Lexus RZ 550e 2026 offre des qualités attrayantes mais ne répond pas aux attentes en matière d'efficacité énergétique et présente une implémentation de boîte de vitesses synthétique non optimale. Malgré les lacunes dans l'exécution technique, le véhicule présente des attributs agréables à considérer pour l'acheteur. L'avis suggère que le RZ 550e a besoin d'améliorations pour l'efficacité de la transmission et la transmission."
      },
      "de": {
        "title": "Test des Lexus RZ 550e 2026: Angenehm, aber verbesserungsbedürftig",
        "summary": "Das Elektrofahrzeug Lexus RZ 550e 2026 bietet attraktive Qualitäten, bleibt aber in Effizienzmetriken hinter und hat eine suboptimale synthetische Schaltgetriebe-Implementierung. Trotz Mängel in der technischen Ausführung präsentiert das Fahrzeug angenehme Eigenschaften zur Überlegung für den Käufer. Die Bewertung deutet darauf hin, dass der RZ 550e Verbesserungen bei der Antriebsstrang-Effizienz und dem Getriebe benötigt."
      },
      "es": {
        "title": "Revisión del Lexus RZ 550e 2026: Agradable, pero necesita mejora",
        "summary": "El vehículo eléctrico Lexus RZ 550e 2026 ofrece cualidades atractivas pero se queda corto en métricas de eficiencia y tiene una implementación subóptima de cambio de marcha sintético. A pesar de las deficiencias en la ejecución técnica, el vehículo presenta atributos agradables para la consideración del comprador. La revisión sugiere que el RZ 550e necesita refinamientos en la eficiencia del tren motriz y la transmisión."
      }
    }
  },
  {
    "title": "RAM now represents 35 percent of bill of materials for HP PCs",
    "slug": "ram-35-percent-hp-pc-bill-materials",
    "url": "https://arstechnica.com/gadgets/2026/02/ram-now-represents-35-percent-of-bill-of-materials-for-hp-pcs/",
    "source": "Ars Technica",
    "date": "2026-02-25T18:21:38.000Z",
    "summary": "RAM costs have surged to represent 35 percent of component costs in HP personal computers, up from 15-18 percent in the previous quarter. The shift reflects recent memory pricing increases and growing importance of RAM to overall PC costs. Rising RAM expenses significantly impact PC manufacturing economics and pricing strategies.",
    "content": "RAM represented about 15 to 18 percent of PC costs last quarter, HP said.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "RAM现占HP个人电脑物料清单的35%",
        "summary": "RAM成本急剧上升，在HP个人电脑的元件成本中占35%，高于上一季度的15-18%。这一变化反映了最近内存价格的上涨和RAM对整体PC成本的日益重要。RAM费用上升对PC制造经济和定价策略产生重大影响。"
      },
      "fr": {
        "title": "La RAM représente désormais 35 pour cent de la nomenclature des PC HP",
        "summary": "Les coûts des RAM ont bondi pour représenter 35 pour cent des coûts des composants dans les ordinateurs personnels HP, contre 15-18 pour cent au trimestre précédent. Le changement reflète les récentes augmentations de prix de la mémoire et l'importance croissante de la RAM dans les coûts globaux des PC. L'augmentation des dépenses en RAM affecte considérablement l'économie de fabrication des PC et les stratégies de tarification."
      },
      "de": {
        "title": "RAM macht jetzt 35 Prozent der Stückliste für HP-PCs aus",
        "summary": "Die RAM-Kosten sind in die Höhe geschossen und machen jetzt 35 Prozent der Komponentenkosten in HP-Personalcomputern aus, gegenüber 15-18 Prozent im vorherigen Quartal. Die Verschiebung spiegelt die jüngsten Speicherpreiserhöhungen und die wachsende Bedeutung von RAM für die Gesamtkosten von PCs wider. Die steigenden RAM-Ausgaben wirken sich erheblich auf die PC-Fertigungswirtschaft und Preisstrategien aus."
      },
      "es": {
        "title": "RAM ahora representa el 35 por ciento de la lista de materiales de las PC HP",
        "summary": "Los costos de RAM se han disparado para representar el 35 por ciento de los costos de componentes en las computadoras personales HP, frente al 15-18 por ciento en el trimestre anterior. El cambio refleja aumentos recientes en los precios de la memoria y la creciente importancia de la RAM en los costos generales de las PC. El aumento de los gastos en RAM impacta significativamente la economía de manufactura de PC y las estrategias de precios."
      }
    }
  },
  {
    "title": "India’s AI boom pushes firms to trade near-term revenue for users",
    "slug": "indias-ai-boom-revenue-users",
    "url": "https://techcrunch.com/2026/02/24/india-ai-boom-pushes-firms-to-trade-near-term-revenue-for-users/",
    "source": "TechCrunch",
    "date": "2026-02-25T02:00:00.000Z",
    "summary": "ChatGPT and rival AI platforms are testing whether India's massive user base can convert to paying customers as free trials end. This reflects a critical monetization challenge for AI companies in emerging markets with price-sensitive users.",
    "content": "ChatGPT and rivals are testing whether India's massive AI user boom can translate into paying customers as free offers wind down.",
    "category": "tech"
  },
  {
    "title": "Pete Hegseth’s Pentagon AI bro squad includes a former Uber executive and a private equity billionaire",
    "slug": "hegseth-pentagon-ai-team-uber-executive",
    "url": "https://www.theverge.com/ai-artificial-intelligence/884165/pentagon-anthropic-emil-michael-steve-feinberg",
    "source": "The Verge",
    "date": "2026-02-25T01:59:00.000Z",
    "summary": "Secretary of Defense Pete Hegseth has assembled a team of private sector tech and finance executives in key Pentagon roles, including a former Uber executive. The appointments signal significant tech industry influence in US defense policy.",
    "content": "U.S. Secretary of Defense Pete Hegseth (L) walks with Emil Michael (R), Under Secretary of Defense (Research & Engineering, while touring an exhibit of Multi-Domain Autonomous systems at the Pentagon July 16, 2025 in Arlington, Virginia. | Win McNamee/Getty Images.\t\n\nHello and welcome to Regulator, a newsletter for Verge subscribers covering the broligarchs, the influencers, and the (potentially conscious) artificial intelligence models scrambling for power in Washington. If you're not a subscriber yet, assert your humanity against the will of the machines by signing up here.\nVery important news: Do you want to tell me stuff and see it printed in Regulator? Well, now you can, because we have a new tip line! Send all commentary, cool information, and ~secrets~ to tina.nguyen+tips@theverge.com. \nThe Pentagon's private-sector A-Team\nThis morning, in advance of a meeting between Defense Secretary Pete Heg …\nRead the full story at The Verge.",
    "category": "tech"
  },
  {
    "title": "Nvidia challenger AI chip startup MatX raised $500M",
    "slug": "matx-ai-chip-startup-500m-funding",
    "url": "https://techcrunch.com/2026/02/24/nvidia-challenger-ai-chip-startup-matx-raised-500m/",
    "source": "TechCrunch",
    "date": "2026-02-25T00:45:47.000Z",
    "summary": "MatX, an AI chip startup founded by former Google TPU engineers, has raised $500 million in funding. The company represents growing competition to Nvidia as demand for specialized AI hardware alternatives increases.",
    "content": "The startup was founded by former Google TPU engineers in 2023.",
    "category": "tech"
  },
  {
    "title": "Apple&#8217;s new age verification tools block underage app downloads where required by law",
    "slug": "apple-age-verification-tools-underage-apps",
    "url": "https://www.theverge.com/tech/884136/apple-age-verification-assurance-underage-app-downloads",
    "source": "The Verge",
    "date": "2026-02-25T00:45:37.000Z",
    "summary": "Apple has launched new age verification tools enabling developers to comply with age-restriction laws across multiple regions including Australia, Brazil, and the US. The system prevents underage users from downloading age-restricted apps without verified age confirmation.",
    "content": "Apple, like many others, has had to launch age verification features in response to new requirements for age checks in many regions, and on Tuesday, the company announced new details about its tools that developers can use to \"meet their age assurance obligations under upcoming U.S. and regional laws, including in Brazil, Australia, Singapore, Utah, and Louisiana.\" \nOne of the big updates is that users in Australia, Brazil, and Singapore can't download apps rated 18-plus unless their age has been confirmed through \"reasonable methods,\" which the App Store can confirm automatically. Apple notes that developers may still \"have separate obliga …\nRead the full story at The Verge.",
    "category": "tech"
  },
  {
    "title": "Self-driving tech startup Wayve raises $1.2B from Nvidia, Uber, and three automakers",
    "slug": "wayve-1-2b-funding-nvidia-uber-automakers",
    "url": "https://techcrunch.com/2026/02/24/self-driving-tech-startup-wayve-raises-1-2b-from-nvidia-uber-and-three-automakers/",
    "source": "TechCrunch",
    "date": "2026-02-25T00:37:59.000Z",
    "summary": "Autonomous vehicle startup Wayve has secured $1.2 billion in funding from major tech and automotive companies including Nvidia and Uber. The round demonstrates intense competition among diverse industry players to develop self-driving technology.",
    "content": "Major automakers, tech giants, AI companies, and chipmakers are all trying to get a piece of Wayve.",
    "category": "tech"
  },
  {
    "title": "Boozy chimps fail urine test, confirm hotly debated theory",
    "slug": "boozy-chimps-urine-test-theory",
    "url": "https://arstechnica.com/science/2026/02/boozy-chimps-fail-urine-test-confirm-hotly-debated-theory/",
    "source": "Ars Technica",
    "date": "2026-02-25T00:05:05.000Z",
    "summary": "A research study analyzing chimpanzee urine samples collected in Africa confirmed a long-debated scientific theory about alcohol consumption in primates. The findings provide empirical evidence for behavior previously observed but not rigorously tested.",
    "content": "Spare a thought for the intrepid graduate students who spent last summer in Africa collecting chimp urine.",
    "category": "tech"
  }
]