[
  {
    "title": "India’s AI boom pushes firms to trade near-term revenue for users",
    "slug": "indias-ai-boom-revenue-users",
    "url": "https://techcrunch.com/2026/02/24/india-ai-boom-pushes-firms-to-trade-near-term-revenue-for-users/",
    "source": "TechCrunch",
    "date": "2026-02-25T02:00:00.000Z",
    "summary": "ChatGPT and rival AI platforms are testing whether India's massive user base can convert to paying customers as free trials end. This reflects a critical monetization challenge for AI companies in emerging markets with price-sensitive users.",
    "content": "ChatGPT and rivals are testing whether India's massive AI user boom can translate into paying customers as free offers wind down.",
    "category": "tech"
  },
  {
    "title": "Pete Hegseth’s Pentagon AI bro squad includes a former Uber executive and a private equity billionaire",
    "slug": "hegseth-pentagon-ai-team-uber-executive",
    "url": "https://www.theverge.com/ai-artificial-intelligence/884165/pentagon-anthropic-emil-michael-steve-feinberg",
    "source": "The Verge",
    "date": "2026-02-25T01:59:00.000Z",
    "summary": "Secretary of Defense Pete Hegseth has assembled a team of private sector tech and finance executives in key Pentagon roles, including a former Uber executive. The appointments signal significant tech industry influence in US defense policy.",
    "content": "U.S. Secretary of Defense Pete Hegseth (L) walks with Emil Michael (R), Under Secretary of Defense (Research & Engineering, while touring an exhibit of Multi-Domain Autonomous systems at the Pentagon July 16, 2025 in Arlington, Virginia. | Win McNamee/Getty Images.\t\n\nHello and welcome to Regulator, a newsletter for Verge subscribers covering the broligarchs, the influencers, and the (potentially conscious) artificial intelligence models scrambling for power in Washington. If you're not a subscriber yet, assert your humanity against the will of the machines by signing up here.\nVery important news: Do you want to tell me stuff and see it printed in Regulator? Well, now you can, because we have a new tip line! Send all commentary, cool information, and ~secrets~ to tina.nguyen+tips@theverge.com. \nThe Pentagon's private-sector A-Team\nThis morning, in advance of a meeting between Defense Secretary Pete Heg …\nRead the full story at The Verge.",
    "category": "tech"
  },
  {
    "title": "Nvidia challenger AI chip startup MatX raised $500M",
    "slug": "matx-ai-chip-startup-500m-funding",
    "url": "https://techcrunch.com/2026/02/24/nvidia-challenger-ai-chip-startup-matx-raised-500m/",
    "source": "TechCrunch",
    "date": "2026-02-25T00:45:47.000Z",
    "summary": "MatX, an AI chip startup founded by former Google TPU engineers, has raised $500 million in funding. The company represents growing competition to Nvidia as demand for specialized AI hardware alternatives increases.",
    "content": "The startup was founded by former Google TPU engineers in 2023.",
    "category": "tech"
  },
  {
    "title": "Apple&#8217;s new age verification tools block underage app downloads where required by law",
    "slug": "apple-age-verification-tools-underage-apps",
    "url": "https://www.theverge.com/tech/884136/apple-age-verification-assurance-underage-app-downloads",
    "source": "The Verge",
    "date": "2026-02-25T00:45:37.000Z",
    "summary": "Apple has launched new age verification tools enabling developers to comply with age-restriction laws across multiple regions including Australia, Brazil, and the US. The system prevents underage users from downloading age-restricted apps without verified age confirmation.",
    "content": "Apple, like many others, has had to launch age verification features in response to new requirements for age checks in many regions, and on Tuesday, the company announced new details about its tools that developers can use to \"meet their age assurance obligations under upcoming U.S. and regional laws, including in Brazil, Australia, Singapore, Utah, and Louisiana.\" \nOne of the big updates is that users in Australia, Brazil, and Singapore can't download apps rated 18-plus unless their age has been confirmed through \"reasonable methods,\" which the App Store can confirm automatically. Apple notes that developers may still \"have separate obliga …\nRead the full story at The Verge.",
    "category": "tech"
  },
  {
    "title": "Self-driving tech startup Wayve raises $1.2B from Nvidia, Uber, and three automakers",
    "slug": "wayve-1-2b-funding-nvidia-uber-automakers",
    "url": "https://techcrunch.com/2026/02/24/self-driving-tech-startup-wayve-raises-1-2b-from-nvidia-uber-and-three-automakers/",
    "source": "TechCrunch",
    "date": "2026-02-25T00:37:59.000Z",
    "summary": "Autonomous vehicle startup Wayve has secured $1.2 billion in funding from major tech and automotive companies including Nvidia and Uber. The round demonstrates intense competition among diverse industry players to develop self-driving technology.",
    "content": "Major automakers, tech giants, AI companies, and chipmakers are all trying to get a piece of Wayve.",
    "category": "tech"
  },
  {
    "title": "Boozy chimps fail urine test, confirm hotly debated theory",
    "slug": "boozy-chimps-urine-test-theory",
    "url": "https://arstechnica.com/science/2026/02/boozy-chimps-fail-urine-test-confirm-hotly-debated-theory/",
    "source": "Ars Technica",
    "date": "2026-02-25T00:05:05.000Z",
    "summary": "A research study analyzing chimpanzee urine samples collected in Africa confirmed a long-debated scientific theory about alcohol consumption in primates. The findings provide empirical evidence for behavior previously observed but not rigorously tested.",
    "content": "Spare a thought for the intrepid graduate students who spent last summer in Africa collecting chimp urine.",
    "category": "tech"
  }
]