[
  {
    "title": "Ultrahuman’s new flagship smart ring has a 15-day battery",
    "slug": "ultrahuman-ring-pro-15-day-battery",
    "url": "https://www.theverge.com/tech/885866/ultrahuman-ring-pro-jade-ai-launch-price-availability",
    "source": "The Verge",
    "date": "2026-02-27T12:00:48.000Z",
    "summary": "Ultrahuman has launched its third-generation Ring Pro smart ring with up to 15 days of battery life and 250 days of on-device health history storage, representing significant improvements over its 2023 predecessor which offered only 4-6 days of battery life. The Ring Pro comes with an enhanced charging case that extends total battery life to 45 days, and the company is also upgrading its health monitoring platform with a new 'biointelligence AI' integration.",
    "content": "The Ultrahuman Ring Pro comes with a snazzy Pro Charging Case for up to 45 days of additional battery life. | Image: Ultrahuman\t\n\nUltrahuman is expanding its health monitoring ecosystem with the launch of a new flagship smart ring and a \"biointelligence AI\" platform upgrade. The Ring Pro is Ultrahuman's third-generation smart ring, and promises up to 15 days of battery life before needing to recharge, alongside 250 days of on-device health history storage.\nThose are some significant improvements compared to its predecessor, the 2023 Ring Air, which provides 4-6 days of battery life and several days of offline data storage, according to user estimates. Ultrahuman has also made other upgrades to the Ring Pro, including a redesigned heart-rate sensor that improves signal …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Ultrahuman新旗舰智能戒指续航15天",
        "summary": "Ultrahuman推出了第三代Ring Pro智能戒指，电池续航可达15天，设备存储容量可存储250天的健康历史记录，相比2023年的前代产品（仅提供4-6天续航）有了显著提升。Ring Pro配备增强型充电盒，可将总续航时间延长至45天，该公司还通过新的\"生物智能AI\"集成来升级其健康监测平台。"
      },
      "fr": {
        "title": "Le nouvel anneau intelligent phare d'Ultrahuman a 15 jours d'autonomie",
        "summary": "Ultrahuman a lancé sa bague intelligente Ring Pro de troisième génération avec jusqu'à 15 jours d'autonomie de batterie et 250 jours de stockage d'historique de santé sur l'appareil, ce qui représente des améliorations significatives par rapport à son prédécesseur de 2023 qui n'offrait que 4-6 jours d'autonomie. La Ring Pro est fournie avec un étui de recharge amélioré qui prolonge l'autonomie totale de la batterie à 45 jours, et la société met également à niveau sa plateforme de surveillance de la santé avec une nouvelle intégration d'« IA biointelligence »."
      },
      "de": {
        "title": "Ultrahuman's neuer Flaggschiff-Smartring hat 15 Tage Akkulaufzeit",
        "summary": "Ultrahuman hat seinen Smart Ring Ring Pro der dritten Generation mit bis zu 15 Tagen Akkulaufzeit und 250 Tagen Speicherung von Gesundheitsverlauf auf dem Gerät eingeführt, was erhebliche Verbesserungen gegenüber seinem Vorgänger aus 2023 darstellt, der nur 4-6 Tage Akkulaufzeit bot. Der Ring Pro wird mit einem verbesserten Ladecase geliefert, das die Gesamtakkulaufzeit auf 45 Tage verlängert, und das Unternehmen aktualisiert auch seine Gesundheitsüberwachungsplattform mit einer neuen „Biointelligenz-KI\"-Integration."
      },
      "es": {
        "title": "El nuevo anillo inteligente insignia de Ultrahuman tiene 15 días de batería",
        "summary": "Ultrahuman ha lanzado su anillo inteligente Ring Pro de tercera generación con hasta 15 días de duración de batería y 250 días de almacenamiento del historial de salud en el dispositivo, lo que representa mejoras significativas respecto a su predecesor de 2023 que ofrecía solo 4-6 días de duración. El Ring Pro viene con un estuche de carga mejorado que extiende la duración total de la batería a 45 días, y la empresa también está mejorando su plataforma de monitoreo de salud con una nueva integración de \"IA biointeligencia\"."
      }
    }
  },
  {
    "title": "Notes from a Burmese Prison",
    "slug": "notes-burmese-prison",
    "url": "https://www.theverge.com/cs/features/820915/notes-burmese-prison-comic",
    "source": "The Verge",
    "date": "2026-02-27T12:00:00.000Z",
    "summary": "This story is a comic by Danny Fenster and Amy Kurzweil about a Burmese prison, but it is not viewable through RSS readers and must be read directly on The Verge's website.",
    "content": "This story is a comic by Danny Fenster and Amy Kurzweil and is not compatible with RSS readers. But you can (and should) read it at The Verge’s website.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "缅甸监狱笔记",
        "summary": "这是由Danny Fenster和Amy Kurzweil创作的关于缅甸监狱的漫画故事，但无法通过RSS阅读器查看，必须直接在The Verge网站上阅读。"
      },
      "fr": {
        "title": "Notes d'une prison birmane",
        "summary": "Il s'agit d'une bande dessinée de Danny Fenster et Amy Kurzweil sur une prison birmane, mais elle n'est pas visible par les lecteurs RSS et doit être lue directement sur le site Web de The Verge."
      },
      "de": {
        "title": "Notizen aus einem burmesischen Gefängnis",
        "summary": "Dies ist ein Comic von Danny Fenster und Amy Kurzweil über ein burmesisches Gefängnis, aber es ist nicht über RSS-Reader sichtbar und muss direkt auf der Website von The Verge gelesen werden."
      },
      "es": {
        "title": "Notas de una prisión birmana",
        "summary": "Esta es una historia de cómic de Danny Fenster y Amy Kurzweil sobre una prisión birmana, pero no se puede ver a través de lectores RSS y debe leerse directamente en el sitio web de The Verge."
      }
    }
  },
  {
    "title": "Phones are going to get weird next week",
    "slug": "phones-going-get-weird-mobile-world-congress",
    "url": "https://www.theverge.com/tech/885287/mwc-2026-what-to-expect-phones-mobile-weird",
    "source": "The Verge",
    "date": "2026-02-27T12:00:00.000Z",
    "summary": "Mobile World Congress is expected to showcase numerous innovative and unconventional phones and devices from manufacturers worldwide, particularly Chinese companies and niche makers, breaking away from the increasingly uniform smartphone market. The event will feature everything from modular phones to devices with unusual specifications and extraordinary features.",
    "content": "Honor’s Robot Phone is set to make an appearance, and this time we might actually see it switched on. | Photo: Dominic Preston / The Verge\t\n\nWith rare exceptions, phones are pretty boring these days. The good news is, a boatload of those rare exceptions are about to show up at once, courtesy of Mobile World Congress.\nThe tech industry's biggest mobile show may not quite have the clout it once did, when the likes of Samsung, Sony, LG, and HTC showcased new flagships there each year, but it still attracts more phone launches than CES does two months earlier. It's especially popular with the Chinese manufacturers who are still fighting for space in the global market, along with niche manufacturers who turn up with extra-durable \"rugged\" devices, or battery beasts that are more powe …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "下周手机将变得很奇怪",
        "summary": "移动世界大会预计将展示来自全球制造商（特别是中国公司和小众品牌）的众多创新和非常规手机和设备，打破越来越趋同的智能手机市场。该活动将展出从模块化手机到具有不寻常规格和非凡功能的设备。"
      },
      "fr": {
        "title": "Les téléphones vont devenir bizarres la semaine prochaine",
        "summary": "Le Mobile World Congress devrait présenter de nombreux téléphones et appareils innovants et non conventionnels de fabricants du monde entier, en particulier des entreprises chinoises et des créateurs de niche, s'éloignant du marché des smartphones de plus en plus uniforme. L'événement présentera tout, des téléphones modulaires aux appareils avec des spécifications inhabituelles et des fonctionnalités extraordinaires."
      },
      "de": {
        "title": "Nächste Woche werden Telefone seltsam",
        "summary": "Die Mobile World Congress wird voraussichtlich zahlreiche innovative und unkonventionelle Telefone und Geräte von Herstellern weltweit präsentieren, insbesondere von chinesischen Unternehmen und Nischenmachern, wodurch sich der Smartphone-Markt von seiner zunehmend einheitlichen Struktur entfernt. Die Veranstaltung wird alles von modularen Telefonen bis zu Geräten mit ungewöhnlichen Spezifikationen und außergewöhnlichen Funktionen zeigen."
      },
      "es": {
        "title": "Los teléfonos se volverán raros la próxima semana",
        "summary": "Se espera que el Mobile World Congress presente numerosos teléfonos y dispositivos innovadores y no convencionales de fabricantes en todo el mundo, particularmente empresas chinas y creadores de nicho, alejándose del mercado de smartphones cada vez más uniforme. El evento presentará desde teléfonos modulares hasta dispositivos con especificaciones inusuales y características extraordinarias."
      }
    }
  },
  {
    "title": "MWC 2026: all the phones, gadgets, and announcements from Barcelona",
    "slug": "mwc-2026-phones-gadgets-announcements-barcelona",
    "url": "https://www.theverge.com/tech/882980/mwc-2026-news-phones-gadgets-announcements",
    "source": "The Verge",
    "date": "2026-02-27T11:49:00.000Z",
    "summary": "Mobile World Congress 2026 in Barcelona will feature major announcements from leading technology companies including Xiaomi, Honor, Samsung, Google, and Nothing, with expected introductions of cutting-edge smartphones, tablets, and wearables. The show is expected to showcase both established products and experimental devices, continuing the tradition of featuring unusual designs and innovative technologies.",
    "content": "The Verge is heading to Barcelona, Spain, for Mobile World Congress, the biggest phone show of the year.\nCES may dominate the headlines when it comes to TVs, computer components, and AI inanity, but for all things mobile, MWC has it beat. Since it’s a global show, that includes all manner of announcements of phones, tablets, and wearables that won’t necessarily release in the US.\nXiaomi has already teased a European launch for its 17 and 17 Ultra flagships, Honor is promising not only its Robot Phone but a full pivot to humanoid robotics, and Nothing is almost certain to drop more details on its Phone 4A ahead of a planned London launch on March 5th.\nThe likes of Samsung and Google will be there too, but mostly to talk about the already-announced 10A and S26 models, while Apple is launching something during the same week as MWC, but not actually in Barcelona.\nWe’ll also be looking out for oddities. Last year featured camera phone concepts with detachable lenses,  a Lenovo laptop with a folding screen, and an Infinix handset with a solar panel in its back. We’ll be hoping this year gets just as weird.\nKeep this page bookmarked for all the news, commentary, and first looks from the show floor.\nPhones are going to get weird next week\n\t\t\t\nXiaomi’s magnetic power bank is incredibly thin\n\t\t\t\nHonor’s new MagicPad 4 is the world’s thinnest Android tablet\n\t\t\t\nTecno is doing a modular phone (again).\n\t\t\t\nTaara Beam provides 25Gbps connectivity over invisible beams of light\n\t\t\t\nHonor is pivoting to robots.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "MWC 2026：来自巴塞罗那的所有手机、小工具和发布会",
        "summary": "2026年巴塞罗那世界移动通信大会将展示小米、荣耀、三星、谷歌和Nothing等领先科技公司的重要发布会，预计将推出尖端智能手机、平板电脑和可穿戴设备。该展会预计将展示成熟产品和实验性设备，延续展示不寻常设计和创新技术的传统。"
      },
      "fr": {
        "title": "MWC 2026 : tous les téléphones, gadgets et annonces de Barcelone",
        "summary": "Le Congrès mondial du mobile 2026 à Barcelone mettra en vedette les principales annonces des entreprises technologiques leaders, notamment Xiaomi, Honor, Samsung, Google et Nothing, avec des introductions attendues de smartphones, tablettes et appareils portables de pointe. Le salon devrait présenter des produits établis et des appareils expérimentaux, poursuivant la tradition de présenter des conceptions inhabituelles et des technologies innovantes."
      },
      "de": {
        "title": "MWC 2026: Alle Telefone, Gadgets und Ankündigungen aus Barcelona",
        "summary": "Der Mobile World Congress 2026 in Barcelona wird wichtige Ankündigungen führender Technologieunternehmen wie Xiaomi, Honor, Samsung, Google und Nothing zeigen, mit erwarteten Einführungen von hochmodernen Smartphones, Tablets und Wearables. Die Messe soll sowohl etablierte Produkte als auch experimentelle Geräte präsentieren und setzt damit die Tradition fort, ungewöhnliche Designs und innovative Technologien zu zeigen."
      },
      "es": {
        "title": "MWC 2026: todos los teléfonos, gadgets y anuncios de Barcelona",
        "summary": "El Congreso Mundial de Móviles 2026 en Barcelona presentará los principales anuncios de las principales empresas tecnológicas, incluyendo Xiaomi, Honor, Samsung, Google y Nothing, con introducciones esperadas de smartphones, tabletas y dispositivos portátiles de última generación. Se espera que la feria muestre productos establecidos y dispositivos experimentales, continuando la tradición de presentar diseños inusuales y tecnologías innovadoras."
      }
    }
  },
  {
    "title": "Ultrahuman bets on redesigned smart ring to win back U.S. market after Oura dispute",
    "slug": "ultrahuman-ring-pro-us-market-comeback",
    "url": "https://techcrunch.com/2026/02/27/ultrahuman-unveils-new-smart-ring-as-it-awaits-u-s-clearance-after-oura-dispute/",
    "source": "TechCrunch",
    "date": "2026-02-27T11:00:00.000Z",
    "summary": "Ultrahuman is launching its redesigned Ring Pro smart ring priced at $479 as a strategic move to regain market position in the U.S. wearables market following competition in the sector. The Ring Pro offers 15 days of battery life, representing a significant improvement in the competitive smart ring category.",
    "content": "Ultrahuman’s Ring Pro promises 15-day battery life and a $479 price tag as the wearables maker expands its health-tech push.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Ultrahuman押注重新设计的智能戒指以重新赢得美国市场，结束与Oura的纠纷",
        "summary": "Ultrahuman推出售价479美元的重新设计的Ring Pro智能戒指，作为在美国可穿戴设备市场中重新获得市场地位的战略举措。Ring Pro提供15天的电池寿命，代表了竞争激烈的智能戒指类别中的显著改进。"
      },
      "fr": {
        "title": "Ultrahuman mise sur une bague intelligente redessinée pour reconquérir le marché américain après le différend avec Oura",
        "summary": "Ultrahuman lance sa bague intelligente Ring Pro redessinée au prix de 479 dollars comme un mouvement stratégique pour retrouver sa position sur le marché des appareils portables aux États-Unis. La Ring Pro offre 15 jours d'autonomie, ce qui représente une amélioration significative dans la catégorie des bagues intelligentes compétitives."
      },
      "de": {
        "title": "Ultrahuman setzt auf neu gestalteten Smart Ring, um den US-Markt nach Oura-Streit zurückzugewinnen",
        "summary": "Ultrahuman bringt seinen neu gestalteten Smart Ring Ring Pro zum Preis von 479 Dollar als strategischen Schritt auf den Markt, um seine Marktposition auf dem US-Wearables-Markt zurückzugewinnen. Der Ring Pro bietet eine Akkulaufzeit von 15 Tagen, was eine erhebliche Verbesserung in der wettbewerbsintensiven Smartring-Kategorie darstellt."
      },
      "es": {
        "title": "Ultrahuman apuesta por un anillo inteligente rediseñado para recuperar el mercado estadounidense después de la disputa con Oura",
        "summary": "Ultrahuman lanza su anillo inteligente Ring Pro rediseñado con un precio de $479 como un movimiento estratégico para recuperar su posición en el mercado de dispositivos portátiles en EE.UU. El Ring Pro ofrece 15 días de duración de la batería, lo que representa una mejora significativa en la categoría de anillos inteligentes competitivos."
      }
    }
  },
  {
    "title": "Plaid valued at $8B in employee share sale",
    "slug": "plaid-valued-8-billion-employee-share-sale",
    "url": "https://techcrunch.com/2026/02/26/plaid-valued-at-8b-in-employee-share-sale/",
    "source": "TechCrunch",
    "date": "2026-02-27T07:19:05.000Z",
    "summary": "Payment infrastructure company Plaid achieved an $8 billion valuation in an employee share sale, marking a 31% increase from its previous $6.1 billion valuation reached in April. The milestone demonstrates investor confidence in Plaid's growing market position in payment technology.",
    "content": "The new valuation is a 31% increase from $6.1 billion Plaid reached in April.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Plaid在员工股份出售中估值80亿美元",
        "summary": "支付基础设施公司Plaid在员工股份出售中达到了80亿美元的估值，比之前在4月达到的60.1亿美元的估值增加了31%。这个里程碑表明投资者对Plaid在支付技术领域不断增长的市场地位的信心。"
      },
      "fr": {
        "title": "Plaid valorisé à 8 milliards de dollars lors d'une vente d'actions aux employés",
        "summary": "La société d'infrastructure de paiement Plaid a atteint une valorisation de 8 milliards de dollars lors d'une vente d'actions aux employés, marquant une augmentation de 31% par rapport à sa valorisation précédente de 6,1 milliards de dollars atteinte en avril. Cette étape démontre la confiance des investisseurs dans la position de marché croissante de Plaid dans la technologie des paiements."
      },
      "de": {
        "title": "Plaid mit 8 Milliarden Dollar in Mitarbeitereigentumsverkauf bewertet",
        "summary": "Das Zahlungsinfrastruktur-Unternehmen Plaid erreichte eine Bewertung von 8 Milliarden Dollar in einem Mitarbeitereigentumsverkauf, was einer Steigerung von 31% gegenüber seiner vorherigen Bewertung von 6,1 Milliarden Dollar im April entspricht. Dies zeigt das Vertrauen der Investoren in Plaids wachsende Marktposition in der Zahlungstechnologie."
      },
      "es": {
        "title": "Plaid valorado en $8 mil millones en venta de acciones de empleados",
        "summary": "La empresa de infraestructura de pagos Plaid logró una valoración de $8 mil millones en una venta de acciones de empleados, marcando un aumento del 31% desde su valoración anterior de $6.1 mil millones alcanzada en abril. Este hito demuestra la confianza de los inversores en la posición de mercado creciente de Plaid en tecnología de pagos."
      }
    }
  }
]