[
  {
    "title": "NASA is pushing back its plans for a Moon landing",
    "slug": "nasa-moon-landing-delay",
    "url": "https://www.theverge.com/science/886656/nasa-artemis-moon-landing-delayed-2028",
    "source": "The Verge",
    "date": "2026-02-27T23:11:40.000Z",
    "summary": "NASA is delaying its Moon landing from Artemis III (2027) to Artemis IV (2028), with Artemis III now serving as a test flight. Following safety recommendations, the agency is increasing mission cadence and aims for at least one surface landing annually after 2028.",
    "content": "NASA announced at a press conference on Friday that it's delaying its plans for a Moon landing until Artemis IV in 2028. The Artemis III mission, scheduled for 2027, was originally going to attempt to land on the Moon but will now be a test flight instead. NASA also says it's \"increasing its cadence of missions,\" including adding a second test flight in 2027 and aiming for \"at least one surface landing every year thereafter,\" including the Artemis IV landing.  \n\nThe overhaul to the Artemis launch schedule follows a report from NASA's Aerospace Safety Advisory Panel (ASAP) earlier this month that highlighted serious safety risks with NASA's p …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "NASA推迟月球登陆计划",
        "summary": "NASA将月球登陆从阿尔忒弥斯三号（2027年）推迟至阿尔忒弥斯四号（2028年），阿尔忒弥斯三号现将作为测试飞行。遵循安全建议，该机构增加了任务频率，目标是2028年后每年至少进行一次表面登陆。"
      },
      "fr": {
        "title": "La NASA repousse ses plans pour un atterrissage lunaire",
        "summary": "La NASA repousse l'atterrissage sur la Lune d'Artemis III (2027) à Artemis IV (2028), Artemis III servant désormais de vol d'essai. Suivant les recommandations de sécurité, l'agence augmente la cadence des missions et vise au moins un atterrissage en surface par an après 2028."
      },
      "de": {
        "title": "NASA verschiebt ihre Pläne für eine Mondlandung",
        "summary": "Die NASA verschiebt ihre Mondlandung von Artemis III (2027) auf Artemis IV (2028), wobei Artemis III nun als Testflug dient. Nach Sicherheitsempfehlungen erhöht die Agentur die Missionsfrequenz und zielt darauf ab, nach 2028 mindestens eine Oberflächenlandung pro Jahr zu erreichen."
      },
      "es": {
        "title": "La NASA retrasa sus planes para un aterrizaje lunar",
        "summary": "La NASA está retrasando su aterrizaje lunar de Artemis III (2027) a Artemis IV (2028), con Artemis III sirviendo ahora como vuelo de prueba. Siguiendo recomendaciones de seguridad, la agencia aumenta la cadencia de misiones y tiene como objetivo al menos un aterrizaje en la superficie anualmente después de 2028."
      }
    }
  },
  {
    "title": "Defense secretary Pete Hegseth designates Anthropic a supply chain risk",
    "slug": "defense-secretary-anthropic-supply-chain-risk",
    "url": "https://www.theverge.com/policy/886632/pentagon-designates-anthropic-supply-chain-risk-ai-standoff",
    "source": "The Verge",
    "date": "2026-02-27T23:06:02.000Z",
    "summary": "Defense Secretary Pete Hegseth designated Anthropic as a 'supply-chain risk' after Trump banned federal use of the AI company's products. This could immediately impact major tech contractors like Palantir and AWS that use Claude for Pentagon work.",
    "content": "US President Donald Trump (R) looks on as US Secretary of Defense Pete Hegseth speaks to the press following US military actions in Venezuela | AFP via Getty Images\t\n\nNearly two hours after President Donald Trump announced on Truth Social that he was banning Anthropic products from the federal government, Secretary of Defense Pete Hegseth took it one step further and announced that he was now designating the AI company as a \"supply-chain risk\". \nThe decision could immediately impact numerous major tech companies that use Claude in their line of work for the Pentagon, including Palantir and AWS. It is not immediately clear to what extent the Pentagon may blacklist companies that contract with Claude for other services outside of national security.\nAfter a week of tense negotiations over the company's acc …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "国防部长皮特·赫格塞斯将Anthropic指定为供应链风险",
        "summary": "在特朗普禁止联邦使用该AI公司产品后，国防部长皮特·赫格塞斯将Anthropic指定为\"供应链风险\"。这可能会立即影响使用Claude进行五角大楼工作的大型科技承包商，如Palantir和AWS。"
      },
      "fr": {
        "title": "Le secrétaire à la défense Pete Hegseth désigne Anthropic comme risque pour la chaîne d'approvisionnement",
        "summary": "Le secrétaire à la défense Pete Hegseth a désigné Anthropic comme un « risque pour la chaîne d'approvisionnement » après que Trump a interdit l'utilisation fédérale des produits de la société d'IA. Cela pourrait immédiatement affecter les grands entrepreneurs technologiques comme Palantir et AWS qui utilisent Claude pour les travaux du Pentagone."
      },
      "de": {
        "title": "Verteidigungsminister Pete Hegseth bezeichnet Anthropic als Lieferkettenrisiko",
        "summary": "Verteidigungsminister Pete Hegseth bezeichnete Anthropic nach Trumps Verbot der föderalen Nutzung der KI-Produkte des Unternehmens als „Lieferkettenrisiko\". Dies könnte unmittelbar große Technologieauftragnehmer wie Palantir und AWS beeinträchtigen, die Claude für Pentagonarbeiten nutzen."
      },
      "es": {
        "title": "El secretario de Defensa Pete Hegseth designa a Anthropic como riesgo de la cadena de suministro",
        "summary": "El Secretario de Defensa Pete Hegseth designó a Anthropic como un \"riesgo de la cadena de suministro\" después de que Trump prohibiera el uso federal de los productos de la empresa de IA. Esto podría afectar inmediatamente a los principales contratistas de tecnología como Palantir y AWS que utilizan Claude para trabajos del Pentágono."
      }
    }
  },
  {
    "title": "OpenAI fires employee for using confidential info on prediction markets",
    "slug": "openai-fires-employee-confidential-prediction-markets",
    "url": "https://techcrunch.com/2026/02/27/openai-fires-employee-for-using-confidential-info-on-prediction-markets/",
    "source": "TechCrunch",
    "date": "2026-02-27T23:00:54.000Z",
    "summary": "OpenAI terminated an employee for trading on prediction markets using confidential company information, violating internal policies against leveraging insider knowledge for personal financial gain.",
    "content": "The company said such trades violates its internal company policies about using confidential information for personal gain.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "OpenAI因员工使用机密信息进行预测市场交易而解雇员工",
        "summary": "OpenAI因员工使用机密公司信息进行预测市场交易而终止了其雇佣关系，这违反了禁止利用内部信息进行个人经济获利的内部政策。"
      },
      "fr": {
        "title": "OpenAI licencie un employé pour avoir utilisé des informations confidentielles sur les marchés de prédiction",
        "summary": "OpenAI a licencié un employé pour avoir négocié sur les marchés de prédiction en utilisant des informations confidentielles de l'entreprise, violant les politiques internes contre l'exploitation des connaissances privilégiées à titre personnel."
      },
      "de": {
        "title": "OpenAI feuert Mitarbeiter für die Nutzung vertraulicher Informationen auf Vorhersagemärkten",
        "summary": "OpenAI beendete die Anstellung eines Mitarbeiters, der auf Vorhersagemärkten mit vertraulichen Unternehmensinformationen handelte, was gegen interne Richtlinien verstößt, die die Nutzung von Insiderwissen für persönlichen finanziellen Gewinn verbieten."
      },
      "es": {
        "title": "OpenAI despide a empleado por usar información confidencial en mercados de predicción",
        "summary": "OpenAI terminó el empleo de un empleado por operar en mercados de predicción utilizando información confidencial de la empresa, violando las políticas internas contra el aprovechamiento de conocimiento privilegiado para beneficio personal."
      }
    }
  },
  {
    "title": "Under a Paramount-WBD merger, two struggling media giants would unite",
    "slug": "paramount-wbd-merger",
    "url": "https://arstechnica.com/gadgets/2026/02/under-a-paramount-wbd-merger-two-struggling-media-giants-would-unite/",
    "source": "Ars Technica",
    "date": "2026-02-27T22:39:00.000Z",
    "summary": "Two declining media giants are exploring a merger to create a more profitable combined entity.",
    "content": "Can two declining companies form a profitable one?",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "在Paramount-WBD合并下，两个苦苦挣扎的媒体巨头将联合",
        "summary": "两个衰退的媒体巨头正在探索合并，以创建一个更盈利的联合实体。"
      },
      "fr": {
        "title": "Sous une fusion Paramount-WBD, deux géants des médias en difficulté s'uniraient",
        "summary": "Deux géants des médias en déclin explorent une fusion pour créer une entité combinée plus rentable."
      },
      "de": {
        "title": "Bei einer Paramount-WBD-Fusion würden sich zwei angeschlagene Medienriesen vereinigen",
        "summary": "Zwei angeschlagene Medienriesen erkunden eine Fusion, um eine rentablere kombinierte Einheit zu schaffen."
      },
      "es": {
        "title": "Bajo una fusión Paramount-WBD, dos gigantes de medios en problemas se unirían",
        "summary": "Dos gigantes de medios en declive están explorando una fusión para crear una entidad combinada más rentable."
      }
    }
  },
  {
    "title": "Pentagon moves to designate Anthropic as a supply-chain risk",
    "slug": "pentagon-designates-anthropic-supply-chain-risk",
    "url": "https://techcrunch.com/2026/02/27/pentagon-moves-to-designate-anthropic-as-a-supply-chain-risk/",
    "source": "TechCrunch",
    "date": "2026-02-27T21:53:14.000Z",
    "summary": "The Pentagon designated Anthropic as a supply-chain risk after Trump directed federal agencies to cease using the AI company's products due to policy disagreements.",
    "content": "\"We don't need it, we don't want it, and will not do business with them again,\" the president wrote in the post.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "五角大楼采取措施将Anthropic指定为供应链风险",
        "summary": "特朗普指示联邦机构停止使用这家人工智能公司的产品，原因是政策分歧，之后五角大楼将Anthropic指定为供应链风险。"
      },
      "fr": {
        "title": "Le Pentagone entreprend de désigner Anthropic comme un risque de chaîne d'approvisionnement",
        "summary": "Le Pentagone a désigné Anthropic comme un risque de chaîne d'approvisionnement après que Trump a ordonné aux agences fédérales de cesser d'utiliser les produits de la société d'IA en raison de désaccords politiques."
      },
      "de": {
        "title": "Das Pentagon unternimmt Schritte, um Anthropic als Lieferkettenrisiko auszuweisen",
        "summary": "Das Pentagon hat Anthropic nach Trumps Anweisung an die Bundesbehörden, die Produkte des KI-Unternehmens nicht mehr zu verwenden, als Lieferkettenrisiko ausgewiesen, da es zu politischen Meinungsverschiedenheiten gekommen ist."
      },
      "es": {
        "title": "El Pentágono se mueve para designar a Anthropic como un riesgo de la cadena de suministro",
        "summary": "El Pentágono designó a Anthropic como un riesgo de la cadena de suministro después de que Trump ordenó a las agencias federales que dejen de usar los productos de la empresa de IA debido a desacuerdos políticos."
      }
    }
  },
  {
    "title": "Warner Bros. Discovery agrees to $110 billion Paramount merger",
    "slug": "warner-bros-discovery-paramount-merger-110-billion",
    "url": "https://www.theverge.com/entertainment/886478/warner-bros-discovery-paramount-merger-agreement",
    "source": "The Verge",
    "date": "2026-02-27T21:43:37.000Z",
    "summary": "Warner Bros. Discovery and Paramount announced an official $110 billion merger agreement, with WBD choosing Paramount over Netflix's $83 billion offer after persistent competitive bidding.",
    "content": "Warner Bros. Discovery and Paramount Skydance's merger agreement is now official. On Friday, the two companies announced plans to merge into a massive media company that will fold WBD's studio, linear channels, streaming service, and gaming segment into Paramount.\nThough WBD initially signed onto an $83 billion agreement to merge part of Warner Bros. with Netflix, Paramount persisted with a hostile takeover bid, followed by a series of offers. That persistence paid off, as WBD determined that Paramount's \"best and final\" offer is \"superior\" to Netflix's deal. On Thursday, Netflix declined to match Paramount's bid, calling it \"no longer fina …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Warner Bros. Discovery同意以1100亿美元合并Paramount",
        "summary": "Warner Bros. Discovery和Paramount宣布了一项正式的1100亿美元合并协议，WBD在持续的竞争性竞标后选择了Paramount，而不是Netflix的830亿美元报价。"
      },
      "fr": {
        "title": "Warner Bros. Discovery accepte une fusion avec Paramount pour 110 milliards de dollars",
        "summary": "Warner Bros. Discovery et Paramount ont annoncé un accord de fusion officiel de 110 milliards de dollars, WBD choisissant Paramount par rapport à l'offre de 83 milliards de dollars de Netflix après des enchères compétitives persistantes."
      },
      "de": {
        "title": "Warner Bros. Discovery stimmt einer Paramount-Fusion im Wert von 110 Milliarden Dollar zu",
        "summary": "Warner Bros. Discovery und Paramount gaben eine offizielle Fusionsvereinbarung in Höhe von 110 Milliarden Dollar bekannt, wobei WBD nach hartnäckigen Wettbewerbsgeboten Paramount der 83-Milliarden-Dollar-Angebot von Netflix vorzog."
      },
      "es": {
        "title": "Warner Bros. Discovery acepta la fusión de Paramount por 110 mil millones de dólares",
        "summary": "Warner Bros. Discovery y Paramount anunciaron un acuerdo de fusión oficial de 110 mil millones de dólares, con WBD eligiendo Paramount sobre la oferta de 83 mil millones de dólares de Netflix después de pujas competitivas persistentes."
      }
    }
  },
  {
    "title": "Trump orders federal agencies to drop Anthropic’s AI",
    "slug": "trump-orders-federal-agencies-drop-anthropic",
    "url": "https://www.theverge.com/policy/886489/pentagon-anthropic-trump-dod",
    "source": "The Verge",
    "date": "2026-02-27T21:30:47.000Z",
    "summary": "Trump ordered federal agencies to immediately stop using Anthropic's AI products, citing the company's refusal to grant the Pentagon unlimited rights to use its technology for mass domestic surveillance.",
    "content": "On Friday afternoon, Donald Trump posted on Truth Social, accusing Anthropic, the AI company behind Claude, of attempting to \"STRONG-ARM\" the Pentagon and directing federal agencies to \"IMMEDIATELY CEASE\" use of its products. At issue is Anthropic CEO Dario Amodei's refusal of an updated agreement with the US military agreeing to \"any lawful use\" of Anthropic's technology, as Defense Secretary Pete Hegseth mandated in a January memo, to the frustration of many tech workers across the industry.\nAs we explained earlier this week, that agreement would give the US military access to use the company's services for mass domestic surveillance and  …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "特朗普命令联邦机构停止使用Anthropic的AI",
        "summary": "特朗普命令联邦机构立即停止使用Anthropic的AI产品，原因是该公司拒绝授予五角大楼无限权限来使用其技术进行大规模国内监控。"
      },
      "fr": {
        "title": "Trump ordonne aux agences fédérales d'abandonner l'IA d'Anthropic",
        "summary": "Trump a ordonné aux agences fédérales d'arrêter immédiatement d'utiliser les produits d'IA d'Anthropic, citant le refus de l'entreprise d'accorder au Pentagone des droits illimités pour utiliser sa technologie pour la surveillance intérieure de masse."
      },
      "de": {
        "title": "Trump befiehlt Bundesbehörden, KI von Anthropic aufzugeben",
        "summary": "Trump befahl Bundesbehörden, die Nutzung von KI-Produkten von Anthropic sofort einzustellen, da das Unternehmen sich weigerte, dem Pentagon unbegrenzte Rechte zur Nutzung seiner Technologie zur Massenüberwachung im Inland zu gewähren."
      },
      "es": {
        "title": "Trump ordena a agencias federales dejar de usar IA de Anthropic",
        "summary": "Trump ordenó a las agencias federales que dejen de usar inmediatamente los productos de IA de Anthropic, citando la negativa de la empresa a otorgar al Pentágono derechos ilimitados para usar su tecnología para vigilancia masiva doméstica."
      }
    }
  },
  {
    "title": "Photons that aren't actually there influence superconductivity",
    "slug": "virtual-photons-superconductivity",
    "url": "https://arstechnica.com/science/2026/02/photons-that-arent-actually-there-influence-superconductivity/",
    "source": "Ars Technica",
    "date": "2026-02-27T21:27:33.000Z",
    "summary": "Physicists discovered that virtual photons—particles that don't physically exist but mediate interactions between materials—play a role in influencing superconductivity.",
    "content": "Interactions between neighboring materials is mediated by virtual photons.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "不真实存在的光子影响超导性",
        "summary": "物理学家发现虚光子——不实际存在但介导材料之间相互作用的粒子——在影响超导性中发挥了作用。"
      },
      "fr": {
        "title": "Des photons qui n'existent pas vraiment influencent la supraconductivité",
        "summary": "Les physiciens ont découvert que les photons virtuels—des particules qui n'existent pas physiquement mais médient les interactions entre les matériaux—jouent un rôle dans l'influence de la supraconductivité."
      },
      "de": {
        "title": "Photonen, die eigentlich nicht existieren, beeinflussen die Supraleitung",
        "summary": "Physiker entdeckten, dass virtuelle Photonen – Partikel, die nicht wirklich existieren, aber Wechselwirkungen zwischen Materialien vermitteln – eine Rolle bei der Beeinflussung der Supraleitung spielen."
      },
      "es": {
        "title": "Los fotones que no existen realmente influyen en la superconductividad",
        "summary": "Los físicos descubrieron que los fotones virtuales—partículas que no existen físicamente pero median interacciones entre materiales—juegan un papel en la influencia de la superconductividad."
      }
    }
  },
  {
    "title": "Musk bashes OpenAI in deposition, saying ‘nobody committed suicide because of Grok’",
    "slug": "musk-bashes-openai-grok-lawsuit",
    "url": "https://techcrunch.com/2026/02/27/musk-bashes-openai-in-deposition-saying-nobody-committed-suicide-because-of-grok/",
    "source": "TechCrunch",
    "date": "2026-02-27T19:42:00.000Z",
    "summary": "During his lawsuit deposition against OpenAI, Elon Musk promoted xAI's Grok as safer than ChatGPT, though Grok later flooded X with nonconsensual nude images.",
    "content": "In his lawsuit against OpenAI, Musk touted xAI safety compared with ChatGPT. A few months later, xAI's Grok flooded X with nonconsensual nude images.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "马斯克在证词中抨击OpenAI，称\"没有人因为Grok而自杀\"",
        "summary": "在针对OpenAI的诉讼证词中，埃隆·马斯克将xAI的Grok推广为比ChatGPT更安全，尽管Grok后来用非法获取的裸照充斥了X。"
      },
      "fr": {
        "title": "Musk critique OpenAI lors de sa déposition, disant « personne ne s'est suicidé à cause de Grok »",
        "summary": "Lors de sa déposition judiciaire contre OpenAI, Elon Musk a promu Grok de xAI comme plus sûr que ChatGPT, bien que Grok ait ensuite inondé X d'images nues non consenties."
      },
      "de": {
        "title": "Musk kritisiert OpenAI in Aussage und sagt, \"niemand hat sich wegen Grok das Leben genommen\"",
        "summary": "Während seiner eidesstattlichen Aussage gegen OpenAI pries Elon Musk xAIs Grok als sicherer als ChatGPT an, obwohl Grok später X mit nichtkonsentierten Nacktbildern überschwemmte."
      },
      "es": {
        "title": "Musk critica a OpenAI en declaración, diciendo \"nadie se suicidó por culpa de Grok\"",
        "summary": "Durante su declaración bajo juramento contra OpenAI, Elon Musk promocionó Grok de xAI como más seguro que ChatGPT, aunque Grok posteriormente inundó X con imágenes desnudas no consentidas."
      }
    }
  },
  {
    "title": "The Trump phone sure looks a lot like this HTC handset",
    "slug": "trump-phone-design-htc-handset",
    "url": "https://www.theverge.com/tech/886135/trump-mobile-t1-phone-htc-u24-pro",
    "source": "The Verge",
    "date": "2026-02-27T19:27:12.000Z",
    "summary": "The Trump phone's design appears to closely resemble the HTC U24 Pro, based on detailed design comparisons after the phone's specifications and location remained unclear for months.",
    "content": "The HTC U24 Pro may not be gold, but its design is otherwise awfully similar to the Trump phone’s. | Image: HTC\t\n\nWhere's the Trump phone? We're going to keep talking about it every week. We've reached out, as usual, to ask about the Trump phone's whereabouts, and have stopped getting a response. This week, thanks to a reader tip, we think we've found the original phone the T1 is based on.\nA long time ago, back when the Trump phone was but a single, inaccurate render and a contradictory spec sheet, we tried to figure out what other phone it might be based on. Now, eight months, two spec overhauls, and one redesign later, I have a good guess: the HTC U24 Pro.\nI didn't spot this by myself. A reader first tipped me off to the similarities between the U24 …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "特朗普手机看起来非常像这款HTC手机",
        "summary": "根据详细的设计对比，特朗普手机的设计似乎与HTC U24 Pro非常相似，而该手机的规格和位置数月来一直不明确。"
      },
      "fr": {
        "title": "Le téléphone Trump ressemble beaucoup à ce téléphone HTC",
        "summary": "Le design du téléphone Trump semble étroitement ressembler au HTC U24 Pro, basé sur des comparaisons de design détaillées après que les spécifications et la localisation du téléphone soient restées peu claires pendant des mois."
      },
      "de": {
        "title": "Das Trump-Telefon sieht diesem HTC-Handset sehr ähnlich",
        "summary": "Das Design des Trump-Telefons scheint dem HTC U24 Pro sehr ähnlich zu sein, basierend auf detaillierten Designvergleichen, nachdem die Spezifikationen und der Standort des Telefons Monate lang unklar blieben."
      },
      "es": {
        "title": "El teléfono Trump parece muy similar a este dispositivo HTC",
        "summary": "El diseño del teléfono Trump parece parecerse mucho al HTC U24 Pro, basado en comparaciones de diseño detalladas después de que las especificaciones y la ubicación del teléfono permanecieron poco claras durante meses."
      }
    }
  },
  {
    "title": "Whoops: US military laser strike takes down CBP drone near Mexican border",
    "slug": "military-laser-strikes-cbp-drone-mexican-border",
    "url": "https://arstechnica.com/tech-policy/2026/02/whoops-us-military-laser-strike-takes-down-cbp-drone-near-mexican-border/",
    "source": "Ars Technica",
    "date": "2026-02-27T19:14:51.000Z",
    "summary": "A US military laser strike accidentally downed a CBP drone near the Mexican border, prompting criticism of Trump administration 'incompetence' creating aviation safety hazards.",
    "content": "Trump admin \"incompetence continues to cause chaos in our skies,\" Duckworth says.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "哎呀：美国军方激光击落墨西哥边境附近的CBP无人机",
        "summary": "美国军方的激光不小心在墨西哥边境附近击落了一架CBP无人机，引发了对特朗普政府\"无能\"导致航空安全隐患的批评。"
      },
      "fr": {
        "title": "Oups: une frappe laser militaire américaine abat un drone du CBP près de la frontière mexicaine",
        "summary": "Une frappe laser militaire américaine a accidentellement abattu un drone du CBP près de la frontière mexicaine, provoquant des critiques face à l'« incompétence » de l'administration Trump créant des risques de sécurité aérienne."
      },
      "de": {
        "title": "Hoppla: Ein US-Militärlaserschlag schießt eine CBP-Drohne in der Nähe der mexikanischen Grenze ab",
        "summary": "Ein Laserschlag des US-Militärs schoss versehentlich eine CBP-Drohne in der Nähe der mexikanischen Grenze ab und führte zu Kritik über die \"Inkompetenz\" der Trump-Administration, die Flugsicherheitsrisiken schuf."
      },
      "es": {
        "title": "¡Uy!: Un ataque con láser militar estadounidense derriba un dron del CBP cerca de la frontera mexicana",
        "summary": "Un ataque con láser militar estadounidense derriba accidentalmente un dron del CBP cerca de la frontera mexicana, provocando críticas por la \"incompetencia\" de la administración Trump que crea peligros de seguridad aérea."
      }
    }
  },
  {
    "title": "Anthropic vs. the Pentagon: What’s actually at stake?",
    "slug": "anthropic-pentagon-ai-autonomous-weapons",
    "url": "https://techcrunch.com/2026/02/27/anthropic-vs-the-pentagon-whats-actually-at-stake/",
    "source": "TechCrunch",
    "date": "2026-02-27T19:11:04.000Z",
    "summary": "Anthropic and the Pentagon are clashing over AI use in autonomous weapons and surveillance, raising critical questions about corporate autonomy, national security priorities, and military AI governance.",
    "content": "Anthropic and the Pentagon are clashing over AI use in autonomous weapons and surveillance, raising high-stakes questions about national security, corporate control, and who sets the rules for military AI.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Anthropic与五角大楼的对抗：真正的利害关系是什么？",
        "summary": "Anthropic和五角大楼在AI用于自主武器和监视方面发生冲突，引发了关于企业自主权、国家安全优先事项和军事AI治理的关键问题。"
      },
      "fr": {
        "title": "Anthropic contre le Pentagone: Qu'est-ce qui est vraiment en jeu?",
        "summary": "Anthropic et le Pentagone s'affrontent sur l'utilisation de l'IA dans les armes autonomes et la surveillance, soulevant des questions critiques sur l'autonomie des entreprises, les priorités de sécurité nationale et la gouvernance de l'IA militaire."
      },
      "de": {
        "title": "Anthropic gegen das Pentagon: Was steht wirklich auf dem Spiel?",
        "summary": "Anthropic und das Pentagon sind in Konflikt über die Verwendung von KI in autonomen Waffen und Überwachung verwickelt, was kritische Fragen zur Unternehmensautonomie, nationalen Sicherheitsprioritäten und militärischer KI-Governance aufwirft."
      },
      "es": {
        "title": "Anthropic contra el Pentágono: ¿Qué está realmente en juego?",
        "summary": "Anthropic y el Pentágono están en conflicto sobre el uso de IA en armas autónomas y vigilancia, planteando preguntas críticas sobre la autonomía corporativa, las prioridades de seguridad nacional y la gobernanza de la IA militar."
      }
    }
  },
  {
    "title": "CISA is getting a new acting director after less than a year",
    "slug": "cisa-new-acting-director",
    "url": "https://www.theverge.com/policy/886316/acting-cisa-director-replaced-madhu-gottumukkala",
    "source": "The Verge",
    "date": "2026-02-27T19:06:25.000Z",
    "summary": "The US Cybersecurity and Infrastructure Security Agency (CISA) appointed Nick Andersen as acting director after Madhu Gottumukkala, who uploaded sensitive documents to ChatGPT, transitioned to a different DHS role.",
    "content": "The US Cybersecurity and Infrastructure Security Agency (CISA), which is part of the Department of Homeland Security, is getting a new acting director, as reported by ABC, less than a year after Madhu Gottumukkala took charge of the agency as deputy director and acting director in May 2025. \nCISA's executive assistant director for cybersecurity, Nick Andersen, will become the agency's new acting director while Gottumkkala will now be serving as director of strategic implementation at DHS. The leadership change comes just a month after reports that Gottumkkala uploaded sensitive documents to ChatGPT. Gottumkkala had requested special permiss …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "美国网络安全基础设施安全局获得新的代理主任，任职不到一年",
        "summary": "美国网络安全基础设施安全局(CISA)任命尼克·安德森为代理主任，此前玛德胡·戈图穆卡拉因向ChatGPT上传敏感文件而转调到其他国土安全部门职位。"
      },
      "fr": {
        "title": "L'ANSSI obtient un nouveau directeur par intérim après moins d'un an",
        "summary": "L'Agence de la cybersécurité et de la sécurité des infrastructures des États-Unis (CISA) a nommé Nick Andersen directeur par intérim après que Madhu Gottumukkala, qui avait téléchargé des documents sensibles sur ChatGPT, ait changé de rôle au sein du DHS."
      },
      "de": {
        "title": "CISA bekommt neuen amtierenden Direktor nach weniger als einem Jahr",
        "summary": "Die US-Cybersecurity and Infrastructure Security Agency (CISA) ernannte Nick Andersen zum amtierenden Direktor, nachdem Madhu Gottumukkala, der vertrauliche Dokumente auf ChatGPT hochgeladen hatte, eine andere DHS-Position übernahm."
      },
      "es": {
        "title": "CISA obtiene un nuevo director interino después de menos de un año",
        "summary": "La Agencia de Seguridad Cibernética e Infraestructura de Estados Unidos (CISA) designó a Nick Andersen como director interino después de que Madhu Gottumukkala, quien cargó documentos sensibles en ChatGPT, pasara a un rol diferente en el DHS."
      }
    }
  },
  {
    "title": "The AI apocalypse is nigh in Good Luck, Have Fun, Don't Die",
    "slug": "good-luck-have-fun-dont-die-ai-film",
    "url": "https://arstechnica.com/culture/2026/02/the-ai-apocalypse-is-nigh-in-good-luck-have-fun-dont-die/",
    "source": "Ars Technica",
    "date": "2026-02-27T19:04:23.000Z",
    "summary": "Director Gore Verbinski and screenwriter Matthew Robinson discuss their darkly satirical sci-fi film that explores artificial intelligence and apocalyptic themes.",
    "content": "Director Gore Verbinksi and screenwriter Matthew Robinson on the making of this darkly satirical sci-fi film.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "《祝你好运，玩得开心，别死了》中AI启示录近在咫尺",
        "summary": "导演戈尔·维比茨基和编剧马修·罗宾逊讨论他们黑暗讽刺的科幻电影，该电影探讨了人工智能和末世主题。"
      },
      "fr": {
        "title": "L'apocalypse de l'IA est imminente dans Good Luck, Have Fun, Don't Die",
        "summary": "Le réalisateur Gore Verbinski et le scénariste Matthew Robinson discutent de leur film de science-fiction satirique et sinistre qui explore l'intelligence artificielle et les thèmes apocalyptiques."
      },
      "de": {
        "title": "Die KI-Apokalypse steht unmittelbar bevor in Good Luck, Have Fun, Don't Die",
        "summary": "Regisseur Gore Verbinski und Drehbuchautor Matthew Robinson diskutieren ihren dunkel satirischen Science-Fiction-Film, der künstliche Intelligenz und apokalyptische Themen erforscht."
      },
      "es": {
        "title": "El apocalipsis de la IA está cerca en Good Luck, Have Fun, Don't Die",
        "summary": "El director Gore Verbinski y el guionista Matthew Robinson discuten su película de ciencia ficción satírica y oscura que explora la inteligencia artificial y temas apocalípticos."
      }
    }
  },
  {
    "title": "AI deepfakes are a train wreck and Samsung&#8217;s selling tickets",
    "slug": "samsung-ai-deepfakes-photographic-evidence",
    "url": "https://www.theverge.com/tech/885727/samsung-execs-unpacked-ai-deepfake-photos-vs-reality-c2pa",
    "source": "The Verge",
    "date": "2026-02-27T18:54:47.000Z",
    "summary": "Samsung executives addressed the societal divide over AI's role in photography and video, as deepfakes increasingly undermine trust in photographic evidence and visual authenticity.",
    "content": "On Thursday morning, I attended a Q&A panel with four top Samsung smartphone executives. Until 2025, Samsung was the world's largest smartphone manufacturer, and by association, the world's largest maker of cameras. It's still the second largest after Apple.\nSamsung handed me the microphone first. I asked:\nWe see a divide in society between people who want AI to do impressive things with their photos and videos, and those who don't want AI to do anything with photos and videos because it's eroding our ability to believe that what we have seen is real, destroying the concept of photographic evidence.\nMetadata tools like C2PA have utterl …\n\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "人工智能深度伪造是一场灾难，三星正在出售门票",
        "summary": "三星高管们针对人工智能在摄影和视频中的角色所引发的社会分裂发表了看法，深度伪造日益侵蚀了人们对摄影证据和视觉真实性的信任。"
      },
      "fr": {
        "title": "Les deepfakes d'IA sont un désastre et Samsung vend des billets",
        "summary": "Les dirigeants de Samsung ont abordé le clivage sociétal sur le rôle de l'IA dans la photographie et la vidéo, alors que les deepfakes nuisent de plus en plus à la confiance dans les preuves photographiques et l'authenticité visuelle."
      },
      "de": {
        "title": "KI-Deepfakes sind ein Desaster und Samsung verkauft Tickets",
        "summary": "Samsung-Führungskräfte sprachen über die gesellschaftliche Spaltung bezüglich der Rolle von KI in der Fotografie und im Video, da Deepfakes zunehmend das Vertrauen in fotografische Beweise und visuelle Authentizität untergraben."
      },
      "es": {
        "title": "Los deepfakes de IA son un desastre y Samsung está vendiendo entradas",
        "summary": "Los ejecutivos de Samsung abordaron la división social sobre el papel de la IA en la fotografía y el video, mientras que los deepfakes socavan cada vez más la confianza en la evidencia fotográfica y la autenticidad visual."
      }
    }
  },
  {
    "title": "Hyperion author Dan Simmons dies from stroke at 77",
    "slug": "hyperion-author-dan-simmons-dies",
    "url": "https://arstechnica.com/culture/2026/02/hyperion-author-dan-simmons-dies-from-stroke-at-77/",
    "source": "Ars Technica",
    "date": "2026-02-27T18:36:04.000Z",
    "summary": "Dan Simmons, the acclaimed author of the science fiction epic Hyperion, has died from a stroke at age 77. His influential work left a lasting impact on the sci-fi genre and readers worldwide.",
    "content": "I went into Hyperion blind, decades ago, knowing almost nothing about it. I was never the same.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "《超级时空》作者丹·西蒙斯因中风逝世，享年77岁",
        "summary": "被誉为科幻史诗《超级时空》作者的丹·西蒙斯因中风去世，享年77岁。他的影响力工作对科幻小说类型和世界各地的读者产生了持久的影响。"
      },
      "fr": {
        "title": "L'auteur d'Hyperion Dan Simmons décède d'un accident vasculaire cérébral à 77 ans",
        "summary": "Dan Simmons, l'auteur acclamé de l'épopée de science-fiction Hyperion, est décédé d'un accident vasculaire cérébral à l'âge de 77 ans. Son travail influent a laissé un impact durable sur le genre de la science-fiction et les lecteurs du monde entier."
      },
      "de": {
        "title": "Hyperion-Autor Dan Simmons stirbt mit 77 Jahren an Schlaganfall",
        "summary": "Dan Simmons, der gefeierte Autor des Science-Fiction-Epos Hyperion, ist mit 77 Jahren an einem Schlaganfall gestorben. Sein einflussreiches Werk hinterließ einen bleibenden Eindruck auf das Science-Fiction-Genre und Leser auf der ganzen Welt."
      },
      "es": {
        "title": "El autor de Hyperion Dan Simmons muere por accidente cerebrovascular a los 77 años",
        "summary": "Dan Simmons, el aclamado autor de la epopeya de ciencia ficción Hyperion, ha muerto por un accidente cerebrovascular a los 77 años. Su obra influyente dejó un impacto duradero en el género de la ciencia ficción y en lectores de todo el mundo."
      }
    }
  },
  {
    "title": "FedEx will refund customers for Trump&#8217;s tariffs — if there ever are any refunds",
    "slug": "fedex-refund-trump-tariffs",
    "url": "https://www.theverge.com/policy/886216/fedex-trump-tariff-refunds",
    "source": "The Verge",
    "date": "2026-02-27T18:36:02.000Z",
    "summary": "FedEx announced it will refund customers for tariff payments following the Supreme Court's ruling that some Trump tariffs are illegal, though no formal refund process exists yet. The company filed a lawsuit seeking full reimbursement of tariff costs.",
    "content": "FedEx plans to pass along any refunds resulting from the Supreme Court's ruling that some of President Donald Trump's tariffs are \"illegal.\" In a statement on its website, FedEx notes that while \"no refund process has been established by the courts,\" the company will reimburse shippers and consumers impacted by tariffs if it gets its money back.\nThe delivery giant issued the statement after filing a lawsuit in the US Court of International Trade, asking the Trump administration for a \"full refund\" of tariff payments. Though FedEx covers the cost of duties and tariffs on a customer's behalf when packages arrive in the US, it bills customers  …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "FedEx 将为特朗普关税退款给客户——如果真的有任何退款的话",
        "summary": "FedEx 宣布将根据最高法院裁定某些特朗普关税非法后为客户退款，但目前还没有正式的退款流程。该公司提起诉讼，寻求对关税成本的全额赔偿。"
      },
      "fr": {
        "title": "FedEx remboursera les clients pour les tarifs douaniers de Trump — s'il y a jamais des remboursements",
        "summary": "FedEx a annoncé qu'il remboursera les clients pour les paiements de tarifs douaniers suite à la décision de la Cour suprême selon laquelle certains tarifs douaniers de Trump sont illégaux, bien qu'aucun processus de remboursement formel n'existe encore. L'entreprise a intenté une action en justice pour obtenir le remboursement intégral des coûts des tarifs douaniers."
      },
      "de": {
        "title": "FedEx wird Kunden für Trumps Zölle erstattet — wenn es jemals Rückerstattungen gibt",
        "summary": "FedEx kündigte an, dass es Kunden für Zollzahlungen erstattet, nachdem der Oberste Gerichtshof festgestellt hatte, dass einige Trump-Zölle illegal sind, obwohl es noch keinen formalen Rückerstattungsprozess gibt. Das Unternehmen reichte eine Klage ein, um eine vollständige Rückerstattung der Zollkosten zu erhalten."
      },
      "es": {
        "title": "FedEx reembolsará a los clientes por los aranceles de Trump — si es que alguna vez hay reembolsos",
        "summary": "FedEx anunció que reembolsará a los clientes los pagos de aranceles tras la sentencia de la Corte Suprema que declara ilegales algunos aranceles de Trump, aunque aún no existe un proceso de reembolso formal. La empresa presentó una demanda buscando el reembolso total de los costos de los aranceles."
      }
    }
  },
  {
    "title": "Amazon’s Fire TV Stick 4K Plus gets a better interface and a 40 percent discount",
    "slug": "amazon-fire-tv-stick-4k-plus-sale",
    "url": "https://www.theverge.com/gadgets/886153/amazon-fire-tv-stick-4k-plus-deal-sale",
    "source": "The Verge",
    "date": "2026-02-27T18:32:53.000Z",
    "summary": "Amazon's redesigned Fire TV OS is rolling out to the Fire TV Stick 4K Plus, now on sale for $29.99 (40% off) with improved navigation and organization. The update includes new content tabs, support for more pinned apps, and enhanced voice controls.",
    "content": "Amazon’s Fire TV Stick 4K Plus is on sale for $29.99, which is $5 shy of its best price. | Image: Amazon\t\n\nWhen Amazon first showed off its redesigned Fire TV OS at CES, we were impressed. It’s faster, better organized, and feels similar to Google’s top-notch TV interface. The update is now finally rolling out to the Amazon Fire TV Stick 4K Plus, making it an even better buy now that it’s on sale for $29.99 ($20 off) at Amazon, Best Buy, and Target — $5 shy of its best price to date. If you want something cheaper and don’t mind waiting for the update to arrive, the Amazon Fire TV Stick 4K Select is also on sale at Amazon, Best Buy, and Target, for $19.99 ($20 off), which is $2 more than its all-time low price.\nAmazon Fire TV Stick 4K Plus\n\nWhere to Buy:\n\n $49.99 $29.99 at Target\n $49.99 $29.99 at Amazon\n $49.99 $29.99 at Best Buy\n\nThe new Fire TV OS update makes navigating content even easier, adding tabs across the top for search, home, movies, TV shows, sports, news, and live content that pull recommendations from all of your subscriptions. Your apps now live on their own row, and you can pin up to 20 favorites instead of just six. You also get support for Alexa Plus, letting you search for specific types of content with your voice, jump to particular scenes, control compatible smart home devices, check sports scores, and more. The update also improves the remote, with a long press of the Home button opening a panel so you can quickly adjust audio or check on devices like Ring cameras.\nThe Fire TV Stick 4K Plus is also a good streaming device on the hardware front. The middle child in the Fire TV stick lineup, it offers half the storage of the $40 Fire TV Stick 4K, but otherwise shares support for HDR10 Plus, Dolby Vision, and Dolby Atmos. You also get an Alexa Voice Remote included, for quick access to apps and voice controls. For most people, it offers a good balance between features and price.\nAmazon Fire TV Stick 4K Select\n\nWhere to Buy:\n\n $39.99 $19.99 at Ama",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "亚马逊Fire TV Stick 4K Plus获得更好的界面和40%折扣",
        "summary": "亚马逊重新设计的Fire TV OS正在推向Fire TV Stick 4K Plus,现在以$29.99(40%折扣)的价格出售,具有改进的导航和组织功能。该更新包括新的内容标签、对更多固定应用的支持以及增强的语音控制。"
      },
      "fr": {
        "title": "Amazon Fire TV Stick 4K Plus bénéficie d'une meilleure interface et d'une réduction de 40%",
        "summary": "Le système d'exploitation Fire TV redessiné d'Amazon est déployé sur le Fire TV Stick 4K Plus, désormais en vente à 29,99$ (40% de réduction) avec une navigation et une organisation améliorées. La mise à jour comprend de nouveaux onglets de contenu, le support de davantage d'applications épinglées et des contrôles vocaux améliorés."
      },
      "de": {
        "title": "Amazons Fire TV Stick 4K Plus bekommt eine bessere Benutzeroberfläche und 40% Rabatt",
        "summary": "Amazons neu gestaltetes Fire TV OS wird auf das Fire TV Stick 4K Plus ausgerollt und ist jetzt für $29,99 (40% Rabatt) mit verbesserter Navigation und Organisation erhältlich. Das Update umfasst neue Inhaltsregisterkarten, Unterstützung für mehr angeheftete Apps und verbesserte Sprachsteuerung."
      },
      "es": {
        "title": "Amazon Fire TV Stick 4K Plus obtiene una mejor interfaz y un descuento del 40%",
        "summary": "El sistema operativo Fire TV rediseñado de Amazon se está implementando en el Fire TV Stick 4K Plus, ahora disponible por $29.99 (40% de descuento) con navegación y organización mejoradas. La actualización incluye nuevas pestañas de contenido, compatibilidad con más aplicaciones fijadas y controles de voz mejorados."
      }
    }
  },
  {
    "title": "ChatGPT reaches 900M weekly active users",
    "slug": "chatgpt-900m-weekly-active-users",
    "url": "https://techcrunch.com/2026/02/27/chatgpt-reaches-900m-weekly-active-users/",
    "source": "TechCrunch",
    "date": "2026-02-27T18:25:51.000Z",
    "summary": "OpenAI announced that ChatGPT has reached 900 million weekly active users while the company raised $110 billion in new private funding. The milestone demonstrates continued rapid adoption of the AI chatbot.",
    "content": "OpenAI shared the new numbers as part of its announcement that it has raised $110 billion in private funding.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "ChatGPT达到9亿周活跃用户",
        "summary": "OpenAI宣布ChatGPT已达到9亿周活跃用户,同时该公司筹集了1100亿美元的新私募融资。这一里程碑证明了AI聊天机器人的持续快速采用。"
      },
      "fr": {
        "title": "ChatGPT atteint 900 millions d'utilisateurs actifs par semaine",
        "summary": "OpenAI a annoncé que ChatGPT a atteint 900 millions d'utilisateurs actifs par semaine tandis que l'entreprise levait 110 milliards de dollars en nouveaux financements privés. Cette étape démontre l'adoption continue et rapide du chatbot IA."
      },
      "de": {
        "title": "ChatGPT erreicht 900 Millionen wöchentlich aktive Benutzer",
        "summary": "OpenAI kündigte an, dass ChatGPT 900 Millionen wöchentlich aktive Benutzer erreicht hat, während das Unternehmen 110 Milliarden Dollar an neuer privater Finanzierung aufbrachte. Der Meilenstein demonstriert die anhaltend schnelle Akzeptanz des KI-Chatbots."
      },
      "es": {
        "title": "ChatGPT alcanza 900 millones de usuarios activos semanales",
        "summary": "OpenAI anunció que ChatGPT ha alcanzado 900 millones de usuarios activos semanales mientras la empresa recaudó 110 mil millones de dólares en nueva financiación privada. El hito demuestra la adopción rápida y continua del chatbot de IA."
      }
    }
  },
  {
    "title": "AI music generator Suno hits 2M paid subscribers and $300M in annual recurring revenue",
    "slug": "ai-music-generator-suno-2m-subscribers-300m-arr",
    "url": "https://techcrunch.com/2026/02/27/ai-music-generator-suno-hits-2-million-paid-subscribers-and-300m-in-annual-recurring-revenue/",
    "source": "TechCrunch",
    "date": "2026-02-27T17:22:02.000Z",
    "summary": "Suno, an AI music generator enabling users to create music via natural language prompts, has reached 2 million paid subscribers and $300 million in annual recurring revenue. The milestone demonstrates strong commercial adoption of AI-powered creative tools among consumers. The platform's success underscores growing demand for democratized music production.",
    "content": "Suno lets users create music using natural language prompts, making it possible for people with little experience to generate audio with little effort.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "AI音乐生成器Suno达到200万付费订阅者和3亿美元年度经常性收入",
        "summary": "Suno是一个AI音乐生成器，允许用户通过自然语言提示创作音乐，已达到200万付费订阅者和3亿美元年度经常性收入。这一里程碑表明AI驱动的创意工具在消费者中获得了强劲的商业采用。该平台的成功强调了对民主化音乐制作日益增长的需求。"
      },
      "fr": {
        "title": "Le générateur de musique IA Suno atteint 2M d'abonnés payants et 300M $ de revenu annuel récurrent",
        "summary": "Suno, un générateur de musique IA permettant aux utilisateurs de créer de la musique via des invites en langage naturel, a atteint 2 millions d'abonnés payants et 300 millions de dollars de revenu annuel récurrent. Le jalon démontre une forte adoption commerciale des outils créatifs alimentés par l'IA parmi les consommateurs. Le succès de la plateforme souligne une demande croissante de production musicale démocratisée."
      },
      "de": {
        "title": "KI-Musikgenerator Suno erreicht 2 Millionen bezahlte Abonnenten und 300 Millionen Dollar jährlich wiederkehrende Einnahmen",
        "summary": "Suno, ein KI-Musikgenerator, der Benutzer befähigt, Musik über natürlichsprachliche Eingaben zu erstellen, hat 2 Millionen bezahlte Abonnenten und 300 Millionen Dollar jährlich wiederkehrende Einnahmen erreicht. Der Meilenstein zeigt eine starke kommerzielle Adoption von KI-gesteuerten Kreativwerkzeugen bei Verbrauchern. Der Erfolg der Plattform unterstreicht die wachsende Nachfrage nach demokratisierter Musikproduktion."
      },
      "es": {
        "title": "El generador de música IA Suno alcanza 2M de suscriptores pagos y $300M en ingresos recurrentes anuales",
        "summary": "Suno, un generador de música IA que permite a los usuarios crear música a través de indicaciones de lenguaje natural, ha alcanzado 2 millones de suscriptores pagos y 300 millones de dólares en ingresos recurrentes anuales. El hito demuestra una fuerte adopción comercial de herramientas creativas impulsadas por IA entre los consumidores. El éxito de la plataforma subraya la creciente demanda de producción musical democratizada."
      }
    }
  },
  {
    "title": "How strong is New York's \"illegal gambling\" case against Valve's loot boxes?",
    "slug": "new-york-case-valve-loot-boxes",
    "url": "https://arstechnica.com/gaming/2026/02/how-strong-is-new-yorks-illegal-gambling-case-against-valves-loot-boxes/",
    "source": "Ars Technica",
    "date": "2026-02-27T17:21:21.000Z",
    "summary": "New York has filed an \"illegal gambling\" case against Valve over loot box mechanics, though legal experts say the state faces a challenging path despite Valve's unique vulnerabilities. The case could set precedent for gaming regulation.",
    "content": "Lawyers tell Ars the state has a tough road ahead, even as Valve is uniquely vulnerable.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "纽约针对Valve战利品箱的\"非法赌博\"案件有多强?",
        "summary": "纽约针对Valve的战利品箱机制提起了\"非法赌博\"诉讼,尽管法律专家表示该州面临着艰难的道路,但Valve存在独特的漏洞。该案件可能为游戏监管设立先例。"
      },
      "fr": {
        "title": "Quelle est la force du dossier d'\"jeu d'argent illégal\" de New York contre les coffres à butin de Valve?",
        "summary": "New York a déposé une action en \"jeu d'argent illégal\" contre Valve concernant la mécanique des coffres à butin, bien que les experts juridiques disent que l'État fait face à un chemin difficile malgré les vulnérabilités uniques de Valve. L'affaire pourrait établir un précédent pour la réglementation des jeux vidéo."
      },
      "de": {
        "title": "Wie stark ist New Yorks \"illegales Glücksspiel\"-Fall gegen Valves Loot Boxen?",
        "summary": "New York hat eine \"illegales Glücksspiel\"-Klage gegen Valve wegen der Loot-Box-Mechanik eingereicht, obwohl Rechtsexperten sagen, dass der Staat trotz Valves einzigartiger Schwachstellen mit einem schwierigen Weg konfrontiert ist. Der Fall könnte einen Präzedenzfall für Spielregulierung schaffen."
      },
      "es": {
        "title": "¿Qué tan fuerte es el caso de \"juego ilegal\" de Nueva York contra las cajas de botín de Valve?",
        "summary": "Nueva York ha presentado un caso de \"juego ilegal\" contra Valve por la mecánica de cajas de botín, aunque los expertos legales dicen que el estado enfrenta un camino desafiante a pesar de las vulnerabilidades únicas de Valve. El caso podría establecer un precedente para la regulación de videojuegos."
      }
    }
  },
  {
    "title": "Apple and Netflix team up to air Formula 1 Canadian Grand Prix",
    "slug": "apple-netflix-formula-1-canadian-grand-prix",
    "url": "https://techcrunch.com/2026/02/27/apple-and-netflix-team-up-to-air-formula-1-canadian-grand-prix/",
    "source": "TechCrunch",
    "date": "2026-02-27T17:17:18.000Z",
    "summary": "Netflix and Apple have partnered to air the Formula 1 Canadian Grand Prix, expanding Netflix's investment in live sports content. The collaboration brings premium sports programming to both platforms' audiences. The partnership reflects intensifying competition among streaming services for exclusive sports rights.",
    "content": "As Netflix continues its live sports push, the company has partnered with Apple to air the Formula 1 Canadian Grand Prix.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Apple和Netflix合作转播一级方程式加拿大大奖赛",
        "summary": "Netflix和Apple已联手转播一级方程式加拿大大奖赛，扩展了Netflix在直播体育内容中的投资。这一合作为两个平台的受众带来了优质体育编程。该伙伴关系反映了流媒体服务之间在独家体育版权竞争中的加剧。"
      },
      "fr": {
        "title": "Apple et Netflix s'associent pour diffuser le Grand Prix de Formule 1 du Canada",
        "summary": "Netflix et Apple se sont associés pour diffuser le Grand Prix de Formule 1 du Canada, élargissant l'investissement de Netflix dans le contenu sportif en direct. La collaboration apporte une programmation sportive premium aux audiences des deux plates-formes. Le partenariat reflète l'intensification de la concurrence entre les services de streaming pour les droits sportifs exclusifs."
      },
      "de": {
        "title": "Apple und Netflix arbeiten zusammen, um den Formel-1-Großpreis von Kanada auszustrahlen",
        "summary": "Netflix und Apple haben sich zusammengetan, um den Formel-1-Großpreis von Kanada auszustrahlen und Netflixs Investitionen in Live-Sportinhalte zu erweitern. Die Zusammenarbeit bringt hochwertige Sportprogramme an beide Plattformen-Zielgruppen. Die Partnerschaft spiegelt den intensiveren Wettbewerb unter Streaming-Diensten um exklusive Sportrechte wider."
      },
      "es": {
        "title": "Apple y Netflix se unen para transmitir el Gran Premio de Fórmula 1 de Canadá",
        "summary": "Netflix y Apple se han asociado para transmitir el Gran Premio de Fórmula 1 de Canadá, expandiendo la inversión de Netflix en contenido deportivo en vivo. La colaboración trae programación deportiva premium a las audiencias de ambas plataformas. La asociación refleja la intensificación de la competencia entre servicios de streaming por derechos deportivos exclusivos."
      }
    }
  },
  {
    "title": "AI vs. the Pentagon: killer robots, mass surveillance, and red lines",
    "slug": "ai-pentagon-killer-robots-mass-surveillance",
    "url": "https://www.theverge.com/ai-artificial-intelligence/886082/ai-vs-the-pentagon-killer-robots-mass-surveillance-and-red-lines",
    "source": "The Verge",
    "date": "2026-02-27T17:16:53.000Z",
    "summary": "Anthropic is refusing Pentagon demands to remove AI guardrails that would enable mass surveillance and fully autonomous lethal weapons, risking designation as a \"supply chain risk.\" CEO Dario Amodei has maintained this position through high-level negotiations despite potential commercial consequences. Competitors OpenAI and xAI have reportedly agreed to the Pentagon's terms, making Anthropic's stance an industry outlier.",
    "content": "WASHINGTON, DC - JANUARY 29: U.S. Secretary of War Pete Hegseth (C) speaks during a meeting of the Cabinet as U.S. President Donald Trump (L) and U.S. Commerce Secretary Howard Lutnick (R) listen in the Cabinet Room of the White House on January 29, 2026 in Washington, DC. President Trump is holding the meeting as the Senate plans to hold a vote on a spending package to avoid another government shutdown, however Democrats are holding out for a deal to consider funding for the Department of Homeland Security.  (Photo by Win McNamee/Getty Images) | Getty Images\t\n\nCan AI firms set limits on how and where the military uses their models? Anthropic is in heated negotiations with the Pentagon after refusing to comply with new military contract terms that would require it to loosen the guardrails on its AI models, allowing for “any lawful use,” even mass surveillance of Americans and fully autonomous lethal weapons. \nPentagon CTO Emil Michael is pushing for Anthropic to be designated a “supply chain risk” if it doesn’t comply, a label usually only given to national security threats. Anthropic’s rivals OpenAI and xAI have reportedly agreed to the new terms, but even after a White House meeting with Defense Secretary Pete Hegseth, Anthropic CEO Dario Amodei is still refusing to cross his company’s red line, stating that “threats do not change our position: we cannot in good conscience accede to their request.”\nFollow along here for the latest updates on the clash between AI companies and the Pentagon…\nWe don’t have to have unsupervised killer robots\n\t\t\t\nAnthropic refuses Pentagon’s new terms, standing firm on lethal autonomous weapons and mass surveillance\n\t\t\t\nPete Hegseth’s Pentagon AI bro squad includes a former Uber executive and a private equity billionaire\n\t\t\t\nInside Anthropic’s existential negotiations with the Pentagon",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "AI对阵五角大楼：杀手机器人、大规模监视和红线",
        "summary": "Anthropic正在拒绝五角大楼的要求，即删除AI护栏，这些护栏会导致大规模监视和完全自主致命武器，面临被指定为\"供应链风险\"的风险。首席执行官达里奥·阿莫代伊在高层谈判中保持了这一立场，尽管存在潜在的商业后果。据报道，竞争对手OpenAI和xAI已同意五角大楼的条款，使Anthropic的立场成为行业异类。"
      },
      "fr": {
        "title": "L'IA contre le Pentagone : robots tueurs, surveillance de masse et lignes rouges",
        "summary": "Anthropic refuse les demandes du Pentagone de supprimer les garde-fous de l'IA qui permettraient la surveillance de masse et les armes autonomes entièrement léthales, risquant d'être désignée comme un « risque de la chaîne d'approvisionnement ». Le PDG Dario Amodei a maintenu cette position à travers des négociations de haut niveau malgré les conséquences commerciales potentielles. Les concurrents OpenAI et xAI auraient accepté les conditions du Pentagone, faisant de la position d'Anthropic un cas isolé dans l'industrie."
      },
      "de": {
        "title": "KI gegen das Pentagon: Killertechnik, Massenüberwachung und rote Linien",
        "summary": "Anthropic verweigert Forderungen des Pentagons, KI-Schutzvorrichtungen zu entfernen, die Massenüberwachung und vollständig autonome tödliche Waffen ermöglichen würden, und riskiert damit, als \"Supply-Chain-Risiko\" eingestuft zu werden. CEO Dario Amodei hat diese Position trotz potenzieller geschäftlicher Konsequenzen durch hochrangige Verhandlungen beibehalten. Konkurrenten OpenAI und xAI haben Berichten zufolge den Bedingungen des Pentagons zugestimmt, was Anthropics Haltung zu einem Ausreißer in der Branche macht."
      },
      "es": {
        "title": "IA contra el Pentágono: robots asesinos, vigilancia masiva y líneas rojas",
        "summary": "Anthropic está rechazando las demandas del Pentágono para eliminar protecciones de IA que permitirían la vigilancia masiva y armas totalmente autónomas y letales, arriesgándose a ser designada como un \"riesgo de cadena de suministro\". El director ejecutivo Dario Amodei ha mantenido esta posición a través de negociaciones de alto nivel a pesar de las posibles consecuencias comerciales. Se informa que los competidores OpenAI y xAI han aceptado los términos del Pentágono, lo que hace que la postura de Anthropic sea un caso atípico en la industria."
      }
    }
  },
  {
    "title": "Woot’s ‘Video Games for All’ sale features some of our favorite games",
    "slug": "woots-video-games-for-all-sale",
    "url": "https://www.theverge.com/gadgets/885334/woot-ps5-nintendo-switch-video-game-sale-lg-c5-oled-tv-deal",
    "source": "The Verge",
    "date": "2026-02-27T17:12:31.000Z",
    "summary": "Woot is running a \"Video Games for All\" sale through March 5 featuring significant discounts on physical games and accessories for major consoles. An additional 20% off code LEVEL20 is available through February 27, with major titles like Elden Ring and The Legend of Zelda marked down substantially. The sale offers Black Friday-level pricing for game purchases.",
    "content": "There’s a sale happening at Woot that’s delivering Black Friday-esque deals on video games through March 5th. The “Video Games for All” sale includes discounts on physical games for most modern consoles, making it a great time to treat yourself (or a pal) to some titles that you’ve been waiting to see big price drops for. There are also deals on gaming accessories like totes, controllers, and more. Through February 27th at 11:58PM CT, you can score an additional 20 percent off products looped into this sale by entering the code LEVEL20 at checkout (it caps at $30 total off your order).\nEveryone’s tastes are different, but some picks in this sale that especially vibe with me include Silent Hill F, which is fun and very different beast from Bloober Team’s Silent Hill 2 remake (less item hunting, more countering enemy attacks). Of course, who can argue against the pure fun contained within the Super Mario Galaxy double-pack for Switch that includes the original title and its sequel? It’s always cliché to say that there’s something for everyone here, but I think it’s actually true this time.\nElden Ring\n \n\nWhere to Buy:\n\n $49.99 $15.99 at Woot (PS5)\n\nThe Legend of Zelda: Echoes of Wisdom\n \n\nWhere to Buy:\n\n $59.99 $37.59 at Woot (Switch)\n\nSilent Hill F\n\nWhere to Buy:\n\n $69.99 $35.99 at Woot (PS5)\n\nMetaphor: ReFantazio\n \n\nWhere to Buy:\n\n $69.99 $14.39 at Woot (Xbox)\n\nBalatro: Special Edition\n\nWhere to Buy:\n\n $29.99 $13.59 at Woot (Switch)\n\nSuper Smash Bros. Ultimate\n \n\nWhere to Buy:\n\n $59.99 $37.59 at Woot (Switch)\n\nMario Kart 8 Deluxe\n \n\nWhere to Buy:\n\n $59.99 $37.59 at Woot (Switch)\n\nSuper Mario Galaxy + Super Mario Galaxy 2 bundle\n\nWhere to Buy:\n\n $69.99 $47.19 at Woot (Switch)\n\nMore deals and discounts\nSometimes, a rug or table can pull the room together. In the event that doesn’t work, Govee’s Pendant Light might just be the ticket. This height-adjustable smart light makes for a fun upgrade in your home, and it’s now selling at its lowest price yet at Amazon. Normally",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Woot的\"全民视频游戏\"促销活动展现我们最喜爱的游戏",
        "summary": "Woot正在运行一个\"全民视频游戏\"促销活动，至3月5日，在主要游戏机上提供大量物理游戏和配件的折扣。额外20%折扣代码LEVEL20可用至2月27日，《艾尔登法环》和《塞尔达传说》等大作大幅降价。该促销提供黑色星期五级别的游戏购买价格。"
      },
      "fr": {
        "title": "La vente \"Jeux vidéo pour tous\" de Woot présente certains de nos jeux préférés",
        "summary": "Woot exécute une vente \"Jeux vidéo pour tous\" jusqu'au 5 mars avec des réductions importantes sur les jeux physiques et les accessoires pour les principales consoles. Un code supplémentaire de 20% de réduction LEVEL20 est disponible jusqu'au 27 février, avec des titres majeurs comme Elden Ring et The Legend of Zelda marqués avec des réductions substantielles. La vente offre des prix de niveau Black Friday pour les achats de jeux."
      },
      "de": {
        "title": "Woots \"Videospiele für alle\" Verkauf zeigt einige unserer Lieblingsspiele",
        "summary": "Woot führt einen \"Videospiele für alle\" Verkauf bis zum 5. März durch, mit erheblichen Rabatten auf physische Spiele und Zubehör für große Konsolen. Ein zusätzlicher 20%-Rabattcode LEVEL20 ist bis zum 27. Februar verfügbar, wobei große Titel wie Elden Ring und The Legend of Zelda erheblich herabgesetzt werden. Der Verkauf bietet Black-Friday-ähnliche Preise für Spielekäufe."
      },
      "es": {
        "title": "La venta \"Videojuegos para todos\" de Woot presenta algunos de nuestros juegos favoritos",
        "summary": "Woot está ejecutando una venta \"Videojuegos para todos\" hasta el 5 de marzo con descuentos significativos en juegos físicos y accesorios para las principales consolas. Un código de descuento adicional del 20% LEVEL20 está disponible hasta el 27 de febrero, con títulos importantes como Elden Ring y The Legend of Zelda marcados con descuentos sustanciales. La venta ofrece precios de Black Friday para compras de videojuegos."
      }
    }
  },
  {
    "title": "Perplexity’s new Computer is another bet that users need many AI models",
    "slug": "perplexity-computer-unified-ai-models",
    "url": "https://techcrunch.com/2026/02/27/perplexitys-new-computer-is-another-bet-that-users-need-many-ai-models/",
    "source": "TechCrunch",
    "date": "2026-02-27T17:00:55.000Z",
    "summary": "Perplexity has launched a product called Computer that consolidates multiple AI capabilities into a unified system. The release reflects Perplexity's bet that users need integrated access to diverse AI models and functionalities. The move positions Perplexity as a platform aggregator in competitive AI search and information services.",
    "content": "Perplexity Computer, in the company’s words, \"unifies every current AI capability into a single system.\"",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Perplexity的新Computer是用户需要多种AI模型的又一个赌注",
        "summary": "Perplexity推出了一款名为Computer的产品，将多个AI功能整合为一个统一系统。该发布反映了Perplexity的赌注，即用户需要集成访问多种AI模型和功能。此举将Perplexity定位为竞争性AI搜索和信息服务中的平台聚合器。"
      },
      "fr": {
        "title": "Le nouvel ordinateur de Perplexity est un autre pari que les utilisateurs ont besoin de nombreux modèles d'IA",
        "summary": "Perplexity a lancé un produit appelé Computer qui consolide plusieurs capacités d'IA dans un système unifié. La version reflète le pari de Perplexity selon lequel les utilisateurs ont besoin d'un accès intégré à divers modèles et fonctionnalités d'IA. Ce mouvement positionne Perplexity comme un agrégateur de plate-forme dans les services de recherche et d'information IA compétitifs."
      },
      "de": {
        "title": "Perplexitys neuer Computer ist ein weiterer Einsatz, dass Nutzer viele KI-Modelle brauchen",
        "summary": "Perplexity hat ein Produkt namens Computer gestartet, das mehrere KI-Funktionen in einem einheitlichen System konsolidiert. Die Veröffentlichung spiegelt Perplexitys Wette wider, dass Benutzer integrierten Zugriff auf verschiedene KI-Modelle und Funktionalitäten benötigen. Der Schritt positioniert Perplexity als Plattformaggregator in wettbewerbsfähigen KI-Such- und Informationsdiensten."
      },
      "es": {
        "title": "El nuevo Computer de Perplexity es otra apuesta de que los usuarios necesitan muchos modelos de IA",
        "summary": "Perplexity ha lanzado un producto llamado Computer que consolida múltiples capacidades de IA en un sistema unificado. El lanzamiento refleja la apuesta de Perplexity de que los usuarios necesitan acceso integrado a diversos modelos y funcionalidades de IA. El movimiento posiciona a Perplexity como un agregador de plataforma en servicios competitivos de búsqueda e información de IA."
      }
    }
  },
  {
    "title": "‘Pokémon Winds and Waves’ are coming to the Nintendo Switch 2 in 2027",
    "slug": "pokemon-winds-waves-nintendo-switch-2-2027",
    "url": "https://techcrunch.com/2026/02/27/pokemon-winds-and-waves-are-coming-to-the-nintendo-switch-2-in-2027/",
    "source": "TechCrunch",
    "date": "2026-02-27T16:57:21.000Z",
    "summary": "Nintendo and The Pokémon Company announced \"Pokémon Winds and Waves\" for Nintendo Switch 2 in 2027, with three new tenth-generation starter Pokémon: Browt (grass bird), Pombon (fire puppy), and Gecqua (water gecko). The reveal marks the beginning of the next mainline Pokémon generation on the upcoming console. The announcement comes alongside broader Switch 2 platform launch expectations.",
    "content": "The tenth generation starter Pokémon were revealed in the trailer: Browt (a grass bird), Pombon (a fire puppy), and Gecqua (a water gecko).",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "《宝可梦风与浪》将于2027年登陆任天堂Switch 2",
        "summary": "任天堂和宝可梦公司宣布《宝可梦风与浪》将于2027年登陆任天堂Switch 2，推出三只新的第十代首发宝可梦：布劳特（草系飞行）、庞邦（火系小狗）和盖克瓜（水系壁虎）。该揭示标志着下一代主线宝可梦在即将推出的主机上的开始。这项公告与Switch 2平台的更广泛发布期望一致。"
      },
      "fr": {
        "title": "\"Pokémon Winds and Waves\" arrive sur Nintendo Switch 2 en 2027",
        "summary": "Nintendo et The Pokémon Company ont annoncé \"Pokémon Winds and Waves\" pour Nintendo Switch 2 en 2027, avec trois nouveaux Pokémon de démarrage de dixième génération : Browt (oiseau herbe), Pombon (chiot feu), et Gecqua (gecko eau). La révélation marque le début de la prochaine génération Pokémon principale sur la console à venir. L'annonce intervient aux côtés des attentes plus larges de lancement de la plateforme Switch 2."
      },
      "de": {
        "title": "\"Pokémon Winds and Waves\" kommt 2027 auf Nintendo Switch 2",
        "summary": "Nintendo und The Pokémon Company kündigten \"Pokémon Winds and Waves\" für Nintendo Switch 2 im Jahr 2027 an, mit drei neuen Starter-Pokémon der zehnten Generation: Browt (Gras-Vogel), Pombon (Feuer-Welpe) und Gecqua (Wasser-Gecko). Die Enthüllung markiert den Beginn der nächsten Hauptgeneration von Pokémon auf der kommenden Konsole. Die Ankündigung erfolgt in Verbindung mit breiteren Erwartungen zum Start der Switch 2-Plattform."
      },
      "es": {
        "title": "\"Pokémon Winds and Waves\" llegarán a Nintendo Switch 2 en 2027",
        "summary": "Nintendo y The Pokémon Company anunciaron \"Pokémon Winds and Waves\" para Nintendo Switch 2 en 2027, con tres nuevos Pokémon iniciales de décima generación: Browt (pájaro hierba), Pombon (cachorro fuego), y Gecqua (gecko agua). La revelación marca el comienzo de la próxima generación principal de Pokémon en la próxima consola. El anuncio se produce junto con expectativas más amplias de lanzamiento de la plataforma Switch 2."
      }
    }
  },
  {
    "title": "Pokémon Winds and Pokémon Waves are coming to the Nintendo Switch 2 in 2027",
    "slug": "pokemon-winds-waves-switch-2-2027",
    "url": "https://techcrunch.com/2026/02/27/pokemon-winds-and-pokemon-waves-are-coming-to-the-nintendo-switch-2-in-2027/",
    "source": "TechCrunch",
    "date": "2026-02-27T16:57:21.000Z",
    "summary": "Nintendo announced Pokémon Winds and Pokémon Waves for Nintendo Switch 2, launching in 2027 with new tenth-generation starter Pokémon including Browt, Pombon, and Gecqua. The new mainline games represent the next major evolution of the franchise.",
    "content": "The 10th-generation starter Pokémon were revealed in the trailer: Browt (a grass bird), Pombon (a fire puppy), and Gecqua (a water gecko).",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "精灵宝可梦《风之篇》和《浪之篇》即将登陆任天堂Switch 2，将于2027年推出",
        "summary": "任天堂宣布了将登陆任天堂Switch 2的《精灵宝可梦风之篇》和《浪之篇》，将于2027年推出，包含新的第十世代首发宝可梦Browt、Pombon和Gecqua。这些新的主线游戏代表了该系列的下一个重大演进。"
      },
      "fr": {
        "title": "Pokémon Winds et Pokémon Waves arrivent sur Nintendo Switch 2 en 2027",
        "summary": "Nintendo a annoncé Pokémon Winds et Pokémon Waves pour Nintendo Switch 2, sortie en 2027 avec de nouveaux Pokémon de départ de dixième génération incluant Browt, Pombon et Gecqua. Les nouveaux jeux principaux représentent la prochaine grande évolution de la franchise."
      },
      "de": {
        "title": "Pokémon Winds und Pokémon Waves kommen 2027 auf die Nintendo Switch 2",
        "summary": "Nintendo kündigte Pokémon Winds und Pokémon Waves für Nintendo Switch 2 an, die 2027 mit neuen Starter-Pokémon der zehnten Generation einschließlich Browt, Pombon und Gecqua erscheinen. Die neuen Hauptspiele stellen die nächste große Entwicklung der Franchise dar."
      },
      "es": {
        "title": "Pokémon Winds y Pokémon Waves llegando a Nintendo Switch 2 en 2027",
        "summary": "Nintendo anunció Pokémon Winds y Pokémon Waves para Nintendo Switch 2, lanzándose en 2027 con nuevos Pokémon iniciales de décima generación incluyendo Browt, Pombon y Gecqua. Los nuevos juegos principales representan la siguiente evolución importante de la franquicia."
      }
    }
  },
  {
    "title": "Employees at Google and OpenAI support Anthropic’s Pentagon stand in open letter",
    "slug": "google-openai-employees-support-anthropic-pentagon",
    "url": "https://techcrunch.com/2026/02/27/employees-at-google-and-openai-support-anthropics-pentagon-stand-in-open-letter/",
    "source": "TechCrunch",
    "date": "2026-02-27T16:23:58.000Z",
    "summary": "Employees from Google and OpenAI have publicly supported Anthropic's refusal to remove guardrails from its AI models for Pentagon use in an open letter. The cross-company solidarity underscores growing concern among tech workers about military applications involving mass surveillance and autonomous weapons. The internal industry support strengthens Anthropic's negotiating position with the Department of Defense.",
    "content": "While Anthropic has an existing partnership with the Pentagon, the AI company has remained firm that its technology not be used for mass domestic surveillance or fully autonomous weaponry.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "谷歌和OpenAI员工在公开信中支持Anthropic的五角大楼立场",
        "summary": "来自谷歌和OpenAI的员工公开支持Anthropic拒绝为五角大楼使用移除其AI模型护栏的决定。跨公司的团结反映了科技工作者对涉及大规模监视和自主武器的军事应用的日益关注。业内的内部支持加强了Anthropic在国防部谈判中的地位。"
      },
      "fr": {
        "title": "Les employés de Google et OpenAI soutiennent la position du Pentagone d'Anthropic dans une lettre ouverte",
        "summary": "Les employés de Google et OpenAI ont publiquement soutenu le refus d'Anthropic de supprimer les garde-fous de ses modèles d'IA pour une utilisation militaire du Pentagone dans une lettre ouverte. La solidarité entre les entreprises souligne les préoccupations croissantes des travailleurs du secteur technologique concernant les applications militaires impliquant la surveillance de masse et les armes autonomes. Le soutien interne de l'industrie renforce la position de négociation d'Anthropic auprès du ministère de la Défense."
      },
      "de": {
        "title": "Mitarbeiter von Google und OpenAI unterstützen Anthropics Pentagon-Haltung in offener Brief",
        "summary": "Mitarbeiter von Google und OpenAI haben öffentlich Anthropics Weigerung unterstützt, Sicherheitsvorkehrungen aus seinen KI-Modellen für die Nutzung durch das Pentagon zu entfernen, in einem offenen Brief. Die unternehmensübergreifende Solidarität unterstreicht die wachsende Besorgnis von Technologiefachleuten über Militäranwendungen mit Massenüberwachung und autonomen Waffen. Die interne branchenweit Unterstützung stärkt Anthropics Verhandlungsposition gegenüber dem Verteidigungsministerium."
      },
      "es": {
        "title": "Empleados de Google y OpenAI apoyan la postura del Pentágono de Anthropic en una carta abierta",
        "summary": "Los empleados de Google y OpenAI han apoyado públicamente la negativa de Anthropic de eliminar las protecciones de seguridad de sus modelos de IA para su uso militar en el Pentágono en una carta abierta. La solidaridad entre empresas subraya la creciente preocupación de los trabajadores tecnológicos sobre aplicaciones militares que implican vigilancia masiva y armas autónomas. El apoyo interno de la industria fortalece la posición negociadora de Anthropic con el Departamento de Defensa."
      }
    }
  },
  {
    "title": "We don&#8217;t have to have unsupervised killer robots",
    "slug": "unsupervised-killer-robots-pentagon-ai",
    "url": "https://www.theverge.com/ai-artificial-intelligence/885963/anthropic-dod-pentagon-tech-workers-ai-labs-react",
    "source": "The Verge",
    "date": "2026-02-27T16:18:26.000Z",
    "summary": "As Pentagon negotiations with Anthropic reach a critical juncture, tech workers across the industry are examining their own companies' military contracts. The standoff centers on whether the US military should have unrestricted AI access for mass surveillance and autonomous lethal weapons. The article explores whether current military AI trajectories are inevitable or if alternative approaches exist.",
    "content": "It's the day of the Pentagon's looming ultimatum for Anthropic: allow the US military unchecked access to its technology, including for mass surveillance and fully autonomous lethal weapons, or potentially be designated a \"supply chain risk\" and potentially lose hundreds of billions of dollars in contracts. Amid the intensifying public statements and threats, tech workers across the industry are looking at their own companies' government and military contracts  wondering what kind of future they're helping to build. \nWhile the Department of Defense has spent weeks negotiating with Anthropic over removing its guardrails, including allowing t …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "我们不一定要拥有无人监督的杀手机器人",
        "summary": "随着Anthropic与五角大楼的谈判进入关键阶段,科技行业的工作者正在审视他们所在公司的军事合同。僵局的中心是美国军方是否应该拥有对大规模监视和自主致命武器的不受限制的AI访问权限。文章探讨了当前军事AI轨迹是否不可避免,或者是否存在替代方案。"
      },
      "fr": {
        "title": "Nous n'avons pas besoin d'avoir des robots tueurs sans surveillance",
        "summary": "Alors que les négociations du Pentagone avec Anthropic atteignent un moment critique, les travailleurs du secteur technologique examinent les contrats militaires de leurs propres entreprises. L'impasse porte sur la question de savoir si l'armée américaine devrait avoir un accès illimité à l'IA pour la surveillance de masse et les armes letales autonomes. L'article explore si les trajectoires actuelles de l'IA militaire sont inévitables ou si des approches alternatives existent."
      },
      "de": {
        "title": "Wir müssen keine unbeaufsichtigten Killerroboter haben",
        "summary": "Während die Pentagon-Verhandlungen mit Anthropic einen kritischen Punkt erreichen, untersuchen Technologiefachleute in der Branche die Militärverträge ihrer eigenen Unternehmen. Der Streitpunkt konzentriert sich darauf, ob das US-Militär unbegrenzten KI-Zugang für Massenüberwachung und autonome tödliche Waffen haben sollte. Der Artikel untersucht, ob aktuelle militärische KI-Trajektorien unvermeidlich sind oder ob alternative Ansätze existieren."
      },
      "es": {
        "title": "No tenemos que tener robots asesinos sin supervisión",
        "summary": "Cuando las negociaciones del Pentágono con Anthropic llegan a un momento crítico, los trabajadores tecnológicos de toda la industria están examinando los contratos militares de sus propias empresas. El punto de conflicto se centra en si el ejército estadounidense debería tener acceso irrestricto a la IA para vigilancia masiva y armas letales autónomas. El artículo explora si las trayectorias actuales de IA militar son inevitables o si existen enfoques alternativos."
      }
    }
  },
  {
    "title": "And the award for the most improved EV goes to... the 2026 Toyota bZ",
    "slug": "2026-toyota-bz-most-improved-ev",
    "url": "https://arstechnica.com/cars/2026/02/and-the-award-for-the-most-improved-ev-goes-to-the-2026-toyota-bz/",
    "source": "Ars Technica",
    "date": "2026-02-27T16:13:51.000Z",
    "summary": "Toyota's 2026 bZ electric SUV features significant revisions and improved efficiency compared to previous generations. The updated model represents meaningful progress in Toyota's electric vehicle portfolio. The improvements position the bZ as one of 2026's most improved electric vehicles.",
    "content": "Toyota's small electric SUV is much-revised, much more efficient, and much better.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "最受改进电动车奖得主是...2026年丰田bZ",
        "summary": "丰田2026年bZ电动SUV相比前代车型进行了重大修订和效率改进。更新的车型代表了丰田电动汽车产品线的有意义的进步。这些改进使bZ成为2026年最受改进的电动汽车之一。"
      },
      "fr": {
        "title": "Et le prix de l'EV le plus amélioré revient à... le Toyota bZ 2026",
        "summary": "Le SUV électrique bZ 2026 de Toyota présente des révisions importantes et une efficacité améliorée par rapport aux générations précédentes. Le modèle mis à jour représente des progrès significatifs dans le portefeuille de véhicules électriques de Toyota. Les améliorations positionnent le bZ comme l'un des véhicules électriques les plus améliorés de 2026."
      },
      "de": {
        "title": "Und der Preis für das am meisten verbesserte Elektrofahrzeug geht an... den 2026 Toyota bZ",
        "summary": "Das Toyota bZ Elektro-SUV 2026 bietet bedeutende Überarbeitungen und verbesserte Effizienz im Vergleich zu früheren Generationen. Das aktualisierte Modell stellt einen bedeutsamen Fortschritt in Toyotas Elektrofahrzeugportfolio dar. Die Verbesserungen positionieren den bZ als eines der am meisten verbesserten Elektrofahrzeuge 2026."
      },
      "es": {
        "title": "Y el premio al vehículo eléctrico más mejorado es... el Toyota bZ 2026",
        "summary": "El SUV eléctrico bZ 2026 de Toyota presenta revisiones significativas y mayor eficiencia en comparación con generaciones anteriores. El modelo actualizado representa un progreso significativo en la cartera de vehículos eléctricos de Toyota. Las mejoras posicionan el bZ como uno de los vehículos eléctricos más mejorados de 2026."
      }
    }
  },
  {
    "title": "CISA replaces acting director after a bumbling year on the job",
    "slug": "cisa-replaces-acting-director-madhu-gottumukkala",
    "url": "https://techcrunch.com/2026/02/27/cisa-replaces-acting-director-gottumukkala-after-a-bumbling-year-on-the-job/",
    "source": "TechCrunch",
    "date": "2026-02-27T15:57:02.000Z",
    "summary": "CISA is replacing acting director Madhu Gottumukkala after a troubled tenure marked by budget cuts, layoffs, and staff reassignments. The departure follows allegations of security lapses and leadership concerns during a critical period for US cybersecurity infrastructure. The replacement signals a new direction for the federal cybersecurity agency.",
    "content": "The U.S. cybersecurity agency's acting director Madhu Gottumukkala will be replaced, after a year of cuts, layoffs, and staff reassignments, and allegations of security lapses and claims he struggled to lead the agency.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "CISA在一年的混乱工作后更换代理主任",
        "summary": "CISA在首任代理主任Madhu Gottumukkala的任期因预算削减、裁员和员工调配而陷入困境后，决定更换其领导。这次离职是在安全漏洞指控和美国网络安全基础设施关键时期的领导力问题之后发生的。这次更换标志着联邦网络安全机构新方向的开始。"
      },
      "fr": {
        "title": "L'AICSP remplace le directeur par intérim après une année chaotique",
        "summary": "L'AICSP remplace le directeur par intérim Madhu Gottumukkala après un mandat difficile marqué par des réductions budgétaires, des licenciements et des réaffectations de personnel. Le départ fait suite à des allégations de failles de sécurité et de préoccupations en matière de leadership lors d'une période critique pour l'infrastructure de cybersécurité américaine. Le remplacement signale une nouvelle orientation pour l'agence fédérale de cybersécurité."
      },
      "de": {
        "title": "CISA ersetzt stellvertretenden Direktor nach turbulenten Jahr",
        "summary": "CISA ersetzt stellvertretenden Direktor Madhu Gottumukkala nach einer schwierigen Amtszeit, die durch Budgetkürzungen, Entlassungen und Personalversetzungen gekennzeichnet ist. Der Rücktritt folgt Vorwürfen von Sicherheitsmängeln und Führungsbedenken in einer kritischen Phase für die US-Cybersicherheitsinfrastruktur. Der Wechsel signalisiert eine neue Richtung für die föderale Cybersicherheitsbehörde."
      },
      "es": {
        "title": "CISA reemplaza al director interino después de un año caótico",
        "summary": "CISA reemplaza al director interino Madhu Gottumukkala después de un mandato difícil marcado por recortes presupuestarios, despidos y reasignaciones de personal. La salida sigue a alegaciones de brechas de seguridad y preocupaciones de liderazgo durante un período crítico para la infraestructura de ciberseguridad estadounidense. El reemplazo señala una nueva dirección para la agencia federal de ciberseguridad."
      }
    }
  },
  {
    "title": "The US military reportedly shot down a CBP drone with a laser",
    "slug": "us-military-shot-down-cbp-drone-laser",
    "url": "https://www.theverge.com/policy/886021/us-military-cbp-drone-laser-texas",
    "source": "The Verge",
    "date": "2026-02-27T15:43:43.000Z",
    "summary": "The US military accidentally shot down a Customs and Border Protection drone using an anti-drone laser near the Mexican border in Fort Hancock, Texas. The incident prompted FAA airspace closure, marking the second similar incident this month involving anti-drone laser operations. The mishaps highlight coordination challenges between military and civilian aviation operations.",
    "content": "The US-Mexico border in Fort Hancock, Texas. | Photographer: Luke Sharrett/Bloomberg via Getty Images\t\n\nThe US military mistakenly shot down a drone belonging to Customs and Border Protection near the Mexican border in Fort Hancock, Texas, according to reports from Reuters and The New York Times. The Thursday incident reportedly led the Federal Aviation Administration to close the airspace where the military fired the anti-drone laser.\nThis marks the second time this month that officials closed airspace near the US-Mexico border due to an incident involving an anti-drone laser. On February 11th, officials closed airspace around the El Paso International Airport for hours after CBP fired an anti-drone laser without coordinating with the FAA, T …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "美国军方据报用激光击落了CBP无人机",
        "summary": "美国军方在得克萨斯州韦科堡附近用反无人机激光意外击落了一架美国海关和边境保护局无人机。这一事件促使美国联邦航空管理局关闭空域，这是本月第二起涉及反无人机激光操作的类似事件。这些失误突出了军事和民用航空运营之间的协调挑战。"
      },
      "fr": {
        "title": "L'armée américaine aurait abattu un drone de la CBP avec un laser",
        "summary": "L'armée américaine a accidentellement abattu un drone des douanes et de la protection des frontières à l'aide d'un laser anti-drone près de la frontière mexicaine à Fort Hancock, au Texas. L'incident a entraîné une fermeture de l'espace aérien de la FAA, marquant le deuxième incident similaire ce mois-ci impliquant des opérations de laser anti-drone. Ces incidents soulignent les défis de coordination entre les opérations militaires et aériennes civiles."
      },
      "de": {
        "title": "Das US-Militär schoss einer CBP-Drohne angeblich mit einem Laser ab",
        "summary": "Das US-Militär schoss versehentlich eine Drohne der Zoll- und Grenzschutzbehörde mit einem Anti-Drohnen-Laser in der Nähe der mexikanischen Grenze in Fort Hancock, Texas ab. Der Vorfall führte zu einer Sperrung des FAA-Luftraums und markiert den zweiten ähnlichen Vorfall diesen Monat mit Anti-Drohnen-Laser-Operationen. Diese Zwischenfälle zeigen Koordinierungsprobleme zwischen militärischen und zivilen Flugbetrieben."
      },
      "es": {
        "title": "El ejército estadounidense aparentemente derribó un dron de la CBP con un láser",
        "summary": "El ejército estadounidense derribó accidentalmente un dron de Aduanas y Protección Fronteriza usando un láser anti-dron cerca de la frontera mexicana en Fort Hancock, Texas. El incidente provocó el cierre del espacio aéreo de la FAA, marcando el segundo incidente similar este mes que involucra operaciones de láser anti-dron. Los percances destacan desafíos de coordinación entre operaciones militares y de aviación civil."
      }
    }
  },
  {
    "title": "Here&#8217;s your first look at Kratos in Amazon&#8217;s God of War show",
    "slug": "amazon-god-of-war-kratos-ryan-hurst",
    "url": "https://www.theverge.com/streaming/886008/amazon-god-of-war-kratos-image",
    "source": "The Verge",
    "date": "2026-02-27T15:19:14.000Z",
    "summary": "Amazon has revealed its first images from the live-action God of War adaptation, showing Ryan Hurst as Kratos and Callum Vinson as Atreus. The casting appears to faithfully adapt the video game characters for television portrayal. The reveal marks a significant milestone in Amazon's adaptation of the acclaimed gaming franchise.",
    "content": "Amazon has slowly been teasing out casting details for its live-action adaptation of God of War, and now we have our first look at the show. It's a single image but a notable one showing protagonist Kratos and his son Atreus. The characters are played by Ryan Hurst and Callum Vinson, respectively, and they look relatively close to their video game counterparts.\nThere aren't a lot of other details about the show just yet, but this is Amazon's official description:\nThe God of War series storyline follows father and son Kratos and Atreus as they embark on a journey to spread the ashes of their wife and mother, Faye. Through their adventures, …\n\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "亚马逊God of War秀中克拉托斯的首次亮相",
        "summary": "亚马逊公布了真人版《战神》改编的首批图片，展示了瑞恩·赫斯特扮演克拉托斯，卡勒姆·文森扮演阿特柔斯。这次选角似乎忠实地将电子游戏角色改编为电视形象。这次曝光标志着亚马逊改编这部受好评的游戏特许经营权的重要里程碑。"
      },
      "fr": {
        "title": "Voici votre premier aperçu de Kratos dans le spectacle God of War d'Amazon",
        "summary": "Amazon a révélé ses premières images de l'adaptation en direct de God of War, montrant Ryan Hurst en tant que Kratos et Callum Vinson en tant qu'Atreus. Le choix de casting semble adapter fidèlement les personnages du jeu vidéo pour la représentation télévisée. La révélation marque une étape importante dans l'adaptation d'Amazon de la franchise de jeu acclamée."
      },
      "de": {
        "title": "Hier ist dein erster Blick auf Kratos in Amazons God of War Show",
        "summary": "Amazon hat die ersten Bilder der Live-Action-Adaptation von God of War veröffentlicht, die Ryan Hurst als Kratos und Callum Vinson als Atreus zeigen. Die Besetzung scheint die Videospielcharaktere treu für die Fernsehdarstellung anzupassen. Die Enthüllung markiert einen wichtigen Meilenstein in Amazons Adaptation des gefeierten Gaming-Franchises."
      },
      "es": {
        "title": "Aquí está tu primer vistazo a Kratos en el show God of War de Amazon",
        "summary": "Amazon ha revelado sus primeras imágenes de la adaptación en vivo de God of War, mostrando a Ryan Hurst como Kratos y Callum Vinson como Atreus. El elenco parece adaptar fielmente los personajes del videojuego para la representación televisiva. La revelación marca un hito importante en la adaptación de Amazon de la franquicia de juegos aclamada."
      }
    }
  },
  {
    "title": "The Galaxy S26 is a photography nightmare",
    "slug": "galaxy-s26-photography-nightmare",
    "url": "https://www.theverge.com/podcast/885942/samsung-galaxy-s26-ai-camera-nightmare-vergecast",
    "source": "The Verge",
    "date": "2026-02-27T15:15:52.000Z",
    "summary": "Samsung's Galaxy S26 introduces new camera features that critics describe as problematic rather than improvements to the flagship line. While other upgrades like the Privacy Display on the S26 Ultra offer practical benefits, the camera changes raise concerns about Samsung's direction. The camera technology strategy represents a notable departure from previous generations.",
    "content": "In many ways, Samsung's new phones are fairly normal upgrades. The S26 lines come with some useful new things - particularly the Privacy Display on the S26 Ultra, which looks like an extremely cool bit of tech and a really useful new feature - and a lot of iterative year-over-year changes. The new camera features, on the other hand, are neither of those things. They're something worse. Something scarier.\n\nVerge subscribers, don't forget you get exclusive access to ad-free Vergecast wherever you get your podcasts. Head here. Not a subscriber? You can sign up here.\nOn this episode of The Vergecast, Nilay and David discuss the new phones,  …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Galaxy S26是摄影噩梦",
        "summary": "三星Galaxy S26推出的新摄像头功能遭到评论家批评，被认为是问题而非旗舰系列的改进。虽然S26 Ultra上的隐私显示屏等其他升级提供了实际好处，但摄像头的变化引发了对三星方向的担忧。摄像头技术战略代表了与前几代产品的显著偏离。"
      },
      "fr": {
        "title": "Le Galaxy S26 est un cauchemar photographique",
        "summary": "Samsung Galaxy S26 introduit de nouvelles fonctionnalités caméra que les critiques décrivent comme problématiques plutôt que comme des améliorations de la gamme phare. Bien que d'autres mises à niveau comme l'affichage de confidentialité sur le S26 Ultra offrent des avantages pratiques, les modifications de la caméra soulèvent des préoccupations concernant la direction de Samsung. La stratégie technologique des caméras représente une évolution notable par rapport aux générations précédentes."
      },
      "de": {
        "title": "Das Galaxy S26 ist ein Fotografie-Albtraum",
        "summary": "Das Samsung Galaxy S26 führt neue Kamerafunktionen ein, die Kritiker als problematisch und nicht als Verbesserung der Flaggschiff-Serie beschreiben. Während andere Upgrades wie die Datenschutzanzeige auf dem S26 Ultra praktische Vorteile bieten, werfen die Kameraänderungen Fragen zur Richtung von Samsung auf. Die Kameratechnologiestrategie stellt einen bemerkenswerten Abbruch zu früheren Generationen dar."
      },
      "es": {
        "title": "El Galaxy S26 es una pesadilla fotográfica",
        "summary": "Samsung Galaxy S26 introduce nuevas características de cámara que los críticos describen como problemáticas en lugar de mejoras en la línea insignia. Si bien otras mejoras como la Pantalla de Privacidad en el S26 Ultra ofrecen beneficios prácticos, los cambios de cámara generan preocupaciones sobre la dirección de Samsung. La estrategia de tecnología de cámara representa una partida notable de generaciones anteriores."
      }
    }
  },
  {
    "title": "Netflix cedes Warner Bros. Discovery to Paramount: “No longer financially attractive”",
    "slug": "netflix-cedes-warner-bros-discovery-paramount",
    "url": "https://arstechnica.com/gadgets/2026/02/netflix-cedes-warner-bros-discovery-to-paramount-no-longer-financially-attractive/",
    "source": "Ars Technica",
    "date": "2026-02-27T15:13:48.000Z",
    "summary": "Netflix has ended its content licensing partnership with Warner Bros. Discovery, stating it is \"no longer financially attractive.\" The strategic decision led to a jump in Netflix's stock price as investors responded positively. The move reflects shifting economics in the competitive streaming marketplace and Netflix's evolving content strategy.",
    "content": "Netflix shares jumped following the announcement.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Netflix放弃华纳兄弟探索频道给派拉蒙：\"不再具有经济吸引力\"",
        "summary": "Netflix已终止与华纳兄弟探索频道的内容许可合作，声称其\"不再具有经济吸引力\"。这一战略决定导致Netflix股价上涨，投资者对此反应积极。此举反映了竞争激烈的流媒体市场中经济格局的转变以及Netflix内容战略的演变。"
      },
      "fr": {
        "title": "Netflix cède Warner Bros. Discovery à Paramount : « N'est plus financièrement attractif »",
        "summary": "Netflix a mis fin à son partenariat de licence de contenu avec Warner Bros. Discovery, affirmant qu'il n'est plus financièrement attractif. La décision stratégique a entraîné une augmentation du prix de l'action Netflix, car les investisseurs ont réagi positivement. Cette mesure reflète l'évolution de l'économie sur le marché concurrentiel du streaming et l'évolution de la stratégie de contenu de Netflix."
      },
      "de": {
        "title": "Netflix tritt Warner Bros. Discovery an Paramount ab: „Nicht mehr finanziell attraktiv\"",
        "summary": "Netflix hat seine Inhaltslizenzkpartnerschaft mit Warner Bros. Discovery beendet und erklärt, dass sie „nicht mehr finanziell attraktiv\" ist. Die strategische Entscheidung führte zu einem Anstieg des Netflix-Aktienkurses, da Investoren positiv reagierten. Der Schritt spiegelt die sich verschiebende Wirtschaftlichkeit auf dem wettbewerbsintensiven Streaming-Markt wider und zeigt Netflixs sich entwickelnde Content-Strategie."
      },
      "es": {
        "title": "Netflix cede Warner Bros. Discovery a Paramount: \"Ya no es financieramente atractivo\"",
        "summary": "Netflix ha terminado su asociación de licencia de contenido con Warner Bros. Discovery, afirmando que ya no es \"financieramente atractivo\". La decisión estratégica provocó un aumento en el precio de las acciones de Netflix, ya que los inversores respondieron positivamente. El movimiento refleja el cambio de la economía en el mercado competitivo del streaming y la estrategia de contenido en evolución de Netflix."
      }
    }
  },
  {
    "title": "NASA shakes up its Artemis program to speed up lunar return",
    "slug": "nasa-artemis-program-lunar-return-faster",
    "url": "https://arstechnica.com/staff/2026/02/nasa-shakes-up-its-artemis-program-to-speed-up-lunar-return/",
    "source": "Ars Technica",
    "date": "2026-02-27T15:08:08.000Z",
    "summary": "NASA is restructuring its Artemis program to accelerate the timeline for human lunar return, moving away from its current multi-year Space Launch System launch cadence. The overhaul reflects recognition that launching the SLS every three-and-a-half years cannot sustain mission objectives. The changes prioritize faster, more frequent lunar missions for NASA's renewed exploration agenda.",
    "content": "\"Launching SLS every three and a half years or so is not a recipe for success.\"",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "NASA改革阿尔忒弥斯计划以加快月球返回",
        "summary": "NASA正在重组其阿尔忒弥斯计划，以加快人类月球返回的时间表，从目前的多年空间发射系统发射频率转变。这次改革反映了人们对每三年半发射一次SLS无法维持任务目标的认识。这些变化优先考虑更快、更频繁的月球任务，以实现NASA新的探索议程。"
      },
      "fr": {
        "title": "La NASA secoue son programme Artemis pour accélérer le retour lunaire",
        "summary": "La NASA restructure son programme Artemis pour accélérer le calendrier du retour humain sur la Lune, s'éloignant de son actuel cadence de lancement du Système de lancement spatial sur plusieurs années. La refonte reflète la reconnaissance que lancer le SLS tous les trois ans et demi ne peut pas soutenir les objectifs de mission. Les changements priorisent les missions lunaires plus rapides et plus fréquentes pour le nouvel agenda d'exploration de la NASA."
      },
      "de": {
        "title": "NASA schüttelt sein Artemis-Programm auf, um die Rückkehr zum Mond zu beschleunigen",
        "summary": "Die NASA strukturiert sein Artemis-Programm um, um den Zeitplan für die menschliche Rückkehr zum Mond zu beschleunigen und sich von ihrer derzeitigen mehrjährigen Startfrequenz des Space Launch Systems zu entfernen. Die Überholung spiegelt die Erkenntnis wider, dass das Starten des SLS alle dreieinhalb Jahre die Missionsziele nicht aufrechterhalten kann. Die Änderungen priorisieren schnellere und häufigere Mondmissionen für Nasas erneuerte Explorationspolitik."
      },
      "es": {
        "title": "NASA sacude su programa Artemis para acelerar el regreso a la Luna",
        "summary": "La NASA está reestructurando su programa Artemis para acelerar el cronograma del regreso humano a la Luna, alejándose de su actual ritmo de lanzamiento del Sistema de Lanzamiento Espacial de varios años. La revisión refleja el reconocimiento de que lanzar el SLS cada tres años y medio no puede sostener los objetivos de la misión. Los cambios priorizan misiones lunares más rápidas y frecuentes para la agenda de exploración renovada de la NASA."
      }
    }
  },
  {
    "title": "Spotify is rolling out Audiobook Charts",
    "slug": "spotify-audiobook-charts",
    "url": "https://techcrunch.com/2026/02/27/spotify-is-rolling-out-audiobook-charts/",
    "source": "TechCrunch",
    "date": "2026-02-27T15:07:42.000Z",
    "summary": "Spotify is launching Audiobook Charts, updated weekly to highlight top audiobooks overall and by genre, mirroring its existing Music and Podcast Charts. The feature expands Spotify's content tracking and discovery across its platform.",
    "content": "Similar to the streaming giant's Music and Podcast Charts, the Audiobook Charts will be updated weekly and highlight the top audiobooks overall and by genre.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Spotify正在推出有声书排行榜",
        "summary": "Spotify推出有声书排行榜，每周更新以突出顶级有声书和各种流派，效仿其现有的音乐和播客排行榜。该功能扩展了Spotify在其平台上的内容跟踪和发现能力。"
      },
      "fr": {
        "title": "Spotify lance les Graphiques d'Audiobooks",
        "summary": "Spotify lance les Graphiques d'Audiobooks, mis à jour chaque semaine pour mettre en avant les meilleurs audiobooks globalement et par genre, imitant ses Graphiques de Musique et de Podcasts existants. Cette fonction élargit le suivi et la découverte de contenu de Spotify sur sa plateforme."
      },
      "de": {
        "title": "Spotify führt Audiobook-Charts ein",
        "summary": "Spotify führt Audiobook-Charts ein, die wöchentlich aktualisiert werden, um die Top-Audiobooks insgesamt und nach Genre hervorzuheben, ähnlich wie die bestehenden Musik- und Podcast-Charts. Die Funktion erweitert Spotifys Content-Tracking und Discovery auf seiner Plattform."
      },
      "es": {
        "title": "Spotify está lanzando gráficos de audiolibros",
        "summary": "Spotify lanza gráficos de audiolibros, actualizados semanalmente para destacar los mejores audiolibros en general y por género, imitando sus gráficos de Música y Podcasts existentes. La función expande el seguimiento y descubrimiento de contenido de Spotify en su plataforma."
      }
    }
  },
  {
    "title": "Last 24 hours to get TechCrunch Disrupt 2026 tickets at the lowest rates of the year",
    "slug": "techcrunch-disrupt-2026-tickets",
    "url": "https://techcrunch.com/2026/02/27/last-24-hours-to-get-techcrunch-disrupt-2026-tickets-at-the-lowest-rates-of-the-year/",
    "source": "TechCrunch",
    "date": "2026-02-27T15:00:00.000Z",
    "summary": "TechCrunch Disrupt 2026 ticket sales at the lowest rates of the year end today, with prices increasing afterward. Early bird discounts offer up to $680 savings for the conference featuring 250+ industry leaders and 10,000 attendees.",
    "content": "The lowest rates of the year for TechCrunch Disrupt 2026 end after today. Prices go up at 11:59 p.m. PT. Don't miss connecting with 10,000 founders, investors, and operators, and key takeaways from 250+ industry leaders. Register now to save up to $680, or up to 30% on group passes.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "距离获得TechCrunch Disrupt 2026门票最低价格仅剩24小时",
        "summary": "TechCrunch Disrupt 2026门票以年度最低价格的销售今天结束，之后价格将上升。早鸟优惠为拥有250多位行业领袖和10,000名与会者的会议提供高达680美元的节省。"
      },
      "fr": {
        "title": "Dernières 24 heures pour obtenir les billets TechCrunch Disrupt 2026 aux tarifs les plus bas de l'année",
        "summary": "Les ventes de billets TechCrunch Disrupt 2026 aux tarifs les plus bas de l'année se terminent aujourd'hui, les prix augmentant par la suite. Les remises anticipées offrent jusqu'à 680 $ d'économies pour la conférence avec 250+ leaders de l'industrie et 10 000 participants."
      },
      "de": {
        "title": "Letzte 24 Stunden für TechCrunch Disrupt 2026 Tickets zu den niedrigsten Sätzen des Jahres",
        "summary": "Die Ticketverkäufe für TechCrunch Disrupt 2026 zu den niedrigsten Sätzen des Jahres enden heute, danach steigen die Preise. Frühbucher-Rabatte bieten bis zu 680 US-Dollar Einsparungen für die Konferenz mit 250+ Branchenführern und 10.000 Teilnehmern."
      },
      "es": {
        "title": "Últimas 24 horas para obtener entradas de TechCrunch Disrupt 2026 a las tarifas más bajas del año",
        "summary": "Las ventas de entradas de TechCrunch Disrupt 2026 a las tarifas más bajas del año terminan hoy, con precios aumentando después. Los descuentos para pájaros madrugadores ofrecen ahorros de hasta $680 para la conferencia con 250+ líderes de la industria y 10,000 asistentes."
      }
    }
  },
  {
    "title": "After Zomato, Deepinder Goyal returns with a $54M brain-monitoring bet",
    "slug": "deepinder-goyal-temple-brain-monitoring",
    "url": "https://techcrunch.com/2026/02/27/after-zomato-deepinder-goyal-returns-with-a-54m-brain-monitoring-bet/",
    "source": "TechCrunch",
    "date": "2026-02-27T14:40:39.000Z",
    "summary": "Zomato co-founder Deepinder Goyal launched Temple, a brain-monitoring wearable startup that raised $54 million in a friends-and-family round at a $190 million valuation. The venture marks Goyal's return to startup founding after his success with Zomato.",
    "content": "Zomato co-founder Deepinder Goyal's new wearable startup Temple has raised $54 million in a friends-and-family round at a post-money valuation of about $190 million.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "离开Zomato后，Deepinder Goyal以5400万美元的脑监测项目回归创业",
        "summary": "Zomato联合创始人Deepinder Goyal创办了Temple，这是一个脑监测可穿戴设备初创公司，在朋友和家族轮融资中筹集了5400万美元，估值1.9亿美元。这次创业标志着Goyal在Zomato成功后重新回归创业领域。"
      },
      "fr": {
        "title": "Après Zomato, Deepinder Goyal revient avec un pari de surveillance cérébrale de 54 millions de dollars",
        "summary": "Le co-fondateur de Zomato, Deepinder Goyal, a lancé Temple, une startup de wearables de surveillance cérébrale qui a levé 54 millions de dollars lors d'un tour de table auprès d'amis et de famille avec une valorisation de 190 millions de dollars. L'entreprise marque le retour de Goyal à la création de startup après son succès avec Zomato."
      },
      "de": {
        "title": "Nach Zomato kehrt Deepinder Goyal mit einem 54-Millionen-Dollar-Gehirnüberwachungs-Wetten zurück",
        "summary": "Der Zomato-Mitgründer Deepinder Goyal hat Temple gegründet, ein Start-up für tragbare Gehirnüberwachungsgeräte, das 54 Millionen Dollar in einer Friends-and-Family-Runde bei einer Bewertung von 190 Millionen Dollar aufgebracht hat. Das Unternehmen markiert Goyals Rückkehr zur Gründung von Start-ups nach seinem Erfolg bei Zomato."
      },
      "es": {
        "title": "Después de Zomato, Deepinder Goyal regresa con una apuesta de monitoreo cerebral de 54 millones de dólares",
        "summary": "El cofundador de Zomato, Deepinder Goyal, lanzó Temple, una startup de wearables de monitoreo cerebral que recaudó 54 millones de dólares en una ronda de amigos y familia con una valoración de 190 millones de dólares. La empresa marca el regreso de Goyal a la fundación de startups después de su éxito con Zomato."
      }
    }
  },
  {
    "title": "How to downgrade from macOS 26 Tahoe on a new Mac",
    "slug": "downgrade-macos-26-tahoe-new-mac",
    "url": "https://arstechnica.com/gadgets/2026/02/how-to-downgrade-from-macos-26-tahoe-on-a-new-mac/",
    "source": "Ars Technica",
    "date": "2026-02-27T14:34:45.000Z",
    "summary": "Most new Macs can still be downgraded from macOS 26 Tahoe with minimal complications, according to Ars Technica's guide. The article provides instructions for users needing to revert to an earlier OS version.",
    "content": "Most new Macs can still be downgraded with few downsides. Here's what to know.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "如何在新Mac上从macOS 26 Tahoe降级",
        "summary": "根据Ars Technica的指南，大多数新Mac仍然可以从macOS 26 Tahoe降级，复杂性最小。该文章为需要恢复到早期OS版本的用户提供了说明。"
      },
      "fr": {
        "title": "Comment rétrograder de macOS 26 Tahoe sur un nouveau Mac",
        "summary": "Selon le guide d'Ars Technica, la plupart des nouveaux Mac peuvent toujours être rétrogradés de macOS 26 Tahoe avec des complications minimales. L'article fournit des instructions pour les utilisateurs qui ont besoin de revenir à une version antérieure du système d'exploitation."
      },
      "de": {
        "title": "So führen Sie ein Downgrade von macOS 26 Tahoe auf einem neuen Mac durch",
        "summary": "Nach Ars Technicas Anleitung können die meisten neuen Macs von macOS 26 Tahoe mit minimalen Komplikationen heruntergefahren werden. Der Artikel bietet Anweisungen für Benutzer, die auf eine frühere Betriebssystemversion zurückgehen müssen."
      },
      "es": {
        "title": "Cómo degradar de macOS 26 Tahoe en una Mac nueva",
        "summary": "Según la guía de Ars Technica, la mayoría de las Macs nuevas aún se pueden degradar de macOS 26 Tahoe con complicaciones mínimas. El artículo proporciona instrucciones para usuarios que necesitan revertir a una versión anterior del sistema operativo."
      }
    }
  },
  {
    "title": "Block lays off 40% of workforce as it goes all-in on AI tools",
    "slug": "block-layoffs-40-percent-ai-tools",
    "url": "https://arstechnica.com/ai/2026/02/block-lays-off-40-of-workforce-as-it-goes-all-in-on-ai-tools/",
    "source": "Ars Technica",
    "date": "2026-02-27T14:19:00.000Z",
    "summary": "Block announced a 40% workforce reduction as it prioritizes AI tools, with the CEO stating \"most companies are late\" to recognize technology's employment impact. The move reflects Block's strategic pivot toward automation.",
    "content": "CEO says \"most companies are late\" to realize how much technology will affect employment.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Block公司裁员40%员工，全力押注AI工具",
        "summary": "Block公司宣布裁减40%的员工，因为它优先考虑AI工具，CEO表示\"大多数公司都很晚\"才认识到技术对就业的影响。这一举措反映了Block公司向自动化战略转变的决定。"
      },
      "fr": {
        "title": "Block licencie 40 % de ses effectifs en se concentrant sur les outils d'IA",
        "summary": "Block a annoncé une réduction de 40 % de sa main-d'œuvre en privilégiant les outils d'IA, le PDG déclarant que \"la plupart des entreprises sont en retard\" pour reconnaître l'impact technologique sur l'emploi. Cette décision reflète le virage stratégique de Block vers l'automatisation."
      },
      "de": {
        "title": "Block entlässt 40 % der Belegschaft und konzentriert sich vollständig auf KI-Tools",
        "summary": "Block kündigte eine Reduzierung der Belegschaft um 40 % an, da es sich auf KI-Tools konzentriert. Der CEO erklärte, dass \"die meisten Unternehmen zu spät\" erkennen, welche Auswirkungen die Technologie auf die Beschäftigung hat. Der Schritt spiegelt Blocks strategische Umorientierung zur Automatisierung wider."
      },
      "es": {
        "title": "Block despide al 40% de su personal mientras apuesta todo a las herramientas de IA",
        "summary": "Block anunció una reducción del 40% de su fuerza laboral mientras prioriza las herramientas de IA. El CEO señaló que \"la mayoría de las empresas llegan tarde\" a reconocer el impacto de la tecnología en el empleo. El movimiento refleja el giro estratégico de Block hacia la automatización."
      }
    }
  },
  {
    "title": "Ultrahuman’s new flagship smart ring has a 15-day battery",
    "slug": "ultrahuman-ring-pro-15-day-battery",
    "url": "https://www.theverge.com/tech/885866/ultrahuman-ring-pro-jade-ai-launch-price-availability",
    "source": "The Verge",
    "date": "2026-02-27T12:00:48.000Z",
    "summary": "Ultrahuman has launched its third-generation Ring Pro smart ring with up to 15 days of battery life and 250 days of on-device health history storage, representing significant improvements over its 2023 predecessor which offered only 4-6 days of battery life. The Ring Pro comes with an enhanced charging case that extends total battery life to 45 days, and the company is also upgrading its health monitoring platform with a new 'biointelligence AI' integration.",
    "content": "The Ultrahuman Ring Pro comes with a snazzy Pro Charging Case for up to 45 days of additional battery life. | Image: Ultrahuman\t\n\nUltrahuman is expanding its health monitoring ecosystem with the launch of a new flagship smart ring and a \"biointelligence AI\" platform upgrade. The Ring Pro is Ultrahuman's third-generation smart ring, and promises up to 15 days of battery life before needing to recharge, alongside 250 days of on-device health history storage.\nThose are some significant improvements compared to its predecessor, the 2023 Ring Air, which provides 4-6 days of battery life and several days of offline data storage, according to user estimates. Ultrahuman has also made other upgrades to the Ring Pro, including a redesigned heart-rate sensor that improves signal …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Ultrahuman新旗舰智能戒指续航15天",
        "summary": "Ultrahuman推出了第三代Ring Pro智能戒指，电池续航可达15天，设备存储容量可存储250天的健康历史记录，相比2023年的前代产品（仅提供4-6天续航）有了显著提升。Ring Pro配备增强型充电盒，可将总续航时间延长至45天，该公司还通过新的\"生物智能AI\"集成来升级其健康监测平台。"
      },
      "fr": {
        "title": "Le nouvel anneau intelligent phare d'Ultrahuman a 15 jours d'autonomie",
        "summary": "Ultrahuman a lancé sa bague intelligente Ring Pro de troisième génération avec jusqu'à 15 jours d'autonomie de batterie et 250 jours de stockage d'historique de santé sur l'appareil, ce qui représente des améliorations significatives par rapport à son prédécesseur de 2023 qui n'offrait que 4-6 jours d'autonomie. La Ring Pro est fournie avec un étui de recharge amélioré qui prolonge l'autonomie totale de la batterie à 45 jours, et la société met également à niveau sa plateforme de surveillance de la santé avec une nouvelle intégration d'« IA biointelligence »."
      },
      "de": {
        "title": "Ultrahuman's neuer Flaggschiff-Smartring hat 15 Tage Akkulaufzeit",
        "summary": "Ultrahuman hat seinen Smart Ring Ring Pro der dritten Generation mit bis zu 15 Tagen Akkulaufzeit und 250 Tagen Speicherung von Gesundheitsverlauf auf dem Gerät eingeführt, was erhebliche Verbesserungen gegenüber seinem Vorgänger aus 2023 darstellt, der nur 4-6 Tage Akkulaufzeit bot. Der Ring Pro wird mit einem verbesserten Ladecase geliefert, das die Gesamtakkulaufzeit auf 45 Tage verlängert, und das Unternehmen aktualisiert auch seine Gesundheitsüberwachungsplattform mit einer neuen „Biointelligenz-KI\"-Integration."
      },
      "es": {
        "title": "El nuevo anillo inteligente insignia de Ultrahuman tiene 15 días de batería",
        "summary": "Ultrahuman ha lanzado su anillo inteligente Ring Pro de tercera generación con hasta 15 días de duración de batería y 250 días de almacenamiento del historial de salud en el dispositivo, lo que representa mejoras significativas respecto a su predecesor de 2023 que ofrecía solo 4-6 días de duración. El Ring Pro viene con un estuche de carga mejorado que extiende la duración total de la batería a 45 días, y la empresa también está mejorando su plataforma de monitoreo de salud con una nueva integración de \"IA biointeligencia\"."
      }
    }
  },
  {
    "title": "Notes from a Burmese Prison",
    "slug": "notes-burmese-prison",
    "url": "https://www.theverge.com/cs/features/820915/notes-burmese-prison-comic",
    "source": "The Verge",
    "date": "2026-02-27T12:00:00.000Z",
    "summary": "This story is a comic by Danny Fenster and Amy Kurzweil about a Burmese prison, but it is not viewable through RSS readers and must be read directly on The Verge's website.",
    "content": "This story is a comic by Danny Fenster and Amy Kurzweil and is not compatible with RSS readers. But you can (and should) read it at The Verge’s website.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "缅甸监狱笔记",
        "summary": "这是由Danny Fenster和Amy Kurzweil创作的关于缅甸监狱的漫画故事，但无法通过RSS阅读器查看，必须直接在The Verge网站上阅读。"
      },
      "fr": {
        "title": "Notes d'une prison birmane",
        "summary": "Il s'agit d'une bande dessinée de Danny Fenster et Amy Kurzweil sur une prison birmane, mais elle n'est pas visible par les lecteurs RSS et doit être lue directement sur le site Web de The Verge."
      },
      "de": {
        "title": "Notizen aus einem burmesischen Gefängnis",
        "summary": "Dies ist ein Comic von Danny Fenster und Amy Kurzweil über ein burmesisches Gefängnis, aber es ist nicht über RSS-Reader sichtbar und muss direkt auf der Website von The Verge gelesen werden."
      },
      "es": {
        "title": "Notas de una prisión birmana",
        "summary": "Esta es una historia de cómic de Danny Fenster y Amy Kurzweil sobre una prisión birmana, pero no se puede ver a través de lectores RSS y debe leerse directamente en el sitio web de The Verge."
      }
    }
  },
  {
    "title": "Phones are going to get weird next week",
    "slug": "phones-going-get-weird-mobile-world-congress",
    "url": "https://www.theverge.com/tech/885287/mwc-2026-what-to-expect-phones-mobile-weird",
    "source": "The Verge",
    "date": "2026-02-27T12:00:00.000Z",
    "summary": "Mobile World Congress is expected to showcase numerous innovative and unconventional phones and devices from manufacturers worldwide, particularly Chinese companies and niche makers, breaking away from the increasingly uniform smartphone market. The event will feature everything from modular phones to devices with unusual specifications and extraordinary features.",
    "content": "Honor’s Robot Phone is set to make an appearance, and this time we might actually see it switched on. | Photo: Dominic Preston / The Verge\t\n\nWith rare exceptions, phones are pretty boring these days. The good news is, a boatload of those rare exceptions are about to show up at once, courtesy of Mobile World Congress.\nThe tech industry's biggest mobile show may not quite have the clout it once did, when the likes of Samsung, Sony, LG, and HTC showcased new flagships there each year, but it still attracts more phone launches than CES does two months earlier. It's especially popular with the Chinese manufacturers who are still fighting for space in the global market, along with niche manufacturers who turn up with extra-durable \"rugged\" devices, or battery beasts that are more powe …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "下周手机将变得很奇怪",
        "summary": "移动世界大会预计将展示来自全球制造商（特别是中国公司和小众品牌）的众多创新和非常规手机和设备，打破越来越趋同的智能手机市场。该活动将展出从模块化手机到具有不寻常规格和非凡功能的设备。"
      },
      "fr": {
        "title": "Les téléphones vont devenir bizarres la semaine prochaine",
        "summary": "Le Mobile World Congress devrait présenter de nombreux téléphones et appareils innovants et non conventionnels de fabricants du monde entier, en particulier des entreprises chinoises et des créateurs de niche, s'éloignant du marché des smartphones de plus en plus uniforme. L'événement présentera tout, des téléphones modulaires aux appareils avec des spécifications inhabituelles et des fonctionnalités extraordinaires."
      },
      "de": {
        "title": "Nächste Woche werden Telefone seltsam",
        "summary": "Die Mobile World Congress wird voraussichtlich zahlreiche innovative und unkonventionelle Telefone und Geräte von Herstellern weltweit präsentieren, insbesondere von chinesischen Unternehmen und Nischenmachern, wodurch sich der Smartphone-Markt von seiner zunehmend einheitlichen Struktur entfernt. Die Veranstaltung wird alles von modularen Telefonen bis zu Geräten mit ungewöhnlichen Spezifikationen und außergewöhnlichen Funktionen zeigen."
      },
      "es": {
        "title": "Los teléfonos se volverán raros la próxima semana",
        "summary": "Se espera que el Mobile World Congress presente numerosos teléfonos y dispositivos innovadores y no convencionales de fabricantes en todo el mundo, particularmente empresas chinas y creadores de nicho, alejándose del mercado de smartphones cada vez más uniforme. El evento presentará desde teléfonos modulares hasta dispositivos con especificaciones inusuales y características extraordinarias."
      }
    }
  },
  {
    "title": "MWC 2026: all the phones, gadgets, and announcements from Barcelona",
    "slug": "mwc-2026-phones-gadgets-announcements-barcelona",
    "url": "https://www.theverge.com/tech/882980/mwc-2026-news-phones-gadgets-announcements",
    "source": "The Verge",
    "date": "2026-02-27T11:49:00.000Z",
    "summary": "Mobile World Congress 2026 in Barcelona will feature major announcements from leading technology companies including Xiaomi, Honor, Samsung, Google, and Nothing, with expected introductions of cutting-edge smartphones, tablets, and wearables. The show is expected to showcase both established products and experimental devices, continuing the tradition of featuring unusual designs and innovative technologies.",
    "content": "The Verge is heading to Barcelona, Spain, for Mobile World Congress, the biggest phone show of the year.\nCES may dominate the headlines when it comes to TVs, computer components, and AI inanity, but for all things mobile, MWC has it beat. Since it’s a global show, that includes all manner of announcements of phones, tablets, and wearables that won’t necessarily release in the US.\nXiaomi has already teased a European launch for its 17 and 17 Ultra flagships, Honor is promising not only its Robot Phone but a full pivot to humanoid robotics, and Nothing is almost certain to drop more details on its Phone 4A ahead of a planned London launch on March 5th.\nThe likes of Samsung and Google will be there too, but mostly to talk about the already-announced 10A and S26 models, while Apple is launching something during the same week as MWC, but not actually in Barcelona.\nWe’ll also be looking out for oddities. Last year featured camera phone concepts with detachable lenses,  a Lenovo laptop with a folding screen, and an Infinix handset with a solar panel in its back. We’ll be hoping this year gets just as weird.\nKeep this page bookmarked for all the news, commentary, and first looks from the show floor.\nPhones are going to get weird next week\n\t\t\t\nXiaomi’s magnetic power bank is incredibly thin\n\t\t\t\nHonor’s new MagicPad 4 is the world’s thinnest Android tablet\n\t\t\t\nTecno is doing a modular phone (again).\n\t\t\t\nTaara Beam provides 25Gbps connectivity over invisible beams of light\n\t\t\t\nHonor is pivoting to robots.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "MWC 2026：来自巴塞罗那的所有手机、小工具和发布会",
        "summary": "2026年巴塞罗那世界移动通信大会将展示小米、荣耀、三星、谷歌和Nothing等领先科技公司的重要发布会，预计将推出尖端智能手机、平板电脑和可穿戴设备。该展会预计将展示成熟产品和实验性设备，延续展示不寻常设计和创新技术的传统。"
      },
      "fr": {
        "title": "MWC 2026 : tous les téléphones, gadgets et annonces de Barcelone",
        "summary": "Le Congrès mondial du mobile 2026 à Barcelone mettra en vedette les principales annonces des entreprises technologiques leaders, notamment Xiaomi, Honor, Samsung, Google et Nothing, avec des introductions attendues de smartphones, tablettes et appareils portables de pointe. Le salon devrait présenter des produits établis et des appareils expérimentaux, poursuivant la tradition de présenter des conceptions inhabituelles et des technologies innovantes."
      },
      "de": {
        "title": "MWC 2026: Alle Telefone, Gadgets und Ankündigungen aus Barcelona",
        "summary": "Der Mobile World Congress 2026 in Barcelona wird wichtige Ankündigungen führender Technologieunternehmen wie Xiaomi, Honor, Samsung, Google und Nothing zeigen, mit erwarteten Einführungen von hochmodernen Smartphones, Tablets und Wearables. Die Messe soll sowohl etablierte Produkte als auch experimentelle Geräte präsentieren und setzt damit die Tradition fort, ungewöhnliche Designs und innovative Technologien zu zeigen."
      },
      "es": {
        "title": "MWC 2026: todos los teléfonos, gadgets y anuncios de Barcelona",
        "summary": "El Congreso Mundial de Móviles 2026 en Barcelona presentará los principales anuncios de las principales empresas tecnológicas, incluyendo Xiaomi, Honor, Samsung, Google y Nothing, con introducciones esperadas de smartphones, tabletas y dispositivos portátiles de última generación. Se espera que la feria muestre productos establecidos y dispositivos experimentales, continuando la tradición de presentar diseños inusuales y tecnologías innovadoras."
      }
    }
  },
  {
    "title": "Ultrahuman bets on redesigned smart ring to win back U.S. market after Oura dispute",
    "slug": "ultrahuman-ring-pro-us-market-comeback",
    "url": "https://techcrunch.com/2026/02/27/ultrahuman-unveils-new-smart-ring-as-it-awaits-u-s-clearance-after-oura-dispute/",
    "source": "TechCrunch",
    "date": "2026-02-27T11:00:00.000Z",
    "summary": "Ultrahuman is launching its redesigned Ring Pro smart ring priced at $479 as a strategic move to regain market position in the U.S. wearables market following competition in the sector. The Ring Pro offers 15 days of battery life, representing a significant improvement in the competitive smart ring category.",
    "content": "Ultrahuman’s Ring Pro promises 15-day battery life and a $479 price tag as the wearables maker expands its health-tech push.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Ultrahuman押注重新设计的智能戒指以重新赢得美国市场，结束与Oura的纠纷",
        "summary": "Ultrahuman推出售价479美元的重新设计的Ring Pro智能戒指，作为在美国可穿戴设备市场中重新获得市场地位的战略举措。Ring Pro提供15天的电池寿命，代表了竞争激烈的智能戒指类别中的显著改进。"
      },
      "fr": {
        "title": "Ultrahuman mise sur une bague intelligente redessinée pour reconquérir le marché américain après le différend avec Oura",
        "summary": "Ultrahuman lance sa bague intelligente Ring Pro redessinée au prix de 479 dollars comme un mouvement stratégique pour retrouver sa position sur le marché des appareils portables aux États-Unis. La Ring Pro offre 15 jours d'autonomie, ce qui représente une amélioration significative dans la catégorie des bagues intelligentes compétitives."
      },
      "de": {
        "title": "Ultrahuman setzt auf neu gestalteten Smart Ring, um den US-Markt nach Oura-Streit zurückzugewinnen",
        "summary": "Ultrahuman bringt seinen neu gestalteten Smart Ring Ring Pro zum Preis von 479 Dollar als strategischen Schritt auf den Markt, um seine Marktposition auf dem US-Wearables-Markt zurückzugewinnen. Der Ring Pro bietet eine Akkulaufzeit von 15 Tagen, was eine erhebliche Verbesserung in der wettbewerbsintensiven Smartring-Kategorie darstellt."
      },
      "es": {
        "title": "Ultrahuman apuesta por un anillo inteligente rediseñado para recuperar el mercado estadounidense después de la disputa con Oura",
        "summary": "Ultrahuman lanza su anillo inteligente Ring Pro rediseñado con un precio de $479 como un movimiento estratégico para recuperar su posición en el mercado de dispositivos portátiles en EE.UU. El Ring Pro ofrece 15 días de duración de la batería, lo que representa una mejora significativa en la categoría de anillos inteligentes competitivos."
      }
    }
  },
  {
    "title": "Plaid valued at $8B in employee share sale",
    "slug": "plaid-valued-8-billion-employee-share-sale",
    "url": "https://techcrunch.com/2026/02/26/plaid-valued-at-8b-in-employee-share-sale/",
    "source": "TechCrunch",
    "date": "2026-02-27T07:19:05.000Z",
    "summary": "Payment infrastructure company Plaid achieved an $8 billion valuation in an employee share sale, marking a 31% increase from its previous $6.1 billion valuation reached in April. The milestone demonstrates investor confidence in Plaid's growing market position in payment technology.",
    "content": "The new valuation is a 31% increase from $6.1 billion Plaid reached in April.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Plaid在员工股份出售中估值80亿美元",
        "summary": "支付基础设施公司Plaid在员工股份出售中达到了80亿美元的估值，比之前在4月达到的60.1亿美元的估值增加了31%。这个里程碑表明投资者对Plaid在支付技术领域不断增长的市场地位的信心。"
      },
      "fr": {
        "title": "Plaid valorisé à 8 milliards de dollars lors d'une vente d'actions aux employés",
        "summary": "La société d'infrastructure de paiement Plaid a atteint une valorisation de 8 milliards de dollars lors d'une vente d'actions aux employés, marquant une augmentation de 31% par rapport à sa valorisation précédente de 6,1 milliards de dollars atteinte en avril. Cette étape démontre la confiance des investisseurs dans la position de marché croissante de Plaid dans la technologie des paiements."
      },
      "de": {
        "title": "Plaid mit 8 Milliarden Dollar in Mitarbeitereigentumsverkauf bewertet",
        "summary": "Das Zahlungsinfrastruktur-Unternehmen Plaid erreichte eine Bewertung von 8 Milliarden Dollar in einem Mitarbeitereigentumsverkauf, was einer Steigerung von 31% gegenüber seiner vorherigen Bewertung von 6,1 Milliarden Dollar im April entspricht. Dies zeigt das Vertrauen der Investoren in Plaids wachsende Marktposition in der Zahlungstechnologie."
      },
      "es": {
        "title": "Plaid valorado en $8 mil millones en venta de acciones de empleados",
        "summary": "La empresa de infraestructura de pagos Plaid logró una valoración de $8 mil millones en una venta de acciones de empleados, marcando un aumento del 31% desde su valoración anterior de $6.1 mil millones alcanzada en abril. Este hito demuestra la confianza de los inversores en la posición de mercado creciente de Plaid en tecnología de pagos."
      }
    }
  }
]