[
  {
    "title": "Gushwork bets on AI search for customer leads — and early results are emerging",
    "slug": "gushwork-ai-search-customer-leads",
    "url": "https://techcrunch.com/2026/02/25/gushwork-bets-on-ai-search-for-customer-leads-and-early-results-are-emerging/",
    "source": "TechCrunch",
    "date": "2026-02-26T00:00:00.000Z",
    "summary": "Gushwork, a startup leveraging AI search tools like ChatGPT for customer lead generation, has raised $9 million in a seed round led by SIG and Lightspeed. Early customer traction suggests the approach is gaining market interest.",
    "content": "Gushwork has raised $9 million in a seed round led by SIG and Lightspeed. The startup has seen early customer traction from AI search tools like ChatGPT.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Gushwork 押注 AI 搜索获取客户线索——早期成果正在出现",
        "summary": "初创公司 Gushwork 利用 ChatGPT 等 AI 搜索工具进行客户线索生成，已在由 SIG 和 Lightspeed 领投的种子轮中融资 900 万美元。早期客户吸引力表明该方法正在获得市场关注。"
      },
      "fr": {
        "title": "Gushwork parie sur la recherche IA pour générer des prospects — et les premiers résultats émergent",
        "summary": "Gushwork, une startup exploitant des outils de recherche IA comme ChatGPT pour la génération de prospects, a levé 9 millions de dollars au cours d'un tour de financement dirigé par SIG et Lightspeed. L'intérêt des premiers clients suggère que cette approche gagne du terrain."
      },
      "de": {
        "title": "Gushwork setzt auf KI-Suche für Kundenakquise — erste Ergebnisse zeichnen sich ab",
        "summary": "Gushwork, ein Startup, das KI-Suchwerkzeuge wie ChatGPT zur Kundenakquise nutzt, hat in einer von SIG und Lightspeed angeführten Seed-Runde 9 Millionen Dollar aufgebracht. Frühe Kundenbindung deutet darauf hin, dass der Ansatz Marktinteresse gewinnt."
      },
      "es": {
        "title": "Gushwork apuesta por la búsqueda de IA para generar clientes — y los primeros resultados están emergiendo",
        "summary": "Gushwork, una startup que aprovecha herramientas de búsqueda de IA como ChatGPT para la generación de clientes, ha recaudado 9 millones de dólares en una ronda de semilla liderada por SIG y Lightspeed. El interés inicial de los clientes sugiere que el enfoque está ganando tracción en el mercado."
      }
    }
  }
]