[
  {
    "title": "Netflix backs out of bid for Warner Bros. Discovery, giving studios, HBO, and CNN to Ellison-owned Paramount",
    "slug": "netflix-backs-out-warner-bros-paramount",
    "url": "https://techcrunch.com/2026/02/26/netflix-warner-bros-discovery-paramount-wbd-bid-studios-hbo-cnn-ellison/",
    "source": "TechCrunch",
    "date": "2026-02-26T23:55:39.000Z",
    "summary": "Netflix has withdrawn its $83 billion bid to acquire Warner Bros. Discovery, allowing Paramount to complete the acquisition instead. The streamer determined the required price was no longer financially attractive despite strong deal fundamentals.",
    "content": "In a one-two punch of centibillion-dollar offers, the bidding war for Warner Bros. Discovery is over. David Ellison-owned Paramount will acquire Warner Bros. Discovery. Netflix has lost.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Netflix放弃竞购华纳兄弟探险公司,将电影制片厂、HBO和CNN留给埃里森旗下的派拉蒙",
        "summary": "Netflix已撤回其830亿美元收购华纳兄弟探险公司的竞价,允许派拉蒙完成收购。尽管交易基本面强劲,但这家流媒体公司认为所需价格不再在财务上具有吸引力。"
      },
      "fr": {
        "title": "Netflix abandonne son offre pour Warner Bros. Discovery, laissant les studios, HBO et CNN à Paramount détenu par Ellison",
        "summary": "Netflix a retiré son offre de 83 milliards de dollars pour acquérir Warner Bros. Discovery, permettant à Paramount de conclure l'acquisition à la place. Le diffuseur a jugé que le prix requis n'était plus financièrement attrayant malgré les fondamentaux solides de l'accord."
      },
      "de": {
        "title": "Netflix zieht sich aus dem Angebot für Warner Bros. Discovery zurück und überlässt die Studios, HBO und CNN dem von Ellison kontrollierten Paramount",
        "summary": "Netflix hat sein Angebot von 83 Milliarden Dollar zur Übernahme von Warner Bros. Discovery zurückgezogen und ermöglicht Paramount, die Übernahme stattdessen abzuschließen. Das Unternehmen stellte fest, dass der erforderliche Preis trotz starker Geschäftsfundamente nicht mehr finanziell attraktiv war."
      },
      "es": {
        "title": "Netflix se retira de la puja por Warner Bros. Discovery, dejando los estudios, HBO y CNN a Paramount propiedad de Ellison",
        "summary": "Netflix ha retirado su oferta de $83 mil millones para adquirir Warner Bros. Discovery, permitiendo que Paramount complete la adquisición en su lugar. El servicio de transmisión determinó que el precio requerido ya no era financieramente atractivo a pesar de los fundamentos sólidos del acuerdo."
      }
    }
  },
  {
    "title": "Jack Dorsey just halved the size of Block’s employee base — and he says your company is next",
    "slug": "jack-dorsey-block-cuts-staff-ai",
    "url": "https://techcrunch.com/2026/02/26/jack-dorsey-block-layoffs-4000-halved-employees-your-company-is-next/",
    "source": "TechCrunch",
    "date": "2026-02-26T23:43:32.000Z",
    "summary": "Jack Dorsey cut Block's workforce by nearly half to under 6,000 employees, attributing the downsizing to AI enabling smaller, more efficient teams. Dorsey suggests other companies may follow with similar reductions.",
    "content": "Jack Dorsey has long been an open admirer of Elon Musk. Now, it seems, he may have been taking notes.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "杰克·多尔西刚刚将Block的员工规模减半——他说你的公司接下来",
        "summary": "杰克·多尔西将Block的员工队伍减少了近一半,至6000人以下,他将缩减归因于AI使更小、更高效的团队成为可能。多尔西暗示其他公司可能会跟进进行类似的裁员。"
      },
      "fr": {
        "title": "Jack Dorsey vient de réduire de moitié la taille de l'effectif de Block — et il dit que votre entreprise est la prochaine",
        "summary": "Jack Dorsey a réduit l'effectif de Block de près de moitié à moins de 6 000 employés, attribuant le redimensionnement à l'IA permettant des équipes plus petites et plus efficaces. Dorsey suggère que d'autres entreprises pourraient suivre avec des réductions similaires."
      },
      "de": {
        "title": "Jack Dorsey hat die Größe der Belegschaft von Block gerade halbiert — und er sagt, dass dein Unternehmen als nächstes an der Reihe ist",
        "summary": "Jack Dorsey hat die Belegschaft von Block um fast die Hälfte auf unter 6.000 Mitarbeiter reduziert und führt die Verringerung darauf zurück, dass KI kleinere, effizientere Teams ermöglicht. Dorsey deutet an, dass andere Unternehmen möglicherweise ähnliche Kürzungen vornehmen werden."
      },
      "es": {
        "title": "Jack Dorsey acaba de reducir a la mitad el tamaño de la plantilla de Block — y dice que tu empresa es la siguiente",
        "summary": "Jack Dorsey redujo la fuerza laboral de Block casi a la mitad a menos de 6.000 empleados, atribuyendo la reducción a que la IA permite equipos más pequeños y eficientes. Dorsey sugiere que otras empresas pueden seguir con reducciones similares."
      }
    }
  },
  {
    "title": "Anthropic refuses Pentagon’s new terms, standing firm on lethal autonomous weapons and mass surveillance",
    "slug": "anthropic-refuses-pentagon-ai-demands",
    "url": "https://www.theverge.com/news/885773/anthropic-department-of-defense-dod-pentagon-refusal-terms-hegseth-dario-amodei",
    "source": "The Verge",
    "date": "2026-02-26T23:22:44.000Z",
    "summary": "Anthropic refused the Pentagon's demands for unrestricted AI system access, maintaining its stance against mass surveillance and lethal autonomous weapons deployment. The company stood firm despite Defense Secretary Pete Hegseth's ultimatum deadline.",
    "content": "Less than 24 hours before the deadline in an ultimatum issued by the Pentagon, Anthropic has refused the Department of Defense's demands for unrestricted access to its AI. \nIt's the culmination of a dramatic exchange of public statements, social media posts, and behind-the-scenes negotiations, coming down to Defense Secretary Pete Hegseth's desire to renegotiate all AI labs' current contracts with the military. But Anthropic, so far, has refused to back down from its two current red lines: no mass surveillance of Americans, and no lethal autonomous weapons (or weapons with license to kill targets with no human oversight whatsoever). OpenAI  …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Anthropic拒绝五角大楼的新条款,在致命自主武器和大规模监控问题上坚持立场",
        "summary": "Anthropic拒绝了五角大楼要求不受限制的AI系统访问权限的要求,坚持其反对大规模监控和致命自主武器部署的立场。尽管国防部长皮特·赫格塞特设定了最后期限,该公司仍然坚守立场。"
      },
      "fr": {
        "title": "Anthropic refuse les nouvelles conditions du Pentagone, restant ferme sur les armes autonomes mortelles et la surveillance de masse",
        "summary": "Anthropic a refusé les demandes du Pentagone d'accès illimité aux systèmes d'IA, maintenant sa position contre la surveillance de masse et le déploiement d'armes autonomes mortelles. L'entreprise a tenu bon malgré l'ultimatum du secrétaire à la Défense Pete Hegseth."
      },
      "de": {
        "title": "Anthropic lehnt die neuen Bedingungen des Pentagons ab und beharrt auf seiner Position zu tödlichen autonomen Waffen und Massenüberwachung",
        "summary": "Anthropic lehnte die Forderungen des Pentagons nach unbegrenztem Zugriff auf KI-Systeme ab und behielt seine Position gegen Massenüberwachung und den Einsatz tödlicher autonomer Waffen bei. Das Unternehmen blieb standhaft trotz des Ultimatums von Verteidigungsminister Pete Hegseth."
      },
      "es": {
        "title": "Anthropic rechaza los nuevos términos del Pentágono, manteniéndose firme en las armas autónomas letales y la vigilancia masiva",
        "summary": "Anthropic rechazó las demandas del Pentágono de acceso sin restricciones a los sistemas de IA, manteniendo su posición contra la vigilancia masiva y el despliegue de armas autónomas letales. La empresa se mantuvo firme a pesar del ultimátum del Secretario de Defensa Pete Hegseth."
      }
    }
  },
  {
    "title": "Anthropic CEO stands firm as Pentagon deadline looms",
    "slug": "anthropic-ceo-pentagon-deadline",
    "url": "https://techcrunch.com/2026/02/26/anthropic-ceo-stands-firm-as-pentagon-deadline-looms/",
    "source": "TechCrunch",
    "date": "2026-02-26T23:19:06.000Z",
    "summary": "Anthropic CEO Dario Amodei stated he cannot accept the Pentagon's requirements for unrestricted military access to the company's AI systems. The refusal marks a significant confrontation as the Defense Department deadline approaches.",
    "content": "Anthropic CEO Dario Amodei said Thursday that he \"cannot in good conscience accede\" to the Pentagon's demands to give the military unrestricted access to its AI systems.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Anthropic CEO 坚守立场，五角大楼期限逼近",
        "summary": "Anthropic CEO Dario Amodei 表示他无法接受五角大楼对该公司AI系统不受限制的军事访问权的要求。这一拒绝标志着在国防部期限接近时发生了重大对抗。"
      },
      "fr": {
        "title": "Le PDG d'Anthropic tient bon alors que la date limite du Pentagone approche",
        "summary": "Le PDG d'Anthropic, Dario Amodei, a déclaré qu'il ne pouvait pas accepter les exigences du Pentagone concernant un accès militaire sans restriction aux systèmes d'IA de l'entreprise. Ce refus marque une confrontation importante alors que la date limite du Département de la Défense approche."
      },
      "de": {
        "title": "CEO von Anthropic bleibt standhaft, während die Pentagon-Frist näher rückt",
        "summary": "Der CEO von Anthropic, Dario Amodei, erklärte, dass er die Anforderungen des Pentagons für unbeschränkten Militärzugriff auf die KI-Systeme des Unternehmens nicht akzeptieren kann. Die Verweigerung markiert eine bedeutende Konfrontation, da die Frist des Verteidigungsministeriums näher rückt."
      },
      "es": {
        "title": "El CEO de Anthropic se mantiene firme mientras se acerca la fecha límite del Pentágono",
        "summary": "El CEO de Anthropic, Dario Amodei, declaró que no puede aceptar los requisitos del Pentágono para acceso militar sin restricciones a los sistemas de IA de la empresa. La negativa marca una confrontación significativa a medida que se acerca la fecha límite del Departamento de Defensa."
      }
    }
  },
  {
    "title": "Neanderthals seemed to have a thing for modern human women",
    "slug": "neanderthals-modern-human-women",
    "url": "https://arstechnica.com/science/2026/02/genomes-chart-the-history-of-neanderthal-modern-human-interactions/",
    "source": "Ars Technica",
    "date": "2026-02-26T23:16:46.000Z",
    "summary": "Genetic analysis reveals Neanderthals predominantly mated with modern human females, evidenced by patterns in human DNA called \"Neanderthal deserts.\" The findings provide new understanding of prehistoric human species interactions.",
    "content": "\"Neanderthal deserts\" in our genomes suggest a strong pattern in matings.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "尼安德特人似乎对现代人类女性情有独钟",
        "summary": "遗传分析表明尼安德特人主要与现代人类女性交配，这从人类DNA中称为\"尼安德特人沙漠\"的模式可以看出。这些发现为史前人类物种相互作用提供了新的理解。"
      },
      "fr": {
        "title": "Les Néandertaliens semblaient avoir un faible pour les femmes humaines modernes",
        "summary": "L'analyse génétique révèle que les Néandertaliens se sont principalement accouplés avec des femelles humaines modernes, comme en témoignent les motifs de l'ADN humain appelés « déserts de Néandertal ». Les résultats offrent une nouvelle compréhension des interactions entre les espèces humaines préhistoriques."
      },
      "de": {
        "title": "Neandertaler schienen ein Faible für Frauen der modernen Menschheit zu haben",
        "summary": "Die genetische Analyse zeigt, dass sich Neandertaler hauptsächlich mit modernen menschlichen Frauen gepaart haben, was sich in Mustern der menschlichen DNA widerspiegelt, die als \"Neandertaler-Wüsten\" bezeichnet werden. Die Ergebnisse bieten ein neues Verständnis der Wechselwirkungen zwischen prähistorischen Menschenarten."
      },
      "es": {
        "title": "Los neandertales parecían tener debilidad por las mujeres humanas modernas",
        "summary": "El análisis genético revela que los neandertales se apareaban predominantemente con hembras humanas modernas, evidenciado por patrones en el ADN humano llamados \"desiertos de Neandertal\". Los hallazgos proporcionan una nueva comprensión de las interacciones entre especies humanas prehistóricas."
      }
    }
  },
  {
    "title": "Netflix walks away from its deal to buy Warner Bros. after Paramount came back with a better offer",
    "slug": "netflix-declines-match-paramount-bid",
    "url": "https://www.theverge.com/streaming/885753/netflix-exit-warner-bros-discovery-deal-paramount",
    "source": "The Verge",
    "date": "2026-02-26T23:10:12.000Z",
    "summary": "Netflix abandoned its acquisition bid for Warner Bros., HBO, and HBO Max after Paramount offered a higher price that Netflix declined to match. The company cited discipline in avoiding financially unattractivedeals.",
    "content": "Netflix has dropped its $83 billion deal to acquire the Warner Bros. studio, HBO, and its streaming service HBO Max. In an announcement on Thursday, co-CEOs Ted Sarandos and Greg Peters say the streamer is \"declining to match\" the new bid made by Paramount:\nThe transaction we negotiated would have created shareholder value with a clear path to regulatory approval. However, we've always been disciplined, and at the price required to match Paramount Skydance's latest offer, the deal is no longer financially attractive, so we are declining to match the Paramount Skydance bid.\nWe believe we would have been strong stewards of Warner Bros.' i …\n\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Netflix 在派拉蒙提出更好的报价后放弃了购买华纳兄弟的交易",
        "summary": "Netflix 在派拉蒙提供更高价格且 Netflix 拒绝匹配后，放弃了对华纳兄弟、HBO 和 HBO Max 的收购竞价。该公司声称这是避免财务上不具吸引力的交易的自律举措。"
      },
      "fr": {
        "title": "Netflix se retire de son accord d'achat de Warner Bros. après que Paramount revienne avec une offre meilleure",
        "summary": "Netflix a abandonné son offre d'acquisition de Warner Bros., HBO et HBO Max après que Paramount ait proposé un prix plus élevé que Netflix a refusé d'égaler. La société a invoqué sa discipline dans la prévention des accords financièrement peu attrayants."
      },
      "de": {
        "title": "Netflix zieht sich von seinem Deal zum Kauf von Warner Bros. zurück, nachdem Paramount mit einem besseren Angebot zurückkommt",
        "summary": "Netflix hat sein Übernahmeangebot für Warner Bros., HBO und HBO Max aufgegeben, nachdem Paramount einen höheren Preis angeboten hatte, den Netflix nicht bereit war zu zahlen. Das Unternehmen führte Disziplin bei der Vermeidung von finanziell unattraktiven Geschäften an."
      },
      "es": {
        "title": "Netflix se retira de su acuerdo para comprar Warner Bros. después de que Paramount regresa con una oferta mejor",
        "summary": "Netflix abandonó su oferta de adquisición de Warner Bros., HBO y HBO Max después de que Paramount ofreciera un precio más alto que Netflix se negó a igualar. La empresa citó disciplina en la evitación de acuerdos financieramente poco atractivos."
      }
    }
  },
  {
    "title": "Microsoft&#8217;s Copilot Tasks AI uses its own computer to get things done",
    "slug": "microsoft-copilot-tasks-cloud-ai",
    "url": "https://www.theverge.com/tech/885741/microsoft-copilot-tasks-ai",
    "source": "The Verge",
    "date": "2026-02-26T22:56:09.000Z",
    "summary": "Microsoft's Copilot Tasks AI system runs on Microsoft's cloud infrastructure to handle background tasks like scheduling and study planning without draining user device resources. The tool accepts natural language instructions and can run on recurring or one-time basis.",
    "content": "Microsoft is previewing a new AI system, Copilot Tasks, that it says is designed to take care of busywork for you in the background, the company announced on Thursday. The feature takes the load off your device using its own cloud-based computer and browser, allowing it to handle a variety of jobs ranging from scheduling appointments to generating study plans while you do something else.\nAs noted by Microsoft, you can describe what you need to Copilot Tasks using natural language, and assign Copilot Tasks to complete jobs on a recurring, scheduled, or one-time basis. Copilot Tasks will provide a report once its work is complete.\nYou can ca …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "微软的Copilot Tasks AI使用自己的计算机完成任务",
        "summary": "微软的Copilot Tasks AI系统在微软云基础设施上运行，处理日程安排和学习计划等后台任务，无需消耗用户设备资源。该工具接受自然语言指令，可按定期或一次性基础运行。"
      },
      "fr": {
        "title": "Copilot Tasks d'AI de Microsoft utilise son propre ordinateur pour accomplir des tâches",
        "summary": "Le système Copilot Tasks AI de Microsoft s'exécute sur l'infrastructure cloud de Microsoft pour gérer les tâches de fond comme la planification d'horaires et la planification d'études sans épuiser les ressources des appareils des utilisateurs. L'outil accepte les instructions en langage naturel et peut s'exécuter sur une base récurrente ou ponctuelle."
      },
      "de": {
        "title": "Microsofts Copilot Tasks AI nutzt seinen eigenen Computer, um Dinge zu erledigen",
        "summary": "Microsofts Copilot Tasks AI-System läuft auf Microsofts Cloud-Infrastruktur, um Hintergrundaufgaben wie Terminplanung und Studienplanung zu bewältigen, ohne Geräteressourcen des Benutzers zu verbrauchen. Das Tool akzeptiert Anweisungen in natürlicher Sprache und kann auf wiederkehrender oder einmaliger Basis ausgeführt werden."
      },
      "es": {
        "title": "Copilot Tasks AI de Microsoft usa su propia computadora para hacer cosas",
        "summary": "El sistema Copilot Tasks AI de Microsoft se ejecuta en la infraestructura en la nube de Microsoft para manejar tareas de fondo como programación y planificación de estudios sin agotar los recursos del dispositivo del usuario. La herramienta acepta instrucciones en lenguaje natural y puede ejecutarse de forma periódica o única."
      }
    }
  },
  {
    "title": "Perplexity announces \"Computer,\" an AI agent that assigns work to other AI agents",
    "slug": "perplexity-computer-ai-agent",
    "url": "https://arstechnica.com/ai/2026/02/perplexity-announces-computer-an-ai-agent-that-assigns-work-to-other-ai-agents/",
    "source": "Ars Technica",
    "date": "2026-02-26T22:53:18.000Z",
    "summary": "Perplexity introduced \"Computer,\" an AI agent that coordinates work among other AI agents, presenting a controlled alternative to broader multi-agent AI systems. The system represents a buttoned-down approach to agent coordination.",
    "content": "It's also a buttoned-down, ostensibly safer take on the OpenClaw concept.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Perplexity宣布\"Computer\"，一个向其他AI代理分配工作的AI代理",
        "summary": "Perplexity推出了\"Computer\"，一个在其他AI代理之间协调工作的AI代理，提供了对更广泛的多代理AI系统的受控替代方案。该系统代表了代理协调的有条不紊的方法。"
      },
      "fr": {
        "title": "Perplexity annonce \"Computer\", un agent IA qui assigne du travail à d'autres agents IA",
        "summary": "Perplexity a introduit \"Computer\", un agent IA qui coordonne le travail entre d'autres agents IA, présentant une alternative contrôlée aux systèmes IA multi-agents plus larges. Le système représente une approche bien structurée de la coordination des agents."
      },
      "de": {
        "title": "Perplexity kündigt \"Computer\" an, einen KI-Agent, der Arbeit an andere KI-Agenten verteilt",
        "summary": "Perplexity führte \"Computer\" ein, einen KI-Agent, der die Arbeit zwischen anderen KI-Agenten koordiniert und eine kontrollierte Alternative zu umfassenderen Multi-Agent-KI-Systemen bietet. Das System stellt einen gut strukturierten Ansatz zur Agent-Koordination dar."
      },
      "es": {
        "title": "Perplexity anuncia \"Computer\", un agente de IA que asigna trabajo a otros agentes de IA",
        "summary": "Perplexity introdujo \"Computer\", un agente de IA que coordina el trabajo entre otros agentes de IA, presentando una alternativa controlada a sistemas de IA multi-agente más amplios. El sistema representa un enfoque bien organizado para la coordinación de agentes."
      }
    }
  },
  {
    "title": "PayPal might not be looking to sell itself: Report",
    "slug": "paypal-not-looking-sell",
    "url": "https://techcrunch.com/2026/02/26/paypal-might-not-be-looking-to-sell-itself-report/",
    "source": "TechCrunch",
    "date": "2026-02-26T22:23:42.000Z",
    "summary": "Sources suggest PayPal may not be in acquisition talks, contradicting earlier reports that Stripe was considering a purchase. The company's acquisition status remains unclear.",
    "content": "PayPal may not be in talks to be acquired, sources have told Semafor, after a previous news report that Stripe was sniffing around.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "PayPal可能不想出售自己：报告",
        "summary": "消息人士表示PayPal可能没有进行收购谈判，这与早前关于Stripe正在考虑收购的报告相矛盾。该公司的收购状态仍不清楚。"
      },
      "fr": {
        "title": "PayPal pourrait ne pas chercher à se vendre: Rapport",
        "summary": "Des sources suggèrent que PayPal pourrait ne pas être en pourparlers d'acquisition, contredisant les rapports antérieurs selon lesquels Stripe envisageait un achat. Le statut d'acquisition de l'entreprise reste flou."
      },
      "de": {
        "title": "PayPal könnte nicht daran interessiert sein, sich selbst zu verkaufen: Bericht",
        "summary": "Quellen deuten darauf hin, dass PayPal möglicherweise nicht in Übernahmeverhandlungen ist, was früheren Berichten widerspricht, wonach Stripe einen Kauf in Betracht zieht. Der Akquisitionsstatus des Unternehmens bleibt unklar."
      },
      "es": {
        "title": "PayPal podría no estar buscando vender: Informe",
        "summary": "Las fuentes sugieren que PayPal podría no estar en conversaciones de adquisición, lo que contradice informes anteriores de que Stripe estaba considerando una compra. El estado de adquisición de la empresa sigue siendo incierto."
      }
    }
  },
  {
    "title": "xAI spent $7M building wall that barely muffles annoying power plant noise",
    "slug": "xai-sound-wall-power-plant",
    "url": "https://arstechnica.com/tech-policy/2026/02/pops-whines-and-roars-xai-accused-of-torturing-neighbors-of-noisy-power-plant/",
    "source": "Ars Technica",
    "date": "2026-02-26T22:19:39.000Z",
    "summary": "xAI spent $7 million constructing a sound wall around its power plant facility, but the barrier has proven inadequate at reducing noise pollution. Community frustration persists over ongoing noise disruption.",
    "content": "“Temu sound wall” not enough to quell fury over xAI’s power plant.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "xAI耗资700万美元建造隔音墙效果不佳",
        "summary": "xAI投入700万美元在其电力设施周围建造隔音墙，但该障碍物在降低噪音污染方面效果不足。社区对持续的噪音干扰感到沮丧。"
      },
      "fr": {
        "title": "xAI a dépensé 7 millions de dollars pour construire un mur qui atténue à peine le bruit gênant de la centrale électrique",
        "summary": "xAI a investi 7 millions de dollars dans la construction d'un mur antibruit autour de son installation électrique, mais la barrière s'est avérée insuffisante pour réduire la pollution sonore. La frustration communautaire persiste face aux perturbations sonores continues."
      },
      "de": {
        "title": "xAI gab 7 Millionen Dollar für eine Lärmschutzmauer aus, die das nervige Kraftwerksgeräusch kaum dämpft",
        "summary": "xAI investierte 7 Millionen Dollar in den Bau einer Lärmschutzmauer um seine Kraftwerksanlage, doch die Barriere erwies sich als unzureichend zur Lärmminderung. Die Frustration der Gemeinde bleibt angesichts der anhaltenden Lärmstörung bestehen."
      },
      "es": {
        "title": "xAI gastó $7 millones construyendo un muro que apenas mitiga el ruido molesto de la planta de energía",
        "summary": "xAI invirtió 7 millones de dólares en la construcción de un muro acústico alrededor de su instalación de energía, pero la barrera resultó insuficiente para reducir la contaminación acústica. La frustración comunitaria persiste por la continua interferencia de ruido."
      }
    }
  },
  {
    "title": "Jack Dorsey’s Block cuts nearly half of its staff in AI gamble",
    "slug": "block-cuts-staff-ai-dorsey",
    "url": "https://www.theverge.com/tech/885710/jack-dorsey-block-layoffs-job-cuts-ai",
    "source": "The Verge",
    "date": "2026-02-26T22:11:13.000Z",
    "summary": "Block laid off nearly half its workforce, reducing from over 10,000 to under 6,000 employees, with CEO Jack Dorsey citing AI's ability to enable smaller, more effective teams. Dorsey claims the business remains strong and profitable despite the cuts.",
    "content": "Jack Dorsey's Block, the financial tech company that runs Square and the Cash app, is cutting its workforce by \"nearly half\" and axing more than 4,000 jobs. The company will shrink from more than 10,000 people to less than 6,000, Dorsey says in a post on X. And the reason why? AI.\n\"We're not making this decision because we're in trouble,\" Dorsey says. \"Our business is strong. Gross profit continues to grow, we continue to serve more and more customers, and profitability is improving. But something has changed. We're already seeing that the intelligence tools we're creating and using, paired with smaller and flatter teams, are enabling a new …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "杰克·多西的Block公司在AI赌注中裁员近一半",
        "summary": "Block公司裁员近一半，员工从10000多人减至6000以下，首席执行官杰克·多西声称AI能够使团队更小、更高效。多西声称尽管进行了裁员，但公司业务仍然强劲且盈利。"
      },
      "fr": {
        "title": "Block de Jack Dorsey réduit de moitié son personnel dans un pari sur l'IA",
        "summary": "Block a licencié près de la moitié de ses effectifs, réduisant les effectifs de plus de 10 000 à moins de 6 000 employés, le PDG Jack Dorsey citant la capacité de l'IA à permettre des équipes plus petites et plus efficaces. Dorsey affirme que l'entreprise reste forte et rentable malgré les réductions."
      },
      "de": {
        "title": "Jack Dorseys Block entlässt fast die Hälfte des Personals als KI-Wette",
        "summary": "Block entließ fast die Hälfte seiner Belegschaft und reduzierte die Mitarbeiterzahl von über 10.000 auf unter 6.000, wobei CEO Jack Dorsey die Fähigkeit der KI hervorhob, kleinere und effektivere Teams zu ermöglichen. Dorsey behauptet, dass das Geschäft trotz der Entlassungen stark und rentabel bleibt."
      },
      "es": {
        "title": "Block de Jack Dorsey corta casi la mitad de su personal en una apuesta por IA",
        "summary": "Block despidió a casi la mitad de su fuerza laboral, reduciendo de más de 10,000 a menos de 6,000 empleados, con el CEO Jack Dorsey citando la capacidad de la IA para permitir equipos más pequeños y efectivos. Dorsey afirma que el negocio sigue siendo sólido y rentable a pesar de los despidos."
      }
    }
  },
  {
    "title": "Lenovo leak reveals a foldable gaming handheld that&#8217;s also a Windows laptop",
    "slug": "lenovo-legion-foldable-gaming-laptop",
    "url": "https://www.theverge.com/tech/885656/lenovo-legion-go-fold-concept-leak",
    "source": "The Verge",
    "date": "2026-02-26T22:08:15.000Z",
    "summary": "Lenovo's leaked Legion Go Fold is a foldable device that transforms between a 7.7-inch handheld gaming PC and an 11.6-inch laptop with adaptable controllers. The device features a POLED display hinge enabling multiple configuration options.",
    "content": "Image: WindowsLatest\t\n\nLenovo's next gaming laptop could be a shapeshifting foldable called the Legion Go Fold, which can be used as a laptop or a handheld gaming PC with two different display sizes, as WindowsLatest reports. Leaked images of the device show it attached to both a keyboard and controllers, with a hinge in the middle of the POLED display, allowing it to unfold from 7.7 inches to 11.6 inches. \nUsers can attach the controllers with the display folded or unfolded, use the display in a vertical split screen mode, or attach it to the keyboard for laptop mode, for a total of four different form factors rolled into one device. Even the controllers are con …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "联想泄露可折叠游戏掌机也是Windows笔记本电脑",
        "summary": "联想泄露的Legion Go Fold是一款可折叠设备，可在7.7英寸掌上游戏PC和11.6英寸笔记本电脑之间转换，配备可适配控制器。该设备采用POLED显示屏铰链，支持多种配置选项。"
      },
      "fr": {
        "title": "La fuite de Lenovo révèle un appareil de jeu portable pliable qui est aussi un ordinateur portable Windows",
        "summary": "Le Legion Go Fold divulgué de Lenovo est un appareil pliable qui se transforme entre un PC de jeu portable 7,7 pouces et un ordinateur portable 11,6 pouces avec des contrôleurs adaptables. L'appareil dispose d'une charnière d'affichage POLED permettant plusieurs options de configuration."
      },
      "de": {
        "title": "Lenovo-Leck enthüllt tragbaren faltbaren Gaming-Handheld, der auch ein Windows-Laptop ist",
        "summary": "Lenovo's durchgesickertes Legion Go Fold ist ein faltbares Gerät, das sich zwischen einem tragbaren Gaming-PC mit 7,7 Zoll und einem Laptop mit 11,6 Zoll mit anpassbaren Controllern verwandelt. Das Gerät verfügt über ein POLED-Display-Scharnier, das mehrere Konfigurationsoptionen ermöglicht."
      },
      "es": {
        "title": "La fuga de Lenovo revela un videojuego portátil plegable que también es una computadora portátil con Windows",
        "summary": "El Legion Go Fold filtrado de Lenovo es un dispositivo plegable que se transforma entre una PC de juegos portátil de 7,7 pulgadas y una computadora portátil de 11,6 pulgadas con controles adaptables. El dispositivo cuenta con una bisagra de pantalla POLED que permite múltiples opciones de configuración."
      }
    }
  },
  {
    "title": "Why no magnets in Galaxy S26? Samsung R&#038;D chief explains",
    "slug": "samsung-galaxy-s26-magnets-explained",
    "url": "https://www.theverge.com/news/885616/samsung-galaxy-s26-no-magnets-because-people-use-cases",
    "source": "The Verge",
    "date": "2026-02-26T21:57:12.000Z",
    "summary": "Samsung's R&D chief explains the Galaxy S26 lacks built-in magnets because added thickness isn't worthwhile, noting 80-90% of users purchase protective cases anyway. Consumers can use external magnetic accessories with their chosen case.",
    "content": "Magnet rings have changed my life. I grip and mount and satisfyingly snap awesome accessories on and off my phone all day. Even Samsung sells neat ones, like these folding magnetic mirrors. But unlike Apple and Google, Samsung refuses to put the magnets inside the phone.\nWhy? I asked Samsung's Won-Joon Choi, the executive in charge of both R&D and operations for Samsung's mobile business. He says the added thickness of magnets is a bad tradeoff to make, because you're just going to buy a case anyhow.\n\"About 80 or 90 percent of people are using a case, and cases with magnets are very popular these days,\" he tells me. \n\n \n @verge \nDouble magn …\n\n\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Galaxy S26为什么没有磁铁？三星研发负责人解释",
        "summary": "三星研发负责人解释Galaxy S26缺乏内置磁铁的原因是增加厚度不值得，他指出80-90%的用户购买保护壳。消费者可以使用外部磁性配件搭配选定的保护壳。"
      },
      "fr": {
        "title": "Pourquoi pas d'aimants dans le Galaxy S26 ? Le chef de la R&D de Samsung explique",
        "summary": "Le chef de la R&D de Samsung explique que le Galaxy S26 manque d'aimants intégrés car l'épaisseur supplémentaire n'en vaut pas la peine, notant que 80-90% des utilisateurs achètent des étuis de protection. Les consommateurs peuvent utiliser des accessoires magnétiques externes avec leur étui choisi."
      },
      "de": {
        "title": "Warum keine Magnete im Galaxy S26? Samsungs F&E-Chef erklärt",
        "summary": "Samsungs F&E-Chef erklärt, dass das Galaxy S26 über keine eingebauten Magnete verfügt, da die zusätzliche Dicke nicht lohnenswert ist. Er merkt an, dass 80-90% der Nutzer Schutzhüllen kaufen. Verbraucher können externe Magnetaccessoires mit ihrer gewählten Hülle verwenden."
      },
      "es": {
        "title": "¿Por qué no hay imanes en el Galaxy S26? El jefe de I+D de Samsung lo explica",
        "summary": "El jefe de I+D de Samsung explica que el Galaxy S26 carece de imanes incorporados porque el grosor añadido no vale la pena, señalando que el 80-90% de los usuarios compran fundas protectoras. Los consumidores pueden usar accesorios magnéticos externos con su funda elegida."
      }
    }
  },
  {
    "title": "The physics of squeaking sneakers",
    "slug": "physics-squeaking-sneakers",
    "url": "https://arstechnica.com/science/2026/02/the-physics-of-squeaking-sneakers/",
    "source": "Ars Technica",
    "date": "2026-02-26T21:48:37.000Z",
    "summary": "Research on sneaker tread patterns reveals how geometry affects squeaking frequency, with some tread blocks designed to produce Star Wars music. The study demonstrates unexpected physics behind footwear acoustics.",
    "content": "Geometry of tread patterns determines frequency, so blocks were designed to play Star Wars music.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "吱吱声运动鞋的物理学",
        "summary": "对运动鞋纹路的研究揭示了几何形状如何影响吱吱声频率，某些纹块被设计用来产生《星球大战》音乐。该研究展示了运动鞋声学背后的意外物理学。"
      },
      "fr": {
        "title": "La physique des baskets qui couinent",
        "summary": "La recherche sur les motifs de semelle des baskets révèle comment la géométrie affecte la fréquence du grincement, certains blocs de semelle étant conçus pour produire de la musique Star Wars. L'étude démontre une physique inattendue derrière l'acoustique des chaussures."
      },
      "de": {
        "title": "Die Physik quietschender Turnschuhe",
        "summary": "Die Forschung an Laufschuh-Profilmustern zeigt, wie die Geometrie die Quietschfrequenz beeinflusst, wobei einige Profilblöcke so gestaltet sind, dass sie Star-Wars-Musik erzeugen. Die Studie zeigt unerwartete Physik hinter der Schallakustik von Fußbekleidung."
      },
      "es": {
        "title": "La física de las zapatillas que chirrían",
        "summary": "La investigación sobre los patrones de la suela de las zapatillas revela cómo la geometría afecta la frecuencia del chirrido, con algunos bloques de suela diseñados para producir música de Star Wars. El estudio demuestra una física inesperada detrás de la acústica del calzado."
      }
    }
  },
  {
    "title": "Smartphone sales could be in for their biggest drop ever",
    "slug": "smartphone-sales-drop-2026-ram",
    "url": "https://www.theverge.com/gadgets/885638/smartphone-decline-ram-shortage-idc",
    "source": "The Verge",
    "date": "2026-02-26T21:22:39.000Z",
    "summary": "The smartphone industry faces a potential record 12.9% shipment decline in 2026 due to RAM shortages caused by AI data center demand, according to IDC forecasts. Average smartphone prices are expected to reach a record $523 despite lower volumes.",
    "content": "The smartphone industry could experience a record-breaking decline in 2026 as a result of the RAM shortage stemming from memory-hungry AI giants. That's according to the latest report from the International Data Corporation (IDC), which forecasts smartphone shipments to plummet 12.9 percent this year, marking its \"lowest annual shipment volume in more than a decade.\"\nAt the same time, the average selling price for smartphones is set to hit new highs, with IDC predicting a 14 percent increase to a record $523. \"While memory prices are projected to stabilize by mid-2027, they are unlikely to return to previous level,\" IDC senior researcher Na …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "智能手机销售可能面临有史以来最大的下滑",
        "summary": "根据IDC预测，智能手机行业在2026年可能面临创纪录的12.9%的出货量下降，原因是由于人工智能数据中心需求导致的内存短缺。尽管出货量较低，平均智能手机价格预计将达到创纪录的523美元。"
      },
      "fr": {
        "title": "Les ventes de smartphones pourraient connaître leur plus grand déclin jamais enregistré",
        "summary": "L'industrie des smartphones pourrait faire face à un déclin potentiel record de 12,9% des expéditions en 2026 en raison de pénuries de RAM causées par la demande des centres de données IA, selon les prévisions IDC. Les prix moyens des smartphones devraient atteindre un record de 523 $ malgré des volumes plus faibles."
      },
      "de": {
        "title": "Smartphone-Verkäufe könnten ihren größten Rückgang aller Zeiten erleben",
        "summary": "Die Smartphone-Industrie könnte 2026 einen potenziellen Rekordrückgang der Lieferungen um 12,9% aufgrund von RAM-Engpässen durch die Nachfrage von KI-Rechenzentren erleben, so IDC-Prognosen. Die durchschnittlichen Smartphone-Preise sollen trotz geringerer Mengen einen Rekord von 523 US-Dollar erreichen."
      },
      "es": {
        "title": "Las ventas de smartphones podrían experimentar su mayor caída en la historia",
        "summary": "La industria de smartphones enfrenta una posible caída récord del 12,9% en envíos en 2026 debido a la escasez de RAM causada por la demanda de centros de datos de IA, según pronósticos de IDC. Se espera que los precios promedio de smartphones alcancen un récord de $523 a pesar de menores volúmenes."
      }
    }
  },
  {
    "title": "Google paid startup Form Energy $1B for its massive 100-hour battery",
    "slug": "google-paid-startup-form-energy-1b-for-its-massive-100-hour-battery",
    "url": "https://techcrunch.com/2026/02/26/google-paid-startup-form-energy-1b-for-its-massive-100-hour-battery/",
    "source": "TechCrunch",
    "date": "2026-02-26T21:04:23.000Z",
    "summary": "The deal paves the way for Form Energy to raise a new funding round before potentially going public next year.",
    "content": "The deal paves the way for Form Energy to raise a new funding round before potentially going public next year.",
    "category": "tech"
  },
  {
    "title": "Samsung exec confirms you can blame RAM — and other materials — for the Galaxy S26’s higher price tag",
    "slug": "samsung-exec-confirms-you-can-blame-ram-and-other-materials-for-the-galaxy-s26-s",
    "url": "https://www.theverge.com/tech/885566/samsung-ram-galaxy-s26-price",
    "source": "The Verge",
    "date": "2026-02-26T20:57:19.000Z",
    "summary": "The Samsung Galaxy S26 and S26 Plus are \"more of the same for more money,\" my colleague Allison Johnson reported this week. Now, Samsung is confirming what we previously only suspected: RAMageddon is ",
    "content": "The Samsung Galaxy S26 and S26 Plus are \"more of the same for more money,\" my colleague Allison Johnson reported this week. Now, Samsung is confirming what we previously only suspected: RAMageddon is partly to blame.\nSamsung's Won-Joon Choi, the COO of its mobile business, tells The Verge that the memory shortage alone made a \"significant contribution\" to the price. All the increasing material costs factored into the Galaxy S26 and S26 Plus costing $100 more than their predecessors this year, as did tariffs, but the memory was \"significant,\" he tells me.\nThe S26 does come with double the storage this year at its higher price, with 256GB ra …\nRead the full story at The Verge.",
    "category": "tech"
  },
  {
    "title": "FTC declines to enforce a kids privacy law for data collected to verify users’ ages",
    "slug": "ftc-declines-to-enforce-a-kids-privacy-law-for-data-collected-to-verify-users-ag",
    "url": "https://www.theverge.com/policy/885592/ftc-age-verification-childrens-online-privacy-enforcement",
    "source": "The Verge",
    "date": "2026-02-26T20:42:17.000Z",
    "summary": "The Federal Trade Commission is encouraging companies to adopt age verification technologies by announcing it will not enforce a children's online privacy law against certain websites that collect and",
    "content": "The Federal Trade Commission is encouraging companies to adopt age verification technologies by announcing it will not enforce a children's online privacy law against certain websites that collect and use minors' personal data in order to verify their ages.\n\"Age verification technologies are some of the most child-protective technologies to emerge in decades,\" Christopher Mufarrige, the director of the Bureau of Consumer Protection, said in a press release. \"Our statement incentivizes operators to use these innovative tools, empowering parents to protect their children online.\"\nThere are certain criteria that websites need to meet in order …\nRead the full story at The Verge.",
    "category": "tech"
  },
  {
    "title": "Qualcomm won&#8217;t be announcing Windows gaming handhelds at GDC after all",
    "slug": "qualcomm-won-8217-t-be-announcing-windows-gaming-handhelds-at-gdc-after-all",
    "url": "https://www.theverge.com/games/885314/qualcomm-wont-be-announcing-windows-gaming-handhelds-at-gdc-after-all",
    "source": "The Verge",
    "date": "2026-02-26T20:25:17.000Z",
    "summary": "In January, Qualcomm hinted to The Verge that it might finally bring its powerful Arm-based Snapdragon processors to Windows gaming handhelds at the 2026 Game Developers Conference in San Francisco - ",
    "content": "In January, Qualcomm hinted to The Verge that it might finally bring its powerful Arm-based Snapdragon processors to Windows gaming handhelds at the 2026 Game Developers Conference in San Francisco - just in time to challenge Nvidia's own first Arm gaming CPU and Intel's first dedicated handheld gaming chips.\nBut plans have shifted, Qualcomm now tells me. It won't announce any updates to its Snapdragon G Series gaming chips there, nor offer the recently announced updates to the Snapdragon X line for journalists to try or benchmark. \n\"Snapdragon X Series and Snapdragon G Series processors are pushing the PC, desktop, and handheld gaming dev …\nRead the full story at The Verge.",
    "category": "tech"
  },
  {
    "title": "So, we’re getting Prada Meta AI glasses, right?",
    "slug": "so-we-re-getting-prada-meta-ai-glasses-right",
    "url": "https://techcrunch.com/2026/02/26/so-were-getting-prada-meta-ai-glasses-right/",
    "source": "TechCrunch",
    "date": "2026-02-26T20:11:55.000Z",
    "summary": "Mark Zuckerberg was at Prada's fashion week event in Milan, leaving everyone to wonder if we're getting Meta AI glasses under the Prada brand.",
    "content": "Mark Zuckerberg was at Prada's fashion week event in Milan, leaving everyone to wonder if we're getting Meta AI glasses under the Prada brand.",
    "category": "tech"
  },
  {
    "title": "Sophia Space raises $10M seed to demo novel space computers",
    "slug": "sophia-space-raises-10m-seed-to-demo-novel-space-computers",
    "url": "https://techcrunch.com/2026/02/26/sophia-space-raises-10m-seed-to-demo-novel-space-computers/",
    "source": "TechCrunch",
    "date": "2026-02-26T19:55:20.000Z",
    "summary": "The company's modular computer tiles offer a new vision for space data centers.",
    "content": "The company's modular computer tiles offer a new vision for space data centers.",
    "category": "tech"
  },
  {
    "title": "Memory shortage could cause the biggest dip in smartphone shipments in over a decade",
    "slug": "memory-shortage-could-cause-the-biggest-dip-in-smartphone-shipments-in-over-a-de",
    "url": "https://techcrunch.com/2026/02/26/memory-shortage-could-cause-the-biggest-smartphone-shipments-dip-in-over-a-decade/",
    "source": "TechCrunch",
    "date": "2026-02-26T19:43:51.000Z",
    "summary": "IDC says phone makers will ship only 1.12 billion smartphones as compared to 1.26 billion last year.",
    "content": "IDC says phone makers will ship only 1.12 billion smartphones as compared to 1.26 billion last year.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "内存短缺可能导致十多年来智能手机出货量最大幅下滑",
        "summary": "IDC表示手机制造商今年将仅出货11.2亿部智能手机，相比去年的12.6亿部。"
      },
      "fr": {
        "title": "La pénurie de mémoire pourrait causer la plus grande baisse des expéditions de smartphones en plus d'une décennie",
        "summary": "IDC déclare que les fabricants de téléphones n'expédieront que 1,12 milliard de smartphones par rapport à 1,26 milliard l'année dernière."
      },
      "de": {
        "title": "Speichermangel könnte zum größten Rückgang der Smartphone-Lieferungen in über einem Jahrzehnt führen",
        "summary": "IDC sagt, dass Telefonsteller nur 1,12 Milliarden Smartphones versenden werden, verglichen mit 1,26 Milliarden im letzten Jahr."
      },
      "es": {
        "title": "La escasez de memoria podría causar la mayor caída en los envíos de smartphones en más de una década",
        "summary": "IDC dice que los fabricantes de teléfonos enviarán solo 1.120 millones de smartphones en comparación con 1.260 millones el año pasado."
      }
    }
  },
  {
    "title": "Mistral AI inks a deal with global consulting giant Accenture",
    "slug": "mistral-ai-inks-a-deal-with-global-consulting-giant-accenture",
    "url": "https://techcrunch.com/2026/02/26/mistral-ai-inks-a-deal-with-global-consulting-giant-accenture/",
    "source": "TechCrunch",
    "date": "2026-02-26T19:17:27.000Z",
    "summary": "Mistral AI lands a partnership with Accenture, the consultant that has also recently announced partnerships with rivals OpenAI and Anthropic.",
    "content": "Mistral AI lands a partnership with Accenture, the consultant that has also recently announced partnerships with rivals OpenAI and Anthropic.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Mistral AI与全球咨询巨头埃森哲达成协议",
        "summary": "Mistral AI与埃森哲达成合作伙伴关系，这家咨询公司最近还宣布与竞争对手OpenAI和Anthropic建立合作伙伴关系。"
      },
      "fr": {
        "title": "Mistral AI conclut un accord avec le géant mondial du conseil Accenture",
        "summary": "Mistral AI établit un partenariat avec Accenture, le cabinet de conseil qui a récemment annoncé des partenariats avec ses rivaux OpenAI et Anthropic."
      },
      "de": {
        "title": "Mistral AI schließt einen Deal mit dem globalen Beratungsriesen Accenture ab",
        "summary": "Mistral AI geht eine Partnerschaft mit Accenture ein, dem Beratungsunternehmen, das kürzlich auch Partnerschaften mit seinen Konkurrenten OpenAI und Anthropic angekündigt hat."
      },
      "es": {
        "title": "Mistral AI firma un acuerdo con el gigante global de consultoría Accenture",
        "summary": "Mistral AI establece una asociación con Accenture, la consultora que también ha anunciado recientemente asociaciones con sus rivales OpenAI y Anthropic."
      }
    }
  },
  {
    "title": "Threads is testing a shortcut to quickly start DM conversations",
    "slug": "threads-dm-shortcut",
    "url": "https://techcrunch.com/2026/02/26/threads-is-testing-a-shortcut-to-quickly-start-dm-conversations/",
    "source": "TechCrunch",
    "date": "2026-02-26T17:58:53.000Z",
    "summary": "Threads is testing quick DM shortcuts where users can type \"DM me\" or \"Message me\" to generate hyperlinks for private conversations. This streamlines how users initiate direct messaging on the platform.",
    "content": "Users who are part of the test can type \"DM me\" or \"Message me\" in a post or reply to automatically generate a hyperlink that invites others to start a private conversation with them.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Threads正在测试快速启动DM对话的快捷方式",
        "summary": "Threads正在测试快速DM快捷方式，用户可以输入\"DM me\"或\"Message me\"来生成私密对话的超链接。这简化了用户在平台上发起直接消息的方式。"
      },
      "fr": {
        "title": "Threads teste un raccourci pour démarrer rapidement des conversations DM",
        "summary": "Threads teste des raccourcis DM rapides où les utilisateurs peuvent taper \"DM me\" ou \"Message me\" pour générer des hyperliens pour les conversations privées. Cela simplifie la façon dont les utilisateurs initient la messagerie directe sur la plateforme."
      },
      "de": {
        "title": "Threads testet eine Verknüpfung zum schnellen Starten von DM-Gesprächen",
        "summary": "Threads testet schnelle DM-Verknüpfungen, bei denen Benutzer \"DM me\" oder \"Message me\" eingeben können, um Hyperlinks für private Gespräche zu generieren. Dies vereinfacht die Art und Weise, wie Benutzer direkte Nachrichten auf der Plattform initiieren."
      },
      "es": {
        "title": "Threads está probando un atajo para iniciar rápidamente conversaciones DM",
        "summary": "Threads está probando atajos rápidos de DM donde los usuarios pueden escribir \"DM me\" o \"Message me\" para generar hipervínculos para conversaciones privadas. Esto simplifica cómo los usuarios inician mensajes directos en la plataforma."
      }
    }
  },
  {
    "title": "Razer’s new laptop sleeve wirelessly charges other devices",
    "slug": "razer-laptop-sleeve-wireless-charging",
    "url": "https://www.theverge.com/tech/885381/razer-laptop-sleeve-16-inch-wireless-charger-qi-power",
    "source": "The Verge",
    "date": "2026-02-26T17:29:56.000Z",
    "summary": "Razer announced a $129.99 laptop sleeve with integrated wireless charging pads that can charge phones and earbuds while protecting laptops up to 16 inches. The accessory combines laptop protection with wireless charging convenience for mobile devices.",
    "content": "The sleeve can’t charge your laptop. | Image: Razer\t\n\nRazer has announced an expensive new laptop sleeve that's not made from an exotic animal or encrusted in diamonds. What potentially justifies paying $129.99 for Razer's Laptop Sleeve 16\" are the pair of wireless charging pads integrated into its cover flap. While you're out and about, it can protect a laptop up to 16-inches in size, and when you find a remote spot to sit down and work, you can also plonk down and charge your phone and earbuds.\nThe padded sleeve has a plush microfiber lining and reinforced edges to help absorb some of the shock of an accidental drop, but it's thin enough to stick underneath your laptop to protect its undersi …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Razer的新笔记本电脑套可以无线充电其他设备",
        "summary": "Razer宣布了一款售价$129.99的笔记本电脑套，配有集成的无线充电垫，可以在保护最多16英寸笔记本电脑的同时为手机和耳塞充电。这个配件结合了笔记本电脑保护和移动设备无线充电的便利。"
      },
      "fr": {
        "title": "La nouvelle housse pour ordinateur portable de Razer charge d'autres appareils sans fil",
        "summary": "Razer a annoncé une housse pour ordinateur portable à 129,99 $ avec des coussinets de charge sans fil intégrés qui peuvent charger des téléphones et des écouteurs tout en protégeant les ordinateurs portables jusqu'à 16 pouces. L'accessoire combine la protection de l'ordinateur portable avec la commodité de la charge sans fil pour les appareils mobiles."
      },
      "de": {
        "title": "Razers neue Laptop-Tasche lädt andere Geräte kabellos auf",
        "summary": "Razer kündigte eine Laptop-Tasche für 129,99 US-Dollar mit integrierten kabellosen Ladepads an, die Telefone und Ohrhörer aufladen und gleichzeitig Laptops bis zu 16 Zoll schützen können. Das Zubehör kombiniert Laptop-Schutz mit der Bequemlichkeit des kabellosen Ladens für mobile Geräte."
      },
      "es": {
        "title": "La nueva funda para portátil de Razer carga otros dispositivos de forma inalámbrica",
        "summary": "Razer anunció una funda para portátil de $129.99 con almohadillas de carga inalámbrica integradas que pueden cargar teléfonos y auriculares mientras protegen portátiles de hasta 16 pulgadas. El accesorio combina la protección del portátil con la comodidad de la carga inalámbrica para dispositivos móviles."
      }
    }
  },
  {
    "title": "Google reveals Nano Banana 2 AI image model, coming to Gemini today",
    "slug": "google-reveals-nano-banana-2-ai-image-model-coming-to-gemini-today",
    "url": "https://arstechnica.com/ai/2026/02/google-releases-nano-banana-2-ai-image-generator-promises-pro-results-with-flash-speed/",
    "source": "Ars Technica",
    "date": "2026-02-26T17:12:10.000Z",
    "summary": "Google's new image model replaces the previous versions immediately.",
    "content": "Google's new image model replaces the previous versions immediately.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "谷歌推出Nano Banana 2 AI图像模型，今日加入Gemini",
        "summary": "谷歌的新图像模型立即替代了以前的版本。"
      },
      "fr": {
        "title": "Google révèle le modèle d'image IA Nano Banana 2, arrivant dans Gemini aujourd'hui",
        "summary": "Le nouveau modèle d'image de Google remplace immédiatement les versions précédentes."
      },
      "de": {
        "title": "Google präsentiert Nano Banana 2 AI-Bildmodell, kommt heute zu Gemini",
        "summary": "Googles neues Bildmodell ersetzt die vorherigen Versionen sofort."
      },
      "es": {
        "title": "Google revela el modelo de imagen de IA Nano Banana 2, que llega a Gemini hoy",
        "summary": "El nuevo modelo de imagen de Google reemplaza las versiones anteriores de inmediato."
      }
    }
  },
  {
    "title": "Read AI launches an email-based ‘digital twin’ to help you with schedules and answers",
    "slug": "read-ai-ada-digital-twin",
    "url": "https://techcrunch.com/2026/02/26/read-ai-launches-an-email-based-digital-twin-to-help-you-with-schedules-and-answers/",
    "source": "TechCrunch",
    "date": "2026-02-26T17:00:00.000Z",
    "summary": "Read AI launched Ada, an email-based digital twin that can reply with your availability and extract answers from company knowledge bases and the web. The tool automates email scheduling and information retrieval tasks.",
    "content": "Read AI is launching Ada, which can reply with your availability and extract answers from the company knowledge base and the web.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Read AI推出基于电子邮件的\"数字双胞胎\"来帮助您安排日程和回答问题",
        "summary": "Read AI推出了Ada，一个基于电子邮件的数字双胞胎，可以根据您的可用性进行回复，并从公司知识库和网络中提取答案。该工具自动化了电子邮件日程安排和信息检索任务。"
      },
      "fr": {
        "title": "Read AI lance un \"jumeau numérique\" basé sur le courrier électronique pour vous aider avec les horaires et les réponses",
        "summary": "Read AI a lancé Ada, un jumeau numérique basé sur le courrier électronique qui peut répondre avec votre disponibilité et extraire des réponses des bases de connaissances d'entreprise et du web. L'outil automatise les tâches de planification des courriers électroniques et de récupération d'informations."
      },
      "de": {
        "title": "Read AI startet einen E-Mail-basierten \"digitalen Zwilling\", um Ihnen bei Zeitplänen und Antworten zu helfen",
        "summary": "Read AI hat Ada gestartet, einen E-Mail-basierten digitalen Zwilling, der mit Ihrer Verfügbarkeit antworten und Antworten aus Unternehmens-Wissensdatenbanken und dem Web extrahieren kann. Das Tool automatisiert E-Mail-Planungs- und Informationsbeschaffungsaufgaben."
      },
      "es": {
        "title": "Read AI lanza un \"gemelo digital\" basado en correo electrónico para ayudarte con horarios y respuestas",
        "summary": "Read AI lanzó Ada, un gemelo digital basado en correo electrónico que puede responder con tu disponibilidad y extraer respuestas de bases de conocimiento empresariales y la web. La herramienta automatiza tareas de programación de correo electrónico y recuperación de información."
      }
    }
  },
  {
    "title": "Cricut’s most popular cutting machine now takes up less space in your crafting room",
    "slug": "cricut-explore-5-compact",
    "url": "https://www.theverge.com/tech/883743/cricut-cutting-machine-explore-5-joy-2-drawing-writing-crafting",
    "source": "The Verge",
    "date": "2026-02-26T17:00:00.000Z",
    "summary": "Cricut announced the Explore 5, which is 30% more compact than the previous model while maintaining full functionality, and the Joy 2, which adds the ability to precisely cut pre-printed materials. Both new machines address space constraints for crafters.",
    "content": "The Cricut Explore 5 will be available in taupe and teal color options. | Image: Cricut\t\n\nCricut has announced new versions of two of its cutting machines that could appeal to crafters struggling with limited space for their hobby. The new Cricut Explore 5 is 30 percent \"more compact\" than the Explore 4 that launched a year ago, without reducing the size or types of materials the machine can handle. The new Cricut Joy 2 is an even smaller alternative to the Explore 5 and adds the ability to precisely slice pre-printed materials so you can finally open that Etsy sticker shop.\nThe Cricut Explore 5 is available starting today for $199 and comes with enough materials to make up to 30 projects. It can also be purchased as part of mor …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Cricut最受欢迎的切割机现在占据手工制作室的空间更小",
        "summary": "Cricut推出了Explore 5，其体积比上一款机型紧凑30%，同时保持全部功能，以及Joy 2，它增加了精确切割预印材料的能力。两款新机器都解决了手工艺爱好者的空间限制问题。"
      },
      "fr": {
        "title": "La machine de découpe la plus populaire de Cricut prend maintenant moins de place dans votre atelier de loisirs créatifs",
        "summary": "Cricut a annoncé l'Explore 5, qui est 30% plus compacte que le modèle précédent tout en maintenant l'intégralité de ses fonctionnalités, et la Joy 2, qui ajoute la capacité de découper avec précision les matériaux préimprimés. Les deux nouvelles machines répondent aux contraintes d'espace des artisans."
      },
      "de": {
        "title": "Crickets beliebteste Schneidemaschine nimmt jetzt weniger Platz in Ihrem Bastelzimmer ein",
        "summary": "Cricut kündigte das Explore 5 an, das 30% kompakter als das vorherige Modell ist und gleichzeitig die vollständige Funktionalität behält, sowie das Joy 2, das die Möglichkeit hinzufügt, vorgedruckte Materialien präzise zu schneiden. Beide neuen Maschinen lösen Platzbeschränkungen für Kunsthandwerker."
      },
      "es": {
        "title": "La máquina de corte más popular de Cricut ahora ocupa menos espacio en tu sala de manualidades",
        "summary": "Cricut anunció el Explore 5, que es 30% más compacto que el modelo anterior mientras mantiene toda la funcionalidad, y el Joy 2, que añade la capacidad de cortar con precisión materiales preimpresos. Ambas nuevas máquinas abordan las limitaciones de espacio para los artesanos."
      }
    }
  },
  {
    "title": "Ford is recalling 4.3 million trucks and SUVs to fix a towing software bug",
    "slug": "ford-recall-towing-software",
    "url": "https://arstechnica.com/cars/2026/02/ford-is-recalling-4-3-million-trucks-and-suvs-to-fix-a-towing-software-bug/",
    "source": "Ars Technica",
    "date": "2026-02-26T16:53:50.000Z",
    "summary": "Ford is recalling 4.3 million trucks and SUVs to fix a towing software bug via over-the-air updates or dealership service. The recall addresses a software issue affecting vehicle towing functionality.",
    "content": "An OTA update will be pushed out in a few weeks; owners can also go to a dealership.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "福特正在召回430万辆卡车和SUV以修复牵引软件缺陷",
        "summary": "福特正在通过无线更新或经销商服务召回430万辆卡车和SUV以修复牵引软件缺陷。该召回解决了影响车辆牵引功能的软件问题。"
      },
      "fr": {
        "title": "Ford rappelle 4,3 millions de camions et de VUS pour corriger un bogue logiciel de remorquage",
        "summary": "Ford rappelle 4,3 millions de camions et de VUS pour corriger un bogue logiciel de remorquage via des mises à jour par ondes ou un service chez le concessionnaire. Le rappel aborde un problème logiciel affectant la fonctionnalité de remorquage du véhicule."
      },
      "de": {
        "title": "Ford ruft 4,3 Millionen Lastkraftwagen und SUVs zurück, um einen Softwarefehler beim Schleppen zu beheben",
        "summary": "Ford ruft 4,3 Millionen Lastkraftwagen und SUVs zurück, um einen Softwarefehler beim Schleppen durch drahtlose Updates oder Werkstattdienste zu beheben. Der Rückruf befasst sich mit einem Softwareproblem, das die Anhängerfunktion des Fahrzeugs beeinträchtigt."
      },
      "es": {
        "title": "Ford está llamando a revisión 4,3 millones de camionetas y SUVs para reparar un error de software de remolque",
        "summary": "Ford está llamando a revisión 4,3 millones de camionetas y SUVs para reparar un error de software de remolque a través de actualizaciones por aire u servicio de concesionario. El llamado a revisión aborda un problema de software que afecta la funcionalidad de remolque del vehículo."
      }
    }
  },
  {
    "title": "Bumble adds AI-powered photo feedback and profile guidance tools",
    "slug": "bumble-ai-photo-feedback",
    "url": "https://techcrunch.com/2026/02/26/bumble-adds-ai-powered-photo-feedback-and-profile-guidance-tools/",
    "source": "TechCrunch",
    "date": "2026-02-26T16:38:59.000Z",
    "summary": "Bumble is adding AI-powered features for photo feedback and profile guidance, joining competitors like Tinder and Hinge in embracing AI on dating platforms. These tools help users optimize their dating profiles.",
    "content": "Bumble and other popular dating apps, like Match Group's Tinder and Hinge, have all embraced AI-powered features.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Bumble添加了AI驱动的照片反馈和个人资料指导工具",
        "summary": "Bumble正在添加用于照片反馈和个人资料指导的AI驱动功能，与Tinder和Hinge等竞争对手一起在约会平台上采用AI。这些工具帮助用户优化他们的约会资料。"
      },
      "fr": {
        "title": "Bumble ajoute des outils de retour d'information sur les photos et des conseils de profil alimentés par l'IA",
        "summary": "Bumble ajoute des fonctionnalités alimentées par l'IA pour les retours d'information sur les photos et les conseils de profil, se joignant à des concurrents comme Tinder et Hinge pour adopter l'IA sur les plateformes de rencontres. Ces outils aident les utilisateurs à optimiser leurs profils de rencontres."
      },
      "de": {
        "title": "Bumble fügt KI-gestützte Fotofeedback- und Profilanleitungswerkzeuge hinzu",
        "summary": "Bumble fügt KI-gestützte Funktionen für Fotofeedback und Profilberatung hinzu und schließt sich Konkurrenten wie Tinder und Hinge an, um KI auf Dating-Plattformen einzuführen. Diese Tools helfen Benutzern, ihre Dating-Profile zu optimieren."
      },
      "es": {
        "title": "Bumble agrega herramientas de retroalimentación de fotos y orientación de perfil impulsadas por IA",
        "summary": "Bumble está agregando funciones impulsadas por IA para retroalimentación de fotos y orientación de perfil, uniéndose a competidores como Tinder e Hinge en la adopción de IA en plataformas de citas. Estas herramientas ayudan a los usuarios a optimizar sus perfiles de citas."
      }
    }
  },
  {
    "title": "Walmart agrees to $100M settlement over deceptive pay practices in Spark Driver program",
    "slug": "walmart-spark-driver-settlement",
    "url": "https://techcrunch.com/2026/02/26/walmart-agrees-to-100m-settlement-over-deceptive-pay-practices-in-spark-driver-program/",
    "source": "TechCrunch",
    "date": "2026-02-26T16:37:13.000Z",
    "summary": "Walmart settled a lawsuit for $100 million over allegations that it misled Spark Driver drivers about tips and reduced their base pay. The settlement addresses deceptive compensation practices in Walmart's gig driver program.",
    "content": "The suit said Walmart would mislead drivers about their possible tips and would reduce their base pay, among other things.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "沃尔玛同意就Spark Driver项目欺骗性报酬行为支付1亿美元和解金",
        "summary": "沃尔玛就其误导Spark Driver司机有关小费信息并降低其基本工资的指控达成1亿美元的诉讼和解。该和解涉及沃尔玛零工驾驶项目中的欺骗性薪酬行为。"
      },
      "fr": {
        "title": "Walmart accepte un règlement de 100 millions de dollars pour pratiques salariales trompeuses dans le programme Spark Driver",
        "summary": "Walmart a réglé un procès pour 100 millions de dollars suite à des allégations selon lesquelles elle aurait induit en erreur les conducteurs du programme Spark Driver concernant les pourboires et réduit leur salaire de base. Le règlement aborde les pratiques de compensation trompeuses du programme de conducteur indépendant de Walmart."
      },
      "de": {
        "title": "Walmart einigt sich auf 100-Millionen-Dollar-Vergleich wegen irreführender Lohnpraktiken im Spark-Driver-Programm",
        "summary": "Walmart einigte sich auf einen Vergleich von 100 Millionen Dollar wegen Vorwürfen, dass es Spark-Driver-Fahrer über Trinkgelder irreführte und ihren Grundlohn senkte. Der Vergleich behandelt irreführende Vergütungspraktiken in Walmarts Gig-Driver-Programm."
      },
      "es": {
        "title": "Walmart acepta un acuerdo de $100 millones por prácticas salariales engañosas en el programa Spark Driver",
        "summary": "Walmart llegó a un acuerdo por $100 millones sobre alegaciones de que engañó a los conductores de Spark Driver con respecto a las propinas y redujo su salario base. El acuerdo aborda prácticas de compensación engañosas en el programa de conductores independientes de Walmart."
      }
    }
  },
  {
    "title": "Self-driving truck startup Einride raises $113M PIPE ahead of public debut",
    "slug": "einride-113m-pipe-ipo",
    "url": "https://techcrunch.com/2026/02/26/self-driving-truck-startup-einride-raises-113m-pipe-ahead-of-public-debut/",
    "source": "TechCrunch",
    "date": "2026-02-26T16:32:31.000Z",
    "summary": "Autonomous truck startup Einride raised $113 million through a PIPE ahead of going public. The funds will support technology development, global expansion, and autonomous deployments across North America, Europe, and the Middle East.",
    "content": "The proceeds will support Einride’s technology roadmap, global expansion, and autonomous deployments in North America, Europe, and the Middle East.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "自动驾驶卡车初创公司Einride在上市前通过PIPE融资1.13亿美元",
        "summary": "自动驾驶卡车初创公司Einride通过PIPE融资1.13亿美元，以为上市做准备。这些资金将支持技术开发、全球扩张以及在北美、欧洲和中东的自动驾驶部署。"
      },
      "fr": {
        "title": "La startup de camions autonomes Einride lève 113 millions de dollars via PIPE avant ses débuts publics",
        "summary": "La startup de camions autonomes Einride a levé 113 millions de dollars via PIPE avant d'être cotée en bourse. Les fonds soutendront le développement technologique, l'expansion mondiale et les déploiements autonomes en Amérique du Nord, Europe et Moyen-Orient."
      },
      "de": {
        "title": "Selbstfahrender Lastwagen-Startup Einride sammelt 113 Millionen Dollar durch PIPE vor Börsengang ein",
        "summary": "Das Startup für autonome Lastwagen Einride sammelte 113 Millionen Dollar durch PIPE vor dem Börsengang ein. Die Mittel werden die Technologieentwicklung, globale Expansion und autonome Einsätze in Nordamerika, Europa und dem Nahen Osten unterstützen."
      },
      "es": {
        "title": "La startup de camiones autónomos Einride recauda $113 millones a través de PIPE antes de su debut público",
        "summary": "La startup de camiones autónomos Einride recaudó $113 millones a través de PIPE antes de salir a bolsa. Los fondos respaldarán el desarrollo tecnológico, la expansión global y los despliegues autónomos en América del Norte, Europa y Oriente Medio."
      }
    }
  },
  {
    "title": "Your smart TV may be crawling the web for AI",
    "slug": "smart-tv-web-crawling-ai",
    "url": "https://www.theverge.com/column/885244/smart-tv-web-crawler-ai",
    "source": "The Verge",
    "date": "2026-02-26T16:30:00.000Z",
    "summary": "Web aggregator Bright Data is pitching streaming services an alternative to ad-supported models: collecting web data through Samsung Tizen and LG webOS apps to train AI systems. The approach offers streaming services revenue without traditional ads.",
    "content": "This is Lowpass by Janko Roettgers, a newsletter on the ever-evolving intersection of tech and entertainment, syndicated just for The Verge subscribers once a week.\nThese days, if you sign up for a new streaming service, you generally have two options: Either pay a massive premium for an ad-free experience, or endure frequent commercial breaks and all the sneaky tracking that comes with ad targeting.\nWeb data aggregator Bright Data has been pitching streaming service operators on an alternative approach for apps running on Samsung's Tizen and LG's webOS platform - one that comes without ads and sky-high fees. All publishers have to do to u …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "你的智能电视可能在为AI爬取网络",
        "summary": "网络聚合器Bright Data向流媒体服务推介了一种替代广告支持模式的方案：通过三星Tizen和LG webOS应用程序收集网络数据以训练AI系统。这种方法为流媒体服务提供了无需传统广告的收入。"
      },
      "fr": {
        "title": "Votre téléviseur intelligent pourrait explorer le web pour l'IA",
        "summary": "L'agrégateur Web Bright Data propose aux services de diffusion en continu une alternative aux modèles soutenus par la publicité : collecter des données web via les applications Samsung Tizen et LG webOS pour entraîner des systèmes d'IA. L'approche offre aux services de diffusion en continu des revenus sans publicités traditionnelles."
      },
      "de": {
        "title": "Ihr intelligenter Fernseher könnte das Web für KI durchsuchen",
        "summary": "Der Web-Aggregator Bright Data bietet Streaming-Diensten eine Alternative zu werbegestützten Modellen an: Sammlung von Webdaten über Samsung Tizen- und LG webOS-Apps zum Trainieren von KI-Systemen. Der Ansatz bietet Streaming-Diensten Einnahmen ohne traditionelle Anzeigen."
      },
      "es": {
        "title": "Tu televisor inteligente podría estar rastreando la web para la IA",
        "summary": "El agregador web Bright Data presenta a los servicios de transmisión una alternativa a los modelos respaldados por publicidad: recopilar datos web a través de aplicaciones Samsung Tizen y LG webOS para entrenar sistemas de IA. El enfoque ofrece ingresos a los servicios de transmisión sin anuncios tradicionales."
      }
    }
  },
  {
    "title": "Cisco says hackers have been exploiting a critical bug to break into big customer networks since 2023",
    "slug": "cisco-critical-bug-hackers",
    "url": "https://techcrunch.com/2026/02/26/cisco-says-hackers-have-been-exploiting-a-critical-bug-to-break-into-big-customer-networks-since-2023/",
    "source": "TechCrunch",
    "date": "2026-02-26T16:03:36.000Z",
    "summary": "Cisco disclosed that hackers have been exploiting a critical vulnerability in its networking gear since 2023 to breach major customer networks. The U.S. government and allies are urging organizations to patch the newly identified bug immediately.",
    "content": "The U.S. government and its allies said hackers have been exploiting the newly identified bug in Cisco networking gear around the world for years, and urged organizations to patch.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "思科称黑客自2023年以来一直在利用严重漏洞入侵大型客户网络",
        "summary": "思科披露黑客自2023年以来一直在利用其网络设备中的严重漏洞来攻击主要客户网络。美国政府和盟国敦促组织立即修补这个新发现的漏洞。"
      },
      "fr": {
        "title": "Cisco affirme que des pirates exploitent un bug critique pour s'introduire dans les réseaux de grands clients depuis 2023",
        "summary": "Cisco a révélé que des pirates exploitent une vulnérabilité critique dans ses équipements réseau depuis 2023 pour compromettre les réseaux de clients majeurs. Le gouvernement américain et ses alliés exhortent les organisations à corriger le bug nouvellement identifié immédiatement."
      },
      "de": {
        "title": "Cisco sagt, dass Hacker seit 2023 einen kritischen Bug ausnutzen, um in die Netzwerke großer Kunden einzudringen",
        "summary": "Cisco hat offenbart, dass Hacker seit 2023 eine kritische Schwachstelle in seiner Netzwerk-Ausrüstung ausnutzen, um wichtige Kundennetzwerke zu kompromittieren. Die US-Regierung und ihre Verbündeten fordern Organisationen auf, den neu identifizierten Bug sofort zu patchen."
      },
      "es": {
        "title": "Cisco dice que hackers han estado explotando un bug crítico para penetrar redes de grandes clientes desde 2023",
        "summary": "Cisco reveló que los hackers han estado explotando una vulnerabilidad crítica en su equipo de red desde 2023 para comprometer redes de clientes importantes. El gobierno de EE.UU. y aliados instan a las organizaciones a parchear el bug recién identificado de inmediato."
      }
    }
  },
  {
    "title": "8BitDo’s customizable Pro 3 controller is $30 off for the first time",
    "slug": "bitdo-pro-3-controller-discount",
    "url": "https://www.theverge.com/gadgets/885192/8bitdo-pro-3-controller-switch-2-pc-galaxy-buds-4-pro-deal-sale",
    "source": "The Verge",
    "date": "2026-02-26T16:00:28.000Z",
    "summary": "8BitDo's Pro 3 wireless controller is discounted to $39.99 at Woot with code LEVEL20, marking its biggest discount. The controller features swappable buttons, macro buttons, and works with Switch 2, PC, and mobile devices.",
    "content": "Woot is offering steep discounts on many video games and accessories, some of which are fairly recent releases. No matter what you choose from its sale catalog, you can get up to $30 off your order with the code LEVEL20 used at checkout through the end of the day on February 27th (the sale lasts through March 5th, but the coupon ends beforehand). 8BitDo’s highly customizable Pro 3 controller for Switch 2, PC and mobile devices is getting its biggest discount at Woot, selling for $39.99 (originally $69.99) with the code applied, or $49.99 without the code.\n8BitDo Pro 3 Wireless Controller\nThe Pro 3 features swappable ABXY face buttons and joystick caps, providing players with a highly customizable experience. It also features new L4 and R4 macro buttons between the triggers and its USB-C charging port, along with more durable and power efficient TMR joysticks.\n\nWhere to Buy:\n\n $69.99 $39.99 at Woot (with code LEVEL20)\n\nThe Pro 3 is a great, comfortable controller, and its swappable, magnetic face buttons are one of its top features. You can adjust the button layout from Switch to Xbox, or swap them for them for unlabeled button faces that are included with each controller. In terms of hardware features, the Pro 3 is similar to the Ultimate 2, packing TMR joysticks, triggers with adjustable stops, and extra macro buttons. One of the key differences, however, is that it has a PlayStation-style stick layout. It can wake the Switch 2, but its rumble performance is behind some of our favorite Switch 2 controllers. Read our review.\nOther Verge-approved deals\nSamsung debuted its new Galaxy S26 phones this week along with some new wireless earbuds, the Galaxy Buds 4 lineup. There’s a great preorder deal on the S26 phone, and you can also get a freebie with either of its Buds 4 and Buds 4 Pro. Amazon is offering a free gift card with both sets. The $179.99 Buds 4 include a $20 gift card — not bad — and the $249.99 Buds 4 Pro that offer improved sound and battery life include",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "8BitDo可定制的Pro 3控制器首次降价30美元",
        "summary": "8BitDo Pro 3无线控制器在Woot上使用代码LEVEL20优惠至39.99美元，创下其最大折扣。该控制器具有可交换按钮、宏按钮，兼容Switch 2、PC和移动设备。"
      },
      "fr": {
        "title": "Le contrôleur Pro 3 personnalisable d'8BitDo est en baisse de 30 $ pour la première fois",
        "summary": "Le contrôleur sans fil Pro 3 d'8BitDo est réduit à 39,99 $ chez Woot avec le code LEVEL20, marquant sa plus grande réduction. Le contrôleur dispose de boutons interchangeables, de boutons macro et fonctionne avec Switch 2, PC et les appareils mobiles."
      },
      "de": {
        "title": "8BitDos anpassbarer Pro 3 Controller ist zum ersten Mal um 30 Dollar reduziert",
        "summary": "Der kabellose Pro 3 Controller von 8BitDo ist bei Woot mit dem Code LEVEL20 auf 39,99 Dollar reduziert, sein größter Rabatt. Der Controller verfügt über auswechselbare Tasten, Makrotasten und funktioniert mit Switch 2, PC und mobilen Geräten."
      },
      "es": {
        "title": "El controlador personalizable Pro 3 de 8BitDo está descuento 30 dólares por primera vez",
        "summary": "El controlador inalámbrico Pro 3 de 8BitDo tiene un descuento a $39.99 en Woot con el código LEVEL20, marcando su mayor descuento. El controlador cuenta con botones intercambiables, botones de macro y funciona con Switch 2, PC y dispositivos móviles."
      }
    }
  },
  {
    "title": "HBO Max&#8217;s password-sharing crackdown is going global",
    "slug": "hbo-max-password-sharing-global",
    "url": "https://www.theverge.com/streaming/885303/hbo-max-password-sharing-global-expansion-q4-2025",
    "source": "The Verge",
    "date": "2026-02-26T16:00:09.000Z",
    "summary": "HBO Max is expanding its password-sharing crackdown globally starting in 2026 after ramping up enforcement in the U.S. The expansion coincides with HBO Max's rollout into new European and international markets.",
    "content": "HBO Max's password-sharing crackdown is going to get a lot bigger. During an earnings call on Thursday, Warner Bros. Discovery streaming head JB Perrette said a global expansion \"will start in 2026,\" as reported earlier by The Wrap.\nWarner Bros. Discovery has ramped up its paid sharing initiative in the US over the past year, introducing \"more aggressive\" prompts in August that push people toward paying an extra $7.99 per month to add another user to their account. Now that HBO Max has launched in several European countries and Latin America, with rollouts planned in the UK, Ireland, and the Asia-Pacific, the streamer likely sees more oppor …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "HBO Max的密码共享打击措施正在全球推行",
        "summary": "HBO Max从2026年开始全球扩大密码共享打击措施，之前在美国加强执法。此扩展与HBO Max在欧洲和国际市场的推出相吻合。"
      },
      "fr": {
        "title": "La répression des partages de mots de passe de HBO Max s'étend mondialement",
        "summary": "HBO Max étend sa répression des partages de mots de passe mondialement à partir de 2026 après avoir renforcé l'application aux États-Unis. L'expansion coïncide avec le lancement de HBO Max sur les nouveaux marchés européens et internationaux."
      },
      "de": {
        "title": "HBO Maxs Crack-Down auf Passwortfreigabe wird weltweit eingeführt",
        "summary": "HBO Max wird seine Durchsetzung gegen Passwortfreigabe ab 2026 weltweit ausweiten, nachdem die Durchsetzung in den USA verstärkt wurde. Die Expansion fällt mit dem Rollout von HBO Max auf neue europäische und internationale Märkte zusammen."
      },
      "es": {
        "title": "La represión del intercambio de contraseñas de HBO Max se expande globalmente",
        "summary": "HBO Max está expandiendo su represión del intercambio de contraseñas globalmente a partir de 2026 después de intensificar la aplicación en EE.UU. La expansión coincide con el lanzamiento de HBO Max en nuevos mercados europeos e internacionales."
      }
    }
  },
  {
    "title": "A VC and some big-name programmers are trying to solve open source’s funding problem, permanently",
    "slug": "open-source-endowment-funding",
    "url": "https://techcrunch.com/2026/02/26/a-vc-and-some-big-name-programmers-are-trying-to-solve-open-sources-funding-problem-permanently/",
    "source": "TechCrunch",
    "date": "2026-02-26T16:00:00.000Z",
    "summary": "A venture capitalist and prominent open source programmers launched the Open Source Endowment to provide sustainable funding for open source projects. The initiative aims to create a permanent solution to open source's chronic funding challenges.",
    "content": "A group of well-known open source programmers and a VC have launched the Open Source Endowment. They hope this new method will provide funding for good.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "一位风险投资家和一些著名程序员正在试图永久解决开源的资金问题",
        "summary": "一位风险投资家和杰出的开源程序员推出了开源基金会，为开源项目提供可持续的资金。该倡议旨在为开源的长期资金挑战创造永久解决方案。"
      },
      "fr": {
        "title": "Un capital-risqueur et d'éminents programmeurs tentent de résoudre définitivement le problème du financement de l'open source",
        "summary": "Un capital-risqueur et d'éminents programmeurs open source ont lancé l'Open Source Endowment pour fournir un financement durable aux projets open source. L'initiative vise à créer une solution permanente aux défis chroniques de financement de l'open source."
      },
      "de": {
        "title": "Ein VC und einige namhafte Programmierer versuchen, das Finanzierungsproblem der Open Source dauerhaft zu lösen",
        "summary": "Ein Risikokapitalgeber und prominente Open-Source-Programmierer haben die Open Source Endowment gegründet, um nachhaltige Finanzierung für Open-Source-Projekte bereitzustellen. Die Initiative zielt darauf ab, eine dauerhafte Lösung für die chronischen Finanzierungsprobleme von Open Source zu schaffen."
      },
      "es": {
        "title": "Un capitalista de riesgo y algunos programadores destacados intentan resolver permanentemente el problema de financiamiento de código abierto",
        "summary": "Un capitalista de riesgo y destacados programadores de código abierto lanzaron la Open Source Endowment para proporcionar financiamiento sostenible a los proyectos de código abierto. La iniciativa tiene como objetivo crear una solución permanente a los desafíos crónicos de financiamiento de código abierto."
      }
    }
  },
  {
    "title": "Google launches Nano Banana 2 model with faster image generation",
    "slug": "google-nano-banana-2-image",
    "url": "https://techcrunch.com/2026/02/26/google-launches-nano-banana-2-model-with-faster-image-generation/",
    "source": "TechCrunch",
    "date": "2026-02-26T16:00:00.000Z",
    "summary": "Google launched Nano Banana 2, a faster image generation model that will become the default in the Gemini app and AI mode. The model improvement enhances image generation speed for users.",
    "content": "Google is making Nano Banana 2 a default model in Gemini app and in AI mode.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "谷歌推出Nano Banana 2模型，加速图像生成",
        "summary": "谷歌推出了Nano Banana 2，一个更快的图像生成模型，将在Gemini应用和AI模式中成为默认模型。该模型改进增强了用户的图像生成速度。"
      },
      "fr": {
        "title": "Google lance le modèle Nano Banana 2 avec une génération d'images plus rapide",
        "summary": "Google a lancé Nano Banana 2, un modèle de génération d'images plus rapide qui deviendra le modèle par défaut dans l'application Gemini et le mode IA. L'amélioration du modèle améliore la vitesse de génération d'images pour les utilisateurs."
      },
      "de": {
        "title": "Google startet Nano Banana 2-Modell mit schnellerer Bildgenerierung",
        "summary": "Google hat Nano Banana 2 eingeführt, ein schnelleres Bildgenerierungsmodell, das zum Standard in der Gemini-App und im KI-Modus wird. Die Modellverbesserung verbessert die Geschwindigkeit der Bildgenerierung für Benutzer."
      },
      "es": {
        "title": "Google lanza el modelo Nano Banana 2 con generación de imágenes más rápida",
        "summary": "Google lanzó Nano Banana 2, un modelo de generación de imágenes más rápido que se convertirá en el estándar predeterminado en la aplicación Gemini y el modo IA. La mejora del modelo mejora la velocidad de generación de imágenes para los usuarios."
      }
    }
  },
  {
    "title": "Democrats to introduce bill aimed at resurrecting IRS Direct File",
    "slug": "democrats-irs-direct-file-bill",
    "url": "https://www.theverge.com/policy/885225/democrats-irs-direct-file-act-taxes",
    "source": "The Verge",
    "date": "2026-02-26T16:00:00.000Z",
    "summary": "A group of 160 Democratic lawmakers introduced the Direct File Act to resurrect IRS Direct File, allowing taxpayers to file taxes directly with the government for free. The bill reverses the Trump administration's decision to eliminate the program that was successfully tested and expanded under Biden.",
    "content": "160 Democratic lawmakers from across the country are backing a soon-to-be-introduced bill that would reverse the Trump administration's decision to eliminate IRS Direct File. The Direct File Act, led by Sen. Elizabeth Warren (D-MA) and Rep. Brad Sherman (D-CA), would bring back the option to file taxes directly with the government for free.\nThe Biden administration first started testing the IRS Direct File system in select states during the 2024 tax season, and it even expanded the system to 25 states in 2025. But uncertainty surrounding IRS Direct File swirled after President Donald Trump came into office, until IRS head Billy Long confirm …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "民主党人介绍旨在复兴美国国税局直接报税的法案",
        "summary": "160名民主党议员引入了《直接报税法案》以复兴美国国税局直接报税，允许纳税人直接向政府免费报税。该法案推翻了特朗普政府消除该项目的决定，该项目在拜登任期内被成功测试和扩展。"
      },
      "fr": {
        "title": "Les démocrates introduisent un projet de loi visant à ressusciter le dépôt direct de l'IRS",
        "summary": "Un groupe de 160 législateurs démocrates a introduit la Loi sur le dépôt direct pour ressusciter le dépôt direct de l'IRS, permettant aux contribuables de déposer leurs impôts directement auprès du gouvernement gratuitement. Le projet de loi annule la décision de l'administration Trump d'éliminer le programme qui a été testé avec succès et étendu sous Biden."
      },
      "de": {
        "title": "Demokraten bringen Gesetz zur Wiederherstellung der direkten IRS-Antragsstellung ein",
        "summary": "Eine Gruppe von 160 demokratischen Gesetzgebern führte das Direct File Act ein, um die direkte IRS-Antragsstellung wiederherzustellen und es Steuerzahlern zu ermöglichen, ihre Steuern kostenlos direkt bei der Regierung einzureichen. Das Gesetz hebt die Entscheidung der Trump-Verwaltung auf, das Programm zu eliminieren, das unter Biden erfolgreich getestet und erweitert wurde."
      },
      "es": {
        "title": "Los demócratas introducen proyecto de ley destinado a resucitar la presentación directa del IRS",
        "summary": "Un grupo de 160 legisladores demócratas introdujo la Ley de presentación directa para resucitar la presentación directa del IRS, permitiendo a los contribuyentes presentar impuestos directamente al gobierno de forma gratuita. El proyecto de ley revierte la decisión de la administración Trump de eliminar el programa que fue probado con éxito y expandido bajo Biden."
      }
    }
  },
  {
    "title": "New AirSnitch attack breaks Wi-Fi encryption in homes, offices, and enterprises",
    "slug": "new-airsnitch-attack-breaks-wi-fi-encryption-in-homes-offices-and-enterprises",
    "url": "https://arstechnica.com/security/2026/02/new-airsnitch-attack-breaks-wi-fi-encryption-in-homes-offices-and-enterprises/",
    "source": "Ars Technica",
    "date": "2026-02-26T15:45:18.000Z",
    "summary": "That guest network you set up for your neighbors may not be as secure as you think.",
    "content": "That guest network you set up for your neighbors may not be as secure as you think.",
    "category": "tech"
  },
  {
    "title": "Spyware makers sentenced to prison in Greece for wiretapping politicians and journalists",
    "slug": "spyware-makers-sentenced-to-prison-in-greece-for-wiretapping-politicians-and-jou",
    "url": "https://techcrunch.com/2026/02/26/spyware-maker-sentenced-to-prison-in-greece-for-wiretapping-politicians-and-journalists/",
    "source": "TechCrunch",
    "date": "2026-02-26T15:45:15.000Z",
    "summary": "Tal Dilian and three other Intellexa executives were tried for their role in a scandal dubbed \"Greek Watergate,\" which dates back to 2022.",
    "content": "Tal Dilian and three other Intellexa executives were tried for their role in a scandal dubbed \"Greek Watergate,\" which dates back to 2022.",
    "category": "tech"
  },
  {
    "title": "X tries wooing advertisers by letting them reuse creatives made for other platforms",
    "slug": "x-tries-wooing-advertisers-by-letting-them-reuse-creatives-made-for-other-platfo",
    "url": "https://techcrunch.com/2026/02/26/x-tries-wooing-advertisers-by-letting-them-reuse-creative-assets-from-other-platforms/",
    "source": "TechCrunch",
    "date": "2026-02-26T15:41:55.000Z",
    "summary": "X has launched an expanded set of aspect ratio support for both image and video ads, so advertisers can now reuse assets they've created for other platforms.",
    "content": "X has launched an expanded set of aspect ratio support for both image and video ads, so advertisers can now reuse assets they've created for other platforms.",
    "category": "tech"
  },
  {
    "title": "eBay to lay off 800 staff",
    "slug": "ebay-to-lay-off-800-staff",
    "url": "https://techcrunch.com/2026/02/26/ebay-to-lay-off-800-staff/",
    "source": "TechCrunch",
    "date": "2026-02-26T15:10:45.000Z",
    "summary": "The latest round of layoffs marks eBay’s third workforce reduction in the past three years.",
    "content": "The latest round of layoffs marks eBay’s third workforce reduction in the past three years.",
    "category": "tech"
  },
  {
    "title": "New York sues Valve for enabling \"illegal gambling\" with loot boxes",
    "slug": "new-york-sues-valve-for-enabling-illegal-gambling-with-loot-boxes",
    "url": "https://arstechnica.com/gaming/2026/02/new-york-sues-valve-for-enabling-illegal-gambling-with-loot-boxes/",
    "source": "Ars Technica",
    "date": "2026-02-26T14:57:36.000Z",
    "summary": "The ability to resell Steam items for real value is key to the state's case.",
    "content": "The ability to resell Steam items for real value is key to the state's case.",
    "category": "tech"
  },
  {
    "title": "A non-public document reveals that science may not be prioritized on next Mars mission",
    "slug": "a-non-public-document-reveals-that-science-may-not-be-prioritized-on-next-mars-m",
    "url": "https://arstechnica.com/space/2026/02/a-non-public-document-reveals-that-science-may-not-be-prioritized-on-next-mars-mission/",
    "source": "Ars Technica",
    "date": "2026-02-26T14:44:25.000Z",
    "summary": "For some reason, NASA chose not to publicly release its Mars orbiter objectives.",
    "content": "For some reason, NASA chose not to publicly release its Mars orbiter objectives.",
    "category": "tech"
  },
  {
    "title": "15 state attorneys general sue RFK Jr. over \"anti-science\" vaccine policy",
    "slug": "state-attorneys-general-sue-rfk-jr-vaccine-policy",
    "url": "https://arstechnica.com/health/2026/02/15-state-attorneys-general-sue-rfk-jr-over-anti-science-vaccine-policy/",
    "source": "Ars Technica",
    "date": "2026-02-26T14:14:55.000Z",
    "summary": "Fifteen state attorneys general have filed a lawsuit against Robert F. Kennedy Jr. regarding vaccine policies they claim contradict scientific evidence and undermine public health standards. The lawsuit targets the Trump administration's reduced vaccine schedule, which critics argue lacks scientific justification.",
    "content": "Trump administration’s reduced vaccine schedule “throws science out the window.”",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "15位州检察长就\"反科学\"疫苗政策起诉RFK Jr.",
        "summary": "十五位州检察长已对罗伯特·F·肯尼迪第二提起诉讼，涉及他们声称与科学证据相矛盾并破坏公共卫生标准的疫苗政策。该诉讼针对特朗普政府减少的疫苗接种时间表，批评人士辩称该时间表缺乏科学依据。"
      },
      "fr": {
        "title": "15 procureurs généraux d'État poursuivent RFK Jr. pour sa politique vaccinale \"anti-science\"",
        "summary": "Quinze procureurs généraux d'État ont intenté un procès à Robert F. Kennedy Jr. concernant des politiques vaccinales qu'ils affirment contredire les preuves scientifiques et miner les normes de santé publique. Le procès cible le calendrier vaccinal réduit de l'administration Trump, que les critiques affirment manquer de justification scientifique."
      },
      "de": {
        "title": "15 Generalstaatsanwälte verklagen RFK Jr. über \"wissenschaftsfeindliche\" Impfpolitik",
        "summary": "Fünfzehn Generalstaatsanwälte haben eine Klage gegen Robert F. Kennedy Jr. eingereicht, die sich auf Impfpolitiken bezieht, die ihrer Meinung nach wissenschaftlichen Beweisen widersprechen und die Standards im Bereich der öffentlichen Gesundheit untergraben. Die Klage zielt auf den reduzierten Impfplan der Trump-Administration ab, den Kritiker für wissenschaftlich unbegründet halten."
      },
      "es": {
        "title": "15 fiscales generales estatales demandan a RFK Jr. por su política de vacunación \"anticientífica\"",
        "summary": "Quince fiscales generales de estados han presentado una demanda contra Robert F. Kennedy Jr. con respecto a políticas de vacunación que afirman contradicen la evidencia científica y socavan los estándares de salud pública. La demanda se dirige al calendario de vacunación reducido de la administración Trump, que los críticos argumentan carece de justificación científica."
      }
    }
  },
  {
    "title": "Badge engineering could be worse than this: The 2026 Subaru Uncharted",
    "slug": "subaru-uncharted-ev-badge-engineering",
    "url": "https://arstechnica.com/cars/2026/02/2026-subaru-uncharted-first-drive-fwd-might-be-the-biggest-selling-point/",
    "source": "Ars Technica",
    "date": "2026-02-26T14:00:59.000Z",
    "summary": "Subaru has released a new electric vehicle called the Uncharted, which shares a platform with Toyota and starts at $34,995, exemplifying the practice of badge engineering in the EV market. The vehicle represents Subaru's strategy in the increasingly competitive electric vehicle segment.",
    "content": "Subaru has a new EV using the platform it shares with Toyota, starting at $34,995.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "徽章工程可能更糟：2026年斯巴鲁Uncharted",
        "summary": "斯巴鲁推出了一款名为Uncharted的新电动汽车，与丰田共享平台，起价34,995美元，体现了电动汽车市场中的徽章工程实践。该车代表了斯巴鲁在竞争日益激烈的电动汽车市场中的战略。"
      },
      "fr": {
        "title": "L'ingénierie de marque pourrait être pire : Le Subaru Uncharted 2026",
        "summary": "Subaru a lancé un nouveau véhicule électrique appelé Uncharted, qui partage une plateforme avec Toyota et coûte à partir de 34 995 $, exemplifiant la pratique de l'ingénierie de marque sur le marché des véhicules électriques. Le véhicule représente la stratégie de Subaru dans le segment des véhicules électriques de plus en plus compétitif."
      },
      "de": {
        "title": "Technische Markengestaltung könnte schlimmer sein: Der Subaru Uncharted 2026",
        "summary": "Subaru hat ein neues Elektrofahrzeug namens Uncharted eingeführt, das eine Plattform mit Toyota teilt und bei 34.995 US-Dollar beginnt und die Praxis der technischen Markengestaltung auf dem Elektrofahrzeugmarkt exemplifiziert. Das Fahrzeug stellt Subarus Strategie im zunehmend wettbewerbsintensiven Segment der Elektrofahrzeuge dar."
      },
      "es": {
        "title": "La ingeniería de marca podría ser peor: El Subaru Uncharted 2026",
        "summary": "Subaru ha lanzado un nuevo vehículo eléctrico llamado Uncharted, que comparte plataforma con Toyota y comienza a $34,995, ejemplificando la práctica de la ingeniería de marca en el mercado de vehículos eléctricos. El vehículo representa la estrategia de Subaru en el segmento de vehículos eléctricos cada vez más competitivo."
      }
    }
  },
  {
    "title": "ULA isn't making the Space Force's GPS interference problem any easier",
    "slug": "ula-vulcan-gps-interference-investigation",
    "url": "https://arstechnica.com/space/2026/02/ula-isnt-making-the-space-forces-gps-interference-problem-any-easier/",
    "source": "Ars Technica",
    "date": "2026-02-26T13:31:18.000Z",
    "summary": "The Space Force is investigating a booster anomaly on United Launch Alliance's Vulcan rocket related to GPS interference issues, with officials expecting the investigation to extend for multiple months. The ongoing issue presents challenges for the Space Force's operations and ULA's launch schedule.",
    "content": "Officials expect the investigation into a booster anomaly on ULA's Vulcan rocket to last multiple months.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "美国联合发射联盟没有让太空军的GPS干扰问题更容易解决",
        "summary": "太空军正在调查联合发射联盟火神号火箭上的助推器异常，该异常与GPS干扰问题有关，官员们预计调查将延长数月。这一持续的问题给太空军的运作和联合发射联盟的发射时间表带来了挑战。"
      },
      "fr": {
        "title": "ULA ne rend pas le problème d'interférence GPS de la Force spatiale plus facile",
        "summary": "La Force spatiale enquête sur une anomalie de propulseur sur le lanceur Vulcan de United Launch Alliance liée à des problèmes d'interférence GPS, les responsables s'attendant à ce que l'enquête s'étende sur plusieurs mois. Le problème persistant présente des défis pour les opérations de la Force spatiale et le calendrier de lancement d'ULA."
      },
      "de": {
        "title": "ULA macht das GPS-Interferenzproblem der Weltraummacht nicht einfacher",
        "summary": "Die Space Force untersucht eine Triebwerksanomalie auf der Vulcan-Rakete von United Launch Alliance im Zusammenhang mit GPS-Interferenzproblemen, und Beamte erwarten, dass sich die Untersuchung über mehrere Monate erstreckt. Das anhaltende Problem stellt Herausforderungen für den Betrieb der Space Force und den Startplan von ULA dar."
      },
      "es": {
        "title": "ULA no está haciendo que el problema de interferencia de GPS de la Fuerza Espacial sea más fácil",
        "summary": "La Fuerza Espacial está investigando una anomalía del impulsor en el cohete Vulcan de United Launch Alliance relacionada con problemas de interferencia de GPS, y se espera que la investigación se extienda por varios meses. El problema en curso presenta desafíos para las operaciones de la Fuerza Espacial y el cronograma de lanzamiento de ULA."
      }
    }
  },
  {
    "title": "Instagram now alerts parents if their teen searches for suicide or self-harm content",
    "slug": "instagram-alerts-parents-teen-suicide-self-harm",
    "url": "https://techcrunch.com/2026/02/26/instagram-now-alerts-parents-if-their-teen-searches-for-suicide-or-self-harm-content/",
    "source": "TechCrunch",
    "date": "2026-02-26T12:00:00.000Z",
    "summary": "Instagram is adding a feature to alert parents when their teens search for suicide or self-harm content, providing families with resources to support their children's mental health. This initiative aims to help parents identify teens at risk and intervene early.",
    "content": "Parents will be informed if their teen searches for suicide or self-harm content and offered resources.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Instagram现在在青少年搜索自杀或自残内容时提醒家长",
        "summary": "Instagram正在添加一项功能，在青少年搜索自杀或自残内容时提醒家长，为家庭提供资源来支持孩子的心理健康。这一举措旨在帮助家长识别有风险的青少年并进行早期干预。"
      },
      "fr": {
        "title": "Instagram alerte maintenant les parents si leurs ados recherchent du contenu suicidaire ou d'automutilation",
        "summary": "Instagram ajoute une fonctionnalité pour alerter les parents lorsque leurs adolescents recherchent du contenu suicidaire ou d'automutilation, en fournissant aux familles des ressources pour soutenir la santé mentale de leurs enfants. Cette initiative vise à aider les parents à identifier les adolescents à risque et à intervenir rapidement."
      },
      "de": {
        "title": "Instagram benachrichtigt nun Eltern, wenn ihre Jugendlichen nach Suizid- oder Selbstverletzen-Inhalten suchen",
        "summary": "Instagram fügt eine Funktion hinzu, um Eltern zu benachrichtigen, wenn ihre Jugendlichen nach Suizid- oder Selbstverletzen-Inhalten suchen, und stellt Familien Ressourcen zur Verfügung, um die psychische Gesundheit ihrer Kinder zu unterstützen. Diese Initiative soll Eltern helfen, gefährdete Jugendliche zu identifizieren und frühzeitig einzugreifen."
      },
      "es": {
        "title": "Instagram ahora alerta a los padres si sus adolescentes buscan contenido de suicidio o autolesiones",
        "summary": "Instagram está agregando una función para alertar a los padres cuando sus adolescentes buscan contenido de suicidio o autolesiones, proporcionando recursos a las familias para apoyar la salud mental de sus hijos. Esta iniciativa tiene como objetivo ayudar a los padres a identificar adolescentes en riesgo e intervenir temprano."
      }
    }
  },
  {
    "title": "Instagram will alert parents if their kids &#8216;repeatedly&#8217; search for self-harm topics",
    "slug": "instagram-alert-parents-repeatedly-self-harm",
    "url": "https://www.theverge.com/tech/885110/meta-instagram-parent-alert-teen-self-harm-suicide",
    "source": "The Verge",
    "date": "2026-02-26T12:00:00.000Z",
    "summary": "Instagram is launching a parental alert system that notifies parents when teens repeatedly search for suicide or self-harm related terms, rolling out first in the US, UK, Australia, and Canada for opted-in supervision accounts. Meta also plans similar protections for its AI chatbots later this year.",
    "content": "The alerts will start rolling out to Teen accounts with parental supervision protections next week. | Image: Meta / The Verge\t\n\nStarting next week, Instagram will notify parents to check on their teen searching for terms related to self-harm or suicide. Meta says a similar alert system for its AI chatbots is coming later this year.\nThe new Instagram feature  sends parents an alert when their child \"repeatedly tries to search for terms clearly associated with suicide or self-harm within a short period of time.\" It's rolling out in the US, UK, Australia, and Canada starting next week, but it's only for parents and teens who opt in to supervision. It's expected to expand to other regions later this year.\n\"The vast majority of teens do not try to search for suicide and …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Instagram将在孩子反复搜索自残话题时提醒家长",
        "summary": "Instagram正在推出一个家长提醒系统，当青少年反复搜索自杀或自残相关内容时通知家长，首先在美国、英国、澳大利亚和加拿大为已选择监管的账户推出。Meta还计划今年晚些时候为其AI聊天机器人提供类似保护。"
      },
      "fr": {
        "title": "Instagram alertera les parents si leurs enfants recherchent régulièrement des sujets d'automutilation",
        "summary": "Instagram lance un système d'alerte parentale qui notifie les parents lorsque les adolescents recherchent à plusieurs reprises des termes liés au suicide ou à l'automutilation, se déployant d'abord aux États-Unis, au Royaume-Uni, en Australie et au Canada pour les comptes de supervision activés. Meta prévoit également des protections similaires pour ses chatbots IA plus tard cette année."
      },
      "de": {
        "title": "Instagram wird Eltern benachrichtigen, wenn ihre Kinder wiederholte Selbstverletzen-Themen suchen",
        "summary": "Instagram führt ein Eltern-Benachrichtigungssystem ein, das Eltern benachrichtigt, wenn Jugendliche wiederholt nach Suizid- oder Selbstverletzen-Begriffen suchen, und rollt es zunächst in den USA, Großbritannien, Australien und Kanada für aktivierte Überwachungskonten aus. Meta plant außerdem ähnliche Schutzmaßnahmen für seine KI-Chatbots später in diesem Jahr."
      },
      "es": {
        "title": "Instagram alertará a los padres si sus hijos buscan repetidamente temas de autolesiones",
        "summary": "Instagram está lanzando un sistema de alerta para padres que notifica a los padres cuando los adolescentes buscan repetidamente términos relacionados con suicidio o autolesiones, implementándose primero en EE.UU., Reino Unido, Australia y Canadá para cuentas de supervisión activadas. Meta también planea protecciones similares para sus chatbots de IA más adelante este año."
      }
    }
  },
  {
    "title": "Google takes control of ‘Android of robotics’ project in quest for physical AI",
    "slug": "google-takes-control-android-robotics-physical-ai",
    "url": "https://www.theverge.com/tech/885113/google-swallows-ai-robotics-moonshot-intrinsic",
    "source": "The Verge",
    "date": "2026-02-26T11:06:33.000Z",
    "summary": "Google is integrating Alphabet's robotics AI company Intrinsic into its core operations after five years as an independent venture, signaling a strategic shift toward physical AI development. The move brings Intrinsic's Android-like robotics platform closer to Google's main business.",
    "content": "Google is folding Alphabet's AI robotics \"moonshot,\" Intrinsic, into the company after five years as an independent unit. The move marks a strategic shift as Google doubles down on physical AI and pulls experimental projects closer to its core business. \nIntrinsic \"graduated\" into an independent company inside Alphabet's Other Bets division in 2021, a portfolio of high-risk, speculative ventures that also includes robotaxi firm Waymo and healthcare company Verily. It pitches itself as an Android-like layer for robotics, building software and tools that make it easier to create robot applications.\nDetails of the purchase are not clear but t …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "谷歌接管\"机器人的安卓\"项目，追求物理人工智能",
        "summary": "谷歌将Alphabet的机器人AI公司Intrinsic整合到其核心业务中，该公司在五年前作为独立企业成立，这标志着向物理人工智能发展的战略转变。此举将Intrinsic类似安卓的机器人平台更接近谷歌的主要业务。"
      },
      "fr": {
        "title": "Google prend le contrôle du projet \"Android de la robotique\" dans sa quête pour l'IA physique",
        "summary": "Google intègre Intrinsic, la société d'IA robotique d'Alphabet, dans ses activités principales après cinq ans en tant qu'entreprise indépendante, signalant un changement stratégique vers le développement de l'IA physique. Cette démarche rapproche la plateforme robotique de type Android d'Intrinsic du cœur de métier de Google."
      },
      "de": {
        "title": "Google übernimmt Kontrolle über das \"Android der Robotik\"-Projekt im Streben nach physischer KI",
        "summary": "Google integriert Alphabets Robotik-KI-Unternehmen Intrinsic in seine Kernoperationen nach fünf Jahren als unabhängiges Unternehmen, was einen strategischen Wandel in Richtung Entwicklung physischer KI signalisiert. Der Schritt bringt Intrinsics Android-ähnliche Robotik-Plattform näher an Googles Hauptgeschäft."
      },
      "es": {
        "title": "Google toma control del proyecto \"Android de la robótica\" en busca de IA física",
        "summary": "Google está integrando Intrinsic, la empresa de IA de robótica de Alphabet, en sus operaciones principales después de cinco años como empresa independiente, señalando un cambio estratégico hacia el desarrollo de IA física. El movimiento acerca la plataforma de robótica similar a Android de Intrinsic más cerca del negocio principal de Google."
      }
    }
  },
  {
    "title": "Salesforce CEO Marc Benioff: This isn’t our first SaaSpocalypse",
    "slug": "salesforce-ceo-marc-benioff-saaspocalypse",
    "url": "https://techcrunch.com/2026/02/25/salesforce-ceo-marc-benioff-this-isnt-our-first-saaspocalypse/",
    "source": "TechCrunch",
    "date": "2026-02-26T01:59:12.000Z",
    "summary": "Salesforce reported strong year-end earnings while addressing concerns about AI threatening its business model. CEO Marc Benioff emphasized the company's resilience through previous technological disruptions. The announcement aims to counter narratives about AI obsolescence in the SaaS sector.",
    "content": "Salesforce reported a solid year-end earnings and then pulled out all the stops to ward off more talk of the death of its business to AI.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Salesforce首席执行官Marc Benioff：这不是我们第一次\"SaaS末日\"",
        "summary": "Salesforce报告了强劲的年终业绩，同时回应了有关人工智能威胁其商业模式的担忧。首席执行官Marc Benioff强调了该公司在以往技术颠覆中的韧性。这项声明旨在反驳关于SaaS领域AI过时的叙述。"
      },
      "fr": {
        "title": "Le PDG de Salesforce Marc Benioff : Ce n'est pas notre premier SaaSpocalypse",
        "summary": "Salesforce a rapporté de solides résultats de fin d'année tout en abordant les préoccupations concernant l'IA menaçant son modèle commercial. Le PDG Marc Benioff a souligné la résilience de l'entreprise face aux perturbations technologiques précédentes. L'annonce vise à contrer les récits sur l'obsolescence de l'IA dans le secteur du SaaS."
      },
      "de": {
        "title": "Salesforce-CEO Marc Benioff: Dies ist nicht unser erstes SaaSpocalypse",
        "summary": "Salesforce meldete starke Jahresendergebnisse und befasste sich mit Bedenken hinsichtlich der künstlichen Intelligenz, die sein Geschäftsmodell bedroht. CEO Marc Benioff betonte die Widerstandsfähigkeit des Unternehmens gegen frühere technologische Störungen. Die Ankündigung zielt darauf ab, Narrative über die Veralterung von KI im SaaS-Sektor entgegenzuwirken."
      },
      "es": {
        "title": "El CEO de Salesforce Marc Benioff: Este no es nuestro primer SaaSpocalipsis",
        "summary": "Salesforce reportó sólidas ganancias de fin de año mientras abordaba las preocupaciones sobre la IA que amenaza su modelo de negocio. El CEO Marc Benioff enfatizó la resiliencia de la empresa frente a perturbaciones tecnológicas previas. El anuncio tiene como objetivo contrarrestar las narrativas sobre la obsolescencia de la IA en el sector SaaS."
      }
    }
  },
  {
    "title": "Gushwork bets on AI search for customer leads — and early results are emerging",
    "slug": "gushwork-ai-search-customer-leads",
    "url": "https://techcrunch.com/2026/02/25/gushwork-bets-on-ai-search-for-customer-leads-and-early-results-are-emerging/",
    "source": "TechCrunch",
    "date": "2026-02-26T00:00:00.000Z",
    "summary": "Gushwork, a startup leveraging AI search tools like ChatGPT for customer lead generation, has raised $9 million in a seed round led by SIG and Lightspeed. Early customer traction suggests the approach is gaining market interest.",
    "content": "Gushwork has raised $9 million in a seed round led by SIG and Lightspeed. The startup has seen early customer traction from AI search tools like ChatGPT.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Gushwork 押注 AI 搜索获取客户线索——早期成果正在出现",
        "summary": "初创公司 Gushwork 利用 ChatGPT 等 AI 搜索工具进行客户线索生成，已在由 SIG 和 Lightspeed 领投的种子轮中融资 900 万美元。早期客户吸引力表明该方法正在获得市场关注。"
      },
      "fr": {
        "title": "Gushwork parie sur la recherche IA pour générer des prospects — et les premiers résultats émergent",
        "summary": "Gushwork, une startup exploitant des outils de recherche IA comme ChatGPT pour la génération de prospects, a levé 9 millions de dollars au cours d'un tour de financement dirigé par SIG et Lightspeed. L'intérêt des premiers clients suggère que cette approche gagne du terrain."
      },
      "de": {
        "title": "Gushwork setzt auf KI-Suche für Kundenakquise — erste Ergebnisse zeichnen sich ab",
        "summary": "Gushwork, ein Startup, das KI-Suchwerkzeuge wie ChatGPT zur Kundenakquise nutzt, hat in einer von SIG und Lightspeed angeführten Seed-Runde 9 Millionen Dollar aufgebracht. Frühe Kundenbindung deutet darauf hin, dass der Ansatz Marktinteresse gewinnt."
      },
      "es": {
        "title": "Gushwork apuesta por la búsqueda de IA para generar clientes — y los primeros resultados están emergiendo",
        "summary": "Gushwork, una startup que aprovecha herramientas de búsqueda de IA como ChatGPT para la generación de clientes, ha recaudado 9 millones de dólares en una ronda de semilla liderada por SIG y Lightspeed. El interés inicial de los clientes sugiere que el enfoque está ganando tracción en el mercado."
      }
    }
  }
]