[
  {
    "title": "Pentagon buyer: We're happy with our launch industry, but payloads are lagging",
    "slug": "pentagon-launch-payloads-speed",
    "url": "https://arstechnica.com/space/2026/02/pentagon-buyer-were-happy-with-our-launch-industry-but-payloads-are-lagging/",
    "source": "Ars Technica",
    "date": "2026-02-23T22:14:28.000Z",
    "summary": "Pentagon procurement officials express satisfaction with the U.S. launch industry but want faster mission deployment timelines. Military buyers describe current two to three-year mission timelines as unacceptably slow for operational needs.",
    "content": "\"The point is to get missions out the door as fast as possible. Two to three years is too slow.\"",
    "category": "tech"
  },
  {
    "title": "Data center builders thought farmers would willingly sell land, learn otherwise",
    "slug": "data-centers-farmland-resistance",
    "url": "https://arstechnica.com/tech-policy/2026/02/im-not-for-sale-farmers-refuse-to-take-millions-in-data-center-deals/",
    "source": "Ars Technica",
    "date": "2026-02-23T21:48:44.000Z",
    "summary": "Data center developers are facing unexpected resistance from farmers unwilling to sell land for facility development despite million-dollar offers. The obstacles highlight that financial incentives alone cannot overcome deep attachment to farmland, even in economically fragile agricultural regions.",
    "content": "Even in a fragile farm economy, million-dollar offers can't sway dedicated farmers.",
    "category": "tech"
  },
  {
    "title": "Panasonic, the former plasma king, will no longer make its own TVs",
    "slug": "panasonic-stops-making-tvs",
    "url": "https://arstechnica.com/gadgets/2026/02/panasonic-the-former-plasma-king-will-no-longer-make-its-own-tvs/",
    "source": "Ars Technica",
    "date": "2026-02-23T21:16:20.000Z",
    "summary": "Panasonic, once a dominant force in television manufacturing, is ceasing in-house TV production as it exits the increasingly competitive market. The decision leaves few major Japanese manufacturers still producing their own televisions.",
    "content": "Panasonic was one of the last Japanese companies still manufacturing TVs.",
    "category": "tech"
  },
  {
    "title": "New Microsoft gaming chief has \"no tolerance for bad AI\"",
    "slug": "microsoft-gaming-chief-ai-focus",
    "url": "https://arstechnica.com/gaming/2026/02/new-microsoft-gaming-chief-has-no-tolerance-for-bad-ai/",
    "source": "Ars Technica",
    "date": "2026-02-23T17:45:29.000Z",
    "summary": "Microsoft's new gaming division chief has pledged strict standards on AI implementation in games. However, the executive faces scrutiny from industry observers concerned about her limited direct background in gaming.",
    "content": "But Asha Sharma faces scrutiny for lack of gaming experience.",
    "category": "tech"
  },
  {
    "title": "The 2026 Mazda CX-5, driven: It got bigger; plus, radical tech upgrade",
    "slug": "2026-mazda-cx5-redesign",
    "url": "https://arstechnica.com/cars/2026/02/the-2026-mazda-cx-5-driven-it-got-bigger-plus-radical-tech-upgrade/",
    "source": "Ars Technica",
    "date": "2026-02-23T17:00:02.000Z",
    "summary": "The redesigned 2026 Mazda CX-5 introduces larger dimensions and significant technology upgrades while starting at $29,990. The updated crossover offers compelling features, though reviewers note it presents notable trade-offs alongside its improvements.",
    "content": "Starting at $29,990, there's a lot to like about the all-new Mazda, but it's not perfect.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "2026年马自达CX-5体验：更大尺寸、激进的科技升级",
        "summary": "经过重新设计的2026年马自达CX-5推出更大的尺寸和重要的技术升级，起价为$29,990。这款更新的跨界车提供引人注目的功能，但评论家指出它在改进的同时也存在显著的权衡。"
      },
      "ja": {
        "title": "2026年マツダCX-5試乗：大型化とラジカルなテク向上",
        "summary": "再設計された2026年マツダCX-5は、より大きなサイズと重要なテクノロジーアップグレードをもたらし、$29,990から始まる。アップデートされたクロスオーバーは魅力的な機能を提供しますが、レビュアーは改善と同時に注目すべきトレードオフがあることを指摘しています。"
      },
      "ko": {
        "title": "2026 마즈다 CX-5 시승: 더 커진 사이즈, 급진적 기술 업그레이드",
        "summary": "재설계된 2026 마즈다 CX-5는 더 큰 치수와 중요한 기술 업그레이드를 제공하며 $29,990부터 시작합니다. 업데이트된 크로스오버는 매력적인 기능을 제공하지만, 평론가들은 개선점과 함께 주목할 만한 트레이드오프가 있음을 지적합니다."
      },
      "fr": {
        "title": "Mazda CX-5 2026 essayée : elle s'agrandit ; plus, une mise à niveau technologique radicale",
        "summary": "Le Mazda CX-5 2026 redessiné introduit des dimensions plus grandes et des améliorations technologiques importantes à partir de 29 990 $. Le crossover mis à jour offre des caractéristiques attrayantes, bien que les critiques notent qu'il présente des compromis notables aux côtés de ses améliorations."
      },
      "de": {
        "title": "Mazda CX-5 2026 Fahrbericht: Es wurde größer; plus radikales Tech-Upgrade",
        "summary": "Der überarbeitete Mazda CX-5 2026 bietet größere Dimensionen und signifikante Technologie-Upgrades ab 29.990 Dollar. Der aktualisierte Crossover bietet überzeugende Features, aber die Rezensenten weisen auf bemerkenswerte Kompromisse neben seinen Verbesserungen hin."
      },
      "es": {
        "title": "Mazda CX-5 2026 probado: se hizo más grande; además, actualización tecnológica radical",
        "summary": "El rediseñado Mazda CX-5 2026 introduce dimensiones más grandes y actualizaciones tecnológicas significativas a partir de $29,990. El crossover actualizado ofrece características atractivas, aunque los críticos señalan que presenta compensaciones notables junto con sus mejoras."
      }
    }
  },
  {
    "title": "AIs can generate near-verbatim copies of novels from training data",
    "slug": "ais-memorize-training-data",
    "url": "https://arstechnica.com/ai/2026/02/ais-can-generate-near-verbatim-copies-of-novels-from-training-data/",
    "source": "Ars Technica",
    "date": "2026-02-23T15:38:00.000Z",
    "summary": "Research reveals that large language models memorize more training data than previously understood, capable of generating near-verbatim reproductions of copyrighted novels and other works. The findings raise important questions about data memorization in AI systems and copyright implications.",
    "content": "LLMs memorize more training data than previously thought.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "AI可以从训练数据生成小说的近乎逐字逐句的副本",
        "summary": "研究表明，大型语言模型比以前理解的记忆更多训练数据，能够生成受版权保护的小说和其他作品的近乎逐字逐句的复制。这些发现提出了关于AI系统中数据记忆和版权影响的重要问题。"
      },
      "ja": {
        "title": "AIは訓練データから小説の近似逐語的コピーを生成できる",
        "summary": "研究により、大規模言語モデルは以前よりも理解されていたより多くの訓練データをメモリー化し、著作権保護される小説や他の作品の近似逐語的再現を生成できることが明らかになった。これらの発見は、AIシステムにおけるデータメモリー化と著作権への影響についての重要な問題を提起している。"
      },
      "ko": {
        "title": "AI가 학습 데이터에서 소설의 거의 원문 그대로의 복사본을 생성할 수 있음",
        "summary": "연구에 따르면 대규모 언어 모델은 이전에 이해한 것보다 더 많은 학습 데이터를 암기하며, 저작권 보호되는 소설 및 기타 작품의 거의 원문 그대로의 복사본을 생성할 수 있다는 것을 보여줍니다. 이 발견은 AI 시스템의 데이터 암기 및 저작권 영향에 대한 중요한 질문을 제기합니다."
      },
      "fr": {
        "title": "Les IAs peuvent générer des copies quasi verbatim de romans à partir de données d'entraînement",
        "summary": "La recherche révèle que les grands modèles de langage mémorisent plus de données d'entraînement que précédemment compris, capables de générer des reproductions quasi verbatim de romans protégeant les droits d'auteur et d'autres ouvrages. Les conclusions soulèvent des questions importantes sur la mémorisation des données dans les systèmes d'IA et les implications sur le droit d'auteur."
      },
      "de": {
        "title": "KIs können nahezu wortgetreue Kopien von Romanen aus Trainingsdaten generieren",
        "summary": "Forschung zeigt, dass große Sprachmodelle mehr Trainingsdaten speichern als bisher verstanden, und wortgetreue Reproduktionen von urheberrechtlich geschützten Romanen und anderen Werken generieren können. Die Erkenntnisse werfen wichtige Fragen zur Datenspeicherung in KI-Systemen und Urheberrechtsauswirkungen auf."
      },
      "es": {
        "title": "Las IAs pueden generar copias casi literales de novelas a partir de datos de entrenamiento",
        "summary": "La investigación revela que los grandes modelos de lenguaje memorizan más datos de entrenamiento de lo que se entendía anteriormente, siendo capaces de generar reproducciones casi literales de novelas protegidas por derechos de autor y otras obras. Los hallazgos plantean preguntas importantes sobre la memorización de datos en sistemas de IA e implicaciones de derechos de autor."
      }
    }
  },
  {
    "title": "Review: Knight of the Seven Kingdoms brings back that Westeros magic",
    "slug": "knight-seven-kingdoms-review",
    "url": "https://arstechnica.com/culture/2026/02/review-knight-of-the-seven-kingdoms-brings-back-that-westeros-magic/",
    "source": "Ars Technica",
    "date": "2026-02-23T13:51:36.000Z",
    "summary": "The Game of Thrones prequel \"Knight of the Seven Kingdoms\" successfully recaptures the storytelling quality that made the original series beloved by audiences. The show demonstrates the Westeros universe still contains compelling narratives worth exploring.",
    "content": "Prequel series is just great storytelling, reminding GoT fans why they loved the original so much.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "评论：《七王国骑士》找回了维斯特洛斯的魔力",
        "summary": "权力游戏前传《七王国骑士》成功地重现了使原系列受到观众喜爱的叙事质量。这部剧表明维斯特洛斯宇宙仍然包含值得探索的引人注目的叙事。"
      },
      "ja": {
        "title": "レビュー：『七王国の騎士』がウェステロスの魔法を取り戻す",
        "summary": "ゲーム・オブ・スローンズの前編『七王国の騎士』は、元のシリーズを視聴者に愛させた物語の質を見事に復活させています。このシリーズはウェステロス宇宙がまだ探求する価値のある魅力的な物語を含んでいることを示しています。"
      },
      "ko": {
        "title": "리뷰: '일곱 왕국의 기사'가 웨스테로스의 마법을 되살리다",
        "summary": "권력의 게임 전편 '일곱 왕국의 기사'는 원래 시리즈를 시청자에게 사랑받게 만든 스토리텔링 품질을 성공적으로 재현합니다. 이 쇼는 웨스테로스 우주가 여전히 탐구할 가치가 있는 매력적인 서사를 포함하고 있음을 보여줍니다."
      },
      "fr": {
        "title": "Critique : Knight of the Seven Kingdoms ramène la magie de Westeros",
        "summary": "La préquelle Game of Thrones « Knight of the Seven Kingdoms » recapture avec succès la qualité narrative qui a rendu la série originale bien-aimée du public. Le spectacle démontre que l'univers de Westeros contient toujours des récits captivants dignes d'exploration."
      },
      "de": {
        "title": "Rezension: Knight of the Seven Kingdoms bringt die Westeros-Magie zurück",
        "summary": "Das Game-of-Thrones-Prequel \"Knight of the Seven Kingdoms\" erfasst erfolgreich die Erzählqualität, die die ursprüngliche Serie beim Publikum beliebt machte. Die Serie zeigt, dass das Westeros-Universum immer noch fesselnde Erzählungen enthält, die es zu erkunden lohnt."
      },
      "es": {
        "title": "Crítica: Caballero de los Siete Reinos trae de vuelta la magia de Westeros",
        "summary": "La precuela de Juego de Tronos \"Caballero de los Siete Reinos\" recaptura con éxito la calidad narrativa que hizo que la serie original fuera amada por la audiencia. El espectáculo demuestra que el universo de Westeros aún contiene narrativas cautivadoras que vale la pena explorar."
      }
    }
  },
  {
    "title": "The first cars bold enough to drive themselves",
    "slug": "autonomous-vehicles-history",
    "url": "https://arstechnica.com/features/2026/02/the-first-cars-bold-enough-to-drive-themselves/",
    "source": "Ars Technica",
    "date": "2026-02-23T12:00:45.000Z",
    "summary": "Autonomous vehicles represent the culmination of over a century of technological development, beginning with early 1904 telekino experiments through modern autonomous Waymo systems. The progression demonstrates how incremental innovations eventually enabled practical self-driving transportation.",
    "content": "Quevedo's telekino of 1904 was the first step on the road to autonomous Waymos.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "敢于自动驾驶的第一批汽车",
        "summary": "自动驾驶汽车代表超一个世纪技术发展的巅峰，从1904年遥控实验到现代Waymo系统。这个过程表明渐进创新如何最终使自动驾驶运输成为现实。"
      },
      "ja": {
        "title": "自動で運転する勇敢な最初の自動車",
        "summary": "自動運転車は1世紀以上の技術発展の集大成であり、1904年のテレキノ実験から現代のWaymo自動運転システムまで進化しています。この進化は、段階的なイノベーションがいかに実用的な自動運転を可能にしたかを示しています。"
      },
      "ko": {
        "title": "자동으로 운전하는 용감한 첫 번째 자동차들",
        "summary": "자율 주행 자동차는 1904년 초기 원격조종 실험부터 현대 Waymo 자율주행 시스템까지 1세기 이상의 기술 발전의 정점입니다. 이 과정은 점진적 혁신이 어떻게 실용적인 자동 운전 운송을 가능하게 했는지 보여줍니다."
      },
      "fr": {
        "title": "Les premières voitures assez audacieuses pour se conduire elles-mêmes",
        "summary": "Les véhicules autonomes représentent l'apogée de plus d'un siècle de développement technologique, depuis les premières expériences de télécommande en 1904 jusqu'aux systèmes Waymo autonomes modernes. Cette progression montre comment les innovations progressives ont rendu possible le transport autonome pratique."
      },
      "de": {
        "title": "Die ersten Autos, die sich selbst zu fahren trauen",
        "summary": "Autonome Fahrzeuge stellen den Höhepunkt von über einem Jahrhundert technologischer Entwicklung dar, von frühen Fernsteuerungsexperimenten 1904 bis zu modernen autonomen Waymo-Systemen. Diese Entwicklung zeigt, wie schrittweise Innovationen letztlich praktisches selbstfahrendes Fahren möglich machten."
      },
      "es": {
        "title": "Los primeros autos lo suficientemente audaces para conducirse a sí mismos",
        "summary": "Los vehículos autónomos representan la culminación de más de un siglo de desarrollo tecnológico, desde los primeros experimentos de control remoto en 1904 hasta los modernos sistemas autónomos de Waymo. Esta progresión demuestra cómo las innovaciones incrementales finalmente hicieron posible el transporte autónomo práctico."
      }
    }
  }
]