[
  {
    "title": "OpenAI’s Sam Altman announces Pentagon deal with ‘technical safeguards’",
    "slug": "openai-sam-altman-pentagon-deal-technical-safeguards",
    "url": "https://techcrunch.com/2026/02/28/openais-sam-altman-announces-pentagon-deal-with-technical-safeguards/",
    "source": "TechCrunch",
    "date": "2026-02-28T16:17:36.000Z",
    "summary": "OpenAI has announced a defense contract with the Pentagon that includes technical safeguards to address concerns about AI safety, directly responding to criticisms raised about other companies like Anthropic. This demonstrates OpenAI's effort to build trust as the U.S. government expands AI use in defense applications. The deal represents a significant expansion of AI integration into military and defense capabilities.",
    "content": "OpenAI's CEO claims its new defense contract includes protections addressing the same issues that became a flashpoint for Anthropic.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "OpenAI的Sam Altman宣布与五角大楼达成具有\"技术防护\"的协议",
        "summary": "OpenAI与五角大楼签署了一份防御合同，包括技术防护措施以解决人工智能安全问题，直接回应了对其他公司（如Anthropic）的批评。这展示了OpenAI在美国政府扩大防御应用中AI使用时建立信任的努力。该协议代表了AI在军事和防御能力中的显著扩展。"
      },
      "fr": {
        "title": "Sam Altman d'OpenAI annonce un accord avec le Pentagone avec \"des mesures de sécurité techniques\"",
        "summary": "OpenAI a annoncé un contrat de défense avec le Pentagone qui comprend des mesures de sécurité techniques pour répondre aux préoccupations en matière de sécurité de l'IA, répondant directement aux critiques adressées à d'autres entreprises comme Anthropic. Cela démontre les efforts d'OpenAI pour établir la confiance alors que le gouvernement américain élargit l'utilisation de l'IA dans les applications de défense. L'accord représente une expansion significative de l'intégration de l'IA dans les capacités militaires et de défense."
      },
      "de": {
        "title": "Sam Altman von OpenAI kündigt Pentagon-Deal mit \"technischen Schutzmaßnahmen\" an",
        "summary": "OpenAI hat einen Verteidigungsvertrag mit dem Pentagon angekündigt, der technische Schutzmaßnahmen zur Behandlung von Bedenken bezüglich der KI-Sicherheit enthält und direkt auf Kritik an anderen Unternehmen wie Anthropic antwortet. Dies demonstriert OpenAIs Bemühungen, Vertrauen aufzubauen, während die US-Regierung die KI-Nutzung in Verteidigungsanwendungen ausweitet. Der Deal stellt eine signifikante Ausweitung der KI-Integration in militärische und Verteidigungsfähigkeiten dar."
      },
      "es": {
        "title": "Sam Altman de OpenAI anuncia un acuerdo con el Pentágono con \"salvaguardas técnicas\"",
        "summary": "OpenAI ha anunciado un contrato de defensa con el Pentágono que incluye salvaguardas técnicas para abordar las preocupaciones sobre la seguridad de la IA, respondiendo directamente a las críticas dirigidas a otras empresas como Anthropic. Esto demuestra el esfuerzo de OpenAI por construir confianza mientras el gobierno estadounidense expande el uso de IA en aplicaciones de defensa. El acuerdo representa una expansión significativa de la integración de IA en capacidades militares y de defensa."
      }
    }
  },
  {
    "title": "You can still grab great deals on Bose headphones and Astro Bot this weekend",
    "slug": "great-deals-bose-headphones-astro-bot-weekend",
    "url": "https://www.theverge.com/gadgets/886520/bose-quietcomfort-headphones-samsung-galaxy-s26-ultra-deal-sale",
    "source": "The Verge",
    "date": "2026-02-28T16:07:14.000Z",
    "summary": "Major retailers including Amazon, Best Buy, and Walmart are offering substantial discounts on popular consumer electronics this weekend, with Bose QuietComfort Headphones discounted $150 and deals on the acclaimed game Astro Bot. Samsung Galaxy S26 preorders come with $200 gift cards and storage upgrades, marking some of the best prices of 2026 for these products. The sales cover a range of consumer tech categories from audio equipment to gaming.",
    "content": "Welcome to the weekend, friends! While the rest of our team was checking out Samsung’s forthcoming Galaxy S26 lineup and prepping for Apple’s “special experience” next week, we’ve been sifting through Woot’s “Video Games for All” sale and a truly weird slate of deals that, frankly, don’t have a throughline. (Some of us have also spent the last week unpacking what Huel is, but that’s neither here nor there.)\nHere’s what we can tell you. If you’re thinking of picking up the Galaxy S26 Ultra at launch, putting in your preorder now isn’t a bad idea. It’s also a great time to pick up the midrange QuietComfort Headphones and what many of us at The Verge consider to be the game of 2024: Astro Bot. And who doesn’t want to save on a slick handheld vac?\nNow let’s get to it.\nIf you’re craving a little peace and quiet, Bose’s QuietComfort Headphones are currently on sale at Amazon in multiple colors for $199 ($150 off), which is the best price we’ve seen this year.\nThe standard QC Headphones are essentially a refresh of the last-gen QC45s with some new software tricks, including the ability to adjust noise cancellation levels and set custom listening modes. That being the case, you still get up to 24 hours of battery life, excellent comfort, and multipoint support, making it easy to switch between Bluetooth devices on the fly. They lack Bose’s immersive audio mode and the higher-quality Bluetooth found in the newer QC Ultras, though, as well as support for lossless audio over USB-C. Then again, that probably shouldn’t come as a surprise given they’re retailing for $250 less.\nBose QuietComfort Headphones\n\nWhere to Buy:\n\n $359 $199 at Amazon\n $359 $229 at Best Buy\n $359 $229 at Walmart\n\nAs we alluded to earlier, Samsung announced its Galaxy S26 lineup this week. There are already plenty of preorder deals to consider, but one of the best comes courtesy of Amazon, which is throwing in a $200 gift card alongside a free storage upgrade when you preorder the 512GB Galaxy S26 Ultra sta",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "本周末你仍然可以抢到Bose耳机和Astro Bot的优惠",
        "summary": "亚马逊、百思买和沃尔玛等主要零售商本周末正在提供流行消费电子产品的大幅折扣，Bose QuietComfort耳机降价150美元，备受好评的游戏Astro Bot也有优惠。三星Galaxy S26预订附带200美元的礼品卡和存储升级，标志着2026年这些产品的一些最佳价格。销售涵盖从音频设备到游戏的各种消费科技类别。"
      },
      "fr": {
        "title": "Vous pouvez toujours obtenir d'excellentes offres sur les casques Bose et Astro Bot ce week-end",
        "summary": "Les grands détaillants comme Amazon, Best Buy et Walmart proposent des réductions substantielles sur les produits électroniques grand public populaires ce week-end, avec les casques Bose QuietComfort réduits de 150 $ et des offres sur le jeu acclamé Astro Bot. Les précommandes Samsung Galaxy S26 incluent des cartes-cadeaux de 200 $ et des mises à niveau de stockage, marquant certains des meilleurs prix de 2026 pour ces produits. Les ventes couvrent une gamme de catégories de technologie grand public, du matériel audio aux jeux."
      },
      "de": {
        "title": "Sie können sich dieses Wochenende immer noch großartige Angebote für Bose-Kopfhörer und Astro Bot sichern",
        "summary": "Große Einzelhandelsketten wie Amazon, Best Buy und Walmart bieten dieses Wochenende erhebliche Rabatte auf beliebte Consumer-Electronics-Produkte an, mit Bose-QuietComfort-Kopfhörern, die um 150 $ ermäßigt sind, und Angeboten für das anerkannte Spiel Astro Bot. Samsung Galaxy S26-Vorbestellungen enthalten 200-Dollar-Geschenkgutscheine und Speicher-Upgrades und markieren einige der besten Preise von 2026 für diese Produkte. Die Verkäufe umfassen eine Reihe von Consumer-Tech-Kategorien vom Audio-Equipment bis zum Gaming."
      },
      "es": {
        "title": "Aún puedes conseguir excelentes ofertas en auriculares Bose y Astro Bot este fin de semana",
        "summary": "Los principales minoristas, incluidos Amazon, Best Buy y Walmart, ofrecen descuentos sustanciales en productos electrónicos de consumo populares este fin de semana, con auriculares Bose QuietComfort con descuento de $150 y ofertas en el aclamado juego Astro Bot. Los pedidos anticipados de Samsung Galaxy S26 incluyen tarjetas de regalo de $200 y actualizaciones de almacenamiento, marcando algunos de los mejores precios de 2026 para estos productos. Las ventas abarcan una variedad de categorías de tecnología de consumo, desde equipos de audio hasta juegos."
      }
    }
  },
  {
    "title": "Xiaomi launches 17 Ultra smartphone, an AirTag clone, and an ultra slim powerbank",
    "slug": "xiaomi-launches-17-ultra-smartphone-airtag-clone-powerbank",
    "url": "https://techcrunch.com/2026/02/28/xiaomi-launches-17-ultra-smartphone-an-airtag-clone-and-an-ultra-slim-powerbank/",
    "source": "TechCrunch",
    "date": "2026-02-28T15:09:03.000Z",
    "summary": "Xiaomi announced multiple new devices at Mobile World Congress including the 17 Ultra flagship smartphone, its first Bluetooth tracker competing with Apple's AirTag, and an ultra-slim portable battery. The announcements showcase Xiaomi's expanding hardware ecosystem strategy beyond smartphones. These launches represent the company's effort to compete across multiple consumer technology categories.",
    "content": "We round up everything Xiaomi announced at its Mobile World Congress event.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "小米推出17 Ultra智能手机、AirTag克隆产品和超薄移动电源",
        "summary": "小米在世界移动大会上宣布了多款新设备，包括17 Ultra旗舰智能手机、其首款与苹果AirTag竞争的蓝牙追踪器和超薄便携式电池。这些公告展示了小米超越智能手机的扩大硬件生态系统战略。这些发布代表了公司在多个消费技术类别中竞争的努力。"
      },
      "fr": {
        "title": "Xiaomi lance le smartphone 17 Ultra, un clone AirTag et une batterie externe ultra fine",
        "summary": "Xiaomi a annoncé plusieurs nouveaux appareils au Mobile World Congress, notamment le smartphone phare 17 Ultra, son premier suivi Bluetooth en concurrence avec AirTag d'Apple, et une batterie portable ultra fine. Les annonces mettent en avant la stratégie d'écosystème matériel étendue de Xiaomi au-delà des smartphones. Ces lancements représentent l'effort de l'entreprise à concourir dans plusieurs catégories de technologie de consommation."
      },
      "de": {
        "title": "Xiaomi bringt Smartphone 17 Ultra, AirTag-Klon und Ultra-Slim-Powerbank auf den Markt",
        "summary": "Xiaomi kündigte auf dem Mobile World Congress mehrere neue Geräte an, darunter das Flagship-Smartphone 17 Ultra, seinen ersten Bluetooth-Tracker, der mit Apples AirTag konkurriert, und eine ultra-dünne tragbare Batterie. Die Ankündigungen zeigen Xiaomis erweiterte Hardware-Ökosystem-Strategie jenseits von Smartphones. Diese Launches stellen die Bemühungen des Unternehmens dar, in mehreren Kategorien der Verbrauchertechnologie zu konkurrieren."
      },
      "es": {
        "title": "Xiaomi lanza el smartphone 17 Ultra, un clon de AirTag y un banco de energía ultra delgado",
        "summary": "Xiaomi anunció múltiples dispositivos nuevos en el Mobile World Congress, incluido el smartphone insignia 17 Ultra, su primer rastreador Bluetooth que compite con AirTag de Apple, y una batería portátil ultra delgada. Los anuncios muestran la estrategia de ecosistema de hardware expandido de Xiaomi más allá de los smartphones. Estos lanzamientos representan el esfuerzo de la empresa por competir en múltiples categorías de tecnología de consumo."
      }
    }
  },
  {
    "title": "Why China’s humanoid robot industry is winning the early market",
    "slug": "china-humanoid-robot-industry-winning-early-market",
    "url": "https://techcrunch.com/2026/02/28/why-chinas-humanoid-robot-industry-is-winning-the-early-market/",
    "source": "TechCrunch",
    "date": "2026-02-28T15:00:00.000Z",
    "summary": "Chinese humanoid robot manufacturers are outpacing U.S. competitors by shipping more units and iterating faster in the emerging market. This early lead reflects China's accelerated development timelines and regulatory approaches that facilitate rapid robotics deployment. The competitive advantage signals a potential shift in dominance for this strategically important technology sector.",
    "content": "China’s push into humanoid robots is accelerating, with domestic firms shipping more units and iterating faster than U.S. competitors in a still-nascent market.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "为什么中国的人形机器人产业赢得了早期市场",
        "summary": "中国人形机器人制造商通过运送更多单位并在新兴市场中更快地迭代，超越了美国竞争对手。这一早期优势反映了中国加快的开发时间表和促进快速机器人部署的监管方法。这一竞争优势预示着这一战略上重要的技术部门主导地位的潜在转变。"
      },
      "fr": {
        "title": "Pourquoi l'industrie des robots humanoïdes chinoise gagne le marché précoce",
        "summary": "Les fabricants de robots humanoïdes chinois surpassent leurs concurrents américains en expédiant plus d'unités et en itérant plus rapidement sur le marché émergent. Cette avance précoce reflète les délais de développement accélérés de la Chine et les approches réglementaires qui facilitent le déploiement rapide de la robotique. L'avantage concurrentiel signale un changement potentiel de la domination dans ce secteur technologique stratégiquement important."
      },
      "de": {
        "title": "Warum Chinas Industrie für humanoide Roboter den frühen Markt gewinnt",
        "summary": "Chinesische Hersteller von Robotern schaffen es, ihre US-amerikanischen Konkurrenten zu übertreffen, indem sie mehr Einheiten versenden und schneller auf dem Emerging Market iterieren. Dieser frühe Vorsprung spiegelt Chinas beschleunigte Entwicklungszeitpläne und regulatorische Ansätze wider, die eine schnelle Roboterbereitstellung ermöglichen. Der Wettbewerbsvorteil deutet auf eine mögliche Verschiebung der Dominanz in diesem strategisch wichtigen Technologiesektor hin."
      },
      "es": {
        "title": "Por qué la industria de robots humanoides de China está ganando el mercado inicial",
        "summary": "Los fabricantes de robots humanoides chinos están superando a sus competidores estadounidenses enviando más unidades e iterando más rápidamente en el mercado emergente. Este liderazgo inicial refleja los cronogramas de desarrollo acelerados de China y los enfoques regulatorios que facilitan el despliegue rápido de robótica. La ventaja competitiva señala un cambio potencial en el dominio de este sector tecnológico estratégicamente importante."
      }
    }
  },
  {
    "title": "Xiaomi’s tracker doesn’t need a case to clip to your keys",
    "slug": "xiaomi-tracker-no-case-clip-keys",
    "url": "https://www.theverge.com/tech/884567/xiaomi-tag-tracker-apple-find-my-google-hub-bluetooth",
    "source": "The Verge",
    "date": "2026-02-28T14:30:00.000Z",
    "summary": "Xiaomi has unveiled the Xiaomi Tag, its first Bluetooth tracker, featuring an integrated metal loop for keyring attachment without requiring an additional case. The tracker supports both Apple's Find My and Google's Find Hub ecosystems but requires users to choose one network at setup. The device uses a replaceable CR2032 battery with approximately one year of battery life.",
    "content": "The Xiaomi Tag is a bit larger than Apple’s second-gen AirTags. | Image: Xiaomi\t\n\nXiaomi has announced its first Bluetooth tracker, and while the Xiaomi Tag has a more elongated design than the Apple AirTag, that lets you use it in more places right out of the box. On one end of the tracker you'll find an integrated metal loop that can be attached to a keyring or clipped to a carabiner without the need for an extra case.\nThe Xiaomi Tag is compatible with both Apple's Find My and Google's Find Hub tracking networks and mobile apps, but not at the same time. You'll need to choose one or the other during setup. Like Apple's AirTag, the Xiaomi Tag is powered by a replaceable CR2032 coin cell battery good for up to a year of  …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "小米的追踪器无需外壳即可夹在您的钥匙上",
        "summary": "小米推出了小米Tag，这是其首款蓝牙追踪器，具有集成的金属环，可无需额外外壳即可连接到钥匙环。该追踪器支持Apple的Find My和Google的Find Hub生态系统，但要求用户在设置时选择一个网络。该设备使用可更换的CR2032电池，电池寿命约为一年。"
      },
      "fr": {
        "title": "Le tracker de Xiaomi n'a pas besoin d'étui pour se clipser sur vos clés",
        "summary": "Xiaomi a dévoilé la Xiaomi Tag, son premier tracker Bluetooth, dotée d'une boucle métallique intégrée pour l'attachement au porte-clés sans nécessiter de boîtier supplémentaire. Le tracker supporte les écosystèmes Apple Find My et Google Find Hub, mais oblige les utilisateurs à choisir un réseau lors de la configuration. L'appareil utilise une batterie CR2032 remplaçable avec une durée de vie d'environ un an."
      },
      "de": {
        "title": "Der Xiaomi-Tracker benötigt keine Hülle, um an Ihren Schlüsseln befestigt zu werden",
        "summary": "Xiaomi hat das Xiaomi Tag vorgestellt, seinen ersten Bluetooth-Tracker mit einer integrierten Metallschlaufe zur Befestigung am Schlüsselbund ohne zusätzliches Etui. Der Tracker unterstützt sowohl Apples Find My als auch Googles Find Hub Ökosysteme, erfordert aber, dass Benutzer beim Setup ein Netzwerk wählen. Das Gerät verwendet eine austauschbare CR2032-Batterie mit einer Lebensdauer von etwa einem Jahr."
      },
      "es": {
        "title": "El rastreador de Xiaomi no necesita estuche para engancharse a tus llaves",
        "summary": "Xiaomi ha presentado la Xiaomi Tag, su primer rastreador Bluetooth, con un bucle de metal integrado para el anillo de llaves sin requerir una carcasa adicional. El rastreador es compatible con los ecosistemas Apple Find My y Google Find Hub, pero requiere que los usuarios elijan una red durante la configuración. El dispositivo utiliza una batería CR2032 reemplazable con una duración aproximada de un año."
      }
    }
  },
  {
    "title": "Xiaomi’s Leica Leitzphone mostly earns the name",
    "slug": "xiaomi-leica-leitzphone-international-launch",
    "url": "https://www.theverge.com/gadgets/886131/xiaomi-leica-leitzphone-17-ultra-review",
    "source": "The Verge",
    "date": "2026-02-28T14:30:00.000Z",
    "summary": "Xiaomi and Leica have deepened their partnership with the international launch of the Leitzphone, marking the first time Leica's logo appears on Xiaomi hardware outside Japan. The Leitzphone is a 17 Ultra with Leica branding, a rotatable camera ring, and minor design modifications. This collaboration represents a significant expansion of Leica's hardware partnerships beyond previous Japan-exclusive Sharp models.",
    "content": "The Leitzphone has just launched internationally alongside a regular version of the 17 Ultra.\t\n\nXiaomi and Leica's long-running phone partnership just got a little closer. Alongside the new international release of its 17 Ultra flagship, Xiaomi has been entrusted with manufacturing a separate version that is the first Leica Leitzphone to release outside of Japan, following three Sharp-made models exclusive to the country.\nIn truth, the Leitzphone is a 17 Ultra with Leica branding and a rotatable camera ring, and apart from a few design tweaks, it's mostly the same as the Leica Edition of that phone already available in China. But the branding is a big deal: Leica hasn't let Xiaomi use its red dot logo on hardware until now, even thoug …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "小米的徕卡Leitzphone在很大程度上赢得了这个名字",
        "summary": "小米和徕卡通过推出Leitzphone国际版深化了合作伙伴关系，这是徕卡标志首次在日本以外的小米硬件上出现。Leitzphone是一款配备徕卡品牌、可旋转相机环和小型设计修改的17 Ultra。这一合作代表了徕卡硬件合作伙伴关系的重大扩展，超越了之前仅限日本的Sharp型号。"
      },
      "fr": {
        "title": "Le Leitzphone Leica de Xiaomi mérite largement le nom",
        "summary": "Xiaomi et Leica ont approfondi leur partenariat avec le lancement international du Leitzphone, marquant la première fois que le logo de Leica apparaît sur du matériel Xiaomi en dehors du Japon. Le Leitzphone est un 17 Ultra avec la marque Leica, une bague de caméra rotative et des modifications de conception mineures. Cette collaboration représente une expansion significative des partenariats matériels de Leica au-delà des modèles Sharp précédents exclusifs au Japon."
      },
      "de": {
        "title": "Xiaomis Leica Leitzphone verdient den Namen größtenteils",
        "summary": "Xiaomi und Leica haben ihre Partnerschaft mit der internationalen Einführung des Leitzphone vertieft, wobei zum ersten Mal das Leica-Logo auf Xiaomi-Hardware außerhalb Japans erscheint. Das Leitzphone ist ein 17 Ultra mit Leica-Branding, einem drehbaren Kameraring und kleineren Designmodifikationen. Diese Zusammenarbeit stellt eine erhebliche Erweiterung von Leicas Hardware-Partnerschaften über die bisherigen Japan-exklusiven Sharp-Modelle hinaus dar."
      },
      "es": {
        "title": "El Leitzphone Leica de Xiaomi se merece principalmente el nombre",
        "summary": "Xiaomi y Leica han profundizado su asociación con el lanzamiento internacional del Leitzphone, marcando la primera vez que el logotipo de Leica aparece en hardware de Xiaomi fuera de Japón. El Leitzphone es un 17 Ultra con marca Leica, un anillo de cámara giratorio y modificaciones de diseño menores. Esta colaboración representa una expansión significativa de las asociaciones de hardware de Leica más allá de los modelos Sharp anteriormente exclusivos de Japón."
      }
    }
  },
  {
    "title": "Xiaomi 17 is a small(ish) phone with a big(ish) battery",
    "slug": "xiaomi-17-small-phone-big-battery",
    "url": "https://www.theverge.com/gadgets/886322/xiaomi-17-release-specs-price-mwc-ultra-leica",
    "source": "The Verge",
    "date": "2026-02-28T14:30:00.000Z",
    "summary": "Xiaomi has launched the 17 and 17 Ultra globally in select Western markets, with the standard 17 priced at £899 and positioned as a competitor to iPhone 17 and Samsung Galaxy S26. The Ultra variant starts at £1,299 with additional features and a larger display. A limited-edition Leitzphone variant is also available at a premium price tier.",
    "content": "The Xiaomi 17 and 17 Ultra are launching together, but there’s no sign of the Pro.\t\n\nXiaomi has just given a global launch to two of its latest flagship phones, the Xiaomi 17 and 17 Ultra, along with a Leica-branded Leitzphone edition of the Ultra. There's no sign, however, of the 17 Pro, which launched in China with an additional display mounted next to the rear cameras.\nThe 17 and 17 Ultra will apparently be available soon in the UK, Europe, and select other markets. The 17 - pitched as a rival to the likes of the iPhone 17 and Samsung Galaxy S26 - will cost £899 / €999 (about $1,200), while the larger and more capable Ultra starts from £1,299 / €1,499 ($1,750). The limited-edition Leitzphone will be substantially more ex …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "小米17是一款小小的手机，电池容量很大",
        "summary": "小米在西方精选市场全球推出了17和17 Ultra，标准版17的价格为£899，定位为iPhone 17和三星Galaxy S26的竞争对手。Ultra版本起价为£1,299，具有额外功能和更大的显示屏。还提供了限量版Leitzphone变体，定价为高端级别。"
      },
      "fr": {
        "title": "Le Xiaomi 17 est un petit téléphone avec une grande batterie",
        "summary": "Xiaomi a lancé les modèles 17 et 17 Ultra mondialement dans certains marchés occidentaux sélectionnés, le modèle standard 17 étant au prix de £899 et positionnée comme concurrent de l'iPhone 17 et du Samsung Galaxy S26. La variante Ultra commence à £1,299 avec des fonctionnalités supplémentaires et un écran plus grand. Une variante Leitzphone en édition limitée est également disponible à un niveau de prix premium."
      },
      "de": {
        "title": "Das Xiaomi 17 ist ein kleines Telefon mit einem großen Akku",
        "summary": "Xiaomi hat das 17 und 17 Ultra auf ausgewählten westlichen Märkten weltweit eingeführt. Das Standard-Modell 17 ist zum Preis von £899 positioniert und konkurriert mit iPhone 17 und Samsung Galaxy S26. Die Ultra-Variante kostet ab £1.299 und bietet zusätzliche Funktionen und ein größeres Display. Es ist auch eine limitierte Leitzphone-Variante zu einem Premium-Preis erhältlich."
      },
      "es": {
        "title": "El Xiaomi 17 es un teléfono pequeño con una batería grande",
        "summary": "Xiaomi ha lanzado los modelos 17 y 17 Ultra globalmente en mercados occidentales seleccionados, con el modelo estándar 17 con un precio de £899 y posicionado como competidor del iPhone 17 y Samsung Galaxy S26. La variante Ultra comienza en £1.299 con características adicionales y una pantalla más grande. También hay disponible una variante Leitzphone de edición limitada a un nivel de precio premium."
      }
    }
  },
  {
    "title": "The Witcher is a perfect fit for Reigns’ Tinder-like roleplaying",
    "slug": "witcher-reigns-tinder-like-roleplaying-game",
    "url": "https://www.theverge.com/entertainment/885432/reigns-the-witcher-interview-steam-iphone-android",
    "source": "The Verge",
    "date": "2026-02-28T14:00:00.000Z",
    "summary": "Nerial has adapted The Witcher franchise for its Reigns series of Tinder-like choose-your-own-adventure games, following previous Game of Thrones and original titles. The studio's creative director explains that the Reigns format effectively simplifies complex universes and storytelling into intuitive interactive decisions. The game demonstrates how the swiping mechanic can work across diverse fantasy settings.",
    "content": "I never knew how easy it was to die in an orgy. But that's just one of the many threats facing Geralt of Rivia in his latest adventure. The studio behind the Reigns series of Tinder-like choose-your-own-adventure games has now adapted The Witcher, following a handful of original titles and a take on Game of Thrones. And for Francois Alliot, creative director at Reigns studio Nerial, the series' structure actually makes it an ideal way to ease players into sprawling fantasies like this. \"There's something about the way you can bring really complex universes, lore, and storylines to simple actions,\" he says. \"It can work in a lot of contexts.\"\n …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "巫师是Reigns类似Tinder的角色扮演游戏的完美契合",
        "summary": "Nerial已经为其Reigns系列适配了《巫师》特许经营权，这是类似Tinder的选择冒险游戏，继续了之前的《权力的游戏》和原始标题。工作室创意总监解释说，Reigns格式有效地将复杂的宇宙和故事简化为直观的交互决策。该游戏展示了滑动机制如何可以在不同的奇幻设置中工作。"
      },
      "fr": {
        "title": "The Witcher est un ajustement parfait pour le jeu de rôle de type Tinder de Reigns",
        "summary": "Nerial a adapté la franchise The Witcher pour sa série Reigns de jeux d'aventure de type Tinder à choix multiples, suivant les titres Game of Thrones et originaux précédents. Le directeur créatif du studio explique que le format Reigns simplifie efficacement les univers complexes et la narration en décisions interactives intuitives. Le jeu démontre comment la mécanique de balayage peut fonctionner dans divers contextes de fantasy."
      },
      "de": {
        "title": "The Witcher ist eine perfekte Ergänzung zu Reigns' Tinder-ähnlichem Rollenspiel",
        "summary": "Nerial hat die The Witcher-Marke für seine Reigns-Serie von Tinder-ähnlichen Abenteuerspielen angepasst, nach früheren Game of Thrones und Originaltiteln. Der Creative Director des Studios erläutert, dass das Reigns-Format komplexe Universen und Geschichten effektiv in intuitive interaktive Entscheidungen vereinfacht. Das Spiel zeigt, wie die Wisch-Mechanik in verschiedenen Fantasy-Settings funktionieren kann."
      },
      "es": {
        "title": "The Witcher es un ajuste perfecto para el juego de rol tipo Tinder de Reigns",
        "summary": "Nerial ha adaptado la franquicia The Witcher para su serie Reigns de juegos de aventura tipo Tinder de opciones múltiples, siguiendo los títulos anteriores de Game of Thrones y originales. El director creativo del estudio explica que el formato Reigns simplifica eficazmente los universos complejos y la narrativa en decisiones interactivas intuitivas. El juego demuestra cómo la mecánica de deslizar puede funcionar en diversos contextos de fantasía."
      }
    }
  },
  {
    "title": "A legendary weather app makes a comeback",
    "slug": "legendary-weather-app-comeback",
    "url": "https://www.theverge.com/tech/886462/acme-weather-samsung-s26-installer",
    "source": "The Verge",
    "date": "2026-02-28T13:00:00.000Z",
    "summary": "The Verge reports in its Installer newsletter that a legendary weather application is making a return to the market. The comeback of this previously notable app represents a resurgence in the competitive weather app category. The app's specific features and return details were not elaborated in the provided excerpt.",
    "content": "Hi, friends! Welcome to Installer No. 117, your guide to the best and Verge-iest stuff in the world. (If you're new here, welcome, please send Android tips, and also you can read all the old editions at the Installer homepage.) \nThis week, I've been reading about Eileen Gu and Ozempic and fancy grocery stores, trying out the beautiful Shiori bookmarking app, trying to temper my expectations for the Scrubs reboot, continuing my test of the Pixel 10 Pro, building my dream to-do list app with Claude Code (it's almost done!), enjoying the beginnings of The Fall and Rise of Reggie Dinkins, recording the next season of Version History, watching a …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "传奇天气应用程序重新回归",
        "summary": "The Verge在其Installer通讯中报道，一个传奇的天气应用程序正在重新回到市场。这个之前著名应用的回归代表了竞争激烈的天气应用类别中的复兴。该应用的具体功能和回归详情在提供的摘录中没有详细说明。"
      },
      "fr": {
        "title": "Une application météo légendaire fait son comeback",
        "summary": "The Verge rapporte dans sa newsletter Installer qu'une application météo légendaire revient sur le marché. Le retour de cette application précédemment notable représente une résurgence dans la catégorie concurrentielle des applications météo. Les caractéristiques spécifiques et les détails du retour de l'application n'ont pas été élaborés dans l'extrait fourni."
      },
      "de": {
        "title": "Eine legendäre Wetter-App kommt zurück",
        "summary": "The Verge berichtet in seinem Installer-Newsletter, dass eine legendäre Wetter-Anwendung auf den Markt zurückkehrt. Das Comeback dieser zuvor bemerkenswerten App stellt eine Wiederbelebung in der wettbewerbsintensiven Wetter-App-Kategorie dar. Die spezifischen Funktionen und Rückgabedetails der App wurden in dem bereitgestellten Auszug nicht näher erläutert."
      },
      "es": {
        "title": "Una aplicación meteorológica legendaria hace su regreso",
        "summary": "The Verge reporta en su boletín Installer que una aplicación meteorológica legendaria está regresando al mercado. El regreso de esta aplicación previamente notable representa un resurgimiento en la categoría competitiva de aplicaciones meteorológicas. Las características específicas y los detalles del retorno de la aplicación no se elaboraron en el extracto proporcionado."
      }
    }
  },
  {
    "title": "Tenways nearly perfects the shareable city e-bike",
    "slug": "tenways-nearly-perfects-shareable-city-e-bike",
    "url": "https://www.theverge.com/reviews/885040/tenways-cgo-compact-review-sharable-adaptable",
    "source": "The Verge",
    "date": "2026-02-28T08:00:00.000Z",
    "summary": "Tenways has created the CGO Compact e-bike to be shared among multiple users with quick adjustments for different heights and a compact folding design. The bike addresses the high cost of electric bikes while minimizing space needs, making it practical for shared ownership in urban environments.",
    "content": "The CGO Compact electric bike twists and folds to create a wall-hugging profile.\t\n\nGood electric bikes are expensive. So why not buy one and share it? \nThat's the idea behind the Tenways CGO Compact e-bike I've been sharing with my wife and teenage daughter for the last two weeks. It adapts in seconds without any tools to comfortably fit riders of varying heights thanks to its low-entry frame, quick-release seat post, and height-adjustable handlebar.\nIt also takes up less space than an ordinary bike with its 20-inch wheels, folding pedals, and a handlebar that twists to create a slim, wall-hugging profile that goes flat inside a car or train. \nThe CGO Compact's geometry puts riders into a comfortable upright body positi …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Tenways近乎完美的可共享城市电动自行车",
        "summary": "Tenways创造了CGO Compact电动自行车，可在多个用户之间共享，具有可快速调整的不同高度和紧凑的折叠设计。这款自行车解决了电动自行车的高成本问题，同时最小化了空间需求，使其成为城市环境中共享所有权的实用选择。"
      },
      "fr": {
        "title": "Tenways perfectionne presque le vélo électrique urbain partageable",
        "summary": "Tenways a créé le vélo électrique CGO Compact à partager entre plusieurs utilisateurs avec des ajustements rapides pour différentes hauteurs et un design pliable compact. Le vélo résout le coût élevé des vélos électriques tout en minimisant les besoins d'espace, ce qui le rend pratique pour la propriété partagée dans les environnements urbains."
      },
      "de": {
        "title": "Tenways perfektioniert das teilbare Elektrofahrrad für die Stadt",
        "summary": "Tenways hat das CGO Compact E-Bike entwickelt, das von mehreren Benutzern gemeinsam genutzt werden kann und schnelle Anpassungen für verschiedene Größen sowie ein kompaktes Faltdesign bietet. Das Fahrrad löst das Problem der hohen Kosten für Elektrofahrräder, während es den Platzbedarf minimiert und sich damit für gemeinsame Nutzung in städtischen Umgebungen eignet."
      },
      "es": {
        "title": "Tenways casi perfecciona la bicicleta eléctrica urbana compartida",
        "summary": "Tenways ha creado la bicicleta eléctrica CGO Compact para ser compartida entre múltiples usuarios con ajustes rápidos para diferentes alturas y un diseño plegable compacto. La bicicleta aborda el alto costo de las bicicletas eléctricas mientras minimiza las necesidades de espacio, lo que la hace práctica para la propiedad compartida en entornos urbanos."
      }
    }
  },
  {
    "title": "India disrupts access to popular developer platform Supabase with blocking order",
    "slug": "india-disrupts-supabase-blocking-order",
    "url": "https://techcrunch.com/2026/02/27/india-disrupts-access-to-popular-developer-platform-supabase-with-blocking-order/",
    "source": "TechCrunch",
    "date": "2026-02-28T03:51:52.000Z",
    "summary": "India has issued a blocking order against Supabase, a major developer platform, causing disrupted access in one of its largest markets. The action impacts a significant portion of the platform's user base in the region.",
    "content": "India, one of Supabase’s biggest markets, is seeing patchy access after a government block order.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "印度对热门开发者平台Supabase下达封锁令",
        "summary": "印度对主要开发者平台Supabase下达了封锁令，导致该平台在其最大市场之一的访问受阻。该行动影响了该地区该平台用户基数的重要部分。"
      },
      "fr": {
        "title": "L'Inde bloque l'accès à la plateforme populaire pour développeurs Supabase",
        "summary": "L'Inde a émis un ordre de blocage contre Supabase, une plateforme majeure pour développeurs, causant un accès perturbé dans l'un de ses plus grands marchés. L'action affecte une part importante de la base d'utilisateurs de la plateforme dans la région."
      },
      "de": {
        "title": "Indien sperrt beliebte Entwicklerplattform Supabase durch Blockierungsbefehl",
        "summary": "Indien hat einen Blockierungsbefehl gegen Supabase, eine wichtige Entwicklerplattform, erlassen, was zu gestörtem Zugriff in einem seiner größten Märkte führt. Die Maßnahme wirkt sich auf einen erheblichen Teil der Nutzerbasis der Plattform in der Region aus."
      },
      "es": {
        "title": "India interrumpe el acceso a la plataforma popular de desarrolladores Supabase con orden de bloqueo",
        "summary": "India ha emitido una orden de bloqueo contra Supabase, una importante plataforma para desarrolladores, causando acceso interrumpido en uno de sus mercados más grandes. La acción afecta a una porción significativa de la base de usuarios de la plataforma en la región."
      }
    }
  },
  {
    "title": "Google quantum-proofs HTTPS by squeezing 2.5kB of data into 64-byte space",
    "slug": "google-quantum-proofs-https-merkle-tree",
    "url": "https://arstechnica.com/security/2026/02/google-is-using-clever-math-to-quantum-proof-https-certificates/",
    "source": "Ars Technica",
    "date": "2026-02-28T01:26:41.000Z",
    "summary": "Google has quantum-proofed HTTPS by implementing Merkle Tree Certificate support, compressing security data from 2.5KB to 64 bytes. The technology is already available in Chrome and will expand across the web to protect against future quantum computing threats.",
    "content": "Merkle Tree Certificate support is already in Chrome. Soon, it will be everywhere.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "谷歌通过将2.5KB数据压缩到64字节来对HTTPS进行量子防护",
        "summary": "谷歌通过实现默克尔树证书支持，将HTTPS进行了量子防护，将安全数据从2.5KB压缩到64字节。该技术已在Chrome中提供，并将扩展到整个网络，以防御未来的量子计算威胁。"
      },
      "fr": {
        "title": "Google rend HTTPS résistant aux attaques quantiques en comprimant 2,5 kB de données en 64 octets",
        "summary": "Google a rendu HTTPS résistant aux attaques quantiques en implémentant le support des certificats Merkle Tree, comprimant les données de sécurité de 2,5 KB à 64 octets. La technologie est déjà disponible dans Chrome et s'étendra sur le web pour se protéger contre les menaces futures de l'informatique quantique."
      },
      "de": {
        "title": "Google macht HTTPS quantensicher, indem 2,5 KB Daten auf 64 Bytes komprimiert werden",
        "summary": "Google hat HTTPS quantensicher gemacht, indem Merkle-Tree-Zertifikatunterstützung implementiert wurde und Sicherheitsdaten von 2,5 KB auf 64 Bytes komprimiert wurden. Die Technologie ist bereits in Chrome verfügbar und wird sich über das Web ausbreiten, um sich vor zukünftigen Quantencomputer-Bedrohungen zu schützen."
      },
      "es": {
        "title": "Google protege HTTPS contra ataques cuánticos al comprimir 2,5 kB de datos en 64 bytes",
        "summary": "Google ha protegido HTTPS contra amenazas cuánticas implementando soporte de certificados Merkle Tree, comprimiendo datos de seguridad de 2,5 KB a 64 bytes. La tecnología ya está disponible en Chrome y se expandirá por toda la web para protegerse contra futuras amenazas de computación cuántica."
      }
    }
  },
  {
    "title": "The Air Force's new ICBM is nearly ready to fly, but there’s nowhere to put it",
    "slug": "air-force-new-icbm-deployment-challenge",
    "url": "https://arstechnica.com/space/2026/02/the-air-forces-new-icbm-is-nearly-ready-to-fly-but-theres-nowhere-to-put-them/",
    "source": "Ars Technica",
    "date": "2026-02-28T00:32:24.000Z",
    "summary": "The U.S. Air Force's next-generation ICBM is nearing deployment readiness but faces placement challenges due to failed strategic assumptions. The delay affects the military's modernization timeline.",
    "content": "\"There were assumptions that were made in the strategy that obviously didn’t come to fruition.\"",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "美国空军新型洲际弹道导弹即将就绪，但却无处可放",
        "summary": "美国空军下一代洲际弹道导弹即将部署就绪，但由于战略假设失败而面临部署地点的挑战。该延迟影响了军事现代化的时间表。"
      },
      "fr": {
        "title": "Le nouveau missile balistique intercontinental de l'armée de l'air est presque prêt à voler, mais il n'y a nulle part où le mettre",
        "summary": "Le prochain missile balistique intercontinental de l'armée de l'air américaine est près de la capacité de déploiement mais fait face à des défis de placement dus aux hypothèses stratégiques échouées. Le retard affecte le calendrier de modernisation militaire."
      },
      "de": {
        "title": "Das neue Interkontinentalflugkörper der Luftwaffe ist bald einsatzbereit, aber es gibt keinen Platz dafür",
        "summary": "Das nächste ICBM der US-Luftwaffe steht kurz vor der Einsatzbereitschaft, sieht sich jedoch aufgrund fehlgeschlagener strategischer Annahmen mit Platzierungsproblemen konfrontiert. Die Verzögerung wirkt sich auf den Militärmodernisierungsplan aus."
      },
      "es": {
        "title": "El nuevo ICBM de la Fuerza Aérea está casi listo para volar, pero no hay lugar para colocarlo",
        "summary": "El próximo ICBM de la Fuerza Aérea de EE.UU. está cerca de estar listo para el despliegue pero enfrenta desafíos de colocación debido a suposiciones estratégicas fallidas. El retraso afecta la línea de tiempo de modernización militar."
      }
    }
  },
  {
    "title": "The best instant cameras you can buy right now",
    "slug": "best-instant-cameras-to-buy",
    "url": "https://www.theverge.com/23133103/best-instant-cameras-fujifilm-polaroid-kodak",
    "source": "The Verge",
    "date": "2026-02-28T00:32:11.000Z",
    "summary": "The Verge tested instant cameras from major brands and recommends the Fujifilm Instax Mini 12 as the best overall option for its print quality, ease of use, and affordability. The buying guide helps consumers find cameras suited to different needs and budgets.",
    "content": "Even with the ability to take excellent photos with our phones and instantly share them across the world, there’s something magical about the old-school instant camera. With just a click of a button, you can capture a moment in a photo that you can see and touch almost immediately. Images captured by an instant camera aren’t as pristine or perfect as those produced by modern digital cameras, but their soft images and imperfections are often a big part of the allure.\nYet not all instant cameras are the same, and some of them are better suited for different needs and budgets. That’s why we tested some of the most popular instant cameras on the market from brands like Fujifilm, Polaroid, Leica, Canon, Kodak, and others.\nAll the models featured in our instant camera buying guide are enjoyable to use, but each offers a distinct set of features at a different price point. As a result, some are more appropriate for a child or budding photographer, while others are more advanced and provide added creative control (for a price). When it comes down to it, though, we consider print quality, ease of use, and affordability to be the hallmarks of a quality shooter. That’s why we picked Fujifilm’s Instax Mini 12 as the best instant camera for most people, as it ticks all three boxes wonderfully.\nIf you’re looking for more creative control or features like filters, however, the Instax Mini Evo is our choice, one that offers great image quality and lets you choose which photos you’d like to print. Other instant cameras, like Kodak’s Mini Retro 3, also offer a variety of advanced creative modes for those who desire more.\nTake a look at this list of our instant camera recommendations to find the best fit for you.\nThe best instant camera for most people\nFujifilm Instax Mini 12\n\n\nScore: 8\n\nProsCons\n\n\nProduces relatively true-to-life photos\nTerrific ease of use\nVery affordable\n\nInstax film can get pricey\nMinimal creative control\nFlash can be overpowering\n\n\n\nWhere to Buy:\n\n $93.95 $86.24",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "现在可以买到的最佳拍立得相机",
        "summary": "The Verge 测试了主要品牌的拍立得相机，推荐富士 Instax Mini 12 作为整体最佳选择，因其打印质量、易用性和经济性。该购买指南帮助消费者找到适合不同需求和预算的相机。"
      },
      "fr": {
        "title": "Les meilleures caméras instantanées que vous pouvez acheter maintenant",
        "summary": "The Verge a testé les caméras instantanées des grandes marques et recommande le Fujifilm Instax Mini 12 comme la meilleure option globale pour sa qualité d'impression, sa facilité d'utilisation et son accessibilité. Le guide d'achat aide les consommateurs à trouver des caméras adaptées à différents besoins et budgets."
      },
      "de": {
        "title": "Die besten Sofortbildkameras, die Sie jetzt kaufen können",
        "summary": "The Verge testete Sofortbildkameras von großen Marken und empfiehlt die Fujifilm Instax Mini 12 als beste Gesamtoption für ihre Druckqualität, Benutzerfreundlichkeit und Erschwinglichkeit. Der Kaufführer hilft Verbrauchern, Kameras zu finden, die ihren unterschiedlichen Anforderungen und Budgets entsprechen."
      },
      "es": {
        "title": "Las mejores cámaras instantáneas que puedes comprar ahora",
        "summary": "The Verge probó cámaras instantáneas de grandes marcas y recomienda la Fujifilm Instax Mini 12 como la mejor opción general por su calidad de impresión, facilidad de uso y asequibilidad. La guía de compra ayuda a los consumidores a encontrar cámaras adecuadas para diferentes necesidades y presupuestos."
      }
    }
  }
]