[
  {
    "title": "The trap Anthropic built for itself",
    "slug": "the-trap-anthropic-built-for-itself",
    "url": "https://techcrunch.com/2026/02/28/the-trap-anthropic-built-for-itself/",
    "source": "TechCrunch",
    "date": "2026-03-01T00:08:58.000Z",
    "summary": "Anthropic and other AI companies have long promised responsible self-governance, but without formal regulatory oversight, there are few mechanisms to hold them accountable. This governance gap creates a potential vulnerability as these companies shape the future of AI.",
    "content": "Anthropic, OpenAI, Google DeepMind and others have long promised to govern themselves responsibly. Now, in the absence of rules, there's not a lot to protect them.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "人工智能公司为自己建造的陷阱",
        "summary": "人工智能公司长期以来承诺负责任的自我治理，但没有正式的监管监督，很少有机制能够追究它们的责任。这种治理缺陷在这些公司塑造人工智能未来时造成了潜在的脆弱性。"
      },
      "fr": {
        "title": "Le piège qu'Anthropic s'est construit",
        "summary": "Anthropic et d'autres entreprises d'IA ont longtemps promis une autogouvernance responsable, mais sans supervision réglementaire formelle, il existe peu de mécanismes pour les tenir responsables. Cette lacune de gouvernance crée une vulnérabilité potentielle alors que ces entreprises façonnent l'avenir de l'IA."
      },
      "de": {
        "title": "Die Falle, die Anthropic für sich selbst gebaut hat",
        "summary": "Anthropic und andere KI-Unternehmen haben lange Zeit verantwortungsvolle Selbstregulierung versprochen, aber ohne formale behördliche Aufsicht gibt es nur wenige Mechanismen, um sie zur Rechenschaft zu ziehen. Diese Governance-Lücke schafft eine potenzielle Schwachstelle, da diese Unternehmen die Zukunft der KI gestalten."
      },
      "es": {
        "title": "La trampa que Anthropic se construyó a sí misma",
        "summary": "Anthropic y otras empresas de IA han prometido durante mucho tiempo la autogobernanza responsable, pero sin supervisión regulatoria formal, hay pocos mecanismos para responsabilizarlas. Esta brecha de gobernanza crea una vulnerabilidad potencial mientras estas empresas moldean el futuro de la IA."
      }
    }
  }
]