[
  {
    "title": "Apple’s touchscreen MacBooks might also have a Dynamic Island",
    "slug": "apple-s-touchscreen-macbooks-might-also-have-a-dynamic-island",
    "url": "https://www.theverge.com/tech/884089/apple-touchscreen-macbook-pro-dynamic-island",
    "source": "The Verge",
    "date": "2026-02-24T23:51:19.000Z",
    "summary": "Apple's OLED touchscreen MacBook Pros set to launch this fall will get a Dynamic Island feature like what's available on iPhones, according to Bloomberg's Mark Gurman. Apple first debuted the Dynamic ",
    "content": "Apple's OLED touchscreen MacBook Pros set to launch this fall will get a Dynamic Island feature like what's available on iPhones, according to Bloomberg's Mark Gurman. Apple first debuted the Dynamic Island with the iPhone 14 Pro and iPhone 14 Pro Max as a pill-shaped cutout that can show information and alerts, though the MacBook Pro's Dynamic Island will be \"smaller\" than what's available on current iPhones.\nThe new MacBook Pros, which will come in 14-inch and 16-inch screen sizes, otherwise look \"similar\" to the current models, Gurman says, but Apple will be updating the Mac's user interface to make it \"dynamic\" and work better for eithe …\nRead the full story at The Verge.",
    "category": "tech"
  },
  {
    "title": "Spanish ‘soonicorn’ Multiverse Computing releases free compressed AI model",
    "slug": "spanish-soonicorn-multiverse-computing-releases-free-compressed-ai-model",
    "url": "https://techcrunch.com/2026/02/24/spanish-soonicorn-multiverse-computing-releases-free-compressed-ai-model/",
    "source": "TechCrunch",
    "date": "2026-02-24T23:32:00.000Z",
    "summary": "Spanish startup Multiverse Computing has released a new version of its HyperNova 60B model on Hugging Face that, it says, bests Mistral's model.",
    "content": "Spanish startup Multiverse Computing has released a new version of its HyperNova 60B model on Hugging Face that, it says, bests Mistral's model.",
    "category": "tech"
  },
  {
    "title": "Apple rolls out age-verification tools worldwide to comply with growing web of child safety laws",
    "slug": "apple-rolls-out-age-verification-tools-worldwide-to-comply-with-growing-web-of-c",
    "url": "https://techcrunch.com/2026/02/24/apple-rolls-out-age-verification-tools-worldwide-to-comply-with-growing-web-of-child-safety-laws/",
    "source": "TechCrunch",
    "date": "2026-02-24T23:21:54.000Z",
    "summary": "Apple complies with new age-assurance laws in the U.S. and abroad, including those that block users from downloading apps aimed at adults.",
    "content": "Apple complies with new age-assurance laws in the U.S. and abroad, including those that block users from downloading apps aimed at adults.",
    "category": "tech"
  },
  {
    "title": "Uber engineers built an AI version of their boss",
    "slug": "uber-engineers-built-an-ai-version-of-their-boss",
    "url": "https://techcrunch.com/2026/02/24/uber-engineers-built-ai-version-of-boss-dara-khosrowshahi/",
    "source": "TechCrunch",
    "date": "2026-02-24T23:09:28.000Z",
    "summary": "Uber CEO Dara Khosrowshahi said the company’s employees have gone all in on AI, going so far as to build a chatbot of him that they use to practice their pitches.",
    "content": "Uber CEO Dara Khosrowshahi said the company’s employees have gone all in on AI, going so far as to build a chatbot of him that they use to practice their pitches.",
    "category": "tech"
  },
  {
    "title": "OpenAI defeats xAI’s trade secrets lawsuit",
    "slug": "openai-defeats-xai-s-trade-secrets-lawsuit",
    "url": "https://www.theverge.com/ai-artificial-intelligence/884049/openai-elon-musk-xai-trade-secrets-lawsuit",
    "source": "The Verge",
    "date": "2026-02-24T23:05:28.000Z",
    "summary": "OpenAI won a victory Tuesday in one of its legal battles with xAI, which involved allegations of poaching and theft of trade secrets. \nThe former company's motion to dismiss the lawsuit was granted on",
    "content": "OpenAI won a victory Tuesday in one of its legal battles with xAI, which involved allegations of poaching and theft of trade secrets. \nThe former company's motion to dismiss the lawsuit was granted on Tuesday with leave to amend, meaning xAI has the option to refile with modified claims. In the ruling, US District Judge Rita F. Lin wrote that \"xAI does not point to any misconduct by OpenAI\" in its current claims. \"Instead, it points to eight former xAI employees who left for OpenAI at around the same time,\" with no indication that OpenAI directed their actions while leaving xAI.\nxAI alleges that two former employees \"stole its source code  …\nRead the full story at The Verge.",
    "category": "tech"
  },
  {
    "title": "WBD says Paramount’s new, higher offer could be “superior” to Netflix's",
    "slug": "wbd-says-paramount-s-new-higher-offer-could-be-superior-to-netflix-s",
    "url": "https://arstechnica.com/gadgets/2026/02/paramount-increases-its-warner-bros-discovery-bid-by-1-per-share/",
    "source": "Ars Technica",
    "date": "2026-02-24T22:52:52.000Z",
    "summary": "WBD's board is still reviewing the offer.",
    "content": "WBD's board is still reviewing the offer.",
    "category": "tech"
  },
  {
    "title": "Following 35% growth, solar has passed hydro on US grid",
    "slug": "following-35-growth-solar-has-passed-hydro-on-us-grid",
    "url": "https://arstechnica.com/science/2026/02/final-2025-data-is-in-us-energy-use-is-up-as-solar-passes-hydro/",
    "source": "Ars Technica",
    "date": "2026-02-24T22:40:08.000Z",
    "summary": "Coal makes a bit of a comeback, if only by accident.",
    "content": "Coal makes a bit of a comeback, if only by accident.",
    "category": "tech"
  },
  {
    "title": "Stripe is reportedly eyeing deal to buy some or all of PayPal",
    "slug": "stripe-is-reportedly-eyeing-deal-to-buy-some-or-all-of-paypal",
    "url": "https://techcrunch.com/2026/02/24/stripe-is-reportedly-eyeing-deal-to-buy-some-or-all-of-paypal/",
    "source": "TechCrunch",
    "date": "2026-02-24T22:35:30.000Z",
    "summary": "Stripe might be looking to buy PayPal, or parts of it, per early reports.",
    "content": "Stripe might be looking to buy PayPal, or parts of it, per early reports.",
    "category": "tech"
  },
  {
    "title": "Former L3Harris Trenchant boss jailed for selling hacking tools to Russian broker",
    "slug": "former-l3harris-trenchant-boss-jailed-for-selling-hacking-tools-to-russian-broke",
    "url": "https://techcrunch.com/2026/02/24/former-l3harris-trenchant-boss-jailed-for-selling-hacking-tools-to-russian-broker/",
    "source": "TechCrunch",
    "date": "2026-02-24T21:50:23.000Z",
    "summary": "Peter Williams, the former head of U.S. hacking tools maker L3Harris Trenchant, was sentenced to seven years in prison for stealing and selling his former company’s hacking and surveillance tools to a",
    "content": "Peter Williams, the former head of U.S. hacking tools maker L3Harris Trenchant, was sentenced to seven years in prison for stealing and selling his former company’s hacking and surveillance tools to a Russian firm.",
    "category": "tech"
  },
  {
    "title": "Google’s new 1.9GW clean energy deal includes massive 100-hour battery",
    "slug": "google-s-new-1-9gw-clean-energy-deal-includes-massive-100-hour-battery",
    "url": "https://techcrunch.com/2026/02/24/googles-new-1-9gw-clean-energy-deal-includes-massive-100-hour-battery/",
    "source": "TechCrunch",
    "date": "2026-02-24T21:32:22.000Z",
    "summary": "Form Energy's iron-air batteries will store wind and solar power to keep the data center running 24/7.",
    "content": "Form Energy's iron-air batteries will store wind and solar power to keep the data center running 24/7.",
    "category": "tech"
  },
  {
    "title": "CarGurus data breach affects 12.5 million accounts",
    "slug": "cargurus-data-breach-affects-12-5-million-accounts",
    "url": "https://techcrunch.com/2026/02/24/cargurus-data-breach-affects-12-5-million-accounts/",
    "source": "TechCrunch",
    "date": "2026-02-24T21:27:42.000Z",
    "summary": "Automotive marketplace CarGurus was the target of a data breach in which the names, email addresses, phone numbers, and physical addresses of millions of customers were stolen.",
    "content": "Automotive marketplace CarGurus was the target of a data breach in which the names, email addresses, phone numbers, and physical addresses of millions of customers were stolen.",
    "category": "tech"
  },
  {
    "title": "Anthropic won’t budge as Pentagon escalates AI dispute",
    "slug": "anthropic-won-t-budge-as-pentagon-escalates-ai-dispute",
    "url": "https://techcrunch.com/2026/02/24/anthropic-wont-budge-as-pentagon-escalates-ai-dispute/",
    "source": "TechCrunch",
    "date": "2026-02-24T21:18:45.000Z",
    "summary": "The Pentagon has given Anthropic until Friday to loosen AI guardrails or face potential penalties, escalating a high-stakes dispute that raises questions about government leverage, vendor dependence, ",
    "content": "The Pentagon has given Anthropic until Friday to loosen AI guardrails or face potential penalties, escalating a high-stakes dispute that raises questions about government leverage, vendor dependence, and investor confidence in defense tech.",
    "category": "tech"
  },
  {
    "title": "DJI sues the FCC for “carelessly” restricting its drones",
    "slug": "dji-sues-the-fcc-for-carelessly-restricting-its-drones",
    "url": "https://arstechnica.com/gadgets/2026/02/dji-sues-the-fcc-for-carelessly-restricting-its-drones/",
    "source": "Ars Technica",
    "date": "2026-02-24T21:15:26.000Z",
    "summary": "DJI lawsuit says company has been \"severely harmed by the FCC’s ruling.\"",
    "content": "DJI lawsuit says company has been \"severely harmed by the FCC’s ruling.\"",
    "category": "tech"
  },
  {
    "title": "Let me see some ID: age verification is spreading across the internet",
    "slug": "let-me-see-some-id-age-verification-is-spreading-across-the-internet",
    "url": "https://www.theverge.com/tech/883855/age-verification-internet-apps-laws-privacy-safety",
    "source": "The Verge",
    "date": "2026-02-24T21:05:58.000Z",
    "summary": "Age verification is a reality on a growing number of social media platforms, requiring an ID or facial scan for full access to everything from YouTube to Roblox. The age-gating wave is coming along wi",
    "content": "Age verification is a reality on a growing number of social media platforms, requiring an ID or facial scan for full access to everything from YouTube to Roblox. The age-gating wave is coming along with calls for stronger child safety measures online, despite concerns about privacy, security, and censorship. \nIn the US, lawmakers are pushing forward bills like the App Store Accountability Act and Parents Over Platforms Act to have app stores themselves verify users’ ages. \nDiscord has delayed plans to roll out age verification globally after user backlash until later in 2026, but it hasn’t completely shelved them, even after a breach of a former vendor last year that leaked some users’ scanned IDs. Meanwhile, other platforms, like ChatGPT and Google, are applying AI models to identify and lock down accounts suspected of being underage until some form of identity verification can prove the user is an adult.\nFollow along below for the latest updates on age verification for internet services and apps…\nDiscord is delaying its global age verification rollout\n\t\t\t\nDiscord distances itself from Persona age verification after user backlash\n\t\t\t\nAmerica desperately needs new privacy laws\n\t\t\t\nDiscord says ‘vast majority’ of users won’t see its new age verification setup\n\t\t\t\nDiscord’s age verification mandate is a leap toward a gated internet\n\t\t\t\nDiscord will require a face scan or ID for full access next month\n\t\t\t\nChatGPT is using age prediction to restrict what minors see\n\t\t\t\nWill you have to show your ID at the app store?\n\t\t\t\nRoblox now requires an age check if you want to chat\n\t\t\t\nMeet the new tech laws of 2026\n\t\t\t\nJudge blocks Texas app store age verification law\n\t\t\t\nAustralia boots kids under 16 off social media: how platforms are responding\n\t\t\t\nWelcome to the ‘papers, please’ internet\n\t\t\t\nHere’s how Apple is locking down iPhones to comply with Texas’ age verification law\n\t\t\t\nBluesky brings age verification to South Dakota and Wyoming\n\t\t\t\nMastodon can’t comply with Mississ",
    "category": "tech"
  },
  {
    "title": "Discord delays global rollout of age verification after backlash",
    "slug": "discord-delays-global-rollout-of-age-verification-after-backlash",
    "url": "https://techcrunch.com/2026/02/24/discord-delays-global-rollout-of-age-verification-after-backlash/",
    "source": "TechCrunch",
    "date": "2026-02-24T20:48:06.000Z",
    "summary": "The company added that 90% of users won’t need to verify their age and will be able to keep using Discord as usual.",
    "content": "The company added that 90% of users won’t need to verify their age and will be able to keep using Discord as usual.",
    "category": "tech"
  },
  {
    "title": "Twitch is overhauling its suspensions policy",
    "slug": "twitch-is-overhauling-its-suspensions-policy",
    "url": "https://techcrunch.com/2026/02/24/twitch-is-overhauling-its-suspensions-policy/",
    "source": "TechCrunch",
    "date": "2026-02-24T18:00:00.000Z",
    "summary": "The company is implementing two suspension types: streaming suspensions and chatting suspensions.",
    "content": "The company is implementing two suspension types: streaming suspensions and chatting suspensions.",
    "category": "tech"
  },
  {
    "title": "You can still get $30 in Samsung credit when you reserve a Galaxy S26 phone",
    "slug": "you-can-still-get-30-in-samsung-credit-when-you-reserve-a-galaxy-s26-phone",
    "url": "https://www.theverge.com/gadgets/883686/samsung-galaxy-s26-plus-ultra-reserve-preorder-unpacked-deal-sale",
    "source": "The Verge",
    "date": "2026-02-24T18:00:00.000Z",
    "summary": "Samsung is set to introduce its new Galaxy S26 lineup at its next Unpacked event on February 25th, potentially alongside a new pair of earbuds and other wearables. If you’re thinking about picking up ",
    "content": "Samsung is set to introduce its new Galaxy S26 lineup at its next Unpacked event on February 25th, potentially alongside a new pair of earbuds and other wearables. If you’re thinking about picking up any of the new devices, it’s worth claiming Samsung’s $30 promotional credit before it expires, which you can do by registering your interest on Samsung’s website before 1PM ET / 10AM PT tomorrow.\nIf you’re even remotely considering an upgrade, there’s not much to lose by signing up.  You don’t need to pay anything or even offer your credit card details to take advantage of the offer. You just need to reserve a device by signing up with your name and email address on Samsung’s website or the Shop Samsung app ahead of the event. Once the devices are officially announced and preorders open, you’ll be able to apply the $30 credit at checkout. Sadly, you can’t use the $30 credit to reduce the cost of your phone or any other Samsung device announced during Unpacked; however, you can use it for all kinds of accessories.\nAlongside the $30 credit, Samsung is offering up to $900 in credit when you trade in your phone at the time of purchase. For instance, trading in an S24 Ultra could net you up to $700 in credit. Your phone will have to meet certain eligibility requirements, though, and can’t exhibit damage beyond normal wear and tear.\nWe don’t know yet exactly what the Galaxy S26 lineup will bring, but early rumors point to a built-in privacy mode that can fully black out content from select apps or parts of the display. Reports also suggest we’ll see more Galaxy AI features — particularly new AI-powered camera tools — along with a brighter camera system.",
    "category": "tech"
  },
  {
    "title": "OpenAI COO says ‘we have not yet really seen AI penetrate enterprise business processes’",
    "slug": "openai-coo-says-we-have-not-yet-really-seen-ai-penetrate-enterprise-business-pro",
    "url": "https://techcrunch.com/2026/02/24/openai-coo-says-we-have-not-yet-really-seen-ai-penetrate-enterprise-business-processes/",
    "source": "TechCrunch",
    "date": "2026-02-24T17:44:34.000Z",
    "summary": "Earlier this month, OpenAI launched a new platform called OpenAI Frontier for enterprises to build and manage agents, but OpenAI COO Brad Lightcap said that businesses haven’t yet seen AI adoption at ",
    "content": "Earlier this month, OpenAI launched a new platform called OpenAI Frontier for enterprises to build and manage agents, but OpenAI COO Brad Lightcap said that businesses haven’t yet seen AI adoption at scale. “One of the interesting things and some of the inspiration for the work we’ve been doing lately around OpenAI Frontier is we […]",
    "category": "tech"
  },
  {
    "title": "Stripe’s valuation soars 74% to $159 billion",
    "slug": "stripe-s-valuation-soars-74-to-159-billion",
    "url": "https://techcrunch.com/2026/02/24/stripes-valuation-soars-74-to-159-billion/",
    "source": "TechCrunch",
    "date": "2026-02-24T17:28:23.000Z",
    "summary": "Stripe has conducted another tender offer, where employees sell shares. Investors include Thrive Capital, Coatue, a16z, and Stripe itself",
    "content": "Stripe has conducted another tender offer, where employees sell shares. Investors include Thrive Capital, Coatue, a16z, and Stripe itself",
    "category": "tech"
  },
  {
    "title": "PlayStation’s Wolverine game hits PS5 in September",
    "slug": "playstation-s-wolverine-game-hits-ps5-in-september",
    "url": "https://www.theverge.com/games/883760/playstation-marvels-wolverine-release-date-insomniac-games",
    "source": "The Verge",
    "date": "2026-02-24T17:23:23.000Z",
    "summary": "Marvel's Wolverine, the next superhero game from Marvel's Spider-Man developer Insomniac Games, will be released on PS5 on September 15th.\nInsomniac announced that it would be making a Wolverine game ",
    "content": "Marvel's Wolverine, the next superhero game from Marvel's Spider-Man developer Insomniac Games, will be released on PS5 on September 15th.\nInsomniac announced that it would be making a Wolverine game way back in 2021, so it's been a long wait in the leadup to an official release date. Sony gave a vague fall 2026 release window last year alongside a very bloody gameplay trailer.\n\n\"In this original story, Wolverine is on the hunt to uncover the secrets of a dark past that keeps eluding him,\" according to the game's PlayStation Store listing. \"His search for answers will send him on perilous excursions to exotic locales, including the island n …\nRead the full story at The Verge.",
    "category": "tech"
  },
  {
    "title": "Archer Aviation accuses rival Vertical Aerospace of ripping off its air taxi designs",
    "slug": "archer-aviation-accuses-rival-vertical-aerospace-of-ripping-off-its-air-taxi-des",
    "url": "https://www.theverge.com/transportation/883648/archer-vertical-patent-infringement-air-taxi",
    "source": "The Verge",
    "date": "2026-02-24T17:16:20.000Z",
    "summary": "Look at the two air taxi designs above. Look similar? The company that designed the one on the left sure thinks so, which is why it's accusing the firm that designed the one on the right of patent inf",
    "content": "Look at the two air taxi designs above. Look similar? The company that designed the one on the left sure thinks so, which is why it's accusing the firm that designed the one on the right of patent infringement.\nOn Monday, Archer Aviation filed a complaint in the US District Court Eastern District of Texas accusing rival Vertical Aerospace of copying its \"Midnight\" aircraft design for its own \"Valo\" vehicle. Archer wants to block Vertical from using the allegedly copied designs, as well as several other patents the company claims have been infringed upon. \n\"Vertical has knowingly, willfully, and in reckless disregard leveraged and exploited …\nRead the full story at The Verge.",
    "category": "tech"
  },
  {
    "title": "Inside the quixotic team trying to build an entire world in a 20-year-old game",
    "slug": "inside-the-quixotic-team-trying-to-build-an-entire-world-in-a-20-year-old-game",
    "url": "https://arstechnica.com/gaming/2026/02/inside-the-quixotic-team-trying-to-build-an-entire-world-in-a-20-year-old-game/",
    "source": "Ars Technica",
    "date": "2026-02-24T17:13:14.000Z",
    "summary": "Stories and lesson learned from an impossibly large community modding project.",
    "content": "Stories and lesson learned from an impossibly large community modding project.",
    "category": "tech"
  },
  {
    "title": "DJI sues over the FCC’s decision to block new drone imports",
    "slug": "dji-sues-over-the-fcc-s-decision-to-block-new-drone-imports",
    "url": "https://www.theverge.com/tech/883734/dji-fcc-lawsuit-drone-import-ban",
    "source": "The Verge",
    "date": "2026-02-24T17:01:44.000Z",
    "summary": "DJI wants a federal court to toss out the Federal Communications Commission's decision to ban imports of its China-made drones and components, as reported earlier by Reuters. In a petition filed in an",
    "content": "DJI wants a federal court to toss out the Federal Communications Commission's decision to ban imports of its China-made drones and components, as reported earlier by Reuters. In a petition filed in an appeals court this week, DJI claims the FCC \"exceeded its statutory authority\" last December when adding drones made in foreign countries to its Covered List, which blocks communications equipment \"deemed to pose an unacceptable risk\" to national security.\nIn addition to preventing DJI and other foreign dronemakers from importing new drones in the US (unless approved by the Department of Defense), the FCC also gave itself the authority to retr …\nRead the full story at The Verge.",
    "category": "tech"
  },
  {
    "title": "YouTube beefs up its $7.99/month Lite subscription with offline downloads and background play",
    "slug": "youtube-beefs-up-its-7-99-month-lite-subscription-with-offline-downloads-and-bac",
    "url": "https://techcrunch.com/2026/02/24/youtube-beefs-up-its-7-99-month-lite-subscription-with-downloads-and-background-play/",
    "source": "TechCrunch",
    "date": "2026-02-24T17:00:00.000Z",
    "summary": "Now the only reason to get the full Premium subscription is ad-free music and music videos.",
    "content": "Now the only reason to get the full Premium subscription is ad-free music and music videos.",
    "category": "tech"
  },
  {
    "title": "YouTube&#8217;s cheaper subscription is getting background play and downloads",
    "slug": "youtube-8217-s-cheaper-subscription-is-getting-background-play-and-downloads",
    "url": "https://www.theverge.com/streaming/883316/youtube-premium-lite-background-play-offline-downloads",
    "source": "The Verge",
    "date": "2026-02-24T17:00:00.000Z",
    "summary": "YouTube is adding background playback and offline downloads to YouTube Premium Lite, its $7.99-per-month subscription. With the change, you'll be able to keep YouTube videos going while you use anothe",
    "content": "YouTube is adding background playback and offline downloads to YouTube Premium Lite, its $7.99-per-month subscription. With the change, you'll be able to keep YouTube videos going while you use another app on your phone or save videos to watch when you're offline. \nYouTube Premium Lite came to the US just about a year ago as a more affordable way to watch YouTube with fewer ads, but it lacked background playback and offline downloads. In its blog post, the company said that it had \"heard feedback about wanting these additional features included in the service.\" The features are rolling out beginning Tuesday and will be available everywhere  …\nRead the full story at The Verge.",
    "category": "tech"
  },
  {
    "title": "Music generator ProducerAI joins Google Labs",
    "slug": "music-generator-producerai-joins-google-labs",
    "url": "https://techcrunch.com/2026/02/24/music-generator-producerai-joins-google-labs/",
    "source": "TechCrunch",
    "date": "2026-02-24T16:57:21.000Z",
    "summary": "Wyclef Jean used Google's AI music tools on his new song \"Back in Abu Dhabi.\"",
    "content": "Wyclef Jean used Google's AI music tools on his new song \"Back in Abu Dhabi.\"",
    "category": "tech"
  },
  {
    "title": "Anthropic&#8217;s Claude Cowork is plugging AI into more boring enterprise stuff",
    "slug": "anthropic-8217-s-claude-cowork-is-plugging-ai-into-more-boring-enterprise-stuff",
    "url": "https://www.theverge.com/ai-artificial-intelligence/883707/anthropic-claude-cowork-updates",
    "source": "The Verge",
    "date": "2026-02-24T16:43:56.000Z",
    "summary": "On Tuesday, Anthropic announced updates to its Claude Cowork platform that allow the AI to help with a wider range of office tasks. Claude Cowork can now connect with several popular office apps, incl",
    "content": "On Tuesday, Anthropic announced updates to its Claude Cowork platform that allow the AI to help with a wider range of office tasks. Claude Cowork can now connect with several popular office apps, including Google Workspace, Docusign, and WordPress. New pre-built plug-ins can also automate tasks in a range of fields, including HR, design, engineering, and finance. Additionally, according to Anthropic, \"Claude can now also handle multi-step tasks end-to-end across Excel and PowerPoint,\" passing context between the two apps. \nThe update is Anthropic's latest push into AI agents, following the initial launch of Claude Cowork last month. Anthrop …\nRead the full story at The Verge.",
    "category": "tech"
  },
  {
    "title": "50 mpg in a Nissan crossover? Testing the new E-Power hybrid system.",
    "slug": "50-mpg-in-a-nissan-crossover-testing-the-new-e-power-hybrid-system",
    "url": "https://arstechnica.com/cars/2026/02/on-the-road-with-nissans-new-e-power-hybrid-coming-to-the-2027-rogue/",
    "source": "Ars Technica",
    "date": "2026-02-24T16:43:27.000Z",
    "summary": "Nissan imported some Qashqais from Europe so we could sample the hybrid system.",
    "content": "Nissan imported some Qashqais from Europe so we could sample the hybrid system.",
    "category": "tech"
  },
  {
    "title": "Marquis sues firewall provider SonicWall, alleges security failings with its firewall backup led to ransomware attack",
    "slug": "marquis-sues-firewall-provider-sonicwall-alleges-security-failings-with-its-fire",
    "url": "https://techcrunch.com/2026/02/24/marquis-sonicwall-lawsuit-ransomware-firewall-breach/",
    "source": "TechCrunch",
    "date": "2026-02-24T16:37:41.000Z",
    "summary": "Fintech giant Marquis is suing its firewall provider SonicWall, claiming that an earlier breach with SonicWall allowed hackers to deploy ransomware on Marquis' network.",
    "content": "Fintech giant Marquis is suing its firewall provider SonicWall, claiming that an earlier breach with SonicWall allowed hackers to deploy ransomware on Marquis' network.",
    "category": "tech"
  },
  {
    "title": "Samsung’s artsy Frame TV has dropped to a record-low price for a limited time",
    "slug": "samsung-s-artsy-frame-tv-has-dropped-to-a-record-low-price-for-a-limited-time",
    "url": "https://www.theverge.com/gadgets/883331/samsung-2025-frame-tv-anker-nano-travel-adapter-deal-sale",
    "source": "The Verge",
    "date": "2026-02-24T15:53:52.000Z",
    "summary": "While the steepest discount is on the 43-inch model, other sizes are on sale as well.\t\n\nNot everybody wants their living room to be dominated by a big, hulking TV screen. Luckily, Samsung’s 2025 Frame",
    "content": "While the steepest discount is on the 43-inch model, other sizes are on sale as well.\t\n\nNot everybody wants their living room to be dominated by a big, hulking TV screen. Luckily, Samsung’s 2025 Frame TV, which is designed to fade into the background when idle, is discounted to its lowest price to date at Woot. Now through February 28th, the 43- and 55-inch panels are on sale for $587.99 ($312 off) and $847.99 ($400 off), respectively, with additional deals available on other sizes.\nSamsung The Frame (2025)\n\nWhere to Buy:\n\n $899.99 $587.99 at Woot (43-inch)\n $1247.99 $847.99 at Woot (55-inch)\n\nThe Frame features a slim QLED panel that can showcase more than 4,000 paintings — including works by Vincent van Gogh and more contemporary artists — via Samsung’s Art Store, helping the 4K set blend into your home decor when turned off. The digital art store lets you browse by collection, period, artist, or color, too, so you can tailor the display to suit your space. You’ll need a $50 annual subscription to access the full catalog, though Samsung does offer access to some artwork for free. \nAs we noted in our recent comparison with similar TVs from TCL and Hisense, the Frame looks the most realistic of any art-inspired TV available. That’s thanks to its anti-glare matte display, which handles reflections better than rival TVs and gives images a canvas-like texture. Plus, if you’re not into classics like Van Gogh’s Starry Night or Edvard Munch’s expressionist masterpiece, The Scream, Samsung lets you display your own photos.\nAnd, of course, when you’re ready to actually watch TV, the Frame delivers. It offers support for Dolby Atmos and HDR10 Plus for more vibrant sound and picture quality, while granting access to Netflix, Hulu, Disney Plus, and all your favorite streaming apps. You also get support for both Amazon Alexa and Google Assistant for hands-free voice control, along with four HDMI ports, all of which meet the gamer-friendly 2.1 spec on the larger models. The 43-i",
    "category": "tech"
  },
  {
    "title": "Ukraine’s startups keep building",
    "slug": "ukraine-s-startups-keep-building",
    "url": "https://techcrunch.com/2026/02/24/ukraines-startups-keep-building/",
    "source": "TechCrunch",
    "date": "2026-02-24T15:48:45.000Z",
    "summary": "In the four years since Russia’s full-scale invasion of their country, Ukrainian startups have done more than survive: they are still building and growing.",
    "content": "In the four years since Russia’s full-scale invasion of their country, Ukrainian startups have done more than survive: they are still building and growing.",
    "category": "tech"
  },
  {
    "title": "Lamborghini cancels electric Lanzador as supercar buyers reject EVs",
    "slug": "lamborghini-cancels-electric-lanzador-as-supercar-buyers-reject-evs",
    "url": "https://arstechnica.com/cars/2026/02/lamborghini-drops-ev-plan-in-favor-of-future-plug-in-hybrids/",
    "source": "Ars Technica",
    "date": "2026-02-24T15:24:02.000Z",
    "summary": "Investing heavily in battery EVs would be \"financially irresponsible,\" CEO said.",
    "content": "Investing heavily in battery EVs would be \"financially irresponsible,\" CEO said.",
    "category": "tech"
  },
  {
    "title": "ADT just bought the company that invented Wi-Fi motion sensing",
    "slug": "adt-just-bought-the-company-that-invented-wi-fi-motion-sensing",
    "url": "https://www.theverge.com/tech/883661/adt-smart-home-security-origin-wireless-ai-wi-fi-motion-presence-sensing",
    "source": "The Verge",
    "date": "2026-02-24T15:20:07.000Z",
    "summary": "ADT, the 150-year-old company best known for home security, has acquired Origin Wireless in a $170 million deal to expand the capabilities of its security and smart home offerings. Origin Wireless dev",
    "content": "ADT, the 150-year-old company best known for home security, has acquired Origin Wireless in a $170 million deal to expand the capabilities of its security and smart home offerings. Origin Wireless developed algorithms that analyze how wireless RF signals bounce around a space to detect the presence and movements of people and objects without the need for additional sensors. \nADT plans to integrate Original Wireless' technology into its smart home and security systems to add more context when security alarms are triggered, and potentially reduce false alarms. By leveraging existing technologies like Wi-Fi, future ADT systems may also require …\nRead the full story at The Verge.",
    "category": "tech"
  },
  {
    "title": "Meta strikes up to $100B AMD chip deal as it chases ‘personal superintelligence’",
    "slug": "meta-strikes-up-to-100b-amd-chip-deal-as-it-chases-personal-superintelligence",
    "url": "https://techcrunch.com/2026/02/24/meta-strikes-up-to-100b-amd-chip-deal-as-it-chases-personal-superintelligence/",
    "source": "TechCrunch",
    "date": "2026-02-24T15:15:16.000Z",
    "summary": "Meta is buying billions of dollars in AMD AI chips in a multiyear deal tied to a 160 million-share warrant, deepening its push to diversify beyond Nvidia and expand data center capacity.",
    "content": "Meta is buying billions of dollars in AMD AI chips in a multiyear deal tied to a 160 million-share warrant, deepening its push to diversify beyond Nvidia and expand data center capacity.",
    "category": "tech"
  },
  {
    "title": "Oura launches a proprietary AI model focused on women’s health",
    "slug": "oura-launches-a-proprietary-ai-model-focused-on-women-s-health",
    "url": "https://techcrunch.com/2026/02/24/oura-launches-a-proprietary-ai-model-focused-on-womens-health/",
    "source": "TechCrunch",
    "date": "2026-02-24T15:08:01.000Z",
    "summary": "The model supports questions spanning the full reproductive health spectrum, from early menstrual cycles through menopause.",
    "content": "The model supports questions spanning the full reproductive health spectrum, from early menstrual cycles through menopause.",
    "category": "tech"
  },
  {
    "title": "Final 4 days to save up to $680 on your TechCrunch Disrupt 2026 pass",
    "slug": "final-4-days-to-save-up-to-680-on-your-techcrunch-disrupt-2026-pass",
    "url": "https://techcrunch.com/2026/02/24/final-4-days-to-save-up-to-680-on-your-techcrunch-disrupt-2026-pass/",
    "source": "TechCrunch",
    "date": "2026-02-24T15:00:00.000Z",
    "summary": "Just 4 days left before savings of up to $680 on your TechCrunch Disrupt 2026 pass end on February 27 at 11:59 p.m. PT. Register to save at one of the most anticipated tech events of the year.",
    "content": "Just 4 days left before savings of up to $680 on your TechCrunch Disrupt 2026 pass end on February 27 at 11:59 p.m. PT. Register to save at one of the most anticipated tech events of the year.",
    "category": "tech"
  },
  {
    "title": "Anthropic launches new push for enterprise agents with plugins for finance, engineering, and design",
    "slug": "anthropic-launches-new-push-for-enterprise-agents-with-plugins-for-finance-engin",
    "url": "https://techcrunch.com/2026/02/24/anthropic-launches-new-push-for-enterprise-agents-with-plugins-for-finance-engineering-and-design/",
    "source": "TechCrunch",
    "date": "2026-02-24T14:45:55.000Z",
    "summary": "It's a major opportunity to grow Anthropic’s enterprise client base — and a significant threat to SaaS products currently performing those functions.",
    "content": "It's a major opportunity to grow Anthropic’s enterprise client base — and a significant threat to SaaS products currently performing those functions.",
    "category": "tech"
  },
  {
    "title": "How Claude Code Claude Codes",
    "slug": "how-claude-code-claude-codes",
    "url": "https://www.theverge.com/podcast/883604/claude-code-ai-future-creator-privacy-vergecast",
    "source": "The Verge",
    "date": "2026-02-24T14:20:35.000Z",
    "summary": "Claude Code is a developer tool for developers. And yet, over the last year and especially the last few months, the team at Anthropic has seen a huge number of people, across industries and discipline",
    "content": "Claude Code is a developer tool for developers. And yet, over the last year and especially the last few months, the team at Anthropic has seen a huge number of people, across industries and disciplines, figure out how to access their terminal so that they could build new stuff too. Few AI products have found true product-market fit the way Claude Code has. But how did that happen? And are we ever going to get out of the terminal?\n\nVerge subscribers, don't forget you get exclusive access to ad-free Vergecast wherever you get your podcasts. Head here. Not a subscriber? You can sign up here.\nOn this episode of The Vergecast, Anthropic's Bo …\nRead the full story at The Verge.",
    "category": "tech"
  },
  {
    "title": "Meta could end up owning 10% of AMD in new chip deal",
    "slug": "meta-could-end-up-owning-10-of-amd-in-new-chip-deal",
    "url": "https://arstechnica.com/ai/2026/02/meta-could-end-up-owning-of-10-amd-in-new-chip-deal/",
    "source": "Ars Technica",
    "date": "2026-02-24T14:10:13.000Z",
    "summary": "AMD will supply 6 gigawatts' worth of chips to buttress Meta's AI efforts.",
    "content": "AMD will supply 6 gigawatts' worth of chips to buttress Meta's AI efforts.",
    "category": "tech"
  },
  {
    "title": "Conduent data breach grows, affecting at least 25M people",
    "slug": "conduent-data-breach-grows-affecting-at-least-25m-people",
    "url": "https://techcrunch.com/2026/02/24/conduent-data-breach-grows-affecting-at-least-25m-people/",
    "source": "TechCrunch",
    "date": "2026-02-24T14:09:11.000Z",
    "summary": "The number of people affected by a data breach at government contractor giant Conduent is growing, as millions of people continue to receive notices warning them that hackers stole their personal data",
    "content": "The number of people affected by a data breach at government contractor giant Conduent is growing, as millions of people continue to receive notices warning them that hackers stole their personal data.",
    "category": "tech"
  },
  {
    "title": "Scientists crack the case of \"screeching\" Scotch tape",
    "slug": "scientists-crack-the-case-of-screeching-scotch-tape",
    "url": "https://arstechnica.com/science/2026/02/heres-why-scotch-tape-screeches-when-its-peeled/",
    "source": "Ars Technica",
    "date": "2026-02-24T14:00:17.000Z",
    "summary": "Micro-cracks travel along the peeling tape at supersonic speeds, producing shock waves and sound pulses.",
    "content": "Micro-cracks travel along the peeling tape at supersonic speeds, producing shock waves and sound pulses.",
    "category": "tech"
  },
  {
    "title": "Mogul says it has tracked $1.5B in music royalties, raised $5M in funding",
    "slug": "mogul-says-it-has-tracked-1-5b-in-music-royalties-raised-5m-in-funding",
    "url": "https://techcrunch.com/2026/02/24/mogul-tracked-1-5-billion-music-royalties-raised-5m-funding/",
    "source": "TechCrunch",
    "date": "2026-02-24T14:00:00.000Z",
    "summary": "Mogul, which helps artists track royalties and value their catalogs, raised $5 million in a round led by the Yamaha Music Innovations Fund.",
    "content": "Mogul, which helps artists track royalties and value their catalogs, raised $5 million in a round led by the Yamaha Music Innovations Fund.",
    "category": "tech"
  },
  {
    "title": "It’s time to pull the plug on plug-in hybrids",
    "slug": "it-s-time-to-pull-the-plug-on-plug-in-hybrids",
    "url": "https://techcrunch.com/2026/02/24/its-time-to-pull-the-plug-on-plug-in-hybrids/",
    "source": "TechCrunch",
    "date": "2026-02-24T14:00:00.000Z",
    "summary": "Plug-in hybrid vehicles are rarely charged, according to a new study. Why are automakers still producing them?",
    "content": "Plug-in hybrid vehicles are rarely charged, according to a new study. Why are automakers still producing them?",
    "category": "tech"
  },
  {
    "title": "New Relic launches new AI agent platform and OpenTelemetry tools",
    "slug": "new-relic-launches-new-ai-agent-platform-and-opentelemetry-tools",
    "url": "https://techcrunch.com/2026/02/24/new-relic-launches-new-ai-agent-platform-and-opentelemetry-tools/",
    "source": "TechCrunch",
    "date": "2026-02-24T14:00:00.000Z",
    "summary": "New Relic is giving enterprises more observability tools, letting them create and manage AI agents, and better integrate OTel data streams.",
    "content": "New Relic is giving enterprises more observability tools, letting them create and manage AI agents, and better integrate OTel data streams.",
    "category": "tech"
  },
  {
    "title": "Waymo robotaxis are now operating in 10 US cities",
    "slug": "waymo-robotaxis-are-now-operating-in-10-us-cities",
    "url": "https://techcrunch.com/2026/02/24/waymo-robotaxis-are-now-operating-in-10-us-cities/",
    "source": "TechCrunch",
    "date": "2026-02-24T14:00:00.000Z",
    "summary": "Waymo launched services today in Dallas, Houston, San Antonio, and Orlando.",
    "content": "Waymo launched services today in Dallas, Houston, San Antonio, and Orlando.",
    "category": "tech"
  },
  {
    "title": "Apple Unveils New M4 Ultra Chip for Mac Studio",
    "slug": "apple-unveils-new-m4-ultra-chip-for-mac-studio",
    "url": "https://techcrunch.com/example/apple-m4-ultra",
    "source": "TechCrunch",
    "date": "2026-02-24T10:00:00Z",
    "summary": "Apple has announced the M4 Ultra chip, featuring a 32-core CPU and 80-core GPU. The new chip powers the updated Mac Studio, offering significant performance gains for professional workflows.",
    "content": "",
    "category": "tech"
  },
  {
    "title": "Firefox 135 Ships with Built-in AI Translation",
    "slug": "firefox-135-ships-with-built-in-ai-translation",
    "url": "https://theverge.com/example/firefox-135",
    "source": "The Verge",
    "date": "2026-02-24T08:30:00Z",
    "summary": "Mozilla's latest Firefox release includes on-device AI translation supporting 20 languages. The feature runs entirely locally, addressing privacy concerns with cloud-based alternatives.",
    "content": "",
    "category": "tech"
  },
  {
    "title": "Linux Kernel 7.0 Released with Major Performance Improvements",
    "slug": "linux-kernel-7-0-released-with-major-performance-improvements",
    "url": "https://arstechnica.com/example/linux-7",
    "source": "Ars Technica",
    "date": "2026-02-23T16:00:00Z",
    "summary": "The Linux 7.0 kernel brings a new scheduler, improved memory management, and better support for ARM64 platforms. Early benchmarks show up to 15% improvement in server workloads.",
    "content": "",
    "category": "tech"
  }
]