[
  {
    "title": "AI music generator Suno hits 2M paid subscribers and $300M in annual recurring revenue",
    "slug": "ai-music-generator-suno-2m-subscribers-300m-arr",
    "url": "https://techcrunch.com/2026/02/27/ai-music-generator-suno-hits-2-million-paid-subscribers-and-300m-in-annual-recurring-revenue/",
    "source": "TechCrunch",
    "date": "2026-02-27T17:22:02.000Z",
    "summary": "Suno, an AI music generator enabling users to create music via natural language prompts, has reached 2 million paid subscribers and $300 million in annual recurring revenue. The milestone demonstrates strong commercial adoption of AI-powered creative tools among consumers. The platform's success underscores growing demand for democratized music production.",
    "content": "Suno lets users create music using natural language prompts, making it possible for people with little experience to generate audio with little effort.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "AI音乐生成器Suno达到200万付费订阅者和3亿美元年度经常性收入",
        "summary": "Suno是一个AI音乐生成器，允许用户通过自然语言提示创作音乐，已达到200万付费订阅者和3亿美元年度经常性收入。这一里程碑表明AI驱动的创意工具在消费者中获得了强劲的商业采用。该平台的成功强调了对民主化音乐制作日益增长的需求。"
      },
      "fr": {
        "title": "Le générateur de musique IA Suno atteint 2M d'abonnés payants et 300M $ de revenu annuel récurrent",
        "summary": "Suno, un générateur de musique IA permettant aux utilisateurs de créer de la musique via des invites en langage naturel, a atteint 2 millions d'abonnés payants et 300 millions de dollars de revenu annuel récurrent. Le jalon démontre une forte adoption commerciale des outils créatifs alimentés par l'IA parmi les consommateurs. Le succès de la plateforme souligne une demande croissante de production musicale démocratisée."
      },
      "de": {
        "title": "KI-Musikgenerator Suno erreicht 2 Millionen bezahlte Abonnenten und 300 Millionen Dollar jährlich wiederkehrende Einnahmen",
        "summary": "Suno, ein KI-Musikgenerator, der Benutzer befähigt, Musik über natürlichsprachliche Eingaben zu erstellen, hat 2 Millionen bezahlte Abonnenten und 300 Millionen Dollar jährlich wiederkehrende Einnahmen erreicht. Der Meilenstein zeigt eine starke kommerzielle Adoption von KI-gesteuerten Kreativwerkzeugen bei Verbrauchern. Der Erfolg der Plattform unterstreicht die wachsende Nachfrage nach demokratisierter Musikproduktion."
      },
      "es": {
        "title": "El generador de música IA Suno alcanza 2M de suscriptores pagos y $300M en ingresos recurrentes anuales",
        "summary": "Suno, un generador de música IA que permite a los usuarios crear música a través de indicaciones de lenguaje natural, ha alcanzado 2 millones de suscriptores pagos y 300 millones de dólares en ingresos recurrentes anuales. El hito demuestra una fuerte adopción comercial de herramientas creativas impulsadas por IA entre los consumidores. El éxito de la plataforma subraya la creciente demanda de producción musical democratizada."
      }
    }
  },
  {
    "title": "Apple and Netflix team up to air Formula 1 Canadian Grand Prix",
    "slug": "apple-netflix-formula-1-canadian-grand-prix",
    "url": "https://techcrunch.com/2026/02/27/apple-and-netflix-team-up-to-air-formula-1-canadian-grand-prix/",
    "source": "TechCrunch",
    "date": "2026-02-27T17:17:18.000Z",
    "summary": "Netflix and Apple have partnered to air the Formula 1 Canadian Grand Prix, expanding Netflix's investment in live sports content. The collaboration brings premium sports programming to both platforms' audiences. The partnership reflects intensifying competition among streaming services for exclusive sports rights.",
    "content": "As Netflix continues its live sports push, the company has partnered with Apple to air the Formula 1 Canadian Grand Prix.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Apple和Netflix合作转播一级方程式加拿大大奖赛",
        "summary": "Netflix和Apple已联手转播一级方程式加拿大大奖赛，扩展了Netflix在直播体育内容中的投资。这一合作为两个平台的受众带来了优质体育编程。该伙伴关系反映了流媒体服务之间在独家体育版权竞争中的加剧。"
      },
      "fr": {
        "title": "Apple et Netflix s'associent pour diffuser le Grand Prix de Formule 1 du Canada",
        "summary": "Netflix et Apple se sont associés pour diffuser le Grand Prix de Formule 1 du Canada, élargissant l'investissement de Netflix dans le contenu sportif en direct. La collaboration apporte une programmation sportive premium aux audiences des deux plates-formes. Le partenariat reflète l'intensification de la concurrence entre les services de streaming pour les droits sportifs exclusifs."
      },
      "de": {
        "title": "Apple und Netflix arbeiten zusammen, um den Formel-1-Großpreis von Kanada auszustrahlen",
        "summary": "Netflix und Apple haben sich zusammengetan, um den Formel-1-Großpreis von Kanada auszustrahlen und Netflixs Investitionen in Live-Sportinhalte zu erweitern. Die Zusammenarbeit bringt hochwertige Sportprogramme an beide Plattformen-Zielgruppen. Die Partnerschaft spiegelt den intensiveren Wettbewerb unter Streaming-Diensten um exklusive Sportrechte wider."
      },
      "es": {
        "title": "Apple y Netflix se unen para transmitir el Gran Premio de Fórmula 1 de Canadá",
        "summary": "Netflix y Apple se han asociado para transmitir el Gran Premio de Fórmula 1 de Canadá, expandiendo la inversión de Netflix en contenido deportivo en vivo. La colaboración trae programación deportiva premium a las audiencias de ambas plataformas. La asociación refleja la intensificación de la competencia entre servicios de streaming por derechos deportivos exclusivos."
      }
    }
  },
  {
    "title": "AI vs. the Pentagon: killer robots, mass surveillance, and red lines",
    "slug": "ai-pentagon-killer-robots-mass-surveillance",
    "url": "https://www.theverge.com/ai-artificial-intelligence/886082/ai-vs-the-pentagon-killer-robots-mass-surveillance-and-red-lines",
    "source": "The Verge",
    "date": "2026-02-27T17:16:53.000Z",
    "summary": "Anthropic is refusing Pentagon demands to remove AI guardrails that would enable mass surveillance and fully autonomous lethal weapons, risking designation as a \"supply chain risk.\" CEO Dario Amodei has maintained this position through high-level negotiations despite potential commercial consequences. Competitors OpenAI and xAI have reportedly agreed to the Pentagon's terms, making Anthropic's stance an industry outlier.",
    "content": "WASHINGTON, DC - JANUARY 29: U.S. Secretary of War Pete Hegseth (C) speaks during a meeting of the Cabinet as U.S. President Donald Trump (L) and U.S. Commerce Secretary Howard Lutnick (R) listen in the Cabinet Room of the White House on January 29, 2026 in Washington, DC. President Trump is holding the meeting as the Senate plans to hold a vote on a spending package to avoid another government shutdown, however Democrats are holding out for a deal to consider funding for the Department of Homeland Security.  (Photo by Win McNamee/Getty Images) | Getty Images\t\n\nCan AI firms set limits on how and where the military uses their models? Anthropic is in heated negotiations with the Pentagon after refusing to comply with new military contract terms that would require it to loosen the guardrails on its AI models, allowing for “any lawful use,” even mass surveillance of Americans and fully autonomous lethal weapons. \nPentagon CTO Emil Michael is pushing for Anthropic to be designated a “supply chain risk” if it doesn’t comply, a label usually only given to national security threats. Anthropic’s rivals OpenAI and xAI have reportedly agreed to the new terms, but even after a White House meeting with Defense Secretary Pete Hegseth, Anthropic CEO Dario Amodei is still refusing to cross his company’s red line, stating that “threats do not change our position: we cannot in good conscience accede to their request.”\nFollow along here for the latest updates on the clash between AI companies and the Pentagon…\nWe don’t have to have unsupervised killer robots\n\t\t\t\nAnthropic refuses Pentagon’s new terms, standing firm on lethal autonomous weapons and mass surveillance\n\t\t\t\nPete Hegseth’s Pentagon AI bro squad includes a former Uber executive and a private equity billionaire\n\t\t\t\nInside Anthropic’s existential negotiations with the Pentagon",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "AI对阵五角大楼：杀手机器人、大规模监视和红线",
        "summary": "Anthropic正在拒绝五角大楼的要求，即删除AI护栏，这些护栏会导致大规模监视和完全自主致命武器，面临被指定为\"供应链风险\"的风险。首席执行官达里奥·阿莫代伊在高层谈判中保持了这一立场，尽管存在潜在的商业后果。据报道，竞争对手OpenAI和xAI已同意五角大楼的条款，使Anthropic的立场成为行业异类。"
      },
      "fr": {
        "title": "L'IA contre le Pentagone : robots tueurs, surveillance de masse et lignes rouges",
        "summary": "Anthropic refuse les demandes du Pentagone de supprimer les garde-fous de l'IA qui permettraient la surveillance de masse et les armes autonomes entièrement léthales, risquant d'être désignée comme un « risque de la chaîne d'approvisionnement ». Le PDG Dario Amodei a maintenu cette position à travers des négociations de haut niveau malgré les conséquences commerciales potentielles. Les concurrents OpenAI et xAI auraient accepté les conditions du Pentagone, faisant de la position d'Anthropic un cas isolé dans l'industrie."
      },
      "de": {
        "title": "KI gegen das Pentagon: Killertechnik, Massenüberwachung und rote Linien",
        "summary": "Anthropic verweigert Forderungen des Pentagons, KI-Schutzvorrichtungen zu entfernen, die Massenüberwachung und vollständig autonome tödliche Waffen ermöglichen würden, und riskiert damit, als \"Supply-Chain-Risiko\" eingestuft zu werden. CEO Dario Amodei hat diese Position trotz potenzieller geschäftlicher Konsequenzen durch hochrangige Verhandlungen beibehalten. Konkurrenten OpenAI und xAI haben Berichten zufolge den Bedingungen des Pentagons zugestimmt, was Anthropics Haltung zu einem Ausreißer in der Branche macht."
      },
      "es": {
        "title": "IA contra el Pentágono: robots asesinos, vigilancia masiva y líneas rojas",
        "summary": "Anthropic está rechazando las demandas del Pentágono para eliminar protecciones de IA que permitirían la vigilancia masiva y armas totalmente autónomas y letales, arriesgándose a ser designada como un \"riesgo de cadena de suministro\". El director ejecutivo Dario Amodei ha mantenido esta posición a través de negociaciones de alto nivel a pesar de las posibles consecuencias comerciales. Se informa que los competidores OpenAI y xAI han aceptado los términos del Pentágono, lo que hace que la postura de Anthropic sea un caso atípico en la industria."
      }
    }
  },
  {
    "title": "Woot’s ‘Video Games for All’ sale features some of our favorite games",
    "slug": "woots-video-games-for-all-sale",
    "url": "https://www.theverge.com/gadgets/885334/woot-ps5-nintendo-switch-video-game-sale-lg-c5-oled-tv-deal",
    "source": "The Verge",
    "date": "2026-02-27T17:12:31.000Z",
    "summary": "Woot is running a \"Video Games for All\" sale through March 5 featuring significant discounts on physical games and accessories for major consoles. An additional 20% off code LEVEL20 is available through February 27, with major titles like Elden Ring and The Legend of Zelda marked down substantially. The sale offers Black Friday-level pricing for game purchases.",
    "content": "There’s a sale happening at Woot that’s delivering Black Friday-esque deals on video games through March 5th. The “Video Games for All” sale includes discounts on physical games for most modern consoles, making it a great time to treat yourself (or a pal) to some titles that you’ve been waiting to see big price drops for. There are also deals on gaming accessories like totes, controllers, and more. Through February 27th at 11:58PM CT, you can score an additional 20 percent off products looped into this sale by entering the code LEVEL20 at checkout (it caps at $30 total off your order).\nEveryone’s tastes are different, but some picks in this sale that especially vibe with me include Silent Hill F, which is fun and very different beast from Bloober Team’s Silent Hill 2 remake (less item hunting, more countering enemy attacks). Of course, who can argue against the pure fun contained within the Super Mario Galaxy double-pack for Switch that includes the original title and its sequel? It’s always cliché to say that there’s something for everyone here, but I think it’s actually true this time.\nElden Ring\n \n\nWhere to Buy:\n\n $49.99 $15.99 at Woot (PS5)\n\nThe Legend of Zelda: Echoes of Wisdom\n \n\nWhere to Buy:\n\n $59.99 $37.59 at Woot (Switch)\n\nSilent Hill F\n\nWhere to Buy:\n\n $69.99 $35.99 at Woot (PS5)\n\nMetaphor: ReFantazio\n \n\nWhere to Buy:\n\n $69.99 $14.39 at Woot (Xbox)\n\nBalatro: Special Edition\n\nWhere to Buy:\n\n $29.99 $13.59 at Woot (Switch)\n\nSuper Smash Bros. Ultimate\n \n\nWhere to Buy:\n\n $59.99 $37.59 at Woot (Switch)\n\nMario Kart 8 Deluxe\n \n\nWhere to Buy:\n\n $59.99 $37.59 at Woot (Switch)\n\nSuper Mario Galaxy + Super Mario Galaxy 2 bundle\n\nWhere to Buy:\n\n $69.99 $47.19 at Woot (Switch)\n\nMore deals and discounts\nSometimes, a rug or table can pull the room together. In the event that doesn’t work, Govee’s Pendant Light might just be the ticket. This height-adjustable smart light makes for a fun upgrade in your home, and it’s now selling at its lowest price yet at Amazon. Normally",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Woot的\"全民视频游戏\"促销活动展现我们最喜爱的游戏",
        "summary": "Woot正在运行一个\"全民视频游戏\"促销活动，至3月5日，在主要游戏机上提供大量物理游戏和配件的折扣。额外20%折扣代码LEVEL20可用至2月27日，《艾尔登法环》和《塞尔达传说》等大作大幅降价。该促销提供黑色星期五级别的游戏购买价格。"
      },
      "fr": {
        "title": "La vente \"Jeux vidéo pour tous\" de Woot présente certains de nos jeux préférés",
        "summary": "Woot exécute une vente \"Jeux vidéo pour tous\" jusqu'au 5 mars avec des réductions importantes sur les jeux physiques et les accessoires pour les principales consoles. Un code supplémentaire de 20% de réduction LEVEL20 est disponible jusqu'au 27 février, avec des titres majeurs comme Elden Ring et The Legend of Zelda marqués avec des réductions substantielles. La vente offre des prix de niveau Black Friday pour les achats de jeux."
      },
      "de": {
        "title": "Woots \"Videospiele für alle\" Verkauf zeigt einige unserer Lieblingsspiele",
        "summary": "Woot führt einen \"Videospiele für alle\" Verkauf bis zum 5. März durch, mit erheblichen Rabatten auf physische Spiele und Zubehör für große Konsolen. Ein zusätzlicher 20%-Rabattcode LEVEL20 ist bis zum 27. Februar verfügbar, wobei große Titel wie Elden Ring und The Legend of Zelda erheblich herabgesetzt werden. Der Verkauf bietet Black-Friday-ähnliche Preise für Spielekäufe."
      },
      "es": {
        "title": "La venta \"Videojuegos para todos\" de Woot presenta algunos de nuestros juegos favoritos",
        "summary": "Woot está ejecutando una venta \"Videojuegos para todos\" hasta el 5 de marzo con descuentos significativos en juegos físicos y accesorios para las principales consolas. Un código de descuento adicional del 20% LEVEL20 está disponible hasta el 27 de febrero, con títulos importantes como Elden Ring y The Legend of Zelda marcados con descuentos sustanciales. La venta ofrece precios de Black Friday para compras de videojuegos."
      }
    }
  },
  {
    "title": "Perplexity’s new Computer is another bet that users need many AI models",
    "slug": "perplexity-computer-unified-ai-models",
    "url": "https://techcrunch.com/2026/02/27/perplexitys-new-computer-is-another-bet-that-users-need-many-ai-models/",
    "source": "TechCrunch",
    "date": "2026-02-27T17:00:55.000Z",
    "summary": "Perplexity has launched a product called Computer that consolidates multiple AI capabilities into a unified system. The release reflects Perplexity's bet that users need integrated access to diverse AI models and functionalities. The move positions Perplexity as a platform aggregator in competitive AI search and information services.",
    "content": "Perplexity Computer, in the company’s words, \"unifies every current AI capability into a single system.\"",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Perplexity的新Computer是用户需要多种AI模型的又一个赌注",
        "summary": "Perplexity推出了一款名为Computer的产品，将多个AI功能整合为一个统一系统。该发布反映了Perplexity的赌注，即用户需要集成访问多种AI模型和功能。此举将Perplexity定位为竞争性AI搜索和信息服务中的平台聚合器。"
      },
      "fr": {
        "title": "Le nouvel ordinateur de Perplexity est un autre pari que les utilisateurs ont besoin de nombreux modèles d'IA",
        "summary": "Perplexity a lancé un produit appelé Computer qui consolide plusieurs capacités d'IA dans un système unifié. La version reflète le pari de Perplexity selon lequel les utilisateurs ont besoin d'un accès intégré à divers modèles et fonctionnalités d'IA. Ce mouvement positionne Perplexity comme un agrégateur de plate-forme dans les services de recherche et d'information IA compétitifs."
      },
      "de": {
        "title": "Perplexitys neuer Computer ist ein weiterer Einsatz, dass Nutzer viele KI-Modelle brauchen",
        "summary": "Perplexity hat ein Produkt namens Computer gestartet, das mehrere KI-Funktionen in einem einheitlichen System konsolidiert. Die Veröffentlichung spiegelt Perplexitys Wette wider, dass Benutzer integrierten Zugriff auf verschiedene KI-Modelle und Funktionalitäten benötigen. Der Schritt positioniert Perplexity als Plattformaggregator in wettbewerbsfähigen KI-Such- und Informationsdiensten."
      },
      "es": {
        "title": "El nuevo Computer de Perplexity es otra apuesta de que los usuarios necesitan muchos modelos de IA",
        "summary": "Perplexity ha lanzado un producto llamado Computer que consolida múltiples capacidades de IA en un sistema unificado. El lanzamiento refleja la apuesta de Perplexity de que los usuarios necesitan acceso integrado a diversos modelos y funcionalidades de IA. El movimiento posiciona a Perplexity como un agregador de plataforma en servicios competitivos de búsqueda e información de IA."
      }
    }
  },
  {
    "title": "‘Pokémon Winds and Waves’ are coming to the Nintendo Switch 2 in 2027",
    "slug": "pokemon-winds-waves-nintendo-switch-2-2027",
    "url": "https://techcrunch.com/2026/02/27/pokemon-winds-and-waves-are-coming-to-the-nintendo-switch-2-in-2027/",
    "source": "TechCrunch",
    "date": "2026-02-27T16:57:21.000Z",
    "summary": "Nintendo and The Pokémon Company announced \"Pokémon Winds and Waves\" for Nintendo Switch 2 in 2027, with three new tenth-generation starter Pokémon: Browt (grass bird), Pombon (fire puppy), and Gecqua (water gecko). The reveal marks the beginning of the next mainline Pokémon generation on the upcoming console. The announcement comes alongside broader Switch 2 platform launch expectations.",
    "content": "The tenth generation starter Pokémon were revealed in the trailer: Browt (a grass bird), Pombon (a fire puppy), and Gecqua (a water gecko).",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "《宝可梦风与浪》将于2027年登陆任天堂Switch 2",
        "summary": "任天堂和宝可梦公司宣布《宝可梦风与浪》将于2027年登陆任天堂Switch 2，推出三只新的第十代首发宝可梦：布劳特（草系飞行）、庞邦（火系小狗）和盖克瓜（水系壁虎）。该揭示标志着下一代主线宝可梦在即将推出的主机上的开始。这项公告与Switch 2平台的更广泛发布期望一致。"
      },
      "fr": {
        "title": "\"Pokémon Winds and Waves\" arrive sur Nintendo Switch 2 en 2027",
        "summary": "Nintendo et The Pokémon Company ont annoncé \"Pokémon Winds and Waves\" pour Nintendo Switch 2 en 2027, avec trois nouveaux Pokémon de démarrage de dixième génération : Browt (oiseau herbe), Pombon (chiot feu), et Gecqua (gecko eau). La révélation marque le début de la prochaine génération Pokémon principale sur la console à venir. L'annonce intervient aux côtés des attentes plus larges de lancement de la plateforme Switch 2."
      },
      "de": {
        "title": "\"Pokémon Winds and Waves\" kommt 2027 auf Nintendo Switch 2",
        "summary": "Nintendo und The Pokémon Company kündigten \"Pokémon Winds and Waves\" für Nintendo Switch 2 im Jahr 2027 an, mit drei neuen Starter-Pokémon der zehnten Generation: Browt (Gras-Vogel), Pombon (Feuer-Welpe) und Gecqua (Wasser-Gecko). Die Enthüllung markiert den Beginn der nächsten Hauptgeneration von Pokémon auf der kommenden Konsole. Die Ankündigung erfolgt in Verbindung mit breiteren Erwartungen zum Start der Switch 2-Plattform."
      },
      "es": {
        "title": "\"Pokémon Winds and Waves\" llegarán a Nintendo Switch 2 en 2027",
        "summary": "Nintendo y The Pokémon Company anunciaron \"Pokémon Winds and Waves\" para Nintendo Switch 2 en 2027, con tres nuevos Pokémon iniciales de décima generación: Browt (pájaro hierba), Pombon (cachorro fuego), y Gecqua (gecko agua). La revelación marca el comienzo de la próxima generación principal de Pokémon en la próxima consola. El anuncio se produce junto con expectativas más amplias de lanzamiento de la plataforma Switch 2."
      }
    }
  },
  {
    "title": "Employees at Google and OpenAI support Anthropic’s Pentagon stand in open letter",
    "slug": "google-openai-employees-support-anthropic-pentagon",
    "url": "https://techcrunch.com/2026/02/27/employees-at-google-and-openai-support-anthropics-pentagon-stand-in-open-letter/",
    "source": "TechCrunch",
    "date": "2026-02-27T16:23:58.000Z",
    "summary": "Employees from Google and OpenAI have publicly supported Anthropic's refusal to remove guardrails from its AI models for Pentagon use in an open letter. The cross-company solidarity underscores growing concern among tech workers about military applications involving mass surveillance and autonomous weapons. The internal industry support strengthens Anthropic's negotiating position with the Department of Defense.",
    "content": "While Anthropic has an existing partnership with the Pentagon, the AI company has remained firm that its technology not be used for mass domestic surveillance or fully autonomous weaponry.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "谷歌和OpenAI员工在公开信中支持Anthropic的五角大楼立场",
        "summary": "来自谷歌和OpenAI的员工公开支持Anthropic拒绝为五角大楼使用移除其AI模型护栏的决定。跨公司的团结反映了科技工作者对涉及大规模监视和自主武器的军事应用的日益关注。业内的内部支持加强了Anthropic在国防部谈判中的地位。"
      },
      "fr": {
        "title": "Les employés de Google et OpenAI soutiennent la position du Pentagone d'Anthropic dans une lettre ouverte",
        "summary": "Les employés de Google et OpenAI ont publiquement soutenu le refus d'Anthropic de supprimer les garde-fous de ses modèles d'IA pour une utilisation militaire du Pentagone dans une lettre ouverte. La solidarité entre les entreprises souligne les préoccupations croissantes des travailleurs du secteur technologique concernant les applications militaires impliquant la surveillance de masse et les armes autonomes. Le soutien interne de l'industrie renforce la position de négociation d'Anthropic auprès du ministère de la Défense."
      },
      "de": {
        "title": "Mitarbeiter von Google und OpenAI unterstützen Anthropics Pentagon-Haltung in offener Brief",
        "summary": "Mitarbeiter von Google und OpenAI haben öffentlich Anthropics Weigerung unterstützt, Sicherheitsvorkehrungen aus seinen KI-Modellen für die Nutzung durch das Pentagon zu entfernen, in einem offenen Brief. Die unternehmensübergreifende Solidarität unterstreicht die wachsende Besorgnis von Technologiefachleuten über Militäranwendungen mit Massenüberwachung und autonomen Waffen. Die interne branchenweit Unterstützung stärkt Anthropics Verhandlungsposition gegenüber dem Verteidigungsministerium."
      },
      "es": {
        "title": "Empleados de Google y OpenAI apoyan la postura del Pentágono de Anthropic en una carta abierta",
        "summary": "Los empleados de Google y OpenAI han apoyado públicamente la negativa de Anthropic de eliminar las protecciones de seguridad de sus modelos de IA para su uso militar en el Pentágono en una carta abierta. La solidaridad entre empresas subraya la creciente preocupación de los trabajadores tecnológicos sobre aplicaciones militares que implican vigilancia masiva y armas autónomas. El apoyo interno de la industria fortalece la posición negociadora de Anthropic con el Departamento de Defensa."
      }
    }
  },
  {
    "title": "We don&#8217;t have to have unsupervised killer robots",
    "slug": "unsupervised-killer-robots-pentagon-ai",
    "url": "https://www.theverge.com/ai-artificial-intelligence/885963/anthropic-dod-pentagon-tech-workers-ai-labs-react",
    "source": "The Verge",
    "date": "2026-02-27T16:18:26.000Z",
    "summary": "As Pentagon negotiations with Anthropic reach a critical juncture, tech workers across the industry are examining their own companies' military contracts. The standoff centers on whether the US military should have unrestricted AI access for mass surveillance and autonomous lethal weapons. The article explores whether current military AI trajectories are inevitable or if alternative approaches exist.",
    "content": "It's the day of the Pentagon's looming ultimatum for Anthropic: allow the US military unchecked access to its technology, including for mass surveillance and fully autonomous lethal weapons, or potentially be designated a \"supply chain risk\" and potentially lose hundreds of billions of dollars in contracts. Amid the intensifying public statements and threats, tech workers across the industry are looking at their own companies' government and military contracts  wondering what kind of future they're helping to build. \nWhile the Department of Defense has spent weeks negotiating with Anthropic over removing its guardrails, including allowing t …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "我们不一定要拥有无人监督的杀手机器人",
        "summary": "随着Anthropic与五角大楼的谈判进入关键阶段,科技行业的工作者正在审视他们所在公司的军事合同。僵局的中心是美国军方是否应该拥有对大规模监视和自主致命武器的不受限制的AI访问权限。文章探讨了当前军事AI轨迹是否不可避免,或者是否存在替代方案。"
      },
      "fr": {
        "title": "Nous n'avons pas besoin d'avoir des robots tueurs sans surveillance",
        "summary": "Alors que les négociations du Pentagone avec Anthropic atteignent un moment critique, les travailleurs du secteur technologique examinent les contrats militaires de leurs propres entreprises. L'impasse porte sur la question de savoir si l'armée américaine devrait avoir un accès illimité à l'IA pour la surveillance de masse et les armes letales autonomes. L'article explore si les trajectoires actuelles de l'IA militaire sont inévitables ou si des approches alternatives existent."
      },
      "de": {
        "title": "Wir müssen keine unbeaufsichtigten Killerroboter haben",
        "summary": "Während die Pentagon-Verhandlungen mit Anthropic einen kritischen Punkt erreichen, untersuchen Technologiefachleute in der Branche die Militärverträge ihrer eigenen Unternehmen. Der Streitpunkt konzentriert sich darauf, ob das US-Militär unbegrenzten KI-Zugang für Massenüberwachung und autonome tödliche Waffen haben sollte. Der Artikel untersucht, ob aktuelle militärische KI-Trajektorien unvermeidlich sind oder ob alternative Ansätze existieren."
      },
      "es": {
        "title": "No tenemos que tener robots asesinos sin supervisión",
        "summary": "Cuando las negociaciones del Pentágono con Anthropic llegan a un momento crítico, los trabajadores tecnológicos de toda la industria están examinando los contratos militares de sus propias empresas. El punto de conflicto se centra en si el ejército estadounidense debería tener acceso irrestricto a la IA para vigilancia masiva y armas letales autónomas. El artículo explora si las trayectorias actuales de IA militar son inevitables o si existen enfoques alternativos."
      }
    }
  },
  {
    "title": "And the award for the most improved EV goes to... the 2026 Toyota bZ",
    "slug": "2026-toyota-bz-most-improved-ev",
    "url": "https://arstechnica.com/cars/2026/02/and-the-award-for-the-most-improved-ev-goes-to-the-2026-toyota-bz/",
    "source": "Ars Technica",
    "date": "2026-02-27T16:13:51.000Z",
    "summary": "Toyota's 2026 bZ electric SUV features significant revisions and improved efficiency compared to previous generations. The updated model represents meaningful progress in Toyota's electric vehicle portfolio. The improvements position the bZ as one of 2026's most improved electric vehicles.",
    "content": "Toyota's small electric SUV is much-revised, much more efficient, and much better.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "最受改进电动车奖得主是...2026年丰田bZ",
        "summary": "丰田2026年bZ电动SUV相比前代车型进行了重大修订和效率改进。更新的车型代表了丰田电动汽车产品线的有意义的进步。这些改进使bZ成为2026年最受改进的电动汽车之一。"
      },
      "fr": {
        "title": "Et le prix de l'EV le plus amélioré revient à... le Toyota bZ 2026",
        "summary": "Le SUV électrique bZ 2026 de Toyota présente des révisions importantes et une efficacité améliorée par rapport aux générations précédentes. Le modèle mis à jour représente des progrès significatifs dans le portefeuille de véhicules électriques de Toyota. Les améliorations positionnent le bZ comme l'un des véhicules électriques les plus améliorés de 2026."
      },
      "de": {
        "title": "Und der Preis für das am meisten verbesserte Elektrofahrzeug geht an... den 2026 Toyota bZ",
        "summary": "Das Toyota bZ Elektro-SUV 2026 bietet bedeutende Überarbeitungen und verbesserte Effizienz im Vergleich zu früheren Generationen. Das aktualisierte Modell stellt einen bedeutsamen Fortschritt in Toyotas Elektrofahrzeugportfolio dar. Die Verbesserungen positionieren den bZ als eines der am meisten verbesserten Elektrofahrzeuge 2026."
      },
      "es": {
        "title": "Y el premio al vehículo eléctrico más mejorado es... el Toyota bZ 2026",
        "summary": "El SUV eléctrico bZ 2026 de Toyota presenta revisiones significativas y mayor eficiencia en comparación con generaciones anteriores. El modelo actualizado representa un progreso significativo en la cartera de vehículos eléctricos de Toyota. Las mejoras posicionan el bZ como uno de los vehículos eléctricos más mejorados de 2026."
      }
    }
  },
  {
    "title": "CISA replaces acting director after a bumbling year on the job",
    "slug": "cisa-replaces-acting-director-madhu-gottumukkala",
    "url": "https://techcrunch.com/2026/02/27/cisa-replaces-acting-director-gottumukkala-after-a-bumbling-year-on-the-job/",
    "source": "TechCrunch",
    "date": "2026-02-27T15:57:02.000Z",
    "summary": "CISA is replacing acting director Madhu Gottumukkala after a troubled tenure marked by budget cuts, layoffs, and staff reassignments. The departure follows allegations of security lapses and leadership concerns during a critical period for US cybersecurity infrastructure. The replacement signals a new direction for the federal cybersecurity agency.",
    "content": "The U.S. cybersecurity agency's acting director Madhu Gottumukkala will be replaced, after a year of cuts, layoffs, and staff reassignments, and allegations of security lapses and claims he struggled to lead the agency.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "CISA在一年的混乱工作后更换代理主任",
        "summary": "CISA在首任代理主任Madhu Gottumukkala的任期因预算削减、裁员和员工调配而陷入困境后，决定更换其领导。这次离职是在安全漏洞指控和美国网络安全基础设施关键时期的领导力问题之后发生的。这次更换标志着联邦网络安全机构新方向的开始。"
      },
      "fr": {
        "title": "L'AICSP remplace le directeur par intérim après une année chaotique",
        "summary": "L'AICSP remplace le directeur par intérim Madhu Gottumukkala après un mandat difficile marqué par des réductions budgétaires, des licenciements et des réaffectations de personnel. Le départ fait suite à des allégations de failles de sécurité et de préoccupations en matière de leadership lors d'une période critique pour l'infrastructure de cybersécurité américaine. Le remplacement signale une nouvelle orientation pour l'agence fédérale de cybersécurité."
      },
      "de": {
        "title": "CISA ersetzt stellvertretenden Direktor nach turbulenten Jahr",
        "summary": "CISA ersetzt stellvertretenden Direktor Madhu Gottumukkala nach einer schwierigen Amtszeit, die durch Budgetkürzungen, Entlassungen und Personalversetzungen gekennzeichnet ist. Der Rücktritt folgt Vorwürfen von Sicherheitsmängeln und Führungsbedenken in einer kritischen Phase für die US-Cybersicherheitsinfrastruktur. Der Wechsel signalisiert eine neue Richtung für die föderale Cybersicherheitsbehörde."
      },
      "es": {
        "title": "CISA reemplaza al director interino después de un año caótico",
        "summary": "CISA reemplaza al director interino Madhu Gottumukkala después de un mandato difícil marcado por recortes presupuestarios, despidos y reasignaciones de personal. La salida sigue a alegaciones de brechas de seguridad y preocupaciones de liderazgo durante un período crítico para la infraestructura de ciberseguridad estadounidense. El reemplazo señala una nueva dirección para la agencia federal de ciberseguridad."
      }
    }
  },
  {
    "title": "The US military reportedly shot down a CBP drone with a laser",
    "slug": "us-military-shot-down-cbp-drone-laser",
    "url": "https://www.theverge.com/policy/886021/us-military-cbp-drone-laser-texas",
    "source": "The Verge",
    "date": "2026-02-27T15:43:43.000Z",
    "summary": "The US military accidentally shot down a Customs and Border Protection drone using an anti-drone laser near the Mexican border in Fort Hancock, Texas. The incident prompted FAA airspace closure, marking the second similar incident this month involving anti-drone laser operations. The mishaps highlight coordination challenges between military and civilian aviation operations.",
    "content": "The US-Mexico border in Fort Hancock, Texas. | Photographer: Luke Sharrett/Bloomberg via Getty Images\t\n\nThe US military mistakenly shot down a drone belonging to Customs and Border Protection near the Mexican border in Fort Hancock, Texas, according to reports from Reuters and The New York Times. The Thursday incident reportedly led the Federal Aviation Administration to close the airspace where the military fired the anti-drone laser.\nThis marks the second time this month that officials closed airspace near the US-Mexico border due to an incident involving an anti-drone laser. On February 11th, officials closed airspace around the El Paso International Airport for hours after CBP fired an anti-drone laser without coordinating with the FAA, T …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "美国军方据报用激光击落了CBP无人机",
        "summary": "美国军方在得克萨斯州韦科堡附近用反无人机激光意外击落了一架美国海关和边境保护局无人机。这一事件促使美国联邦航空管理局关闭空域，这是本月第二起涉及反无人机激光操作的类似事件。这些失误突出了军事和民用航空运营之间的协调挑战。"
      },
      "fr": {
        "title": "L'armée américaine aurait abattu un drone de la CBP avec un laser",
        "summary": "L'armée américaine a accidentellement abattu un drone des douanes et de la protection des frontières à l'aide d'un laser anti-drone près de la frontière mexicaine à Fort Hancock, au Texas. L'incident a entraîné une fermeture de l'espace aérien de la FAA, marquant le deuxième incident similaire ce mois-ci impliquant des opérations de laser anti-drone. Ces incidents soulignent les défis de coordination entre les opérations militaires et aériennes civiles."
      },
      "de": {
        "title": "Das US-Militär schoss einer CBP-Drohne angeblich mit einem Laser ab",
        "summary": "Das US-Militär schoss versehentlich eine Drohne der Zoll- und Grenzschutzbehörde mit einem Anti-Drohnen-Laser in der Nähe der mexikanischen Grenze in Fort Hancock, Texas ab. Der Vorfall führte zu einer Sperrung des FAA-Luftraums und markiert den zweiten ähnlichen Vorfall diesen Monat mit Anti-Drohnen-Laser-Operationen. Diese Zwischenfälle zeigen Koordinierungsprobleme zwischen militärischen und zivilen Flugbetrieben."
      },
      "es": {
        "title": "El ejército estadounidense aparentemente derribó un dron de la CBP con un láser",
        "summary": "El ejército estadounidense derribó accidentalmente un dron de Aduanas y Protección Fronteriza usando un láser anti-dron cerca de la frontera mexicana en Fort Hancock, Texas. El incidente provocó el cierre del espacio aéreo de la FAA, marcando el segundo incidente similar este mes que involucra operaciones de láser anti-dron. Los percances destacan desafíos de coordinación entre operaciones militares y de aviación civil."
      }
    }
  },
  {
    "title": "Here&#8217;s your first look at Kratos in Amazon&#8217;s God of War show",
    "slug": "amazon-god-of-war-kratos-ryan-hurst",
    "url": "https://www.theverge.com/streaming/886008/amazon-god-of-war-kratos-image",
    "source": "The Verge",
    "date": "2026-02-27T15:19:14.000Z",
    "summary": "Amazon has revealed its first images from the live-action God of War adaptation, showing Ryan Hurst as Kratos and Callum Vinson as Atreus. The casting appears to faithfully adapt the video game characters for television portrayal. The reveal marks a significant milestone in Amazon's adaptation of the acclaimed gaming franchise.",
    "content": "Amazon has slowly been teasing out casting details for its live-action adaptation of God of War, and now we have our first look at the show. It's a single image but a notable one showing protagonist Kratos and his son Atreus. The characters are played by Ryan Hurst and Callum Vinson, respectively, and they look relatively close to their video game counterparts.\nThere aren't a lot of other details about the show just yet, but this is Amazon's official description:\nThe God of War series storyline follows father and son Kratos and Atreus as they embark on a journey to spread the ashes of their wife and mother, Faye. Through their adventures, …\n\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "亚马逊God of War秀中克拉托斯的首次亮相",
        "summary": "亚马逊公布了真人版《战神》改编的首批图片，展示了瑞恩·赫斯特扮演克拉托斯，卡勒姆·文森扮演阿特柔斯。这次选角似乎忠实地将电子游戏角色改编为电视形象。这次曝光标志着亚马逊改编这部受好评的游戏特许经营权的重要里程碑。"
      },
      "fr": {
        "title": "Voici votre premier aperçu de Kratos dans le spectacle God of War d'Amazon",
        "summary": "Amazon a révélé ses premières images de l'adaptation en direct de God of War, montrant Ryan Hurst en tant que Kratos et Callum Vinson en tant qu'Atreus. Le choix de casting semble adapter fidèlement les personnages du jeu vidéo pour la représentation télévisée. La révélation marque une étape importante dans l'adaptation d'Amazon de la franchise de jeu acclamée."
      },
      "de": {
        "title": "Hier ist dein erster Blick auf Kratos in Amazons God of War Show",
        "summary": "Amazon hat die ersten Bilder der Live-Action-Adaptation von God of War veröffentlicht, die Ryan Hurst als Kratos und Callum Vinson als Atreus zeigen. Die Besetzung scheint die Videospielcharaktere treu für die Fernsehdarstellung anzupassen. Die Enthüllung markiert einen wichtigen Meilenstein in Amazons Adaptation des gefeierten Gaming-Franchises."
      },
      "es": {
        "title": "Aquí está tu primer vistazo a Kratos en el show God of War de Amazon",
        "summary": "Amazon ha revelado sus primeras imágenes de la adaptación en vivo de God of War, mostrando a Ryan Hurst como Kratos y Callum Vinson como Atreus. El elenco parece adaptar fielmente los personajes del videojuego para la representación televisiva. La revelación marca un hito importante en la adaptación de Amazon de la franquicia de juegos aclamada."
      }
    }
  },
  {
    "title": "The Galaxy S26 is a photography nightmare",
    "slug": "galaxy-s26-photography-nightmare",
    "url": "https://www.theverge.com/podcast/885942/samsung-galaxy-s26-ai-camera-nightmare-vergecast",
    "source": "The Verge",
    "date": "2026-02-27T15:15:52.000Z",
    "summary": "Samsung's Galaxy S26 introduces new camera features that critics describe as problematic rather than improvements to the flagship line. While other upgrades like the Privacy Display on the S26 Ultra offer practical benefits, the camera changes raise concerns about Samsung's direction. The camera technology strategy represents a notable departure from previous generations.",
    "content": "In many ways, Samsung's new phones are fairly normal upgrades. The S26 lines come with some useful new things - particularly the Privacy Display on the S26 Ultra, which looks like an extremely cool bit of tech and a really useful new feature - and a lot of iterative year-over-year changes. The new camera features, on the other hand, are neither of those things. They're something worse. Something scarier.\n\nVerge subscribers, don't forget you get exclusive access to ad-free Vergecast wherever you get your podcasts. Head here. Not a subscriber? You can sign up here.\nOn this episode of The Vergecast, Nilay and David discuss the new phones,  …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Galaxy S26是摄影噩梦",
        "summary": "三星Galaxy S26推出的新摄像头功能遭到评论家批评，被认为是问题而非旗舰系列的改进。虽然S26 Ultra上的隐私显示屏等其他升级提供了实际好处，但摄像头的变化引发了对三星方向的担忧。摄像头技术战略代表了与前几代产品的显著偏离。"
      },
      "fr": {
        "title": "Le Galaxy S26 est un cauchemar photographique",
        "summary": "Samsung Galaxy S26 introduit de nouvelles fonctionnalités caméra que les critiques décrivent comme problématiques plutôt que comme des améliorations de la gamme phare. Bien que d'autres mises à niveau comme l'affichage de confidentialité sur le S26 Ultra offrent des avantages pratiques, les modifications de la caméra soulèvent des préoccupations concernant la direction de Samsung. La stratégie technologique des caméras représente une évolution notable par rapport aux générations précédentes."
      },
      "de": {
        "title": "Das Galaxy S26 ist ein Fotografie-Albtraum",
        "summary": "Das Samsung Galaxy S26 führt neue Kamerafunktionen ein, die Kritiker als problematisch und nicht als Verbesserung der Flaggschiff-Serie beschreiben. Während andere Upgrades wie die Datenschutzanzeige auf dem S26 Ultra praktische Vorteile bieten, werfen die Kameraänderungen Fragen zur Richtung von Samsung auf. Die Kameratechnologiestrategie stellt einen bemerkenswerten Abbruch zu früheren Generationen dar."
      },
      "es": {
        "title": "El Galaxy S26 es una pesadilla fotográfica",
        "summary": "Samsung Galaxy S26 introduce nuevas características de cámara que los críticos describen como problemáticas en lugar de mejoras en la línea insignia. Si bien otras mejoras como la Pantalla de Privacidad en el S26 Ultra ofrecen beneficios prácticos, los cambios de cámara generan preocupaciones sobre la dirección de Samsung. La estrategia de tecnología de cámara representa una partida notable de generaciones anteriores."
      }
    }
  },
  {
    "title": "Netflix cedes Warner Bros. Discovery to Paramount: “No longer financially attractive”",
    "slug": "netflix-cedes-warner-bros-discovery-paramount",
    "url": "https://arstechnica.com/gadgets/2026/02/netflix-cedes-warner-bros-discovery-to-paramount-no-longer-financially-attractive/",
    "source": "Ars Technica",
    "date": "2026-02-27T15:13:48.000Z",
    "summary": "Netflix has ended its content licensing partnership with Warner Bros. Discovery, stating it is \"no longer financially attractive.\" The strategic decision led to a jump in Netflix's stock price as investors responded positively. The move reflects shifting economics in the competitive streaming marketplace and Netflix's evolving content strategy.",
    "content": "Netflix shares jumped following the announcement.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Netflix放弃华纳兄弟探索频道给派拉蒙：\"不再具有经济吸引力\"",
        "summary": "Netflix已终止与华纳兄弟探索频道的内容许可合作，声称其\"不再具有经济吸引力\"。这一战略决定导致Netflix股价上涨，投资者对此反应积极。此举反映了竞争激烈的流媒体市场中经济格局的转变以及Netflix内容战略的演变。"
      },
      "fr": {
        "title": "Netflix cède Warner Bros. Discovery à Paramount : « N'est plus financièrement attractif »",
        "summary": "Netflix a mis fin à son partenariat de licence de contenu avec Warner Bros. Discovery, affirmant qu'il n'est plus financièrement attractif. La décision stratégique a entraîné une augmentation du prix de l'action Netflix, car les investisseurs ont réagi positivement. Cette mesure reflète l'évolution de l'économie sur le marché concurrentiel du streaming et l'évolution de la stratégie de contenu de Netflix."
      },
      "de": {
        "title": "Netflix tritt Warner Bros. Discovery an Paramount ab: „Nicht mehr finanziell attraktiv\"",
        "summary": "Netflix hat seine Inhaltslizenzkpartnerschaft mit Warner Bros. Discovery beendet und erklärt, dass sie „nicht mehr finanziell attraktiv\" ist. Die strategische Entscheidung führte zu einem Anstieg des Netflix-Aktienkurses, da Investoren positiv reagierten. Der Schritt spiegelt die sich verschiebende Wirtschaftlichkeit auf dem wettbewerbsintensiven Streaming-Markt wider und zeigt Netflixs sich entwickelnde Content-Strategie."
      },
      "es": {
        "title": "Netflix cede Warner Bros. Discovery a Paramount: \"Ya no es financieramente atractivo\"",
        "summary": "Netflix ha terminado su asociación de licencia de contenido con Warner Bros. Discovery, afirmando que ya no es \"financieramente atractivo\". La decisión estratégica provocó un aumento en el precio de las acciones de Netflix, ya que los inversores respondieron positivamente. El movimiento refleja el cambio de la economía en el mercado competitivo del streaming y la estrategia de contenido en evolución de Netflix."
      }
    }
  },
  {
    "title": "NASA shakes up its Artemis program to speed up lunar return",
    "slug": "nasa-artemis-program-lunar-return-faster",
    "url": "https://arstechnica.com/staff/2026/02/nasa-shakes-up-its-artemis-program-to-speed-up-lunar-return/",
    "source": "Ars Technica",
    "date": "2026-02-27T15:08:08.000Z",
    "summary": "NASA is restructuring its Artemis program to accelerate the timeline for human lunar return, moving away from its current multi-year Space Launch System launch cadence. The overhaul reflects recognition that launching the SLS every three-and-a-half years cannot sustain mission objectives. The changes prioritize faster, more frequent lunar missions for NASA's renewed exploration agenda.",
    "content": "\"Launching SLS every three and a half years or so is not a recipe for success.\"",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "NASA改革阿尔忒弥斯计划以加快月球返回",
        "summary": "NASA正在重组其阿尔忒弥斯计划，以加快人类月球返回的时间表，从目前的多年空间发射系统发射频率转变。这次改革反映了人们对每三年半发射一次SLS无法维持任务目标的认识。这些变化优先考虑更快、更频繁的月球任务，以实现NASA新的探索议程。"
      },
      "fr": {
        "title": "La NASA secoue son programme Artemis pour accélérer le retour lunaire",
        "summary": "La NASA restructure son programme Artemis pour accélérer le calendrier du retour humain sur la Lune, s'éloignant de son actuel cadence de lancement du Système de lancement spatial sur plusieurs années. La refonte reflète la reconnaissance que lancer le SLS tous les trois ans et demi ne peut pas soutenir les objectifs de mission. Les changements priorisent les missions lunaires plus rapides et plus fréquentes pour le nouvel agenda d'exploration de la NASA."
      },
      "de": {
        "title": "NASA schüttelt sein Artemis-Programm auf, um die Rückkehr zum Mond zu beschleunigen",
        "summary": "Die NASA strukturiert sein Artemis-Programm um, um den Zeitplan für die menschliche Rückkehr zum Mond zu beschleunigen und sich von ihrer derzeitigen mehrjährigen Startfrequenz des Space Launch Systems zu entfernen. Die Überholung spiegelt die Erkenntnis wider, dass das Starten des SLS alle dreieinhalb Jahre die Missionsziele nicht aufrechterhalten kann. Die Änderungen priorisieren schnellere und häufigere Mondmissionen für Nasas erneuerte Explorationspolitik."
      },
      "es": {
        "title": "NASA sacude su programa Artemis para acelerar el regreso a la Luna",
        "summary": "La NASA está reestructurando su programa Artemis para acelerar el cronograma del regreso humano a la Luna, alejándose de su actual ritmo de lanzamiento del Sistema de Lanzamiento Espacial de varios años. La revisión refleja el reconocimiento de que lanzar el SLS cada tres años y medio no puede sostener los objetivos de la misión. Los cambios priorizan misiones lunares más rápidas y frecuentes para la agenda de exploración renovada de la NASA."
      }
    }
  },
  {
    "title": "Ultrahuman’s new flagship smart ring has a 15-day battery",
    "slug": "ultrahuman-ring-pro-15-day-battery",
    "url": "https://www.theverge.com/tech/885866/ultrahuman-ring-pro-jade-ai-launch-price-availability",
    "source": "The Verge",
    "date": "2026-02-27T12:00:48.000Z",
    "summary": "Ultrahuman has launched its third-generation Ring Pro smart ring with up to 15 days of battery life and 250 days of on-device health history storage, representing significant improvements over its 2023 predecessor which offered only 4-6 days of battery life. The Ring Pro comes with an enhanced charging case that extends total battery life to 45 days, and the company is also upgrading its health monitoring platform with a new 'biointelligence AI' integration.",
    "content": "The Ultrahuman Ring Pro comes with a snazzy Pro Charging Case for up to 45 days of additional battery life. | Image: Ultrahuman\t\n\nUltrahuman is expanding its health monitoring ecosystem with the launch of a new flagship smart ring and a \"biointelligence AI\" platform upgrade. The Ring Pro is Ultrahuman's third-generation smart ring, and promises up to 15 days of battery life before needing to recharge, alongside 250 days of on-device health history storage.\nThose are some significant improvements compared to its predecessor, the 2023 Ring Air, which provides 4-6 days of battery life and several days of offline data storage, according to user estimates. Ultrahuman has also made other upgrades to the Ring Pro, including a redesigned heart-rate sensor that improves signal …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Ultrahuman新旗舰智能戒指续航15天",
        "summary": "Ultrahuman推出了第三代Ring Pro智能戒指，电池续航可达15天，设备存储容量可存储250天的健康历史记录，相比2023年的前代产品（仅提供4-6天续航）有了显著提升。Ring Pro配备增强型充电盒，可将总续航时间延长至45天，该公司还通过新的\"生物智能AI\"集成来升级其健康监测平台。"
      },
      "fr": {
        "title": "Le nouvel anneau intelligent phare d'Ultrahuman a 15 jours d'autonomie",
        "summary": "Ultrahuman a lancé sa bague intelligente Ring Pro de troisième génération avec jusqu'à 15 jours d'autonomie de batterie et 250 jours de stockage d'historique de santé sur l'appareil, ce qui représente des améliorations significatives par rapport à son prédécesseur de 2023 qui n'offrait que 4-6 jours d'autonomie. La Ring Pro est fournie avec un étui de recharge amélioré qui prolonge l'autonomie totale de la batterie à 45 jours, et la société met également à niveau sa plateforme de surveillance de la santé avec une nouvelle intégration d'« IA biointelligence »."
      },
      "de": {
        "title": "Ultrahuman's neuer Flaggschiff-Smartring hat 15 Tage Akkulaufzeit",
        "summary": "Ultrahuman hat seinen Smart Ring Ring Pro der dritten Generation mit bis zu 15 Tagen Akkulaufzeit und 250 Tagen Speicherung von Gesundheitsverlauf auf dem Gerät eingeführt, was erhebliche Verbesserungen gegenüber seinem Vorgänger aus 2023 darstellt, der nur 4-6 Tage Akkulaufzeit bot. Der Ring Pro wird mit einem verbesserten Ladecase geliefert, das die Gesamtakkulaufzeit auf 45 Tage verlängert, und das Unternehmen aktualisiert auch seine Gesundheitsüberwachungsplattform mit einer neuen „Biointelligenz-KI\"-Integration."
      },
      "es": {
        "title": "El nuevo anillo inteligente insignia de Ultrahuman tiene 15 días de batería",
        "summary": "Ultrahuman ha lanzado su anillo inteligente Ring Pro de tercera generación con hasta 15 días de duración de batería y 250 días de almacenamiento del historial de salud en el dispositivo, lo que representa mejoras significativas respecto a su predecesor de 2023 que ofrecía solo 4-6 días de duración. El Ring Pro viene con un estuche de carga mejorado que extiende la duración total de la batería a 45 días, y la empresa también está mejorando su plataforma de monitoreo de salud con una nueva integración de \"IA biointeligencia\"."
      }
    }
  },
  {
    "title": "Notes from a Burmese Prison",
    "slug": "notes-burmese-prison",
    "url": "https://www.theverge.com/cs/features/820915/notes-burmese-prison-comic",
    "source": "The Verge",
    "date": "2026-02-27T12:00:00.000Z",
    "summary": "This story is a comic by Danny Fenster and Amy Kurzweil about a Burmese prison, but it is not viewable through RSS readers and must be read directly on The Verge's website.",
    "content": "This story is a comic by Danny Fenster and Amy Kurzweil and is not compatible with RSS readers. But you can (and should) read it at The Verge’s website.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "缅甸监狱笔记",
        "summary": "这是由Danny Fenster和Amy Kurzweil创作的关于缅甸监狱的漫画故事，但无法通过RSS阅读器查看，必须直接在The Verge网站上阅读。"
      },
      "fr": {
        "title": "Notes d'une prison birmane",
        "summary": "Il s'agit d'une bande dessinée de Danny Fenster et Amy Kurzweil sur une prison birmane, mais elle n'est pas visible par les lecteurs RSS et doit être lue directement sur le site Web de The Verge."
      },
      "de": {
        "title": "Notizen aus einem burmesischen Gefängnis",
        "summary": "Dies ist ein Comic von Danny Fenster und Amy Kurzweil über ein burmesisches Gefängnis, aber es ist nicht über RSS-Reader sichtbar und muss direkt auf der Website von The Verge gelesen werden."
      },
      "es": {
        "title": "Notas de una prisión birmana",
        "summary": "Esta es una historia de cómic de Danny Fenster y Amy Kurzweil sobre una prisión birmana, pero no se puede ver a través de lectores RSS y debe leerse directamente en el sitio web de The Verge."
      }
    }
  },
  {
    "title": "Phones are going to get weird next week",
    "slug": "phones-going-get-weird-mobile-world-congress",
    "url": "https://www.theverge.com/tech/885287/mwc-2026-what-to-expect-phones-mobile-weird",
    "source": "The Verge",
    "date": "2026-02-27T12:00:00.000Z",
    "summary": "Mobile World Congress is expected to showcase numerous innovative and unconventional phones and devices from manufacturers worldwide, particularly Chinese companies and niche makers, breaking away from the increasingly uniform smartphone market. The event will feature everything from modular phones to devices with unusual specifications and extraordinary features.",
    "content": "Honor’s Robot Phone is set to make an appearance, and this time we might actually see it switched on. | Photo: Dominic Preston / The Verge\t\n\nWith rare exceptions, phones are pretty boring these days. The good news is, a boatload of those rare exceptions are about to show up at once, courtesy of Mobile World Congress.\nThe tech industry's biggest mobile show may not quite have the clout it once did, when the likes of Samsung, Sony, LG, and HTC showcased new flagships there each year, but it still attracts more phone launches than CES does two months earlier. It's especially popular with the Chinese manufacturers who are still fighting for space in the global market, along with niche manufacturers who turn up with extra-durable \"rugged\" devices, or battery beasts that are more powe …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "下周手机将变得很奇怪",
        "summary": "移动世界大会预计将展示来自全球制造商（特别是中国公司和小众品牌）的众多创新和非常规手机和设备，打破越来越趋同的智能手机市场。该活动将展出从模块化手机到具有不寻常规格和非凡功能的设备。"
      },
      "fr": {
        "title": "Les téléphones vont devenir bizarres la semaine prochaine",
        "summary": "Le Mobile World Congress devrait présenter de nombreux téléphones et appareils innovants et non conventionnels de fabricants du monde entier, en particulier des entreprises chinoises et des créateurs de niche, s'éloignant du marché des smartphones de plus en plus uniforme. L'événement présentera tout, des téléphones modulaires aux appareils avec des spécifications inhabituelles et des fonctionnalités extraordinaires."
      },
      "de": {
        "title": "Nächste Woche werden Telefone seltsam",
        "summary": "Die Mobile World Congress wird voraussichtlich zahlreiche innovative und unkonventionelle Telefone und Geräte von Herstellern weltweit präsentieren, insbesondere von chinesischen Unternehmen und Nischenmachern, wodurch sich der Smartphone-Markt von seiner zunehmend einheitlichen Struktur entfernt. Die Veranstaltung wird alles von modularen Telefonen bis zu Geräten mit ungewöhnlichen Spezifikationen und außergewöhnlichen Funktionen zeigen."
      },
      "es": {
        "title": "Los teléfonos se volverán raros la próxima semana",
        "summary": "Se espera que el Mobile World Congress presente numerosos teléfonos y dispositivos innovadores y no convencionales de fabricantes en todo el mundo, particularmente empresas chinas y creadores de nicho, alejándose del mercado de smartphones cada vez más uniforme. El evento presentará desde teléfonos modulares hasta dispositivos con especificaciones inusuales y características extraordinarias."
      }
    }
  },
  {
    "title": "MWC 2026: all the phones, gadgets, and announcements from Barcelona",
    "slug": "mwc-2026-phones-gadgets-announcements-barcelona",
    "url": "https://www.theverge.com/tech/882980/mwc-2026-news-phones-gadgets-announcements",
    "source": "The Verge",
    "date": "2026-02-27T11:49:00.000Z",
    "summary": "Mobile World Congress 2026 in Barcelona will feature major announcements from leading technology companies including Xiaomi, Honor, Samsung, Google, and Nothing, with expected introductions of cutting-edge smartphones, tablets, and wearables. The show is expected to showcase both established products and experimental devices, continuing the tradition of featuring unusual designs and innovative technologies.",
    "content": "The Verge is heading to Barcelona, Spain, for Mobile World Congress, the biggest phone show of the year.\nCES may dominate the headlines when it comes to TVs, computer components, and AI inanity, but for all things mobile, MWC has it beat. Since it’s a global show, that includes all manner of announcements of phones, tablets, and wearables that won’t necessarily release in the US.\nXiaomi has already teased a European launch for its 17 and 17 Ultra flagships, Honor is promising not only its Robot Phone but a full pivot to humanoid robotics, and Nothing is almost certain to drop more details on its Phone 4A ahead of a planned London launch on March 5th.\nThe likes of Samsung and Google will be there too, but mostly to talk about the already-announced 10A and S26 models, while Apple is launching something during the same week as MWC, but not actually in Barcelona.\nWe’ll also be looking out for oddities. Last year featured camera phone concepts with detachable lenses,  a Lenovo laptop with a folding screen, and an Infinix handset with a solar panel in its back. We’ll be hoping this year gets just as weird.\nKeep this page bookmarked for all the news, commentary, and first looks from the show floor.\nPhones are going to get weird next week\n\t\t\t\nXiaomi’s magnetic power bank is incredibly thin\n\t\t\t\nHonor’s new MagicPad 4 is the world’s thinnest Android tablet\n\t\t\t\nTecno is doing a modular phone (again).\n\t\t\t\nTaara Beam provides 25Gbps connectivity over invisible beams of light\n\t\t\t\nHonor is pivoting to robots.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "MWC 2026：来自巴塞罗那的所有手机、小工具和发布会",
        "summary": "2026年巴塞罗那世界移动通信大会将展示小米、荣耀、三星、谷歌和Nothing等领先科技公司的重要发布会，预计将推出尖端智能手机、平板电脑和可穿戴设备。该展会预计将展示成熟产品和实验性设备，延续展示不寻常设计和创新技术的传统。"
      },
      "fr": {
        "title": "MWC 2026 : tous les téléphones, gadgets et annonces de Barcelone",
        "summary": "Le Congrès mondial du mobile 2026 à Barcelone mettra en vedette les principales annonces des entreprises technologiques leaders, notamment Xiaomi, Honor, Samsung, Google et Nothing, avec des introductions attendues de smartphones, tablettes et appareils portables de pointe. Le salon devrait présenter des produits établis et des appareils expérimentaux, poursuivant la tradition de présenter des conceptions inhabituelles et des technologies innovantes."
      },
      "de": {
        "title": "MWC 2026: Alle Telefone, Gadgets und Ankündigungen aus Barcelona",
        "summary": "Der Mobile World Congress 2026 in Barcelona wird wichtige Ankündigungen führender Technologieunternehmen wie Xiaomi, Honor, Samsung, Google und Nothing zeigen, mit erwarteten Einführungen von hochmodernen Smartphones, Tablets und Wearables. Die Messe soll sowohl etablierte Produkte als auch experimentelle Geräte präsentieren und setzt damit die Tradition fort, ungewöhnliche Designs und innovative Technologien zu zeigen."
      },
      "es": {
        "title": "MWC 2026: todos los teléfonos, gadgets y anuncios de Barcelona",
        "summary": "El Congreso Mundial de Móviles 2026 en Barcelona presentará los principales anuncios de las principales empresas tecnológicas, incluyendo Xiaomi, Honor, Samsung, Google y Nothing, con introducciones esperadas de smartphones, tabletas y dispositivos portátiles de última generación. Se espera que la feria muestre productos establecidos y dispositivos experimentales, continuando la tradición de presentar diseños inusuales y tecnologías innovadoras."
      }
    }
  },
  {
    "title": "Ultrahuman bets on redesigned smart ring to win back U.S. market after Oura dispute",
    "slug": "ultrahuman-ring-pro-us-market-comeback",
    "url": "https://techcrunch.com/2026/02/27/ultrahuman-unveils-new-smart-ring-as-it-awaits-u-s-clearance-after-oura-dispute/",
    "source": "TechCrunch",
    "date": "2026-02-27T11:00:00.000Z",
    "summary": "Ultrahuman is launching its redesigned Ring Pro smart ring priced at $479 as a strategic move to regain market position in the U.S. wearables market following competition in the sector. The Ring Pro offers 15 days of battery life, representing a significant improvement in the competitive smart ring category.",
    "content": "Ultrahuman’s Ring Pro promises 15-day battery life and a $479 price tag as the wearables maker expands its health-tech push.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Ultrahuman押注重新设计的智能戒指以重新赢得美国市场，结束与Oura的纠纷",
        "summary": "Ultrahuman推出售价479美元的重新设计的Ring Pro智能戒指，作为在美国可穿戴设备市场中重新获得市场地位的战略举措。Ring Pro提供15天的电池寿命，代表了竞争激烈的智能戒指类别中的显著改进。"
      },
      "fr": {
        "title": "Ultrahuman mise sur une bague intelligente redessinée pour reconquérir le marché américain après le différend avec Oura",
        "summary": "Ultrahuman lance sa bague intelligente Ring Pro redessinée au prix de 479 dollars comme un mouvement stratégique pour retrouver sa position sur le marché des appareils portables aux États-Unis. La Ring Pro offre 15 jours d'autonomie, ce qui représente une amélioration significative dans la catégorie des bagues intelligentes compétitives."
      },
      "de": {
        "title": "Ultrahuman setzt auf neu gestalteten Smart Ring, um den US-Markt nach Oura-Streit zurückzugewinnen",
        "summary": "Ultrahuman bringt seinen neu gestalteten Smart Ring Ring Pro zum Preis von 479 Dollar als strategischen Schritt auf den Markt, um seine Marktposition auf dem US-Wearables-Markt zurückzugewinnen. Der Ring Pro bietet eine Akkulaufzeit von 15 Tagen, was eine erhebliche Verbesserung in der wettbewerbsintensiven Smartring-Kategorie darstellt."
      },
      "es": {
        "title": "Ultrahuman apuesta por un anillo inteligente rediseñado para recuperar el mercado estadounidense después de la disputa con Oura",
        "summary": "Ultrahuman lanza su anillo inteligente Ring Pro rediseñado con un precio de $479 como un movimiento estratégico para recuperar su posición en el mercado de dispositivos portátiles en EE.UU. El Ring Pro ofrece 15 días de duración de la batería, lo que representa una mejora significativa en la categoría de anillos inteligentes competitivos."
      }
    }
  },
  {
    "title": "Plaid valued at $8B in employee share sale",
    "slug": "plaid-valued-8-billion-employee-share-sale",
    "url": "https://techcrunch.com/2026/02/26/plaid-valued-at-8b-in-employee-share-sale/",
    "source": "TechCrunch",
    "date": "2026-02-27T07:19:05.000Z",
    "summary": "Payment infrastructure company Plaid achieved an $8 billion valuation in an employee share sale, marking a 31% increase from its previous $6.1 billion valuation reached in April. The milestone demonstrates investor confidence in Plaid's growing market position in payment technology.",
    "content": "The new valuation is a 31% increase from $6.1 billion Plaid reached in April.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Plaid在员工股份出售中估值80亿美元",
        "summary": "支付基础设施公司Plaid在员工股份出售中达到了80亿美元的估值，比之前在4月达到的60.1亿美元的估值增加了31%。这个里程碑表明投资者对Plaid在支付技术领域不断增长的市场地位的信心。"
      },
      "fr": {
        "title": "Plaid valorisé à 8 milliards de dollars lors d'une vente d'actions aux employés",
        "summary": "La société d'infrastructure de paiement Plaid a atteint une valorisation de 8 milliards de dollars lors d'une vente d'actions aux employés, marquant une augmentation de 31% par rapport à sa valorisation précédente de 6,1 milliards de dollars atteinte en avril. Cette étape démontre la confiance des investisseurs dans la position de marché croissante de Plaid dans la technologie des paiements."
      },
      "de": {
        "title": "Plaid mit 8 Milliarden Dollar in Mitarbeitereigentumsverkauf bewertet",
        "summary": "Das Zahlungsinfrastruktur-Unternehmen Plaid erreichte eine Bewertung von 8 Milliarden Dollar in einem Mitarbeitereigentumsverkauf, was einer Steigerung von 31% gegenüber seiner vorherigen Bewertung von 6,1 Milliarden Dollar im April entspricht. Dies zeigt das Vertrauen der Investoren in Plaids wachsende Marktposition in der Zahlungstechnologie."
      },
      "es": {
        "title": "Plaid valorado en $8 mil millones en venta de acciones de empleados",
        "summary": "La empresa de infraestructura de pagos Plaid logró una valoración de $8 mil millones en una venta de acciones de empleados, marcando un aumento del 31% desde su valoración anterior de $6.1 mil millones alcanzada en abril. Este hito demuestra la confianza de los inversores en la posición de mercado creciente de Plaid en tecnología de pagos."
      }
    }
  }
]