[
  {
    "title": "Oh great, here comes 6G",
    "slug": "oh-great-here-comes-6g",
    "url": "https://www.theverge.com/tech/886558/6g-satellite-ai-isac",
    "source": "The Verge",
    "date": "2026-03-02T11:30:00.000Z",
    "summary": "6G standard establishment will be a major topic at Mobile World Congress 2026 in Barcelona. Like previous wireless standards, 6G will likely follow 5G's pattern of incremental improvements rather than delivering immediate revolutionary changes to daily life.",
    "content": "It’s like 5G, but one more. | Image: Cath Virginia / The Verge, Getty Images\t\n\nIt brings me no pleasure to say this, but friends: The next G cometh. \nThe standard formally known as 6G is still being established, but it's going to be a major topic of discussion at Mobile World Congress 2026, which gets started today in Barcelona. \n5G arrived back in 2019, but also, did it, entirely? You may have noticed a distinct lack of the robot surgeons and streets dominated by autonomous vehicles that standard was supposed to enable in your daily life. Like the Gs that arrived before, 5G continues to evolve through new \"releases\" every few years - a case of incremental progress that couldn't possibly live up to all that hype. Tha …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "哎呀，6G来了",
        "summary": "6G标准的制定将是2026年巴塞罗那移动世界大会的重要议题。与之前的无线标准一样，6G可能会遵循5G的渐进式改进模式，而不是为日常生活带来立竿见影的革命性变化。"
      },
      "fr": {
        "title": "Oh là là, voici la 6G",
        "summary": "L'établissement de la norme 6G sera un sujet majeur au Mobile World Congress 2026 à Barcelone. Comme les normes sans fil précédentes, la 6G suivra probablement le modèle d'améliorations progressives de la 5G plutôt que d'apporter des changements révolutionnaires immédiats à la vie quotidienne."
      },
      "de": {
        "title": "Oh je, da kommt die 6G",
        "summary": "Die Etablierung des 6G-Standards wird ein Hauptthema auf der Mobile World Congress 2026 in Barcelona sein. Wie frühere drahtlose Standards wird 6G wahrscheinlich dem Muster inkrementeller Verbesserungen von 5G folgen, anstatt sofortige revolutionäre Veränderungen im täglichen Leben zu bringen."
      },
      "es": {
        "title": "Oh no, aquí viene 6G",
        "summary": "El establecimiento del estándar 6G será un tema importante en el Mobile World Congress 2026 en Barcelona. Como los estándares inalámbricos anteriores, es probable que 6G siga el patrón de mejoras incrementales de 5G en lugar de traer cambios revolucionarios inmediatos a la vida cotidiana."
      }
    }
  },
  {
    "title": "Tecno’s latest concept phone is lit by neon",
    "slug": "tecno-latest-concept-phone-lit-by-neon",
    "url": "https://www.theverge.com/gadgets/886923/tecnos-latest-concept-phone-is-lit-by-neon",
    "source": "The Verge",
    "date": "2026-03-02T09:00:00.000Z",
    "summary": "Tecno unveiled two concept smartphone designs featuring innovative finishes. The Pova Neon includes genuine ionized gas neon lighting for a glowing effect, while the AI EInk model uses color-changing electronic ink adjustable via the phone's camera.",
    "content": "The Neon supposedly includes actual neon lighting in the rear. | Image: Tecno\t\n\nAfter teasing a magnetic, modular smartphone concept the other day, Tecno has followed that up with another two phone designs centered around color-changing finishes: one with E Ink, and the other incorporating neon.\nI'm the most taken with the Pova Neon, which the company says includes genuine neon lighting, not just bright colors: it uses \"ionized inert gas lighting technology\" to create a glowing effect.\nBy contrast the AI EInk builds color electronic ink into the rear of the phone, allowing you to change the phone's color on the fly. Perhaps more impressively, you're able to set the color using the camera, so you could make your phone  …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Tecno最新概念手机采用霓虹灯照亮",
        "summary": "Tecno推出了两款具有创新设计的概念智能手机。Pova Neon配备了真正的离子化气体霓虹灯照明，可产生发光效果，而AI EInk型号则使用可通过手机摄像头调节的变色电子墨水。"
      },
      "fr": {
        "title": "Le dernier téléphone concept de Tecno est éclairé au néon",
        "summary": "Tecno a dévoilé deux designs de smartphones conceptuels avec des finitions innovantes. Le Pova Neon comprend un véritable éclairage néon à gaz ionisé pour un effet luminescent, tandis que le modèle AI EInk utilise de l'encre électronique à changement de couleur ajustable via la caméra du téléphone."
      },
      "de": {
        "title": "Tecnos neuestes Konzepttelefon wird mit Neon beleuchtet",
        "summary": "Tecno enthüllte zwei Konzept-Smartphone-Designs mit innovativen Oberflächen. Das Pova Neon verfügt über echte ionisierte Gas-Neonbeleuchtung für einen leuchtenden Effekt, während das AI EInk-Modell elektronische Tinte mit Farbwechsel verwendet, die über die Kamera des Telefons angepasst werden kann."
      },
      "es": {
        "title": "El último teléfono concepto de Tecno está iluminado por neón",
        "summary": "Tecno presentó dos diseños de smartphones conceptuales con acabados innovadores. El Pova Neon incluye auténtica iluminación de neón de gas ionizado para un efecto luminoso, mientras que el modelo AI EInk utiliza tinta electrónica de cambio de color ajustable a través de la cámara del teléfono."
      }
    }
  },
  {
    "title": "AMD will bring its \"Ryzen AI\" processors to standard desktop PCs for the first time",
    "slug": "amd-ryzen-ai-processors-standard-desktop-pcs",
    "url": "https://arstechnica.com/gadgets/2026/03/amd-ryzen-ai-400-cpus-will-bring-upgraded-graphics-to-socket-am5-desktops/",
    "source": "Ars Technica",
    "date": "2026-03-02T08:00:29.000Z",
    "summary": "AMD is bringing its Ryzen AI processors to standard desktop PCs for the first time. The first wave targets business PCs rather than consumer DIY builders, bringing on-device AI capabilities to a broader market.",
    "content": "First wave of Ryzen AI desktop CPUs targets business PCs rather than DIYers.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "AMD将首次为标准台式电脑带来\"Ryzen AI\"处理器",
        "summary": "AMD首次为标准台式电脑带来Ryzen AI处理器。首批产品针对商务电脑而非消费者DIY构建者，为更广泛的市场带来设备上AI功能。"
      },
      "fr": {
        "title": "AMD apportera ses processeurs \"Ryzen AI\" aux ordinateurs de bureau standard pour la première fois",
        "summary": "AMD apporte ses processeurs Ryzen AI aux ordinateurs de bureau standard pour la première fois. La première vague cible les PC professionnels plutôt que les constructeurs DIY grand public, apportant les capacités d'IA sur l'appareil à un marché plus large."
      },
      "de": {
        "title": "AMD bringt seine \"Ryzen AI\"-Prozessoren zum ersten Mal auf Standard-Desktop-PCs",
        "summary": "AMD bringt seine Ryzen AI-Prozessoren zum ersten Mal auf Standard-Desktop-PCs. Die erste Welle zielt auf Business-PCs statt auf Verbraucher-DIY-Erbauer ab und bringt On-Device-AI-Funktionen auf einen breiteren Markt."
      },
      "es": {
        "title": "AMD traerá sus procesadores \"Ryzen AI\" a PC de escritorio estándar por primera vez",
        "summary": "AMD está trayendo sus procesadores Ryzen AI a PC de escritorio estándar por primera vez. La primera ola se dirige a PC empresariales en lugar de constructores DIY para consumidores, trayendo capacidades de IA en el dispositivo a un mercado más amplio."
      }
    }
  },
  {
    "title": "Vivo’s next phone will launch with a professional camera rig",
    "slug": "vivo-next-phone-professional-camera-rig",
    "url": "https://www.theverge.com/gadgets/887250/vivo-x300-ultra-global-launch-telephoto-camera-cage",
    "source": "The Verge",
    "date": "2026-03-02T08:00:00.000Z",
    "summary": "Vivo revealed its flagship X300 Ultra smartphone at Mobile World Congress, featuring a 200-megapixel telephoto camera and professional camera accessories. The model will be the first Ultra in the series to launch globally outside China.",
    "content": "Look closely and you might spot a phone in there somewhere. | Image: Vivo\t\n\nVivo rarely has a presence at MWC, but this year it bucked that trend in a big way, with the reveal of its next flagship phone, the X300 Ultra, alongside an upgraded telephoto extender lens and professional camera cage. The company isn't ready to launch the handset just yet - or even reveal very many of its specs - but has confirmed that whenever it does arrive, it will be the first Ultra to go on sale outside China.\nThe only concrete detail about the X300 Ultra itself Vivo would confirm is that it will have a 200-megapixel telephoto camera. That was true of last year's X200 Ultra too though, so we're still waiting to find out what upgrades …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "Vivo的下一款手机将搭载专业摄像头组",
        "summary": "Vivo在移动世界大会上推出了其旗舰X300 Ultra智能手机，配备200万像素长焦摄像头和专业摄像头配件。该机型将成为该系列首款在中国以外全球推出的Ultra版本。"
      },
      "fr": {
        "title": "Le prochain téléphone de Vivo sera lancé avec un ensemble de caméras professionnelles",
        "summary": "Vivo a présenté son smartphone phare X300 Ultra au Mobile World Congress, doté d'une caméra téléobjectif de 200 mégapixels et d'accessoires de caméra professionnels. Le modèle sera le premier Ultra de la série à être lancé mondialement en dehors de la Chine."
      },
      "de": {
        "title": "Vivos nächstes Telefon wird mit einer professionellen Kameraausrüstung gestartet",
        "summary": "Vivo enthüllte sein Flaggschiff-Smartphone X300 Ultra auf dem Mobile World Congress mit einer 200-Megapixel-Telekamera und professionellem Kamerazubehör. Das Modell wird das erste Ultra der Serie sein, das weltweit außerhalb Chinas eingeführt wird."
      },
      "es": {
        "title": "El próximo teléfono de Vivo se lanzará con un equipo de cámara profesional",
        "summary": "Vivo reveló su teléfono inteligente insignia X300 Ultra en el Mobile World Congress, que cuenta con una cámara de teleobjetivo de 200 megapíxeles y accesorios de cámara profesionales. El modelo será el primer Ultra de la serie en lanzarse globalmente fuera de China."
      }
    }
  },
  {
    "title": "Qualcomm’s new chip is geared toward wearable AI gadgets",
    "slug": "qualcomm-new-chip-wearable-ai-gadgets",
    "url": "https://www.theverge.com/tech/886434/qualcomm-snapdragon-wear-elite-wearables",
    "source": "The Verge",
    "date": "2026-03-02T07:00:00.000Z",
    "summary": "Qualcomm announced the Snapdragon Wear Elite chip designed for AI-powered wearables including smart pendants, pins, and glasses. The chip upgrades to a 3nm process with dedicated neural processing units for developers creating consumer AI wearables.",
    "content": "AI wearables, all the way down. | Image: Qualcomm\t\n\nLike it or not, more AI wearables may be on the horizon - or at least Qualcomm seems to think so. Today the company announced its new Snapdragon Wear Elite chip. \nAt a press briefing, Qualcomm said it considers the Elite to be a \"wrist plus\" chip. Meaning, it won't replace the previous W5 Plus, but exist alongside it. The company said it expects the Elite will appeal to gadget makers looking to create AI wearables such as pendants, pins, and potentially display-free smart glasses. (More powerful smart glasses will likely use its AR chip.) \nOn top of being upgraded to the 3nm process, the Elite chip will have an eNPU and a Hexagon NPU for A …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "高通的新芯片针对可穿戴式AI设备",
        "summary": "高通宣布推出Snapdragon Wear Elite芯片，专为包括智能吊坠、别针和眼镜在内的AI驱动可穿戴设备设计。该芯片采用3纳米工艺升级，为开发消费者AI可穿戴设备的开发者配备了专门的神经处理单元。"
      },
      "fr": {
        "title": "La nouvelle puce de Qualcomm est destinée aux gadgets portables IA",
        "summary": "Qualcomm a annoncé la puce Snapdragon Wear Elite conçue pour les appareils portables alimentés par l'IA, notamment les pendentifs intelligents, les broches et les lunettes. La puce bénéficie d'une mise à niveau vers un processus 3 nm avec des unités de traitement neuronal dédiées pour les développeurs créant des appareils portables IA grand public."
      },
      "de": {
        "title": "Qualcomms neuer Chip ist für tragbare KI-Geräte ausgelegt",
        "summary": "Qualcomm kündigte den Snapdragon Wear Elite Chip an, der für KI-gesteuerte tragbare Geräte wie intelligente Anhänger, Anstecknadeln und Brillen entwickelt wurde. Der Chip wird mit einem 3-nm-Prozess aktualisiert und verfügt über dedizierte neurale Verarbeitungseinheiten für Entwickler, die tragbare KI-Geräte für Verbraucher entwickeln."
      },
      "es": {
        "title": "El nuevo chip de Qualcomm está orientado a gadgets portátiles de IA",
        "summary": "Qualcomm anunció el chip Snapdragon Wear Elite diseñado para dispositivos portátiles impulsados por IA, incluyendo colgantes inteligentes, alfileres y gafas. El chip se actualiza a un proceso de 3 nm con unidades de procesamiento neuronal dedicadas para desarrolladores que crean dispositivos portátiles de IA para consumidores."
      }
    }
  },
  {
    "title": "The Motorola Razr Fold is shaping up to be pure flagship",
    "slug": "motorola-razr-fold-flagship",
    "url": "https://www.theverge.com/tech/887249/motorola-razr-fold-specs-camera-silicon-carbon-battery",
    "source": "The Verge",
    "date": "2026-03-02T05:00:00.000Z",
    "summary": "Motorola's upcoming Razr Fold will be a premium-tier foldable phone priced at €1,999 (roughly $2,350) with the Moto Pen Ultra stylus, launching first in Europe before coming to North America. The device features a 6,000mAh silicon-carbon battery, making it the first foldable sold in North America to use this technology. This positions the Razr Fold as a high-end competitor in the folding phone market rather than a budget alternative.",
    "content": "It’s all starting to unfold. | Photo: Allison Johnson / The Verge\t\n\nMotorola has revealed a little more about its upcoming folding phone, and all signs point toward a premium option - not the budget-friendlier alternative the category could use. \nFor starters, the Razr Fold will cost €1,999 (about $2,350) bundled with the Moto Pen Ultra. It'll go on sale first in Europe, with North America to follow \"in the coming months.\" Motorola hasn't confirmed how much it will cost without the stylus, or what the price is in US dollars.\nThe Razr Fold will come with a huge 6,000mAh silicon-carbon battery, making it the first foldable sold in North America to use the technology. It's not quite the biggest battery on any …\nRead the full story at The Verge.",
    "category": "tech",
    "translations": {
      "zh": {
        "title": "摩托罗拉 Razr Fold 正在成为纯旗舰机型",
        "summary": "摩托罗拉即将推出的 Razr Fold 是一款高端折叠屏手机,定价 €1,999(约合 $2,350),配备 Moto Pen Ultra 手写笔,首先在欧洲推出,随后登陆北美。该设备搭载 6,000mAh 硅碳电池,成为在北美销售的首款采用该技术的折叠屏手机。这使 Razr Fold 成为折叠屏手机市场中的高端竞争者,而不是预算型替代品。"
      },
      "fr": {
        "title": "Le Motorola Razr Fold s'annonce comme un pur flagship",
        "summary": "Le prochain Razr Fold de Motorola sera un téléphone pliable haut de gamme au prix de 1 999 € (environ 2 350 $) avec le stylet Moto Pen Ultra, lancé d'abord en Europe avant d'arriver en Amérique du Nord. L'appareil dispose d'une batterie en silicium-carbone de 6 000 mAh, ce qui en ferait le premier téléphone pliable vendu en Amérique du Nord à utiliser cette technologie. Cela positionne le Razr Fold comme un concurrent haut de gamme sur le marché des téléphones pliants plutôt qu'une alternative budgétaire."
      },
      "de": {
        "title": "Das Motorola Razr Fold entwickelt sich zu einem echten Flaggschiff",
        "summary": "Das kommende Motorola Razr Fold wird ein Premium-Falttelefon zum Preis von 1.999 € (etwa 2.350 $) mit dem Moto Pen Ultra Stylus sein und zunächst in Europa eingeführt werden, bevor es nach Nordamerika kommt. Das Gerät verfügt über einen 6.000-mAh-Silizium-Kohlenstoff-Akku und ist das erste in Nordamerika verkaufte Falttelefon mit dieser Technologie. Dies positioniert das Razr Fold als hochwertige Konkurrenz auf dem Markt für faltbare Telefone und nicht als budgetfreundliche Alternative."
      },
      "es": {
        "title": "El Motorola Razr Fold se perfila como un puro buque insignia",
        "summary": "El próximo Motorola Razr Fold será un teléfono plegable de gama premium con un precio de 1.999 € (aproximadamente $2.350) con el stylus Moto Pen Ultra, lanzándose primero en Europa antes de llegar a América del Norte. El dispositivo cuenta con una batería de silicio-carbono de 6.000 mAh, lo que lo convierte en el primer teléfono plegable vendido en América del Norte que utiliza esta tecnología. Esto posiciona al Razr Fold como un competidor de gama alta en el mercado de teléfonos plegables en lugar de una alternativa presupuestaria."
      }
    }
  }
]