[
  {
    "title": "I Ported Coreboot to the ThinkPad X270",
    "slug": "i-ported-coreboot-to-the-thinkpad-x270",
    "url": "https://dork.dev/posts/2026-02-20-ported-coreboot/",
    "source": "Hacker News",
    "date": "2026-02-23T23:58:45.000Z",
    "summary": "Article URL: https://dork.dev/posts/2026-02-20-ported-coreboot/\nComments URL: https://news.ycombinator.com/item?id=47130860\nPoints: 264\n# Comments: 56",
    "content": "Article URL: https://dork.dev/posts/2026-02-20-ported-coreboot/\nComments URL: https://news.ycombinator.com/item?id=47130860\nPoints: 264\n# Comments: 56",
    "category": "github"
  },
  {
    "title": "Making Wolfram tech available as a foundation tool for LLM systems",
    "slug": "wolfram-llm-foundation-tool",
    "url": "https://writings.stephenwolfram.com/2026/02/making-wolfram-tech-available-as-a-foundation-tool-for-llm-systems/",
    "source": "Hacker News",
    "date": "2026-02-23T22:11:34.000Z",
    "summary": "Wolfram Research is making its computational technology available as a foundation tool for LLM systems, extending AI capabilities beyond language processing to include mathematical computation and symbolic reasoning. This integration positions Wolfram as infrastructure for next-generation AI applications.",
    "content": "Article URL: https://writings.stephenwolfram.com/2026/02/making-wolfram-tech-available-as-a-foundation-tool-for-llm-systems/\nComments URL: https://news.ycombinator.com/item?id=47129727\nPoints: 301\n# Comments: 163",
    "category": "github",
    "translations": {
      "zh": {
        "title": "将 Wolfram 技术作为 LLM 系统的基础工具提供",
        "summary": "Wolfram Research 将其计算技术作为 LLM 系统的基础工具提供，将 AI 能力扩展到数学计算和符号推理，超越语言处理。这一集成将 Wolfram 定位为下一代 AI 应用的基础设施。"
      },
      "ja": {
        "title": "WolframテクノロジーをLLMシステムの基礎ツールとして利用可能にする",
        "summary": "Wolfram Researchは、計算技術をLLMシステムの基盤ツールとして利用可能にし、言語処理を超えた数学計算と記号推論を含むAI機能を拡張している。この統合は、次世代AI応用のインフラストラクチャとしてWolframを位置づけている。"
      },
      "ko": {
        "title": "Wolfram 기술을 LLM 시스템의 기초 도구로 제공",
        "summary": "Wolfram Research가 계산 기술을 LLM 시스템의 기초 도구로 제공하여 AI 기능을 언어 처리를 넘어 수학 계산과 기호 추론으로 확장한다. 이 통합은 Wolfram을 차세대 AI 애플리케이션의 인프라로 위치시킨다."
      },
      "fr": {
        "title": "Mettre la technologie Wolfram à disposition en tant qu'outil fondamental pour les systèmes LLM",
        "summary": "Wolfram Research met sa technologie informatique à disposition en tant qu'outil fondamental pour les systèmes LLM, étendant les capacités de l'IA au-delà du traitement du langage pour inclure le calcul mathématique et le raisonnement symbolique. Cette intégration positionne Wolfram comme infrastructure pour les applications IA de prochaine génération."
      },
      "de": {
        "title": "Wolfram-Technologie als Grundwerkzeug für LLM-Systeme verfügbar machen",
        "summary": "Wolfram Research stellt seine Rechentechnologie als Grundwerkzeug für LLM-Systeme zur Verfügung und erweitert KI-Fähigkeiten über die Sprachverarbeitung hinaus auf mathematische Berechnungen und symbolisches Denken. Diese Integration positioniert Wolfram als Infrastruktur für nächstgenerative KI-Anwendungen."
      },
      "es": {
        "title": "Disponibilizar la tecnología Wolfram como herramienta fundamental para sistemas LLM",
        "summary": "Wolfram Research pone su tecnología computacional a disposición como herramienta fundamental para sistemas LLM, extendiendo las capacidades de IA más allá del procesamiento del lenguaje para incluir cálculo matemático y razonamiento simbólico. Esta integración posiciona a Wolfram como infraestructura para aplicaciones de IA de próxima generación."
      }
    }
  },
  {
    "title": "FreeBSD doesn't have Wi-Fi driver for my old MacBook, so AI built one for me",
    "slug": "freebsd-wifi-driver-old-macbook-ai-built",
    "url": "https://vladimir.varank.in/notes/2026/02/freebsd-brcmfmac/",
    "source": "Hacker News",
    "date": "2026-02-23T21:44:28.000Z",
    "summary": "A developer used AI assistance to build a Wi-Fi driver for FreeBSD on an old MacBook that lacked official driver support, demonstrating practical applications of AI-assisted development for addressing hardware compatibility gaps in open-source operating systems.",
    "content": "Article URL: https://vladimir.varank.in/notes/2026/02/freebsd-brcmfmac/\nComments URL: https://news.ycombinator.com/item?id=47129361\nPoints: 425\n# Comments: 349",
    "category": "github",
    "translations": {
      "zh": {
        "title": "FreeBSD 没有旧 MacBook 的 Wi-Fi 驱动，所以 AI 为我构建了一个",
        "summary": "一名开发者利用 AI 协助为缺乏官方驱动支持的旧 MacBook 构建了 FreeBSD Wi-Fi 驱动，展示了 AI 辅助开发在解决开源操作系统硬件兼容性问题中的实际应用。"
      },
      "fr": {
        "title": "FreeBSD n'a pas de pilote Wi-Fi pour mon ancien MacBook, donc l'IA en a construit un pour moi",
        "summary": "Un développeur a utilisé l'assistance de l'IA pour construire un pilote Wi-Fi FreeBSD sur un ancien MacBook dépourvu de support de pilote officiel, démontrant les applications pratiques du développement assisté par l'IA pour résoudre les lacunes de compatibilité matérielle dans les systèmes d'exploitation open-source."
      },
      "de": {
        "title": "FreeBSD hat keinen Wi-Fi-Treiber für meinen alten MacBook, also hat die KI einen für mich gebaut",
        "summary": "Ein Entwickler nutzte KI-Unterstützung, um einen Wi-Fi-Treiber für FreeBSD auf einem alten MacBook ohne offizielle Treiberunterstützung zu entwickeln, was praktische Anwendungen der KI-gestützten Entwicklung zur Behebung von Hardware-Kompatibilitätslücken in Open-Source-Betriebssystemen demonstriert."
      },
      "es": {
        "title": "FreeBSD no tiene controlador Wi-Fi para mi MacBook antiguo, así que la IA construyó uno para mí",
        "summary": "Un desarrollador utilizó asistencia de IA para construir un controlador Wi-Fi de FreeBSD en un MacBook antiguo que carecía de soporte de controlador oficial, demostrando aplicaciones prácticas del desarrollo asistido por IA para abordar las brechas de compatibilidad de hardware en sistemas operativos de código abierto."
      }
    }
  },
  {
    "title": "“Car Wash” test with 53 models",
    "slug": "car-wash-test-with-53-ai-models",
    "url": "https://opper.ai/blog/car-wash-test",
    "source": "Hacker News",
    "date": "2026-02-23T20:16:08.000Z",
    "summary": "Testing 53 AI models on a simple logic puzzle revealed only 5 models can answer consistently across 10 runs, with most performing below human baseline (71.5% chose correctly). This demonstrates reasoning limitations even among leading proprietary models including GPT-5 and Claude Sonnet 4.5.",
    "content": "\"I Want to Wash My Car. The Car Wash Is 50 Meters Away. Should I Walk or Drive?\" This question has been making the rounds as a simple AI logic test so I wanted to see how it holds up across a broad set of models. Ran 53 models (leading open-source, open-weight, proprietary) with no system prompt, forced choice between drive and walk, with a reasoning field.\nOn a single run, only 11 out of 53 got it right (42 said walk). But a single run doesn't prove much, so I reran every model 10 times. Same prompt, no cache, clean slate.\nThe results got worse. Of the 11 that passed the single run, only 5 could do it consistently. GPT-5 managed 7/10. GPT-5.1, GPT-5.2, Claude Sonnet 4.5, every Llama and Mistral model scored 0/10 across all 10 runs.\nPeople kept saying humans would fail this too, so I got a human baseline through Rapidata (10k people, same forced choice): 71.5% said drive. Most models perform below that.\nAll reasoning traces (ran via Opper, my startup), full model breakdown, human baseline data, and raw JSON files are in the writeup for anyone who wants to dig in or run their own analysis.\nComments URL: https://news.ycombinator.com/item?id=47128138\nPoints: 361\n# Comments: 427",
    "category": "github",
    "translations": {
      "zh": {
        "title": "53 个 AI 模型的\"洗车\"测试",
        "summary": "对 53 个 AI 模型进行简单逻辑谜题测试，结果显示仅 5 个模型能在 10 次运行中保持一致，大多数性能低于人类基准线（71.5% 正确率）。这展示了即使是领先专有模型（包括 GPT-5 和 Claude Sonnet 4.5）的推理局限性。"
      },
      "fr": {
        "title": "Test \"Car Wash\" avec 53 modèles",
        "summary": "Les tests de 53 modèles d'IA sur une simple énigme logique ont révélé que seuls 5 modèles pouvaient répondre de manière cohérente sur 10 passages, la plupart performant en dessous de la ligne de base humaine (71,5% choisis correctement). Ceci démontre les limitations de raisonnement même parmi les modèles propriétaires les plus performants, y compris GPT-5 et Claude Sonnet 4.5."
      },
      "de": {
        "title": "\"Car Wash\"-Test mit 53 Modellen",
        "summary": "Ein Test von 53 KI-Modellen mit einem einfachen Logikrätsel zeigte, dass nur 5 Modelle in 10 Durchläufen konsistent antworten konnten, wobei die meisten unter der menschlichen Grundlinie abschnitten (71,5% richtig gewählt). Dies demonstriert Reasoning-Limitierungen auch bei führenden proprietären Modellen, einschließlich GPT-5 und Claude Sonnet 4.5."
      },
      "es": {
        "title": "Prueba \"Car Wash\" con 53 modelos",
        "summary": "Probar 53 modelos de IA en un simple acertijo lógico reveló que solo 5 modelos pueden responder de manera consistente en 10 ejecuciones, con la mayoría teniendo un desempeño por debajo del nivel de referencia humano (71.5% eligieron correctamente). Esto demuestra limitaciones de razonamiento incluso en modelos propietarios líderes, incluidos GPT-5 y Claude Sonnet 4.5."
      }
    }
  },
  {
    "title": "Binance fired employees who found $1.7B in crypto was sent to Iran",
    "slug": "binance-fired-employees-1-7b-crypto-sent-iran",
    "url": "https://www.nytimes.com/2026/02/23/technology/binance-employees-iran-firings.html",
    "source": "Hacker News",
    "date": "2026-02-23T19:23:30.000Z",
    "summary": "Binance fired employees who discovered approximately $1.7 billion in cryptocurrency had been sent to Iran in violation of sanctions. The incident raises questions about internal compliance procedures, employee protections for whistleblowers, and regulatory oversight of major cryptocurrency exchanges.",
    "content": "Article URL: https://www.nytimes.com/2026/02/23/technology/binance-employees-iran-firings.html\nComments URL: https://news.ycombinator.com/item?id=47127396\nPoints: 546\n# Comments: 253",
    "category": "github",
    "translations": {
      "zh": {
        "title": "Binance 解雇发现 17 亿美元加密货币被送往伊朗的员工",
        "summary": "Binance 解雇了发现约 17 亿美元加密货币因违反制裁被送往伊朗的员工。这一事件引发了关于内部合规程序、员工举报人保护和主要加密货币交易所监管监督的问题。"
      },
      "fr": {
        "title": "Binance a licencié des employés qui ont découvert que 1,7 milliard de dollars en crypto ont été envoyés à l'Iran",
        "summary": "Binance a licencié les employés qui ont découvert qu'environ 1,7 milliard de dollars en crypto-monnaie avaient été envoyés à l'Iran en violation des sanctions. L'incident soulève des questions sur les procédures de conformité interne, les protections des employés dénonciateurs et la surveillance réglementaire des principaux échanges de crypto-monnaies."
      },
      "de": {
        "title": "Binance feuerte Mitarbeiter, die herausfanden, dass 1,7 Milliarden Dollar in Krypto zum Iran geschickt wurden",
        "summary": "Binance feuerte Mitarbeiter, die entdeckten, dass etwa 1,7 Milliarden Dollar in Kryptowährungen unter Verstoß gegen Sanktionen in den Iran geschickt worden waren. Der Vorfall wirft Fragen zu internen Compliance-Verfahren, zum Schutz von Mitarbeitern, die Verstöße melden, und zur regulatorischen Aufsicht großer Kryptowährungsbörsen auf."
      },
      "es": {
        "title": "Binance despidió empleados que descubrieron que se enviaron 1.7 mil millones de dólares en criptografía a Irán",
        "summary": "Binance despidió a empleados que descubrieron que aproximadamente 1.7 mil millones de dólares en criptomonedas fueron enviados a Irán en violación de sanciones. El incidente plantea preguntas sobre procedimientos internos de cumplimiento, protecciones de empleados denunciantes y supervisión regulatoria de los principales intercambios de criptomonedas."
      }
    }
  },
  {
    "title": "Americans are destroying Flock surveillance cameras",
    "slug": "americans-destroying-flock-surveillance-cameras",
    "url": "https://techcrunch.com/2026/02/23/americans-are-destroying-flock-surveillance-cameras/",
    "source": "Hacker News",
    "date": "2026-02-23T19:04:34.000Z",
    "summary": "Americans are actively destroying Flock surveillance cameras deployed across cities, reflecting growing public concern about privacy and opposition to expanding surveillance infrastructure. The movement represents broader tension between public safety interests and privacy rights in the digital age.",
    "content": "Article URL: https://techcrunch.com/2026/02/23/americans-are-destroying-flock-surveillance-cameras/\nComments URL: https://news.ycombinator.com/item?id=47127081\nPoints: 697\n# Comments: 481",
    "category": "github",
    "translations": {
      "zh": {
        "title": "美国人摧毁Flock监控摄像头",
        "summary": "美国人正积极摧毁部署在各城市的Flock监控摄像头，反映公众对隐私的日益关注和对扩大监控基础设施的反对。该运动代表了公共安全利益与数字时代隐私权之间的广泛矛盾。"
      },
      "fr": {
        "title": "Les Américains détruisent les caméras de surveillance Flock",
        "summary": "Les Américains détruisent activement les caméras de surveillance Flock déployées dans les villes, reflétant les préoccupations croissantes du public concernant la vie privée et l'opposition à l'expansion de l'infrastructure de surveillance. Le mouvement représente une tension plus large entre les intérêts de la sécurité publique et les droits à la vie privée à l'ère numérique."
      },
      "de": {
        "title": "Amerikaner zerstören Flock-Überwachungskameras",
        "summary": "Amerikaner zerstören aktiv Flock-Überwachungskameras, die in Städten eingesetzt werden, was wachsende öffentliche Bedenken hinsichtlich Datenschutz und Opposition gegen die Ausweitung der Überwachungsinfrastruktur widerspiegelt. Die Bewegung stellt eine umfassendere Spannung zwischen Sicherheitsinteressen und Datenschutzrechten im digitalen Zeitalter dar."
      },
      "es": {
        "title": "Los estadounidenses están destruyendo cámaras de vigilancia Flock",
        "summary": "Los estadounidenses están destruyendo activamente cámaras de vigilancia Flock desplegadas en ciudades, reflejando la creciente preocupación pública sobre privacidad y la oposición a la expansión de la infraestructura de vigilancia. El movimiento representa una tensión más amplia entre los intereses de seguridad pública y los derechos de privacidad en la era digital."
      }
    }
  },
  {
    "title": "Writing code is cheap now",
    "slug": "writing-code-cheap-now",
    "url": "https://simonwillison.net/guides/agentic-engineering-patterns/code-is-cheap/",
    "source": "Hacker News",
    "date": "2026-02-23T17:20:25.000Z",
    "summary": "AI-powered code generation has dramatically reduced the cost of writing software, fundamentally changing economics and forcing developers to reconsider what creates value in engineering. The trend requires new approaches to workflow optimization and redefining developer productivity in an era of cheap code.",
    "content": "Article URL: https://simonwillison.net/guides/agentic-engineering-patterns/code-is-cheap/\nComments URL: https://news.ycombinator.com/item?id=47125374\nPoints: 353\n# Comments: 450",
    "category": "github",
    "translations": {
      "zh": {
        "title": "现在写代码很便宜",
        "summary": "AI驱动的代码生成大幅降低了软件编写成本，从根本上改变了经济学，迫使开发者重新思考工程价值。这一趋势需要新的工作流优化方法和在廉价代码时代重新定义开发者生产力。"
      },
      "fr": {
        "title": "Écrire du code est bon marché maintenant",
        "summary": "La génération de code alimentée par l'IA a dramatiquement réduit le coût de développement de logiciels, transformant fondamentalement l'économie et forçant les développeurs à reconsidérer ce qui crée de la valeur en ingénierie. La tendance nécessite de nouvelles approches d'optimisation des flux de travail et une redéfinition de la productivité des développeurs à l'ère du code bon marché."
      },
      "de": {
        "title": "Code schreiben ist jetzt billig",
        "summary": "KI-gestützte Code-Generierung hat die Kosten für die Softwareentwicklung dramatisch gesenkt und die Wirtschaft grundlegend verändert, wodurch Entwickler gezwungen werden, zu überdenken, was Wert in der Technik schafft. Der Trend erfordert neue Ansätze zur Workflow-Optimierung und eine Neudefinition der Entwicklerproduktivität in einer Ära billiger Code-Entwicklung."
      },
      "es": {
        "title": "Ahora escribir código es barato",
        "summary": "La generación de código impulsada por IA ha reducido dramáticamente el costo de escribir software, cambiando fundamentalmente la economía y obligando a los desarrolladores a reconsiderar qué crea valor en la ingeniería. La tendencia requiere nuevos enfoques para la optimización del flujo de trabajo y redefinir la productividad del desarrollador en una era de código barato."
      }
    }
  },
  {
    "title": "ASML unveils EUV light source advance that could yield 50% more chips by 2030",
    "slug": "asml-unveils-euv-light-source-advance-50-percent-more-chips-2030",
    "url": "https://www.reuters.com/world/china/asml-unveils-euv-light-source-advance-that-could-yield-50-more-chips-by-2030-2026-02-23/",
    "source": "Hacker News",
    "date": "2026-02-23T17:18:41.000Z",
    "summary": "ASML announced a breakthrough in extreme ultraviolet (EUV) light source technology that could increase semiconductor production capacity by 50% by 2030. The advancement addresses critical chip supply constraints and accelerates manufacturing progress in semiconductor production.",
    "content": "Article URL: https://www.reuters.com/world/china/asml-unveils-euv-light-source-advance-that-could-yield-50-more-chips-by-2030-2026-02-23/\nComments URL: https://news.ycombinator.com/item?id=47125349\nPoints: 367\n# Comments: 105",
    "category": "github",
    "translations": {
      "zh": {
        "title": "ASML推出EUV光源突破，到2030年可能增加50%芯片产量",
        "summary": "ASML宣布了极紫外(EUV)光源技术突破，到2030年可能增加芯片生产能力50%。该进展解决了关键芯片供应制约，加快了半导体生产制造进展。"
      },
      "fr": {
        "title": "ASML dévoile une avancée en source de lumière EUV qui pourrait augmenter la production de puces de 50 % d'ici 2030",
        "summary": "ASML a annoncé une percée dans la technologie des sources de lumière ultraviolette extrême (EUV) qui pourrait augmenter la capacité de production de semi-conducteurs de 50 % d'ici 2030. L'avancée aborde les contraintes critiques d'approvisionnement en puces et accélère les progrès de la fabrication dans la production de semi-conducteurs."
      },
      "de": {
        "title": "ASML enthüllt EUV-Lichttechnik-Durchbruch, der bis 2030 50% mehr Chips bringen könnte",
        "summary": "ASML kündigte einen Durchbruch in der Extrem-Ultraviolett-Lichttechnologie (EUV) an, der die Halbleiterproduktionskapazität bis 2030 um 50% erhöhen könnte. Der Fortschritt behebt kritische Engpässe in der Chipversorgung und beschleunigt den Fertigungsfortschritt in der Halbleiterproduktion."
      },
      "es": {
        "title": "ASML presenta avance en fuente de luz EUV que podría generar 50% más chips para 2030",
        "summary": "ASML anunció un avance en tecnología de fuente de luz ultravioleta extrema (EUV) que podría aumentar la capacidad de producción de semiconductores un 50% para 2030. El avance aborda las limitaciones críticas de suministro de chips y acelera el progreso de fabricación en la producción de semiconductores."
      }
    }
  },
  {
    "title": "The Missing Semester of Your CS Education – Revised for 2026",
    "slug": "missing-semester-cs-education-revised-2026",
    "url": "https://missing.csail.mit.edu/",
    "source": "Hacker News",
    "date": "2026-02-23T16:02:48.000Z",
    "summary": "MIT's revised Missing Semester course now addresses AI-powered development tools, agentic coding, and code quality, reflecting six years of field evolution since the original 2020 course.",
    "content": "We returned to MIT last month to teach a revised version of Missing Semester, six years after the original debut (which has been extensively discussed on HN, in https://news.ycombinator.com/item?id=22226380 and https://news.ycombinator.com/item?id=34934216).\nWe’ve updated the course based on our personal experiences as well as major changes in the field (e.g., the proliferation of AI-powered developer tools) over the past several years. The 2026 course includes revised versions of four lectures from the previous course, and it adds five entirely new lectures:\n- Development Environment and Tools\n- Packaging and Shipping Code\n- Agentic Coding\n- Beyond the Code (soft skills)\n- Code Quality\nWe’d love to hear any feedback from the HN community to improve the current or future iterations of the course. In particular, we’re curious to hear the community’s take on our inclusion of AI-related topics (e.g., dedicating an entire class to the topic of agentic coding; though we tried to counterbalance it with plenty of disclaimers, and a dedicated section on AI etiquette in Beyond the Code).\n--Anish, Jon, and Jose\nComments URL: https://news.ycombinator.com/item?id=47124171\nPoints: 422\n# Comments: 120",
    "category": "github",
    "translations": {
      "zh": {
        "title": "你的计算机科学教育中缺失的学期 - 2026年修订版",
        "summary": "MIT修订的\"缺失的学期\"课程现在涵盖人工智能驱动的开发工具、代理编程和代码质量，反映了自原始2020年课程以来六年的领域发展。"
      },
      "fr": {
        "title": "Le semestre manquant de votre éducation informatique - Révisé pour 2026",
        "summary": "Le cours révisé \"Missing Semester\" du MIT aborde maintenant les outils de développement alimentés par l'IA, le codage agentique et la qualité du code, reflétant six ans d'évolution du domaine depuis le cours original de 2020."
      },
      "de": {
        "title": "Das fehlende Semester Ihrer Informatikausbildung – Überarbeitete Fassung für 2026",
        "summary": "Der überarbeitete \"Missing Semester\"-Kurs des MIT behandelt nun KI-gestützte Entwicklungstools, agentenbasierte Codierung und Codequalität und spiegelt sechs Jahre Feldentwicklung seit dem ursprünglichen 2020er Kurs wider."
      },
      "es": {
        "title": "El semestre que falta en tu educación de informática - Revisado para 2026",
        "summary": "El curso revisado \"Missing Semester\" del MIT ahora aborda herramientas de desarrollo impulsadas por IA, codificación agentiva y calidad del código, reflejando seis años de evolución del campo desde el curso original de 2020."
      }
    }
  },
  {
    "title": "A simple web we own",
    "slug": "simple-web-we-own",
    "url": "https://rsdoiel.github.io/blog/2026/02/21/a_simple_web_we_own.html",
    "source": "Hacker News",
    "date": "2026-02-23T16:01:18.000Z",
    "summary": "Explores the value of building and maintaining independent web properties outside platform ecosystems as an alternative to centralized, algorithm-driven social platforms.",
    "content": "Article URL: https://rsdoiel.github.io/blog/2026/02/21/a_simple_web_we_own.html\nComments URL: https://news.ycombinator.com/item?id=47124149\nPoints: 305\n# Comments: 226",
    "category": "github",
    "translations": {
      "zh": {
        "title": "我们拥有的简单网络",
        "summary": "探讨在平台生态系统之外构建和维护独立网络属性的价值，作为集中式、算法驱动的社交平台的替代方案。"
      },
      "fr": {
        "title": "Un web simple que nous possédons",
        "summary": "Explore la valeur de construire et de maintenir des propriétés web indépendantes en dehors des écosystèmes de plateforme, comme alternative aux plates-formes de médias sociaux centralisées et basées sur des algorithmes."
      },
      "de": {
        "title": "Ein einfaches Web, das wir besitzen",
        "summary": "Untersucht den Wert des Aufbaus und der Verwaltung unabhängiger Web-Eigenschaften außerhalb von Plattformökosystemen als Alternative zu zentralisierten, algorithmusgesteuerten Social-Media-Plattformen."
      },
      "es": {
        "title": "Una web simple que poseemos",
        "summary": "Explora el valor de construir y mantener propiedades web independientes fuera de ecosistemas de plataformas como alternativa a las plataformas de redes sociales centralizadas y basadas en algoritmos."
      }
    }
  }
]