[
  {
    "title": "I Ported Coreboot to the ThinkPad X270",
    "slug": "i-ported-coreboot-to-the-thinkpad-x270",
    "url": "https://dork.dev/posts/2026-02-20-ported-coreboot/",
    "source": "Hacker News",
    "date": "2026-02-23T23:58:45.000Z",
    "summary": "Article URL: https://dork.dev/posts/2026-02-20-ported-coreboot/\nComments URL: https://news.ycombinator.com/item?id=47130860\nPoints: 264\n# Comments: 56",
    "content": "Article URL: https://dork.dev/posts/2026-02-20-ported-coreboot/\nComments URL: https://news.ycombinator.com/item?id=47130860\nPoints: 264\n# Comments: 56",
    "category": "github"
  },
  {
    "title": "Making Wolfram tech available as a foundation tool for LLM systems",
    "slug": "wolfram-llm-foundation-tool",
    "url": "https://writings.stephenwolfram.com/2026/02/making-wolfram-tech-available-as-a-foundation-tool-for-llm-systems/",
    "source": "Hacker News",
    "date": "2026-02-23T22:11:34.000Z",
    "summary": "Wolfram Research is making its computational technology available as a foundation tool for LLM systems, extending AI capabilities beyond language processing to include mathematical computation and symbolic reasoning. This integration positions Wolfram as infrastructure for next-generation AI applications.",
    "content": "Article URL: https://writings.stephenwolfram.com/2026/02/making-wolfram-tech-available-as-a-foundation-tool-for-llm-systems/\nComments URL: https://news.ycombinator.com/item?id=47129727\nPoints: 301\n# Comments: 163",
    "category": "github",
    "translations": {
      "zh": {
        "title": "将 Wolfram 技术作为 LLM 系统的基础工具提供",
        "summary": "Wolfram Research 将其计算技术作为 LLM 系统的基础工具提供，将 AI 能力扩展到数学计算和符号推理，超越语言处理。这一集成将 Wolfram 定位为下一代 AI 应用的基础设施。"
      },
      "ja": {
        "title": "WolframテクノロジーをLLMシステムの基礎ツールとして利用可能にする",
        "summary": "Wolfram Researchは、計算技術をLLMシステムの基盤ツールとして利用可能にし、言語処理を超えた数学計算と記号推論を含むAI機能を拡張している。この統合は、次世代AI応用のインフラストラクチャとしてWolframを位置づけている。"
      },
      "ko": {
        "title": "Wolfram 기술을 LLM 시스템의 기초 도구로 제공",
        "summary": "Wolfram Research가 계산 기술을 LLM 시스템의 기초 도구로 제공하여 AI 기능을 언어 처리를 넘어 수학 계산과 기호 추론으로 확장한다. 이 통합은 Wolfram을 차세대 AI 애플리케이션의 인프라로 위치시킨다."
      },
      "fr": {
        "title": "Mettre la technologie Wolfram à disposition en tant qu'outil fondamental pour les systèmes LLM",
        "summary": "Wolfram Research met sa technologie informatique à disposition en tant qu'outil fondamental pour les systèmes LLM, étendant les capacités de l'IA au-delà du traitement du langage pour inclure le calcul mathématique et le raisonnement symbolique. Cette intégration positionne Wolfram comme infrastructure pour les applications IA de prochaine génération."
      },
      "de": {
        "title": "Wolfram-Technologie als Grundwerkzeug für LLM-Systeme verfügbar machen",
        "summary": "Wolfram Research stellt seine Rechentechnologie als Grundwerkzeug für LLM-Systeme zur Verfügung und erweitert KI-Fähigkeiten über die Sprachverarbeitung hinaus auf mathematische Berechnungen und symbolisches Denken. Diese Integration positioniert Wolfram als Infrastruktur für nächstgenerative KI-Anwendungen."
      },
      "es": {
        "title": "Disponibilizar la tecnología Wolfram como herramienta fundamental para sistemas LLM",
        "summary": "Wolfram Research pone su tecnología computacional a disposición como herramienta fundamental para sistemas LLM, extendiendo las capacidades de IA más allá del procesamiento del lenguaje para incluir cálculo matemático y razonamiento simbólico. Esta integración posiciona a Wolfram como infraestructura para aplicaciones de IA de próxima generación."
      }
    }
  }
]